{"imdbID":"tt0018429","Title":"Sorrell and Son","Year":"1927","Director":"Herbert Brenon","Country":"USA","Language":"English","Production_Co":"Joseph M. Schenck Productions, Feature Productions ","Runtime":"100 min","Cast":"H.B. Warner, Anna Q. Nilsson, Mickey McBan, Carmel Myers, Lionel Belmore, Norman Trevor, Betsy Ann Hisle, Louis Wolheim, Paul McAllister, Alice Joyce, Nils Asther, Mary Nolan","Plot":"Stephen Sorrell, a decorated war hero, raises his son Kit alone after Kit's mother deserts husband and child in the boy's infancy. Sorrell loses a promising job offer and is forced to take ... See full summary » Stephen Sorrell, a decorated war hero, raises his son Kit alone after Kit's mother deserts husband and child in the boy's infancy. Sorrell loses a promising job offer and is forced to take work as a menial. Both his dignity and his health are damaged as he suffers under the exhausting labor and harsh treatment he receives as a hotel porter. But Sorrell thrives in the knowledge that his son will benefit from his labors. Sorrell has allowed the boy to believe his mother dead, but when the mother shows up, wanting to re-enter the young man's life, Sorrell must make hard decisions. Written by Jim Beaver <jumblejim@prodigy.net>","Genre":"Drama","Keywords":"partially lost film, based on novel, character name in title","imdbRating":"6.3","imdbVotes":"28","Awards":"Nominated for 1 Oscar.","Metascore":"","Released":"2 December 1927 (USA) ","Location":"England, UK","Actors":"H.B. Warner, Anna Q. Nilsson, Mickey McBan ","Writer":"Warwick Deeping (novel), Herbert Brenon | 1 more credit »","Running_time":"PT100M / 1h 40min","Description":"Directed by Herbert Brenon.  With H.B. Warner, Anna Q. Nilsson, Mickey McBan, Carmel Myers. Stephen Sorrell, a decorated war hero, raises his son Kit alone after Kit's mother deserts husband and child in the boy's infancy. Sorrell loses a promising job offer and is forced to take work as a menial. Both his dignity and his health are damaged as he suffers under the exhausting labor and harsh treatment he receives as a hotel porter. But Sorrell thrives in the knowledge that his son will ...","Rated":"N/A"}