{"imdbID":"tt0082158","Title":"Chariots of Fire","Year":"1981","Director":"Hugh Hudson","Writer":"Colin Welland (original screenplay)","Country":"UK","Language":"English, French","Budget":"$5,500,000 (estimated)","Gross":"$58,800,000 (USA)","Production_Co":"Twentieth Century Fox Film Corporation, Allied Stars Ltd., Enigma Productions ","Runtime":"125 min","Cast":"Nicholas Farrell, Nigel Havers, Ian Charleson, Ben Cross, Daniel Gerroll, Ian Holm, John Gielgud, Lindsay Anderson, Nigel Davenport, Cheryl Campbell, Alice Krige, Dennis Christopher, Brad Davis, Patrick Magee, Peter Egan","Plot":"Two British track athletes, one a determined Jew and the other a devout Christian, compete in the 1924 Olympics. It's the post-WWI era. Britons Harold Abrahams and Eric Liddell are both naturally gifted fast sprinters, but approach running and how it fits into their respective lives differently. The son of a Lithuanian-Jew, Harold, who lives a somewhat privileged life as a student at Cambridge, uses being the fastest to overcome what he sees as the obstacles he faces in life as a Jew despite that privilege. In his words to paraphrase an old adage, he is often invited to the trough, but isn't allowed to drink. His running prowess does earn him the respect of his classmates, especially his running teammates, and to some extent the school administration, if only he maintains what they consider proper gentlemanly decorum, which isn't always the case in their minds. Born in China the son of Christian missionaries, Eric, a Scot, is a devout member of the Church of Scotland who eventually wants to return to that missionary work. He sees running as a win-win in that the notoriety of being fast gives him... Written by Huggo","Genre":"Biography, Drama, Sport","Keywords":"missionary, race, jew, christian, athlete","imdbRating":"7.3","imdbVotes":"39,102","Awards":"Won 4 Oscars. Another 14 wins & 19 nominations.","Metascore":"","Released":"9 April 1982 (USA) ","Location":"Ruskin Drive Sports Ground, St.Helens, Merseyside, England, UK ","Actors":"Ben Cross, Ian Charleson, Nicholas Farrell ","Running_time":"PT125M / 2h 5min","Description":"Directed by Hugh Hudson.  With Ben Cross, Ian Charleson, Nicholas Farrell, Nigel Havers. Two British track athletes, one a determined Jew and the other a devout Christian, compete in the 1924 Olympics.","Rated":"PG"}