{"imdbID":"tt0094336","Title":"Withnail & I","Year":"1987","Director":"Bruce Robinson","Writer":"Bruce Robinson","Taglines":"If you don't remember the sixties, don't worry - neither did they. ","Certificate":"R | See all certifications »","Country":"UK, Canada","Language":"English, Latin","Also_Known_As":"Mi ketten ","Gross":"$1,544,889 (USA)","Production_Co":"Cineplex-Odeon Films, HandMade Films ","Runtime":"107 min","Sound_Mix":"Mono","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"In the scene where Withnail (Richard E. Grant) ostensibly downs a bottle of lighter fluid, the can, which in rehearsals had been full of water, was full of vinegar. Director Bruce Robinson used vinegar on the take to get a better facial reaction from Grant. The vomiting was scripted and faked. See more »","Goofs":"Surmonti-50 (which was to be taken with a pork pie so they could \"miss out Monday\") was not available until 1980 or so. See more »","Crazy_Credits":"Paul McGann is credited only as \"and I\". See more »","Cast":"Richard E. Grant, Paul McGann, Richard Griffiths, Ralph Brown, Michael Elphick, Daragh O'Malley, Michael Wardle, Una Brandon-Jones, Noel Johnson, Irene Sutcliffe, Llewellyn Rees, Robert Oates, Anthony Wise, Eddie Tagoe","Plot":"London, 1969 - two 'resting' (unemployed and unemployable) actors, Withnail and Marwood, fed up with damp, cold, piles of washing-up, mad drug dealers and psychotic Irishmen, decide to ... See full summary » London, 1969 - two 'resting' (unemployed and unemployable) actors, Withnail and Marwood, fed up with damp, cold, piles of washing-up, mad drug dealers and psychotic Irishmen, decide to leave their squalid Camden flat for an idyllic holiday in the countryside, courtesy of Withnail's uncle Monty's country cottage. But when they get there, it rains non-stop, there's no food, and their basic survival skills turn out to be somewhat limited. Matters are not helped by the arrival of Uncle Monty, who shows an uncomfortably keen interest in Marwood... Written by Michael Brooke <michael@everyman.demon.co.uk>","Genre":"Comedy, Drama","Keywords":"homosexual, gay, cottage, actor, rain","imdbRating":"7.8","imdbVotes":"29,836","Awards":"1 win & 1 nomination.","Metascore":"","Released":"19 June 1987 (USA) ","Location":"M25 Motorway, Buckinghamshire, England, UK ","Actors":"Richard E. Grant, Paul McGann, Richard Griffiths ","Running_time":"PT107M / 1h 47min","Description":"Directed by Bruce Robinson.  With Richard E. Grant, Paul McGann, Richard Griffiths, Ralph Brown. London, 1969 - two 'resting' (unemployed and unemployable) actors, Withnail and Marwood, fed up with damp, cold, piles of washing-up, mad drug dealers and psychotic Irishmen, decide to leave their squalid Camden flat for an idyllic holiday in the countryside, courtesy of Withnail's uncle Monty's country cottage. But when they get there, it rains non-stop, there's no food, and their basic survival...","Rated":"R"}