{"imdbID":"tt0056825","Title":"America America","Year":"1963","Director":"Elia Kazan","Writer":"Elia Kazan","Country":"USA","Language":"English","Production_Co":"Athena Enterprises, Warner Bros. ","Runtime":"174 min","Cast":"Stathis Giallelis, Frank Wolff, Harry Davis, Elena Karam, Estelle Hemsley, Gregory Rozakis, Lou Antonio, Salem Ludwig, John Marley, Joanna Frank, Paul Mann, Linda Marsh, Robert H. Harris, Katharine Balfour","Plot":"A young Anatolian Greek, entrusted with his family's fortune, loses it en route to Istanbul and dreams of going to the United States. Elia Kazan, ethnic Greek but Turkish by birth, tells the story of the struggles of his uncle - in this account named Stavros Topouzoglou - in emigrating to America. In the 1890's, the young, kind-hearted but naive Stavros lived in Anatolia, where the Greek and Armenian minorities were repressed by the majority Turks, this repression which often led to violence. Even Stavros being friends with an Armenian was frowned upon. As such, Stavros dreamed of a better life - specifically in America - where, as a result, he could make his parents proud by his grand accomplishments. Instead, his parents, with most of their money, sent Stavros to Constantinople to help fund the carpet shop owned by his first cousin once removed. What Stavros encountered on his journey, made on foot with a small donkey, made him question life in Anatolia even further. Once in Constantinople, his resolve to earn the 110 Turkish pound third class fare to the United States became stronger than ever. But try after try,... Written by Huggo","Genre":"Drama","Keywords":"greek, dream, america, money, turk","imdbRating":"7.9","imdbVotes":"3,326","Awards":"Won 1 Oscar. Another 6 wins & 11 nominations.","Metascore":"","Released":"17 June 1964 (France) ","Location":"Statue of Liberty, Liberty Island, New York Harbor, New York City, New York, USA ","Actors":"Stathis Giallelis, Frank Wolff, Elena Karam ","Running_time":"PT174M / 2h 54min","Description":"Directed by Elia Kazan.  With Stathis Giallelis, Frank Wolff, Elena Karam, Harry Davis. A young Anatolian Greek, entrusted with his family's fortune, loses it en route to Istanbul and dreams of going to the United States.","Rated":"N/A"}