{"imdbID":"tt0077405","Title":"Days of Heaven","Year":"1978","Director":"Terrence Malick","Writer":"Terrence Malick","Taglines":"You've got to go through Hell before you get to Heaven ","Certificate":"PG | See all certifications »","Country":"USA","Language":"English, Italian","Also_Known_As":"Días de gloria ","Budget":"$3,000,000 (estimated)","Production_Co":"Paramount Pictures ","Runtime":"94 min","Sound_Mix":"Dolby (35 mm prints)| 70 mm 6-Track (70 mm prints)","Color":"Color (Metrocolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Included among the \"1001 Movies You Must See Before You Die\", edited by Steven Schneider. See more »","Goofs":"Just after the opening of the film at the steel mill, we see a freight train going across a high trestle in silhouette, with the roofs of the cars perfectly empty, but immediately we get a closeup of the train's roofs, looking forward, and it has scores of migrant workers sitting and sprawled on the roofs of the cars. See more »","Cast":"Richard Gere, Brooke Adams, Sam Shepard, Linda Manz, Robert J. Wilke, Jackie Shultis, Stuart Margolin, Timothy Scott, Gene Bell, Doug Kershaw, Richard Libertini, Frenchie Lemond, Sahbra Markus, Bob Wilson, Muriel Jolliffe","Plot":"A hot-tempered farm laborer convinces the woman he loves to marry their rich but dying boss so that they can have a claim to his fortune. Bill and Abby, a young couple who to the outside world pretend to be brother and sister are living and working in Chicago at the beginning of the century. They want to escape the poverty and hard labor of the city and travel south. Together with the girl Linda (who acts as the narrator in the movie) they find employment on a farm in the Texas panhandle. When the harvest is over the young, rich and handsome farmer invites them to stay because he has fallen in love with Abby. When Bill and Abby discover that the farmer is seriously ill and has only got a year left to live they decide that Abby will accept his wedding proposal in order to make some benefit out of the situation. When the expected death fails to come, jealousy and impatience are slowly setting in and accidents become eventually inevitable. Written by Theo de Grood <tdg@xs4all.nl>","Genre":"Drama, Romance","Keywords":"farm, wealth, farm worker, harvest, grasshopper","imdbRating":"8.0","imdbVotes":"36,180","Awards":"Won 1 Oscar. Another 11 wins & 11 nominations.","Metascore":"93","Released":"13 September 1978 (USA) ","Location":"Raymond, Alberta, Canada ","Actors":"Richard Gere, Brooke Adams, Sam Shepard ","Running_time":"PT94M / 1h 34min","Description":"Directed by Terrence Malick.  With Richard Gere, Brooke Adams, Sam Shepard, Linda Manz. A hot-tempered farm laborer convinces the woman he loves to marry their rich but dying boss so that they can have a claim to his fortune.","Rated":"PG"}