{"imdbID":"tt0085959","Title":"The Meaning of Life","Year":"1983","Taglines":"What it is, Where it is, and how to avoid treading in it [Video Australia] ","Certificate":"R | See all certifications »","Country":"UK","Language":"English","Also_Known_As":"Monty Python's The Meaning of Life ","Budget":"$9,000,000 (estimated)","Production_Co":"Celandine Films, The Monty Python Partnership, Universal Pictures ","Runtime":"107 min | 112 min (2003 restored director's cut)","Sound_Mix":"Dolby","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"While writing this film, the Pythons decided to take a break and put on some shows at the Hollywood Bowl. They were filmed and released as Monty Python Live at the Hollywood Bowl (1982). See more »","Goofs":"At the start of the miracle of birth section, the mother is traveling head first. Just before she leaves the corridor, the shot from the gurney indicates that she is moving feet first. See more »","Crazy_Credits":"In the opening credits, the title is initially written as \"MEANING OF LIFF\", then a lightning strike corrects that to \"LIFE\". A book, \"The Meaning of Liff\", written by Douglas Adams and John Lloyd was published in 1983. See more »","Cast":"Graham Chapman, John Cleese, Terry Gilliam, Eric Idle, Terry Jones, Michael Palin, Carol Cleveland, Simon Jones, Patricia Quinn, Judy Loe, Andrew MacLachlan, Mark Holmes, Valerie Whittington, Jennifer Franks, Imogen Bickford-Smith","Plot":"The comedy team takes a look at life in all its stages in their own uniquely silly way. Why are we here, what's it all about? The Monty Python-team is trying to sort out the most important question on Earth: what is the meaning of life? They do so by exploring the various stages of life, starting with birth. A doctor seems more interested in his equipment than in delivering the baby or caring for the mother, a Roman Catholic couple have quite a lot of children because 'every sperm is sacred'. In the growing and learning part of life, catholic schoolboys attend a rather strange church service and ditto sex education lesson. Onto war, where an officer's plan to attack is thwarted by his underlings wanting to celebrate his birthday and an officer's leg is bitten off by presumably an African tiger. At middle age a couple orders 'philosophy' at a restaurant, after which the film continues with live organ transplants. The autumn years are played in a restaurant, which, after being treated to the song 'Isn't It Awfully Nice to Have a Penis?' by an entertainer, sees the arrival ... Written by Arnoud Tiele (imdb@tiele.nl)","Genre":"Comedy, Fantasy, Musical","Keywords":"death, restaurant, monty python, comedy team, church","imdbRating":"7.6","imdbVotes":"82,891","Awards":"Nominated for 1 BAFTA Film Award. Another 1 win & 1 nomination.","Metascore":"","Released":"1 April 1983 (USA) ","Location":"England, UK ","Actors":"John Cleese, Terry Gilliam, Eric Idle ","Director":"Terry Jones, Terry Gilliam","Writer":"Graham Chapman, John Cleese | 4 more credits »","Running_time":"PT107M / 1h 47min","Description":"Directed by Terry Jones, Terry Gilliam.  With John Cleese, Terry Gilliam, Eric Idle, Terry Jones. The comedy team takes a look at life in all its stages in their own uniquely silly way.","Rated":"R"}