{"imdbID":"tt0070047","Title":"The Exorcist","Year":"1973","Director":"William Friedkin","Taglines":"The Scariest Movie Of All Time Has Returned. In The Version You've Never Seen Before. ","Country":"USA","Language":"English, Latin, Greek, French, German, Arabic","Also_Known_As":"The Exorcist: The Version You Haven't Seen Yet ","Budget":"$8,000,000 (estimated)","Opening_Weekend":"£151,714 (UK) (19 June 1998)","Gross":"ESP 1,343,229,032 (Spain) (29 June 2001)","Production_Co":"Warner Bros., Hoya Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"122 min | 132 min (director's cut)","Sound_Mix":"70 mm 6-Track (1979 re-release)| DTS-ES (director's cut)| Dolby Digital EX (director's cut)| Mono (original release)| SDDS (director's cut)","Color":"Color (Metrocolor)","Aspect_Ratio":"1.37 : 1","Trivia":"Geraldine Page turned down the role of the mother that went to Ellen Burstyn. See more »","Goofs":"After the initial session of exorcism, Father Damien Karras unties Regan's wrist from the bed and ties them together. When Father Merrin returns to resume the session Regan's wrists are again tied to the bed. See more »","Crazy_Credits":"There are no opening credits after the title. Although it is commonplace now, it was unheard of in 1973. See more »","Cast":"Ellen Burstyn, Max von Sydow, Lee J. Cobb, Kitty Winn, Jack MacGowran, Jason Miller, Linda Blair, William O'Malley, Barton Heyman, Peter Masterson, Rudolf Schündler, Gina Petrushka, Robert Symonds, Arthur Storch, Thomas Bermingham","Plot":"When a teenage girl is possessed by a mysterious entity, her mother seeks the help of two priests to save her daughter. A visiting actress in Washington, D.C., notices dramatic and dangerous changes in the behavior and physical make-up of her 12-year-old daughter. Meanwhile, a young priest at nearby Georgetown University begins to doubt his faith while dealing with his mother's terminal sickness. And, book-ending the story, a frail, elderly priest recognizes the necessity for a show-down with an old demonic enemy. Written by Andrew Harmon <aharmon@erols.com>","Genre":"Horror","Keywords":"exorcism, exorcist, demonic possession, priest, loss of innocence","imdbRating":"8.0","imdbVotes":"276,037","Awards":"Won 2 Oscars. Another 14 wins & 14 nominations.","Metascore":"82","Released":"26 December 1973 (USA) ","Location":"3600 Prospect Street, Georgetown, Washington, District of Columbia, USA ","Actors":"Ellen Burstyn, Max von Sydow, Linda Blair ","Writer":"William Peter Blatty (written for the screen by), William Peter Blatty (novel)","Running_time":"PT122M / 2h 2min","Description":"Directed by William Friedkin.  With Ellen Burstyn, Max von Sydow, Linda Blair, Lee J. Cobb. When a teenage girl is possessed by a mysterious entity, her mother seeks the help of two priests to save her daughter.","Rated":"R"}