{"imdbID":"tt0063415","Title":"The Party","Year":"1968","Director":"Blake Edwards","Taglines":"If you've ever been to a wilder party... you're under arrest.","Certificate":"PG | See all certifications »","Country":"USA","Language":"English, Italian, Russian, French, Chinese","Also_Known_As":"La fiesta inolvidable ","Budget":"$1,500,000 (estimated)","Gross":"SEK 4,388,000 (Sweden)","Production_Co":"Mirisch Corporation, The ","Runtime":"99 min","Sound_Mix":"Mono (Westrex Recording System)","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Production designer Fernando Carrere reused the fireplace he had designed for The Pink Panther (1963) in this film. See more »","Goofs":"Mrs Clutterbuck falls from a walkway into the swimming pool below and is pulled out soaking wet. She is carried up to her bedroom but her clothes are now dry. See more »","Cast":"Peter Sellers, Claudine Longet, Natalia Borisova, Jean Carson, Marge Champion, Al Checco, Corinne Cole, Dick Crockett, Frances Davis, Danielle De Metz, Herbert Ellis, Paul Ferrara, Steve Franken, Kathe Green, Allen Jung","Plot":"A clerical mistake results in a bumbling Indian film star being invited to an exclusive Hollywood party instead of being fired. After getting fired from General Federal Studios, Junior Artiste, Hrundi V. Bakshi, ends up getting invited to an upscale party thrown by the wealthy Clutterbuck family. After his tryst with his shoe, he is aided by an inebriated butler and a baby elephant to create hilarious chaos for the hosts and their chic guests. Written by rAjOo (gunwanti@hotmail.com)","Genre":"Comedy","Keywords":"bumbling, shoe, elephant, premature explosion, cowboy","imdbRating":"7.6","imdbVotes":"29,155","Awards":"","Metascore":"","Released":"4 April 1968 (USA) ","Location":"Hollywood, Los Angeles, California, USA ","Actors":"Peter Sellers, Claudine Longet, Natalia Borisova ","Writer":"Blake Edwards (screenplay), Tom Waldman (screenplay) | 2 more credits »","Running_time":"PT99M / 1h 39min","Description":"Directed by Blake Edwards.  With Peter Sellers, Claudine Longet, Natalia Borisova, Jean Carson. A clerical mistake results in a bumbling Indian film star being invited to an exclusive Hollywood party instead of being fired.","Rated":"PG"}