{"imdbID":"tt0042876","Title":"Rashômon","Year":"1950","Director":"Akira Kurosawa","Taglines":"The husband, the wife...or the bandit? ","Certificate":"See all certifications »","Country":"Japan","Language":"Japanese","Also_Known_As":"Rashomon ","Budget":"$250,000 (estimated)","Production_Co":"Daiei Motion Picture Company ","":"Show detailed company contact information on IMDbPro »","Runtime":"88 min","Sound_Mix":"Mono (Western Electric Recording)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"In the wife's vision, the music used was only available during post-production. Akira Kurosawa and his editor were amazed when they found that the music corresponded almost perfectly with the action on the screen and they didn't need to change the scene to match the music. See more »","Cast":"Toshirô Mifune, Machiko Kyô, Masayuki Mori, Takashi Shimura, Minoru Chiaki, Kichijirô Ueda, Noriko Honma, Daisuke Katô","Plot":"A heinous crime and its aftermath are recalled from differing points of view. A priest, a woodcutter and another man are taking refuge from a rainstorm in the shell of a former gatehouse called Rashômon. The priest and the woodcutter are recounting the story of a murdered samurai whose body the woodcutter discovered three days earlier in a forest grove. Both were summoned to testify at the murder trial, the priest who ran into the samurai and his wife traveling through the forest just before the murder occurred. Three other people who testified at the trial are supposedly the only direct witnesses: a notorious bandit named Tajômaru, who allegedly murdered the samurai and raped his wife; the white veil cloaked wife of the samurai; and the samurai himself who testifies through the use of a medium. The three tell a similarly structured story - that Tajômaru kidnapped and bound the samurai so that he could rape the wife - but which ultimately contradict each other, the motivations and the actual killing being what differ. The woodcutter reveals at Rashômon that he ... Written by Huggo","Genre":"Crime, Drama","Keywords":"samurai, trial, priest, murder, forest","imdbRating":"8.3","imdbVotes":"98,286","Awards":"Nominated for 1 Oscar. Another 9 wins & 3 nominations.","Metascore":"","Released":"25 August 1950 (Japan) ","Location":"Daiei Tokyo Studios, Tokyo, Japan ","Actors":"Toshirô Mifune, Machiko Kyô, Masayuki Mori ","Writer":"Ryûnosuke Akutagawa (stories), Akira Kurosawa (screenplay) | 2 more credits »","Running_time":"PT88M / 1h 28min","Description":"Directed by Akira Kurosawa.  With Toshirô Mifune, Machiko Kyô, Masayuki Mori, Takashi Shimura. A heinous crime and its aftermath are recalled from differing points of view.","Rated":"N/A"}