{"imdbID":"tt0041959","Title":"The Third Man","Year":"1949","Director":"Carol Reed","Taglines":"Hunted by men...Sought by WOMEN! ","Certificate":"See all certifications »","Country":"UK","Language":"English, German, Russian","Also_Known_As":"El tercer hombre ","Opening_Weekend":"$13,576 (USA) (7 May 1999)","Gross":"$449,191 (USA) (20 November 2015)","Production_Co":"Carol Reed's Production, London Film Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"104 min","Sound_Mix":"Mono (Western Electric Recording)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Orson Welles said that when he agreed to play Harry Lime, he was offered either a straight salary or a percentage of the profits. Welles chose the salary but he later regretted it because the film went on to become such a huge hit, the percentage was ultimately worth far more than the salary. See more »","Goofs":"As Martins arrives at the funeral, he asks Maj. Calloway who the funeral is for. A black tombstone is seen behind Martins. When he walks towards the grave and stands by Anna, the same tombstone is seen behind her. This occurred because both of those scenes were not filmed on location in Vienna, but later at Shepperton Studios, which only had very few fake tombstones available. See more »","Cast":"Joseph Cotten, Alida Valli, Orson Welles, Trevor Howard, Bernard Lee, Paul Hörbiger, Ernst Deutsch, Siegfried Breuer, Erich Ponto, Wilfrid Hyde-White, Hedwig Bleibtreu","Plot":"Pulp novelist Holly Martins travels to shadowy, postwar Vienna, only to find himself investigating the mysterious death of an old friend, Harry Lime. An out of work pulp fiction novelist, Holly Martins, arrives in a post war Vienna divided into sectors by the victorious allies, and where a shortage of supplies has lead to a flourishing black market. He arrives at the invitation of an ex-school friend, Harry Lime, who has offered him a job, only to discover that Lime has recently died in a peculiar traffic accident. From talking to Lime's friends and associates Martins soon notices that some of the stories are inconsistent, and determines to discover what really happened to Harry Lime. Written by Mark Thompson <mrt@oasis.icl.co.uk>","Genre":"Film-Noir, Mystery, Thriller","Keywords":"black market, dark secret, penicillin, occupation zone, evil man","imdbRating":"8.3","imdbVotes":"109,544","Awards":"Won 1 Oscar. Another 4 wins & 4 nominations.","Metascore":"","Released":"31 August 1949 (UK) ","Location":"8 Schreyvogelgasse, Vienna, Austria ","Actors":"Orson Welles, Joseph Cotten, Alida Valli ","Writer":"Graham Greene (by), Graham Greene (screen play)","Running_time":"PT104M / 1h 44min","Description":"Directed by Carol Reed.  With Orson Welles, Joseph Cotten, Alida Valli, Trevor Howard. Pulp novelist Holly Martins travels to shadowy, postwar Vienna, only to find himself investigating the mysterious death of an old friend, Harry Lime.","Rated":"N/A"}