{"imdbID":"tt0036775","Title":"Double Indemnity","Year":"1944","Director":"Billy Wilder","Taglines":"Paramount's terrific story of an unholy love, and an almost perfect crime! ","Certificate":"See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Frau ohne Gewissen ","Budget":"$927,262 (estimated)","Production_Co":"Paramount Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"107 min | 90 min (Ontario)","Sound_Mix":"Mono (Western Electric Mirrophonic Recording)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Various studios expressed interest in the story when it first appeared in serial form in 1935, but realized it was unfilmable within the strictures of the newly-established Production Code. See more »","Goofs":"In the first scene in which Walter first kisses Phyllis, we see a wedding ring on Walter's hand. Fred MacMurray was married and the ring was not noticed until post-production. See more »","Cast":"Fred MacMurray, Barbara Stanwyck, Edward G. Robinson, Porter Hall, Jean Heather, Tom Powers, Byron Barr, Richard Gaines, Fortunio Bonanova, John Philliber","Plot":"An insurance representative lets himself be talked into a murder/insurance fraud scheme that arouses an insurance investigator's suspicions. In 1938, Walter Neff, an experienced salesman of the Pacific All Risk Insurance Co., meets the seductive wife of one of his clients, Phyllis Dietrichson, and they have an affair. Phyllis proposes to kill her husband to receive the proceeds of an accident insurance policy and Walter devises a scheme to receive twice the amount based on a double indemnity clause. When Mr. Dietrichson is found dead on a train-track, the police accept the determination of accidental death. However, the insurance analyst and Walter's best friend Barton Keyes does not buy the story and suspects that Phyllis has murdered her husband with the help of another man. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Crime, Drama, Film-Noir","Keywords":"insurance investigation, insurance, murder, insurance policy, insurance salesman","imdbRating":"8.4","imdbVotes":"93,731","Awards":"Nominated for 7 Oscars. Another 2 wins & 2 nominations.","Metascore":"","Released":"24 April 1944 (USA) ","Location":"1825 N. Kingsley Drive, Hollywood, Los Angeles, California, USA ","Actors":"Fred MacMurray, Barbara Stanwyck, Edward G. Robinson ","Writer":"Billy Wilder (screenplay), Raymond Chandler (screenplay) | 1 more credit »","Running_time":"PT107M / 1h 47min","Description":"Directed by Billy Wilder.  With Fred MacMurray, Barbara Stanwyck, Edward G. Robinson, Byron Barr. An insurance representative lets himself be talked into a murder/insurance fraud scheme that arouses an insurance investigator's suspicions.","Rated":"N/A"}