{"imdbID":"tt0090329","Title":"Witness","Year":"1985","Director":"Peter Weir","Country":"USA","Language":"English, German","Budget":"$12,000,000 (estimated)","Gross":"$65,500,000 (USA)","Production_Co":"Paramount Pictures, Edward S. Feldman Production ","Runtime":"112 min","Cast":"Harrison Ford, Kelly McGillis, Josef Sommer, Lukas Haas, Jan Rubes, Alexander Godunov, Danny Glover, Brent Jennings, Patti LuPone, Angus MacInnes, Frederick Rolf, Viggo Mortensen, John Garson, Beverly May, Ed Crowley","Plot":"A young Amish boy is sole witness to a murder; policeman John Book goes into hiding in Amish country to protect him until the trial. An 8 year old Amish boy and his mother are traveling to Philadelphia, on their way to visit the mother's sister. While waiting at the train station, the young boy witnesses a brutal murder inside one of the bathroom stall. Police detective John Book is assigned to investigate the murder of the man, who was a undercover cop. Soon after, Book finds out that he's in great danger when the culprits know about his investigation and hides out in the Amish community. There, he learns the way of living among the Amish locals, which consists of non-violence and agriculture. Book soon starts a romance with the mother of the little boy, but their romance is forbidden by the Amish standards. But, it's not long before the bad guys find out Book's whereabouts. Written by blazesnakes9","Genre":"Crime, Drama, Romance","Keywords":"amish, murder, train, love, police","imdbRating":"7.4","imdbVotes":"64,861","Awards":"Won 2 Oscars. Another 10 wins & 26 nominations.","Metascore":"76","Released":"8 February 1985 (USA) ","Location":"30th Street Station - 3001 Market Street, Philadelphia, Pennsylvania, USA ","Actors":"Harrison Ford, Kelly McGillis, Lukas Haas ","Writer":"William Kelley (story), Pamela Wallace (story) | 3 more credits »","Running_time":"PT112M / 1h 52min","Description":"Directed by Peter Weir.  With Harrison Ford, Kelly McGillis, Lukas Haas, Josef Sommer. A young Amish boy is sole witness to a murder; policeman John Book goes into hiding in Amish country to protect him until the trial.","Rated":"R"}