{"imdbID":"tt0083658","Title":"Blade Runner","Year":"1982","Director":"Ridley Scott","Taglines":"The star of \"RAIDERS OF THE LOST ARK\" and the director of \"ALIEN\" take you on a spectacular journey to the savage world of the year 2019!! ","Country":"USA, Hong Kong, UK","Language":"English, German, Cantonese, Japanese, Hungarian","Also_Known_As":"Dangerous Days ","Budget":"$28,000,000 (estimated)","Opening_Weekend":"$6,150,002 (USA) (25 June 1982)","Gross":"$27,000,000 (USA)","Production_Co":"Ladd Company, The, Shaw Brothers, Warner Bros. ","":"Show detailed company contact information on IMDbPro »","Runtime":"117 min","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby Stereo (35 mm prints)","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Only days away from the beginning of principal photography, production company Filmways Inc., who had promised to provide $15 million for the production, withdrew from the project, investing the money in Brian De Palma's Blow Out (1981) instead. In only a matter of days, producer Michael Deeley was able to broker a $22 million three-way deal with Tandem Pictures, the Ladd Company (through Warner Bros.) and Hong Kong producer Sir Run Run Shaw (20th Century Fox, United Artists and Universal all turned the project down). The Ladd Company provided $7½ million and took domestic distribution rights. Sir Run Run Shaw also provided $7½ million and took international distribution rights. Tandem Pictures provided $7 million and took ancillary distribution rights (TV, home video etc). Tandem also provided the completion guarantee on the proviso that if the film went over its $22 million budget by 10% or more, they would pay for it but they could assume complete artistic control of the project. Ultimately, the film cost $28 million, and executive producers Jerry Perenchio and Bud Yorkin did indeed take over the project. See more »","Goofs":"When Deckard is talking to the Egyptian snake vendor, you can see through the glass that each characters dialogue does not match their mouth movements. This is true in all versions of the film, except the Workprint. Even in 2007 \"Final Cut\", the obviousness of the error has been reduced, but if you look closely, you can still see that the audio doesn't quite match the visual. See more »","Crazy_Credits":"The opening credits sequence features a detailed, dictionary-style definition of the word Replicant. See more »","Cast":"Harrison Ford, Rutger Hauer, Sean Young, Edward James Olmos, M. Emmet Walsh, Daryl Hannah, William Sanderson, Brion James, Joe Turkel, Joanna Cassidy, James Hong, Morgan Paull, Kevin Thompson, John Edward Allen, Hy Pyke","Plot":"A blade runner must pursue and try to terminate four replicants who stole a ship in space and have returned to Earth to find their creator. In the futuristic year of 2019, Los Angeles has become a dark and depressing metropolis, filled with urban decay. Rick Deckard, an ex-cop, is a \"Blade Runner\". Blade runners are people assigned to assassinate \"replicants\". The replicants are androids that look like real human beings. When four replicants commit a bloody mutiny on the Off World colony, Deckard is called out of retirement to track down the androids. As he tracks the replicants, eliminating them one by one, he soon comes across another replicant, Rachel, who evokes human emotion, despite the fact that she's a replicant herself. As Deckard closes in on the leader of the replicant group, his true hatred toward artificial intelligence makes him question his own identity in this future world, including what's human and what's not human. Written by blazesnakes9","Genre":"Sci-Fi, Thriller","Keywords":"tech noir, human android relationship, police detective, existentialism, megacorporation","imdbRating":"8.2","imdbVotes":"445,533","Awards":"Nominated for 2 Oscars. Another 11 wins & 16 nominations.","Metascore":"88","Released":"25 June 1982 (USA) ","Location":"Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA ","Actors":"Harrison Ford, Rutger Hauer, Sean Young ","Writer":"Hampton Fancher (screenplay), David Webb Peoples (screenplay) (as David Peoples) | 1 more credit »","Running_time":"PT117M / 1h 57min","Description":"Directed by Ridley Scott.  With Harrison Ford, Rutger Hauer, Sean Young, Edward James Olmos. A blade runner must pursue and try to terminate four replicants who stole a ship in space and have returned to Earth to find their creator.","Rated":"R"}