{"imdbID":"tt0076666","Title":"Saturday Night Fever","Year":"1977","Director":"John Badham","Country":"USA","Language":"English, Italian","Budget":"$3,000,000 (estimated)","Gross":"$94,213,184 (USA)","Production_Co":"Robert Stigwood Organization (RSO) ","Runtime":"118 min | 113 min (PG)","Cast":"John Travolta, Karen Lynn Gorney, Barry Miller, Joseph Cali, Paul Pape, Donna Pescow, Bruce Ornstein, Julie Bovasso, Martin Shakar, Sam Coppola, Nina Hansen, Lisa Peluso, Denny Dillon, Bert Michaels, Robert Costanzo","Plot":"A Brooklyn teenager feels his only chance to succeed is as the king of the disco floor. His carefree youth and weekend dancing help him to forget the reality of his bleak life. Nineteen-year-old Brooklyn native Tony Manero lives for Saturday nights at the local disco, where he's king of the club, thanks to his stylish moves on the dance floor. But outside of the club, things don't look so rosy. At home, Tony fights constantly with his father and has to compete with his family's starry-eyed view of his older brother, a priest. Nor can he find satisfaction at his dead-end job at a small paint store. However, things begin to change when he spies Stephanie Mangano in the disco and starts training with her for the club's dance competition. Stephanie dreams of the world beyond Brooklyn, and her plans to move to Manhattan just over the bridge soon change Tony's life forever. Written by alfiehitchie","Genre":"Drama, Music","Keywords":"the bee gees, 1970s, disco, dance, dancing","imdbRating":"6.8","imdbVotes":"51,820","Awards":"Nominated for 1 Oscar. Another 4 wins & 11 nominations.","Metascore":"77","Released":"16 December 1977 (USA) ","Location":"9324 3d Avenue, Bay Ridge, Brooklyn, New York City, New York, USA ","Actors":"John Travolta, Karen Lynn Gorney, Barry Miller ","Writer":"Nik Cohn (story), Norman Wexler (screenplay)","Running_time":"PT118M / 1h 58min","Description":"Directed by John Badham.  With John Travolta, Karen Lynn Gorney, Barry Miller, Joseph Cali. A Brooklyn teenager feels his only chance to succeed is as the king of the disco floor. His carefree youth and weekend dancing help him to forget the reality of his bleak life.","Rated":"R"}