{"imdbID":"tt0068182","Title":"Aguirre, the Wrath of God","Year":"1972","Director":"Werner Herzog","Writer":"Werner Herzog","Taglines":"A breathtaking journey into the heart of darkness. ","Certificate":"Not Rated | See all certifications »","Country":"West Germany","Language":"German, Quechua, Spanish","Also_Known_As":"Aguirre, the Wrath of God ","Budget":"$370,000 (estimated)","Production_Co":"Werner Herzog Filmproduktion, Hessischer Rundfunk (HR) ","Runtime":"93 min","Sound_Mix":"Mono","Color":"Color (Eastmancolor)","Aspect_Ratio":"1.37 : 1","Trivia":"Many of the scenes depicted in the film were unrehearsed and unstaged, and the dividing line between the cast acting in character and simply reacting to their situations as people became very blurry. For example, in one of the opening scenes, when the carriage holding Aguirre's daughter tips over and threatens to collapse, a hand comes in from the right side of the frame to assist the actors in steadying their hold. That hand belongs to director Werner Herzog. See more »","Goofs":"When Pizarro sends off the expedition, he expects them to return in one week. However, when Don Pedro tells the men that they have to return by foot, he says that they could make it in two weeks \"as Pizarro said\". See more »","Cast":"Klaus Kinski, Helena Rojo, Del Negro, Ruy Guerra, Peter Berling, Cecilia Rivera, Daniel Ades, Edward Roland, Alexandra Cheves, Armando Polanah, Daniel Farfán, Julio E. Martínez, Alejandro Repullés, Indianern der Kooperative Lauramarca","Plot":"In the 16th century, the ruthless and insane Don Lope de Aguirre leads a Spanish expedition in search of El Dorado. A few decades after the destruction of the Inca empire, a Spanish expedition leaves the mountains of Peru and goes down the Amazon river in search of gold and wealth. Soon, they come across great difficulties and Don Aguirres, a ruthless man who cares only about riches, becomes their leader. But will his quest lead them to \"the golden city\", or to certain destruction? Written by Chris Makrozahopoulos <makzax@hotmail.com>","Genre":"Adventure, Drama, History","Keywords":"conquistador, spanish, river, expedition, spain","imdbRating":"8.0","imdbVotes":"37,141","Awards":"4 wins & 3 nominations.","Metascore":"","Released":"3 April 1977 (USA) ","Location":"Huayna Picchu, Peru ","Actors":"Klaus Kinski, Ruy Guerra, Helena Rojo ","Running_time":"PT93M / 1h 33min","Description":"Directed by Werner Herzog.  With Klaus Kinski, Ruy Guerra, Helena Rojo, Del Negro. In the 16th century, the ruthless and insane Don Lope de Aguirre leads a Spanish expedition in search of El Dorado.","Rated":"NOT RATED"}