{"imdbID":"tt0087843","Title":"Once Upon a Time in America","Year":"1984","Director":"Sergio Leone","Taglines":"As boys, they made a pact to share their fortunes, their loves, their lives. As men, they shared a dream to rise from poverty to power. Forging an empire built on greed, violence and betrayal, their dream would end as a mystery that refuse to die. ","Country":"Italy, USA","Language":"English, Italian, French","Also_Known_As":"Érase una vez en América ","Budget":"$30,000,000 (estimated)","Gross":"$5,300,000 (USA)","Production_Co":"Ladd Company, The, Embassy International Pictures, PSO International ","":"Show detailed company contact information on IMDbPro »","Runtime":"229 min | 139 min (re-cut) | 251 min (extended director's cut)","Sound_Mix":"Mono","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The script was written in Italian by Leonardo Benvenuti; in 1981 writing partners Piero De Bernardi and Enrico Medioli, and Stuart Kaminsky were brought in to appropriately translate it into English. According to Kaminsky, Benvenuti was primarily responsible for devising the visual scenes, Medioli maintained the epic nature of the film, and Kaminsky wrote all the dialogue (Kaminsky also collaborated with Robert De Niro to ensure the characterization between Max and Noodles was both similar and distinct). See more »","Goofs":"When Noodles talks to Deborah in the dressing room after her play, every time she raises her voice it reverberates like she'd be talking in a big hall - which is because the small dressing room is a set, presumably with one wall and the ceiling missing, built on a big sound stage. See more »","Crazy_Credits":"Joey Faye is credited as the \"adorable old man.\" See more »","Cast":"Robert De Niro, James Woods, Elizabeth McGovern, Joe Pesci, Burt Young, Tuesday Weld, Treat Williams, Danny Aiello, Richard Bright, James Hayden, William Forsythe, Darlanne Fluegel, Larry Rapp, Richard Foronjy, Robert Harper","Plot":"A former Prohibition-era Jewish gangster returns to the Lower East Side of Manhattan over thirty years later, where he once again must confront the ghosts and regrets of his old life. Epic tale of a group of Jewish gangsters in New York, from childhood, through their glory years during prohibition, and their meeting again 35 years later. Written by Andrew Welsh <andreww@bnr.ca>","Genre":"Crime, Drama","Keywords":"childhood friend, 1920s, ambiguity, speakeasy, mob hit","imdbRating":"8.4","imdbVotes":"212,243","Awards":"Nominated for 2 Golden Globes. Another 11 wins & 7 nominations.","Metascore":"","Released":"1 June 1984 (USA) ","Location":"Intersection of Washington Street and Water Street, Dumbo, Brooklyn, New York City, New York, USA ","Actors":"Robert De Niro, James Woods, Elizabeth McGovern ","Writer":"Harry Grey (novel), Leonardo Benvenuti (screenplay) | 6 more credits »","Running_time":"PT229M / 3h 49min","Description":"Directed by Sergio Leone.  With Robert De Niro, James Woods, Elizabeth McGovern, Joe Pesci. A former Prohibition-era Jewish gangster returns to the Lower East Side of Manhattan over thirty years later, where he once again must confront the ghosts and regrets of his old life.","Rated":"R"}