{"imdbID":"tt0042546","Title":"Harvey","Year":"1950","Director":"Henry Koster","Taglines":"The Wonderful Pulitzer Prize Play... becomes one of the Great Motion Pictures of our Time!","Certificate":"Not Rated | See all certifications »","Country":"USA","Language":"English, Spanish, Latin","Also_Known_As":"Mein Freund Harvey ","Production_Co":"Universal International Pictures (UI) ","":"Show detailed company contact information on IMDbPro »","Runtime":"104 min | 111 min (DVD)","Sound_Mix":"Mono (Western Electric Recording)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Harold Lloyd was willing to appear in a film version of the Pulitzer Prize-winning play, and Preston Sturges expressed interest in purchasing the screen rights. See more »","Goofs":"In the daytime scenes at Chumley's Rest, shadows are seen of the actors and props that clearly go against the dominant natural light. See more »","Crazy_Credits":"At the very end Harvey opens a door and the words at the bottom of the screen say \"Harvey as Himself.\" See more »","Cast":"James Stewart, Josephine Hull, Peggy Dow, Charles Drake, Cecil Kellaway, Victoria Horne, Jesse White, William H. Lynn, Wallace Ford, Nana Bryant, Grayce Mills, Clem Bevans, Harvey, Gino Corrado, Jack Curtis","Plot":"Due to his insistence that he has an invisible six-foot rabbit for a best friend, a whimsical middle-aged man is thought by his family to be insane - but he may be wiser than anyone knows. The classic stage hit gets the Hollywood treatment in the story of Elwood P. Dowd who makes friends with a spirit taking the form of a human-sized rabbit named Harvey that only he sees (and a few privileged others on occasion also.) After his sister tries to commit him to a mental institution, a comedy of errors ensues. Elwood and Harvey become the catalysts for a family mending its wounds and for romance blossoming in unexpected places. Written by Dale Roloff","Genre":"Comedy, Drama","Keywords":"rabbit, mental institution, 1950s, title character not the main character, hypodermic needle","imdbRating":"8.1","imdbVotes":"43,476","Awards":"Won 1 Oscar. Another 1 win & 4 nominations.","Metascore":"","Released":"13 October 1950 (USA) ","Location":"Universal Studios - 100 Universal City Plaza, Universal City, California, USA ","Actors":"James Stewart, Josephine Hull, Peggy Dow ","Writer":"Mary Chase (from the Pulitzer Prize Play by), Mary Chase (screenplay) | 1 more credit »","Running_time":"PT104M / 1h 44min","Description":"Directed by Henry Koster.  With James Stewart, Josephine Hull, Peggy Dow, Charles Drake. Due to his insistence that he has an invisible six-foot rabbit for a best friend, a whimsical middle-aged man is thought by his family to be insane - but he may be wiser than anyone knows.","Rated":"NOT RATED"}