{"imdbID":"tt0066999","Title":"Dirty Harry","Year":"1971","Director":"Don Siegel","Taglines":"Detective Harry Callahan. He doesn't break murder cases. He smashes them. ","Certificate":"R | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Dead Right ","Budget":"$4,000,000 (estimated)","Gross":"SEK 1,540,127 (Sweden)","Production_Co":"Warner Bros., Malpaso Company, The ","Runtime":"102 min | 99 min (cut)","Sound_Mix":"Mono","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Harry drives a 1968 Ford Galaxie 500, California plate 'WKH 370'. See more »","Goofs":"When Scorpio is baited to come after the priest, Harry is wielding a Winchester Model 70 in .458 Winchester Magnum. In the ensuing shootout, Harry fires 6 rounds without reloading. In reality, the size of the .458 Win Mag case is so large that it limits the magazine capacity to 3 (2 in some rifles). With one round in the chamber, the maximum number of rounds he could have fired without reloading is four. See more »","Cast":"Clint Eastwood, Harry Guardino, Reni Santoni, John Vernon, Andrew Robinson, John Larch, John Mitchum, Mae Mercer, Lyn Edgington, Ruth Kobart, Woodrow Parfrey, Josef Sommer, William Paterson, James Nolan, Maurice Argent","Plot":"When a mad man calling himself 'the Scorpio Killer' menaces the city, tough as nails San Francisco Police Inspector Harry Callahan is assigned to track down and ferret out the crazed psychopath. In the year 1971, San Francisco faces the terror of a maniac known as Scorpio- who snipes at innocent victims and demands ransom through notes left at the scene of the crime. Inspector Harry Callahan (known as Dirty Harry by his peers through his reputation handling of homicidal cases) is assigned to the case along with his newest partner Inspector Chico Gonzalez to track down Scorpio and stop him. Using humiliation and cat and mouse type of games against Callahan, Scorpio is put to the test with the cop with a dirty attitude. Written by commanderblue","Genre":"Crime, Thriller","Keywords":"dirty harry, sniper, .44 magnum, smith and wesson model 29, smith and wesson .44 magnum revolver","imdbRating":"7.8","imdbVotes":"111,100","Awards":"1 win & 1 nomination.","Metascore":"","Released":"23 December 1971 (USA) ","Location":"Alamo Square, Hayes Valley, San Francisco, California, USA ","Actors":"Clint Eastwood, Andrew Robinson, Harry Guardino ","Writer":"Harry Julian Fink (screenplay), Rita M. Fink (screenplay) (as R.M. Fink) | 3 more credits »","Running_time":"PT102M / 1h 42min","Description":"Directed by Don Siegel.  With Clint Eastwood, Andrew Robinson, Harry Guardino, Reni Santoni. When a mad man calling himself 'the Scorpio Killer' menaces the city, tough as nails San Francisco Police Inspector Harry Callahan is assigned to track down and ferret out the crazed psychopath.","Rated":"R"}