{"imdbID":"tt0053198","Title":"The 400 Blows","Year":"1959","Director":"François Truffaut","Taglines":"Det franske mesterværk om de unge i lømmelalderen[Denmark] ","Certificate":"Not Rated | See all certifications »","Country":"France","Language":"French, English","Also_Known_As":"The 400 Blows ","Production_Co":"Les Films du Carrosse, Sédif Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"99 min","Sound_Mix":"Mono","Color":"Black and White","Aspect_Ratio":"2.35 : 1","Trivia":"François Truffaut: is seen riding next to Antoine in the centrifuge ride at the fair, and can then be seen smoking a cigarette just outside the ride. See more »","Goofs":"Position of Antoine's hands on the door when Rene comes to visit changes. See more »","Cast":"Jean-Pierre Léaud, Claire Maurier, Albert Rémy, Guy Decomble, Georges Flamant, Patrick Auffay, Daniel Couturier, François Nocher, Richard Kanayan, Renaud Fontanarosa, Michel Girard, Serge Moati, Bernard Abbou, Jean-François Bergouignan, Michel Lesignor","Plot":"Moving story of a young boy who, left without attention, delves into a life of petty crime. Seemingly in constant trouble at school, 14 year-old Antoine Doinel returns at the end of every day to a drab and unhappy home life. His parents have little money and he sleeps on a couch that's been pushed into the kitchen. He knows his mother is having an affair and his parents bicker constantly. He decides to skip school and begins a downward spiral of lies and later stealing. His parents are at their wits end and after he's stopped by the police, they decide the best thing to do would be to let Antoine face the consequences. He's sent to a juvenile detention facility where he doesn't do much better. He does manage to escape however......... Written by garykmcd","Genre":"Crime, Drama","Keywords":"school, coming of age, juvenile delinquency, schoolboy, running away","imdbRating":"8.2","imdbVotes":"67,153","Awards":"Nominated for 1 Oscar. Another 7 wins & 3 nominations.","Metascore":"","Released":"16 November 1959 (USA) ","Location":"Avenue Frochot, Paris 9, Paris, France ","Actors":"Jean-Pierre Léaud, Albert Rémy, Claire Maurier ","Writer":"François Truffaut (scenario), Marcel Moussy (adaptation) (as M. Moussy) | 2 more credits »","Running_time":"PT99M / 1h 39min","Description":"Directed by François Truffaut.  With Jean-Pierre Léaud, Albert Rémy, Claire Maurier, Guy Decomble. Moving story of a young boy who, left without attention, delves into a life of petty crime.","Rated":"NOT RATED"}