{"imdbID":"tt0093191","Title":"Wings of Desire","Year":"1987","Director":"Wim Wenders","Taglines":"There are angels on the streets of Berlin.","Certificate":"PG-13 | See all certifications »","Country":"West Germany, France","Language":"German, English, French, Turkish, Hebrew, Spanish, Japanese","Also_Known_As":"The Sky Above Berlin ","Gross":"$3,806,540 (USA) (18 September 1998)","Production_Co":"Road Movies Filmproduktion, Argos Films, Westdeutscher Rundfunk (WDR) ","Runtime":"128 min","Sound_Mix":"Dolby","Color":"Color (Eastmancolor)| Black and White (partly)","Aspect_Ratio":"1.37 : 1","Trivia":"All of the black & white sequences were shot through a one-of-a-kind filter made from a stocking that belonged to cinematographer Henri Alekan's grandmother. See more »","Goofs":"The position of the trapeze artists' arms change after Bruno stands in her trailer. See more »","Crazy_Credits":"Dedicated to all the former angels, but especially to Yasujiro, François and Andrej. See more »","Cast":"Bruno Ganz, Solveig Dommartin, Otto Sander, Curt Bois, Peter Falk, Hans Martin Stier, Elmar Wilms, Sigurd Rachman, Beatrice Manowski, Lajos Kovács, Bruno Rosaz, Laurent Petitgand, Chick Ortega, Otto Kuhnle, Christoph Merg","Plot":"An angel tires of overseeing human activity and wishes to become human when he falls in love with a mortal. Visible only to those like them and to human children, Damiel and Cassiel are two angels, who have existed even before humankind. Along with several other angels, they currently wander around West Berlin, generally on their own, observing and preserving life, sometimes trying to provide comfort to the troubled, although those efforts are not always successful. Among those they are currently observing are: the cast and crew of a movie - a detective story set in WWII Nazi Germany - which include a sensitive and perceptive Peter Falk; an elderly man named Homer looking for eternal peace; and the troupe of a financially failing circus, which has closed early for the season because of those financial problems. One day, Damiel tells Cassiel that he wants to become human, to feel not only the sensory aspects of physical beings, but also emotional aspects. He embarks on this thought with the full realization that there is no turning back if he decides to do so. His thoughts are largely ... Written by Huggo","Genre":"Drama, Fantasy, Romance","Keywords":"library, angel, circus, love, germany","imdbRating":"8.1","imdbVotes":"45,963","Awards":"Nominated for 1 BAFTA Film Award. Another 18 wins & 10 nominations.","Metascore":"79","Released":"6 May 1988 (USA) ","Location":"Cinema Paris - Kurfürstendamm 211, Berlin, Germany ","Actors":"Bruno Ganz, Solveig Dommartin, Otto Sander ","Writer":"Wim Wenders, Peter Handke (screenplay) | 1 more credit »","Running_time":"PT128M / 2h 8min","Description":"Directed by Wim Wenders.  With Bruno Ganz, Solveig Dommartin, Otto Sander, Curt Bois. An angel tires of overseeing human activity and wishes to become human when he falls in love with a mortal.","Rated":"PG-13"}