{"imdbID":"tt0026144","Title":"Broadway Melody of 1936","Year":"1935","Country":"USA","Language":"English","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"101 min","Cast":"Jack Benny, Eleanor Powell, Robert Taylor, Una Merkel, Sid Silvers, Buddy Ebsen, June Knight, Vilma Ebsen, Nick Long Jr., Robert Wildhack, Paul Harvey, Frances Langford, Harry Stockwell","Plot":"Bob Gordon is staging a new Broadway Show, but he is short of money. He gets an offer of money by the young widow Lilian, if she can dance in his new show. Bert Keeler, a paper man, gets ... See full summary » Bob Gordon is staging a new Broadway Show, but he is short of money. He gets an offer of money by the young widow Lilian, if she can dance in his new show. Bert Keeler, a paper man, gets this information and is writing about this in his column in an slight unfriendly way. Gordon's old class mate Irene Forster, a tap dancer from Albany also tries to get the leading role in this show, but Lilian insists in getting this part herself. So Irene Forster, Bert Keeler and Gordon's secretary Kitty start a little game to get Irene the leading role. Written by Stephan Eichenberg <eichenbe@fak-cbg.tu-muenchen.de>","Genre":"Musical, Romance","Keywords":"gossip columnist, dancer, phony accent, reference to greta garbo, french accent","imdbRating":"6.9","imdbVotes":"991","Awards":"Won 1 Oscar. Another 2 nominations.","Metascore":"","Released":"20 September 1935 (USA) ","Location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA","Actors":"Jack Benny, Eleanor Powell, Robert Taylor ","Director":"Roy Del Ruth, W.S. Van Dyke (uncredited)","Writer":"Jack McGowan (screen play), Sid Silvers (screen play) | 2 more credits »","Running_time":"PT101M / 1h 41min","Description":"Directed by Roy Del Ruth, W.S. Van Dyke.  With Jack Benny, Eleanor Powell, Robert Taylor, Una Merkel. Bob Gordon is staging a new Broadway Show, but he is short of money. He gets an offer of money by the young widow Lilian, if she can dance in his new show. Bert Keeler, a paper man, gets this information and is writing about this in his column in an slight unfriendly way. Gordon's old class mate Irene Forster, a tap dancer from Albany also tries to get the leading role in this show, but Lilian ...","Rated":"PASSED"}