{"imdbID":"tt0071853","Title":"Monty Python and the Holy Grail","Year":"1975","Taglines":"And now! At Last! Another film completely different from some of the other films which aren't quite the same as this one is. ","Certificate":"See all certifications »","Country":"UK","Language":"English, French, Latin","Also_Known_As":"Monte Paithan mariyu Holi Greyil ","Budget":"£229,575 (estimated)","Opening_Weekend":"$45,487 (USA) (15 June 2001)","Gross":"$1,229,197 (USA) (25 May 2012)","Production_Co":"Michael White Productions, National Film Trustee Company, Python (Monty) Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"91 min","Sound_Mix":"Dolby Digital (2001 re-release)| Mono (original release)","Color":"Color (Technicolor)","Aspect_Ratio":"1.66 : 1","Trivia":"When King Arthur and his knights reach Camelot,the trumpet fanfare is the identification fanfare for Rediffusion Television. Rediffusion produced Do Not Adjust Your Set (1967) and At Last the 1948 Show (1967), two programs featuring the members of Monty Python before teaming up. See more »","Goofs":"The Black Knight's sword is soaked in blood when he pulls it out of the Green Knight's head, yet a few seconds later when he duels Arthur, it is clean. We never saw him clean it. See more »","Crazy_Credits":"On the Regions 2 and 4 DVD's (Europe and Australasia) release, the end credits are extended to three minutes (rather than 20 seconds) of a black screen with the intermission music. See more »","Cast":"Graham Chapman, John Cleese, Eric Idle, Terry Gilliam, Terry Jones, Michael Palin, Connie Booth, Carol Cleveland, Neil Innes, Bee Duffell, John Young, Rita Davies, Avril Stewart, Sally Kinghorn, Mark Zycon","Plot":"King Arthur and his knights embark on a low-budget search for the Grail, encountering many, very silly obstacles. History is turned on its comic head when, in 10th century England, King Arthur travels the countryside to find knights who will join him at the Round Table in Camelot. Gathering up the men is a tale in itself but after a bit of a party at Camelot, many decide to leave only to be stopped by God who sends them on a quest: to find the Holy Grail. After a series of individual adventures, the knights are reunited but must face a wizard named Tim, killer rabbits and lessons in the use of holy hand grenades. Their quest comes to an end however when the police intervene - just what you would expect in a Monty Python movie. Written by garykmcd","Genre":"Adventure, Comedy, Fantasy","Keywords":"knight, lancelot, king arthur, holy grail, camelot","imdbRating":"8.3","imdbVotes":"368,971","Awards":"2 wins & 2 nominations.","Metascore":"90","Released":"6 December 1979 (India) ","Location":"Appin, Argyll and Bute, Scotland, UK ","Actors":"Graham Chapman, John Cleese, Eric Idle ","Director":"Terry Gilliam, Terry Jones","Writer":"Graham Chapman, John Cleese | 4 more credits »","Running_time":"PT91M / 1h 31min","Description":"Directed by Terry Gilliam, Terry Jones.  With Graham Chapman, John Cleese, Eric Idle, Terry Gilliam. King Arthur and his knights embark on a low-budget search for the Grail, encountering many, very silly obstacles.","Rated":"N/A"}