{"imdbID":"tt0025316","Title":"It Happened One Night","Year":"1934","Director":"Frank Capra","Taglines":"An unforgettable entertainment...the outstanding performance of two outstanding careers! ","Certificate":"Unrated | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Night Bus ","Budget":"$325,000 (estimated)","Production_Co":"Columbia Pictures Corporation ","":"Show detailed company contact information on IMDbPro »","Runtime":"105 min | 65 min (cut TV)","Sound_Mix":"Mono (Western Electric Noiseless Recording)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Director Frank Capra came up with the idea about \"the walls of Jericho\" because Claudette Colbert refused to undress in front of the camera. See more »","Goofs":"When Peter is making breakfast for Ellen, as the table is first set, there are six doughnuts on the plate in the lower left corner of the screen, but when they sit and begin eating and discussing what there is to eat, there are only two. See more »","Cast":"Clark Gable, Claudette Colbert, Walter Connolly, Roscoe Karns, Jameson Thomas, Alan Hale, Arthur Hoyt, Blanche Friderici, Charles C. Wilson","Plot":"A spoiled heiress, running away from her family, is helped by a man who is actually a reporter in need of a story. Ellie Andrews has just tied the knot with society aviator King Westley when she is whisked away to her father's yacht and out of King's clutches. Ellie jumps ship and eventually winds up on a bus headed back to her husband. Reluctantly she must accept the help of out-of- work reporter Peter Warne. Actually, Warne doesn't give her any choice: either she sticks with him until he gets her back to her husband, or he'll blow the whistle on Ellie to her father. Either way, Peter gets what (he thinks!) he wants .... a really juicy newspaper story. Written by A.L.Beneteau <albl@inforamp.net>","Genre":"Comedy, Romance","Keywords":"bus, love, reporter, money, detective","imdbRating":"8.2","imdbVotes":"61,988","Awards":"Won 5 Oscars. Another 5 wins & 1 nomination.","Metascore":"","Released":"23 February 1934 (USA) ","Location":"Santa Anita Ave in Arcadia, California, USA ","Actors":"Clark Gable, Claudette Colbert, Walter Connolly ","Writer":"Robert Riskin (screen play), Samuel Hopkins Adams (based on the short story by)","Running_time":"PT105M / 1h 45min","Description":"Directed by Frank Capra.  With Clark Gable, Claudette Colbert, Walter Connolly, Roscoe Karns. A spoiled heiress, running away from her family, is helped by a man who is actually a reporter in need of a story.","Rated":"UNRATED"}