{"imdbID":"tt0047203","Title":"Magnificent Obsession","Year":"1954","Director":"Douglas Sirk","Country":"USA","Language":"English, German","Production_Co":"Universal International Pictures (UI) ","Runtime":"108 min","Cast":"Jane Wyman, Rock Hudson, Agnes Moorehead, Otto Kruger, Barbara Rush, Gregg Palmer, Paul Cavanagh, Sara Shane, Richard H. Cutting, Judy Nugent, Helen Kleeb, Rudolph Anders, Fred Nurney, John Mylong, Alexander Campbell","Plot":"When churlish, spoiled rich man Bob Merrick foolishly wrecks his speed boat, the rescue team resuscitates him with equipment that's therefore unavailable to aid a local hero, Dr. Wayne ... See full summary » When churlish, spoiled rich man Bob Merrick foolishly wrecks his speed boat, the rescue team resuscitates him with equipment that's therefore unavailable to aid a local hero, Dr. Wayne Phillips, who dies as a result. Phillips had helped many people, and when Merrick learns Phillips' secret, to give selflessly and in secret, he tries it in a ham-handed way. The result further alienates Phillips' widow, Helen, with whom Merrick has fallen in love. Merrick's persistence causes another tragedy, and he must remake his life, including going back to medical school, in an attempt to make amends and win her love. Written by <jhailey@hotmail.com>","Genre":"Drama, Romance","Keywords":"boat, widow, flowerpot, kiss on the forehead, swinging doors","imdbRating":"7.1","imdbVotes":"3,990","Awards":"Nominated for 1 Oscar. Another 1 win.","Metascore":"","Released":"7 August 1954 (USA) ","Location":"Big Bear Lake, Big Bear Valley, San Bernardino National Forest, California, USA ","Actors":"Jane Wyman, Rock Hudson, Agnes Moorehead ","Writer":"Lloyd C. Douglas (novel), Robert Blees (screenplay) | 3 more credits »","Running_time":"PT108M / 1h 48min","Description":"Directed by Douglas Sirk.  With Jane Wyman, Rock Hudson, Agnes Moorehead, Otto Kruger. When churlish, spoiled rich man Bob Merrick foolishly wrecks his speed boat, the rescue team resuscitates him with equipment that's therefore unavailable to aid a local hero, Dr. Wayne Phillips, who dies as a result. Phillips had helped many people, and when Merrick learns Phillips' secret, to give selflessly and in secret, he tries it in a ham-handed way. The result further alienates Phillips' ...","Rated":"APPROVED"}