{"imdbID":"tt0025301","Title":"Imitation of Life","Year":"1934","Director":"John M. Stahl","Country":"USA","Language":"English","Production_Co":"Universal Pictures ","Runtime":"111 min","Cast":"Claudette Colbert, Warren William, Rochelle Hudson, Ned Sparks, Louise Beavers, Fredi Washington, Juanita Quigley, Alan Hale, Henry Armetta, Wyndham Standing","Plot":"Bea Pullman and her daughter Jessie have had a hard time making ends meet since Bea's husband died. Help comes in the form of Delilah Johnson, who agrees to work as Bea's housekeeper in ... See full summary » Bea Pullman and her daughter Jessie have had a hard time making ends meet since Bea's husband died. Help comes in the form of Delilah Johnson, who agrees to work as Bea's housekeeper in exchange for a room for herself and her daughter Peola. Bea comes up with a plan to market Delilah's pancake recipe. The two soon become wealthy and as the years go on, their friendship deepens. Their relationships with their daughters, however, become strained. Ashamed of her mother, Peola seeks a new life by passing for white. Bea's love for her daughter is tested when she and Jessie fall for the same man. Written by <dbubbeo@cmp.com>","Genre":"Drama, Romance","Keywords":"housekeeper, friendship, passing for white, pancake, reference to coca cola","imdbRating":"7.6","imdbVotes":"2,743","Awards":"Nominated for 3 Oscars. Another 1 win.","Metascore":"","Released":"26 November 1934 (USA) ","Location":"Universal Studios - 100 Universal City Plaza, Universal City, California, USA","Actors":"Claudette Colbert, Warren William, Rochelle Hudson ","Writer":"Fannie Hurst (novel), William Hurlbut (screenplay)","Running_time":"PT111M / 1h 51min","Description":"Directed by John M. Stahl.  With Claudette Colbert, Warren William, Rochelle Hudson, Ned Sparks. Bea Pullman and her daughter Jessie have had a hard time making ends meet since Bea's husband died. Help comes in the form of Delilah Johnson, who agrees to work as Bea's housekeeper in exchange for a room for herself and her daughter Peola. Bea comes up with a plan to market Delilah's pancake recipe. The two soon become wealthy and as the years go on, their friendship deepens. Their ...","Rated":"APPROVED"}