{"imdbID":"tt0082971","Title":"Raiders of the Lost Ark","Year":"1981","Director":"Steven Spielberg","Taglines":"The Return of the Great Adventure. ","Certificate":"PG | See all certifications »","Country":"USA","Language":"English, German, Hebrew, Spanish, Arabic, Nepali","Also_Known_As":"Indiana Jones ","Budget":"$18,000,000 (estimated)","Opening_Weekend":"$1,673,731 (USA) (7 September 2012)","Gross":"$242,374,454 (USA)","Production_Co":"Paramount Pictures, Lucasfilm ","":"Show detailed company contact information on IMDbPro »","Runtime":"115 min","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby (35 mm prints)","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"A fiberglass boulder 22 feet (7 m) in diameter was made for the scene where Indiana escapes from the temple. Steven Spielberg was so impressed by production designer Norman Reynolds' realization of his idea that he gave the boulder a more prominent role in the film and told Reynolds to let the boulder roll another 50 feet (15 m) See more »","Goofs":"Map of Indy's plane route includes Jordan, which before 1949 was known as Transjordan. See more »","Crazy_Credits":"The mountain in the Paramount logo dissolves into the mountain in the Peruvian jungle. See more »","Cast":"Harrison Ford, Karen Allen, Paul Freeman, Ronald Lacey, John Rhys-Davies, Denholm Elliott, Alfred Molina, Wolf Kahler, Anthony Higgins, Vic Tablian, Don Fellows, William Hootkins, Bill Reimbold, Fred Sorenson, Patrick Durkin","Plot":"Archaeologist and adventurer Indiana Jones is hired by the US government to find the Ark of the Covenant before the Nazis. The year is 1936. An archeology professor named Indiana Jones is venturing in the jungles of South America searching for a golden statue. Unfortunately, he sets off a deadly trap but miraculously escapes. Then, Jones hears from a museum curator named Marcus Brody about a biblical artifact called The Ark of the Covenant, which can hold the key to humanly existence. Jones has to venture to vast places such as Nepal and Egypt to find this artifact. However, he will have to fight his enemy Rene Belloq and a band of Nazis in order to reach it. Written by John Wiggins","Genre":"Action, Adventure","Keywords":"nazi, ark of the covenant, archeologist, egypt, archeological dig","imdbRating":"8.5","imdbVotes":"635,724","Awards":"Won 4 Oscars. Another 29 wins & 23 nominations.","Metascore":"90","Released":"12 June 1981 (USA) ","Location":"Yuma, Arizona, USA ","Actors":"Harrison Ford, Karen Allen, Paul Freeman ","Writer":"Lawrence Kasdan (screenplay), George Lucas (story) | 1 more credit »","Running_time":"PT115M / 1h 55min","Description":"Directed by Steven Spielberg.  With Harrison Ford, Karen Allen, Paul Freeman, John Rhys-Davies. Archaeologist and adventurer Indiana Jones is hired by the US government to find the Ark of the Covenant before the Nazis.","Rated":"PG"}