{"imdbID":"tt0061418","Title":"Bonnie and Clyde","Year":"1967","Director":"Arthur Penn","Country":"USA","Language":"English","Budget":"$2,500,000 (estimated)","Gross":"SEK 5,828,000 (Sweden)","Production_Co":"Warner Brothers/Seven Arts, Tatira-Hiller Productions ","Runtime":"111 min","Cast":"Warren Beatty, Faye Dunaway, Michael J. Pollard, Gene Hackman, Estelle Parsons, Denver Pyle, Dub Taylor, Evans Evans, Gene Wilder","Plot":"A somewhat romanticized account of the career of the notoriously violent bank robbing couple and their gang. 1934. Young adults Bonnie Parker, a waitress, and Clyde Barrow, a criminal just released from prison, are immediately attracted to what the other represents for their life when they meet by chance in West Dallas, Texas. Bonnie is fascinated with Clyde's criminal past, and his matter-of-factness and bravado in talking about it. Clyde sees in Bonnie someone sympatico to his goals in life. Although attracted to each other physically, a sexual relationship between the two has a few obstacles to happen. Regardless, they decide to join forces to embark on a life of crime, holding up whatever establishments, primarily banks, to make money and to have fun. They don't plan on hurting anyone physically or killing anyone despite wielding loaded guns. They amass a small gang of willing accomplices, including C.W. Moss, a mechanic to fix whatever cars they steal which is important especially for their getaways, and Buck Barrow, one of Clyde's older brothers. The only reluctant tag-along is Buck's ... Written by Huggo","Genre":"Biography, Crime, Drama","Keywords":"1930s, gang, bank robber, love, modern western","imdbRating":"7.9","imdbVotes":"77,413","Awards":"Won 2 Oscars. Another 19 wins & 26 nominations.","Metascore":"81","Released":"13 August 1967 (USA) ","Location":"Albertson Ranch, Triunfo, California, USA ","Actors":"Warren Beatty, Faye Dunaway, Michael J. Pollard ","Writer":"David Newman, Robert Benton","Running_time":"PT111M / 1h 51min","Description":"Directed by Arthur Penn.  With Warren Beatty, Faye Dunaway, Michael J. Pollard, Gene Hackman. A somewhat romanticized account of the career of the notoriously violent bank robbing couple and their gang.","Rated":"APPROVED"}