{"imdbID":"tt0048728","Title":"To Catch a Thief","Year":"1955","Director":"Alfred Hitchcock","Taglines":"For a moment he forgets he's a thief--and she forgets she's a lady! ","Country":"USA","Language":"English, French","Also_Known_As":"Alfred Hitchcock's To Catch a Thief ","Budget":"$2,500,000 (estimated)","Production_Co":"Paramount Pictures ","Runtime":"106 min","Sound_Mix":"Mono (Western Electric Recording)","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"There is a second reference to Alfred Hitchcock's dislike of eggs. A raw egg is thrown hitting the glass and splattering in the restaurant at the beginning when the kitchen staff believe Cary Grant is responsible for the recent thefts. He is also offered a saucer of milk referring to \"cats\". See more »","Goofs":"When the police first ask Robie to accompany them for questioning, he excuses himself to change into something more formal. He is seen going up to his room wearing white socks. He is later shown at Bertani's restaurant wearing the same shoes but no socks. See more »","Cast":"Cary Grant, Grace Kelly, Jessie Royce Landis, John Williams, Charles Vanel, Brigitte Auber, Jean Martinelli, Georgette Anys","Plot":"When a reformed jewel thief is suspected of returning to his former occupation, he must ferret out the real thief in order to prove his innocence. American expatriate John Robie living in high style on the Riviera is a retired cat burglar. He must find out who a copy cat is to keep a new wave of jewel thefts from being pinned on him. High on the list of prime victims is Jessie Stevens, in Europe to help daughter Frances find a suitable husband. The Lloyds of London insurance agent is using a thief to catch a thief. Take an especially close look at scene where Robie gets Jessie's attention, dropping an expensive casino chip down the décolletage of a French roulette player. Written by Dale O'Connor <daleoc@interaccess.com>","Genre":"Mystery, Romance, Thriller","Keywords":"thief, reckless driving, based on novel, burglar, cat","imdbRating":"7.5","imdbVotes":"44,273","Awards":"Won 1 Oscar. Another 5 nominations.","Metascore":"","Released":"1955 (UK) ","Location":"Tourrettes-sur-Loup, Alpes-Maritimes, France ","Actors":"Cary Grant, Grace Kelly, Jessie Royce Landis ","Writer":"John Michael Hayes (screenplay), David Dodge (based on the novel by)","Running_time":"PT106M / 1h 46min","Description":"Directed by Alfred Hitchcock.  With Cary Grant, Grace Kelly, Jessie Royce Landis, John Williams. When a reformed jewel thief is suspected of returning to his former occupation, he must ferret out the real thief in order to prove his innocence.","Rated":"PG"}