{"imdbID":"tt0084591","Title":"Reuben, Reuben","Year":"1983","Director":"Robert Ellis Miller","Country":"USA","Language":"English","Production_Co":"Saltair Productions, TAFT Entertainment Pictures ","Runtime":"101 min","Cast":"Tom Conti, Kelly McGillis, Roberts Blossom, Joel Fabiani, Cynthia Harris, Lois Smith, E. Katherine Kerr, Rex Robbins, Kara Wilson, Jack Davidson, Damon Douglas, Robert Nichols, Ed Grady, Thomas McGowan, Dan Doby","Plot":"A drunken Scottish poet, who has not written a word in years, feels compelled to regain control of his life and work after meeting a beautiful young woman. Gowan McGland is a half-Irish/half-Welsh Scottish poet with some renown. He is also a total s*** - a boozer, a womanizer (his conquests more frequently married than not), lazy, and a leech, with a deteriorating body and bad teeth, losing which he equates with death. He also has his charms, which, in combination with his renown, leads to him usually being able to get what he wants. His wife, Edith McGland, also a writer, is well aware of who he is, their marriage which is in name only, although they are still good friends. It is because of her profession and her connection that she has been commissioned to write his biography. Because he is lazy, he has not written anything in five years. He is on a speaking tour to earn what little money he has, currently on an extended stop in Woodsmoke, Connecticut. His reputation in almost every sense precedes him in Woodsmoke - including his womanizing where probably only the husbands of his conquests are unaware of what's going on, and his ... Written by Huggo","Genre":"Comedy, Drama, Romance","Keywords":"poet, repetition in title, poetry reading, older man younger woman relationship, love","imdbRating":"6.9","imdbVotes":"745","Awards":"Nominated for 2 Oscars. Another 2 wins & 6 nominations.","Metascore":"","Released":"21 June 1984 (Australia) ","Location":"Shelby, North Carolina, USA","Actors":"Tom Conti, Kelly McGillis, Roberts Blossom ","Writer":"Peter De Vries (novel), Herman Shumlin (play) | 1 more credit »","Running_time":"PT101M / 1h 41min","Description":"Directed by Robert Ellis Miller.  With Tom Conti, Kelly McGillis, Roberts Blossom, Joel Fabiani. A drunken Scottish poet, who has not written a word in years, feels compelled to regain control of his life and work after meeting a beautiful young woman.","Rated":"R"}