{"imdbID":"tt0077975","Title":"Animal House","Year":"1978","Director":"John Landis","Taglines":"We got to do something...You know what we are gonna do ? Toga party ! ","Certificate":"R | See all certifications »","Country":"USA","Language":"English, Italian","Also_Known_As":"National Lampoon's Animal House ","Budget":"$3,000,000 (estimated)","Gross":"$141,600,000 (USA)","Production_Co":"Universal Pictures, Oregon Film Factory, Stage III Productions ","Runtime":"109 min","Sound_Mix":"Mono (Todd-AO)","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"To prepare for their roles - and despite being warned against mixing with the students - the cast of the Deltas (except John Belushi, who was in New York working on Saturday Night Live (1975)) accepted an invitation from some girls to a real frat party at the University of Oregon's SAE house. The real fraternity members treated them with hostility and a brawl ensued, started by James Widdoes when he threw a cup of beer at some drunk football players. Widdoes ended up losing a few teeth and Bruce McGill received a black eye. When Belushi returned to the set and learned of the fight, he had to be physically restrained from seeking revenge. See more »","Goofs":"The movie takes place in 1962, but Astroturf was not invented until 1965. See more »","Crazy_Credits":"Four of the listings in the cast are \"mean dude,\" \"meaner dude,\" \"meanest dude,\" and \"gigantic dude\". See more »","Cast":"Tom Hulce, Stephen Furst, Mark Metcalf, Mary Louise Weller, Martha Smith, James Daughton, Kevin Bacon, John Belushi, Douglas Kenney, Chris Miller, Bruce Bonnheim, Karen Allen, James Widdoes, Tim Matheson, Peter Riegert","Plot":"At a 1962 college, Dean Vernon Wormer is determined to expel the entire Delta Tau Chi Fraternity, but those trouble-makers have other plans for him. Faber College has one frat house so disreputable it will take anyone. It has a second one full of white, anglo-saxon, rich young men who are so sanctimonious no one can stand them except Dean Wormer. The dean enlists the help of the second frat to get the boys of Delta House off campus. The dean's plan comes into play just before the homecoming parade to end all parades for all time. Written by John Vogel <jlvogel@comcast.net>","Genre":"Comedy","Keywords":"camera shot of feet, stockinged feet in face, college, parade, homecoming parade","imdbRating":"7.6","imdbVotes":"87,934","Awards":"2 wins & 1 nomination.","Metascore":"82","Released":"28 July 1978 (USA) ","Location":"729 East 11th Street, Eugene, Oregon, USA ","Actors":"John Belushi, Karen Allen, Tom Hulce ","Writer":"Harold Ramis, Douglas Kenney | 1 more credit »","Running_time":"PT109M / 1h 49min","Description":"Directed by John Landis.  With John Belushi, Karen Allen, Tom Hulce, Stephen Furst. At a 1962 college, Dean Vernon Wormer is determined to expel the entire Delta Tau Chi Fraternity, but those trouble-makers have other plans for him.","Rated":"R"}