{"imdbID":"tt0024865","Title":"The Barretts of Wimpole Street","Year":"1934","Director":"Sidney Franklin","Country":"USA","Language":"English","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"109 min (Turner library print)","Cast":"Norma Shearer, Fredric March, Charles Laughton, Maureen O'Sullivan, Katharine Alexander, Ralph Forbes, Marion Clayton Anderson, Ian Wolfe, Ferdinand Munier, Una O'Connor, Leo G. Carroll, Vernon Downing, Neville Clark, Matthew Smith, Robert Carleton","Plot":"Elizabeth Barrett's tyrannical father has forbidden any of his family to marry. Nevertheless, Elizabeth falls in love with the poet Robert Browning. In 1845 London, the Barrett family is ruled with an iron fist by its stern widowed patriarch, Edward Moulton-Barrett. His nine grown children are afraid of him more than they love him. One of his rules is that none of his children are allowed to marry, which does not sit well with youngest daughter Henrietta as she loves and wants to marry Captain Surtees Cook. Of the nine, the one exception is his daughter Elizabeth, who abides faithfully to her father's wishes. Elizabeth does not think too much about the non-marriage rule as she has an unknown chronic illness which has kept her bedridden. She feels her life will not be a long one. With her time, she writes poetry, which she shares by correspondence with another young poet, Robert Browning. Elizabeth's outlook on her life changes when she meets Mr. Browning for the first time, he who has fallen in love with her without even having met her. She, in return, falls in love with him after their meeting. With Mr. Browning's love and ... Written by Huggo","Genre":"Biography, Drama, Romance","Keywords":"poet, captain, poetry, reference to buckingham palace, ends with a kiss","imdbRating":"7.1","imdbVotes":"1,075","Awards":"Nominated for 2 Oscars. Another 1 win.","Metascore":"","Released":"21 September 1934 (USA) ","Location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA","Actors":"Norma Shearer, Fredric March, Charles Laughton ","Writer":"Rudolph Besier (from the play by) (as Rudolf Besier), Ernest Vajda (screen play) | 2 more credits »","Running_time":"PT109M / 1h 49min","Description":"Directed by Sidney Franklin.  With Norma Shearer, Fredric March, Charles Laughton, Maureen O'Sullivan. Elizabeth Barrett's tyrannical father has forbidden any of his family to marry. Nevertheless, Elizabeth falls in love with the poet Robert Browning.","Rated":"PASSED"}