{"imdbID":"tt0036342","Title":"Shadow of a Doubt","Year":"1943","Director":"Alfred Hitchcock","Taglines":"A Blast of DRAMATIC Dynamite exploded right before your eyes!","Certificate":"Approved | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Shadow of Doubt ","Production_Co":"Skirball Productions, Universal Pictures ","Runtime":"108 min","Sound_Mix":"Mono (Western Electric Recording)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Alfred Hitchcock: [bathroom] \"BM\" is engraved on a ring. See more »","Goofs":"When Charlotte and Charlie cross the street to go to the bank, the street corner is empty. In the next shot, there are many people on the same corner. See more »","Cast":"Teresa Wright, Joseph Cotten, Macdonald Carey, Henry Travers, Patricia Collinge, Hume Cronyn, Wallace Ford, Edna May Wonacott, Charles Bates, Irving Bacon, Clarence Muse, Janet Shaw, Estelle Jewell","Plot":"A young woman discovers her visiting \"Uncle Charlie\" may not be the man he seems to be. Charlotte 'Charlie' Newton is bored with her quiet life at home with her parents and her younger sister. She wishes something exciting would happen and knows exactly what they need: a visit from her sophisticated and much traveled uncle Charlie Oakley, her mother's younger brother. Imagine her delight when, out of the blue, they receive a telegram from uncle Charlie announcing that he is coming to visit them for awhile. Charlie Oakley creates quite a stir and charms the ladies club as well as the bank president where his brother-in-law works. Young Charlie begins to notice some odd behavior on his part, such as cutting out a story in the local paper about a man who marries and then murders rich widows. When two strangers appear asking questions about him, she begins to imagine the worst about her dearly beloved uncle Charlie. Written by garykmcd","Genre":"Thriller","Keywords":"murderer, widow, suspect, california, telegram","imdbRating":"8.0","imdbVotes":"44,078","Awards":"Nominated for 1 Oscar. Another 1 win & 2 nominations.","Metascore":"","Released":"15 January 1943 (USA) ","Location":"904 McDonald Avenue, Santa Rosa, California, USA ","Actors":"Teresa Wright, Joseph Cotten, Macdonald Carey ","Writer":"Thornton Wilder (screenplay), Sally Benson (screenplay) | 2 more credits »","Running_time":"PT108M / 1h 48min","Description":"Directed by Alfred Hitchcock.  With Teresa Wright, Joseph Cotten, Macdonald Carey, Henry Travers. A young woman discovers her visiting \"Uncle Charlie\" may not be the man he seems to be.","Rated":"APPROVED"}