{"imdbID":"tt0088680","Title":"After Hours","Year":"1985","Director":"Martin Scorsese","Writer":"Joseph Minion","Taglines":"What is the very worst night you ever had...? [UK Video] ","Certificate":"R | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"A Night in SoHo ","Budget":"$4,500,000 (estimated)","Gross":"$10,600,000 (USA)","Production_Co":"Geffen Company, The, Double Play ","Runtime":"97 min","Sound_Mix":"Mono","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The conversation between Paul and the bouncer at Club Berlin is mostly from Franz Kafka's \"Before The Law.\" See more »","Goofs":"When confronted by Tom's neighbors, Paul says he's a friend of Tom's, but during their initial meeting in the bar, Paul and Tom do not exchange names. See more »","Crazy_Credits":"The closing credits are displayed over a moving shot of Paul's office, during which more and more employees show up for work. When the camera passes Paul's desk again, he has disappeared. See more »","Cast":"Griffin Dunne, Rosanna Arquette, Verna Bloom, Tommy Chong, Linda Fiorentino, Teri Garr, John Heard, Cheech Marin, Catherine O'Hara, Dick Miller, Will Patton, Robert Plunket, Bronson Pinchot, Rocco Sisto, Larry Block","Plot":"An ordinary word processor has the worst night of his life after he agrees to visit a girl in Soho whom he met that evening at a coffee shop. A meek word processor impulsively travels to Manhattan's Soho District to date an attractive but apparently disturbed young woman and finds himself trapped there in a nightmarishly surreal vortex of improbable coincidences and farcical circumstances. Written by duke1029","Genre":"Comedy, Crime, Drama","Keywords":"mohawk haircut, black comedy, mistaken identity, burglar, diner","imdbRating":"7.7","imdbVotes":"38,057","Awards":"Nominated for 1 Golden Globe. Another 3 wins & 8 nominations.","Metascore":"90","Released":"11 October 1985 (USA) ","Location":"128 Spring Street, Soho, Manhattan, New York City, New York, USA ","Actors":"Griffin Dunne, Rosanna Arquette, Verna Bloom ","Running_time":"PT97M / 1h 37min","Description":"Directed by Martin Scorsese.  With Griffin Dunne, Rosanna Arquette, Verna Bloom, Tommy Chong. An ordinary word processor has the worst night of his life after he agrees to visit a girl in Soho whom he met that evening at a coffee shop.","Rated":"R"}