{"imdbID":"tt0055798","Title":"Birdman of Alcatraz","Year":"1962","Country":"USA","Language":"English","Budget":"$2,650,000 (estimated)","Production_Co":"Norma Productions ","Runtime":"147 min","Cast":"Burt Lancaster, Karl Malden, Thelma Ritter, Neville Brand, Betty Field, Telly Savalas, Edmond O'Brien, Hugh Marlowe, Whit Bissell, Crahan Denton, James Westerfield","Plot":"A surly convicted murderer held in permanent isolation redeems himself when he becomes a renowned bird expert. In 1912, the notorious and violent prisoner Robert Franklin Stroud is transferred to the Leavenworth Prison convicted for murdering a man. When a guard cancels the visit of his mother, Elizabeth Stroud, due to a violation of the internal rules, he stabs and kills the guard and goes to trial three times. He is sentenced to be executed by the gallows, but his mother appeals to President Woodrow Wilson who commutes his sentence to life imprisonment. However, the warden, Harvey Shoemaker, decides to keep Stroud in solitary for the rest of his life. One day, Stroud finds a sparrow that has fallen from the nest in the yard and he raises the bird until it is strong enough to fly. Stroud finds a motivation for his life raising and caring for birds and becomes an expert in birds. He marries Stella Johnson and together they run a business, providing medicine developed by Stroud. But a few years after, Stroud is transferred to Alcatraz and has to leave his birds behind. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Biography, Drama","Keywords":"bird, prison, alcatraz, solitary confinement, warden","imdbRating":"7.8","imdbVotes":"11,846","Awards":"Nominated for 4 Oscars. Another 4 wins & 8 nominations.","Metascore":"","Released":"3 July 1962 (USA) ","Location":"Alcatraz Island, San Francisco Bay, California, USA ","Actors":"Burt Lancaster, Karl Malden, Thelma Ritter ","Director":"John Frankenheimer, Charles Crichton (uncredited)","Writer":"Guy Trosper (screenplay), Thomas E. Gaddis (book)","Running_time":"PT147M / 2h 27min","Description":"Directed by John Frankenheimer, Charles Crichton.  With Burt Lancaster, Karl Malden, Thelma Ritter, Neville Brand. A surly convicted murderer held in permanent isolation redeems himself when he becomes a renowned bird expert.","Rated":"N/A"}