{"imdbID":"tt0045296","Title":"Viva Zapata!","Year":"1952","Director":"Elia Kazan","Writer":"John Steinbeck","Country":"USA","Language":"English, Spanish","Production_Co":"Twentieth Century Fox Film Corporation ","Runtime":"113 min","Cast":"Marlon Brando, Jean Peters, Anthony Quinn, Joseph Wiseman, Arnold Moss, Alan Reed, Margo, Harold Gordon, Lou Gilbert, Frank Silvera, Florenz Ames, Richard Garrick, Fay Roope, Mildred Dunnock","Plot":"The story of Mexican revolutionary Emiliano Zapata, who led a rebellion against the corrupt, oppressive dictatorship of president Porfirio Diaz in the early 20th century. In 1909, Emiliano Zapata, a well-born but penniless Mexican Mestizo from the southern state of Morelos, comes to Mexico City to complain that their arable land has been enclosed, leaving them only in the barren hills. His expressed dissatisfaction with the response of the President Diaz puts him in danger, and when he rashly rescues a prisoner from the local militia he becomes an outlaw. Urged on by a strolling intellectual, Fernando, he supports the exiled Don Francisco Madero against Diaz, and becomes the leader of his forces in the South as Francisco 'Pancho' Villa is in the North. Diaz flees, and Madero takes his place; but he is a puppet president, in the hands of the leader of the army, Huerta, who has him assassinated when he tries to express solidarity for the men who fought for him. Zapata and Villa return to arms, and, successful in victory, seek to find a leader for the country. Unwillingly, Zapata takes the job, but, a while later, he responds to some petitioners from his ... Written by alfiehitchie","Genre":"Biography, Drama, History","Keywords":"mexican, outlaw, army, mexico, alternate history","imdbRating":"7.5","imdbVotes":"7,147","Awards":"Won 1 Oscar. Another 2 wins & 9 nominations.","Metascore":"","Released":"22 August 1952 (West Germany) ","Location":"Denver & Rio Grande Western Railroad, Durango, Colorado, USA ","Actors":"Marlon Brando, Jean Peters, Anthony Quinn ","Running_time":"PT113M / 1h 53min","Description":"Directed by Elia Kazan.  With Marlon Brando, Jean Peters, Anthony Quinn, Joseph Wiseman. The story of Mexican revolutionary Emiliano Zapata, who led a rebellion against the corrupt, oppressive dictatorship of president Porfirio Diaz in the early 20th century.","Rated":"N/A"}