{"imdbID":"tt0082010","Title":"An American Werewolf in London","Year":"1981","Director":"John Landis","Writer":"John Landis","Taglines":"John Landis - the director of Animal House brings you a different kind of animal. ","Certificate":"R | See all certifications »","Country":"UK, USA","Language":"English","Also_Known_As":"Un hombre lobo americano en Londres ","Budget":"$10,000,000 (estimated)","Gross":"SEK 3,103,703 (Sweden)","Production_Co":"PolyGram Filmed Entertainment, Lyncanthrope Films ","Runtime":"97 min | 92 min (heavily cut)","Sound_Mix":"DTS (re-release)| Mono","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"John Landis: appears briefly near the end of the film. He is the bearded man who gets hit by a car and thrown through the plate glass window in Piccadilly Circus. See more »","Goofs":"At the beginning sequence, after he left the car with the sheep, David has dirt on his jacket. At the next scene, only a few seconds later, the dirt has gone. See more »","Crazy_Credits":"Lyncanthrope Films Limited wishes to extend its heartfelt congratulations to Lady Diana Spencer and His Royal Highness The Prince of Wales on the occasion of their marriage - July 29th 1981. See more »","Cast":"Joe Belcher, David Naughton, Griffin Dunne, David Schofield, Brian Glover, Lila Kaye, Rik Mayall, Sean Baker, Paddy Ryan, Jenny Agutter, Anne-Marie Davies, John Woodvine, Frank Oz, Don McKillop, Paul Kember","Plot":"Two American college students on a walking tour of Britain are attacked by a werewolf that none of the locals will admit exists. Two American college students are on a walking tour of Britain and are attacked by a werewolf. One is killed, the other is mauled. The werewolf is killed but reverts to its human form, and the local townspeople are unwilling to acknowledge its existence. The surviving student begins to have nightmares of hunting on four feet at first but then finds that his friend and other recent victims appear to him, demanding that he commit suicide to release them from their curse, being trapped between worlds because of their unnatural deaths. Written by John Vogel <jlvogel@comcast.net>","Genre":"Comedy, Fantasy, Horror","Keywords":"werewolf, american, death, nightmare, curse","imdbRating":"7.6","imdbVotes":"61,835","Awards":"Won 1 Oscar. Another 2 wins & 3 nominations.","Metascore":"60","Released":"21 August 1981 (USA) ","Location":"Burnham Beeches, Buckinghamshire, England, UK ","Actors":"David Naughton, Jenny Agutter, Joe Belcher ","Running_time":"PT97M / 1h 37min","Description":"Directed by John Landis.  With David Naughton, Jenny Agutter, Joe Belcher, Griffin Dunne. Two American college students on a walking tour of Britain are attacked by a werewolf that none of the locals will admit exists.","Rated":"R"}