{"imdbID":"tt0058557","Title":"Seance on a Wet Afternoon","Year":"1964","Director":"Bryan Forbes","Country":"UK","Language":"English","Budget":"£143,000 (estimated)","Production_Co":"Beaver Films, Allied Film Makers (AFM) ","Cast":"Kim Stanley, Margaret Lacey, Marie Burke, Maria Kazan, Lionel Gamlin, Marian Spencer, Richard Attenborough, Godfrey James, Judith Donner, Ronald Hines, Hajni Biro, Mark Eden, Nanette Newman, Diana Lambert, Frank Singuineau","Plot":"A psychic convinces her weak-willed husband to kidnap the child of a wealthy couple, so she can use her abilities to locate the child and thus achieve fame. Myra and Billy Savage are a married couple living in London. Myra works as a medium, she who holds weekly meetings - séances - for a regular group of customers, while Billy supports her in these ventures as he does not otherwise work due to his asthma. \"Arthur\" is her spirit guide, he who was their stillborn son. Myra is the dominant in the couple, Billy the weak minded follower. Myra, with Billy's support, devises a scheme to raise her public prominence as a medium: kidnap Amanda Clayton, the adolescent daughter of a wealthy couple, and using her psychic powers provide information to the Claytons and the police of Amanda and the requested ransom money's whereabouts. Myra and Billy view this scheme as a victimless crime, if a crime at all, as they don't plan on harming Amanda and they are returning the requested ransom. To carry out the scheme successfully, they will have to: kidnap Amanda; convince Amanda that her temporary captivity is not out of the ordinary, while having her not ... Written by Huggo","Genre":"Crime, Drama","Keywords":"ransom, medium, kidnapping, grande dame guignol, stillborn child","imdbRating":"8.0","imdbVotes":"4,398","Awards":"Nominated for 1 Oscar. Another 7 wins & 4 nominations.","Metascore":"","Released":"5 November 1964 (USA) ","Location":"41 Marryat Road, Wimbledon, London, England, UK ","Actors":"Kim Stanley, Richard Attenborough, Margaret Lacey ","Writer":"Mark McShane (novel), Bryan Forbes (written for the screen by)","Running_time":"PT115M / 1h 55min","Description":"Directed by Bryan Forbes.  With Kim Stanley, Richard Attenborough, Margaret Lacey, Marie Burke. A psychic convinces her weak-willed husband to kidnap the child of a wealthy couple, so she can use her abilities to locate the child and thus achieve fame.","Rated":"N/A"}