{"imdbID":"tt0056264","Title":"Mutiny on the Bounty","Year":"1962","Country":"USA","Language":"English, Polynesian, French","Budget":"$19,000,000 (estimated)","Production_Co":"Metro-Goldwyn-Mayer (MGM), Arcola Pictures ","Runtime":"178 min","Cast":"Marlon Brando, Trevor Howard, Richard Harris, Hugh Griffith, Richard Haydn, Tarita, Percy Herbert, Duncan Lamont, Gordon Jackson, Chips Rafferty, Noel Purcell, Ashley Cowan, Eddie Byrne, Frank Silvera, Tim Seely","Plot":"The Bounty leaves Portsmouth in 1787. Its destination: to sail to Tahiti and load bread-fruit. Captain Bligh will do anything to get there as fast as possible, using any means to keep up a ... See full summary » The Bounty leaves Portsmouth in 1787. Its destination: to sail to Tahiti and load bread-fruit. Captain Bligh will do anything to get there as fast as possible, using any means to keep up a strict discipline. When they arrive at Tahiti, it is like a paradise for the crew, something completely different than the living hell aboard the ship. On the way back to England, officer Fletcher Christian becomes the leader of a mutiny. Written by Mattias Thuresson","Genre":"Adventure, Drama, History","Keywords":"discipline, ship's crew, british seaman, corporal punishment, sailing ship","imdbRating":"7.2","imdbVotes":"11,263","Awards":"Nominated for 7 Oscars. Another 3 wins & 6 nominations.","Metascore":"","Released":"8 November 1962 (USA) ","Location":"Bora Bora, Leeward Islands, French Polynesia ","Actors":"Marlon Brando, Trevor Howard, Richard Harris ","Director":"Lewis Milestone, Carol Reed (uncredited)","Writer":"Charles Lederer (screenplay), Charles Nordhoff (novel) | 1 more credit »","Running_time":"PT178M / 2h 58min","Description":"Directed by Lewis Milestone, Carol Reed.  With Marlon Brando, Trevor Howard, Richard Harris, Hugh Griffith. The Bounty leaves Portsmouth in 1787. Its destination: to sail to Tahiti and load bread-fruit. Captain Bligh will do anything to get there as fast as possible, using any means to keep up a strict discipline. When they arrive at Tahiti, it is like a paradise for the crew, something completely different than the living hell aboard the ship. On the way back to England, officer Fletcher Christian ...","Rated":"UNRATED"}