{"imdbID":"tt0095631","Title":"Midnight Run","Year":"1988","Director":"Martin Brest","Writer":"George Gallo","Taglines":"Monday... Escape with their lives from New York... Tuesday... Impersonate F.B.I. agents in Chicago... Wednesday... Steal plane in New Mexico... Thursday... Almost kill each other by accident... Friday... Almost kill each other on purpose... ","Certificate":"R | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Fuga a la medianoche ","Budget":"$30,000,000 (estimated)","Gross":"$38,413,606 (USA)","Production_Co":"Universal Pictures, City Light Films ","Runtime":"126 min","Sound_Mix":"Dolby","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"In the latter part of the film, there is a shot of Jimmy Serrano and his associates walking from a taxi into a casino in Las Vegas. The Dunes Hotel's sign is clearly visible against the sky in the background, and its hotel tower can be seen at the left edge of the screen. This indicates that the camera was pointed toward Las Vegas Boulevard from the Dunes property. The Dunes closed in 1993 and Bellagio was built on its former grounds. See more »","Goofs":"Mardukas has three shadows when rescuing Jack from the river. See more »","Cast":"Robert De Niro, Charles Grodin, Yaphet Kotto, John Ashton, Dennis Farina, Joe Pantoliano, Richard Foronjy, Robert Miranda, Jack Kehoe, Wendy Phillips, Danielle DuClos, Philip Baker Hall, Tom McCleister, Mary Gillis, John Toles-Bey","Plot":"An accountant is chased by bounty hunters, the FBI, and the Mafia after jumping bail. Bounty hunter Jack Walsh (Robert De Niro) is sent to find and return bail jumper and former Mafia accountant, Jonathan \"The Duke\" Mardukas (Charles Grodin). The FBI have had no success in locating The Duke, so when Jack finds him in next to no time, they are a little embarrassed. In order to collect his $100,000 fee, Jack must take The Duke from New York to Los Angeles. However, the Mafia and the FBI have other ideas, as does Marvin Dorfler (John Ashton), a rival bounty hunter. On their long cross-country trip to LA, the two get to know each other and they build up a strange friendship. Written by Rob Hartill","Genre":"Action, Comedy, Crime","Keywords":"bounty hunter, fbi, accountant, mafia, mob","imdbRating":"7.6","imdbVotes":"52,628","Awards":"Nominated for 2 Golden Globes. Another 2 wins & 1 nomination.","Metascore":"78","Released":"20 July 1988 (USA) ","Location":"Miami, Arizona, USA ","Actors":"Robert De Niro, Charles Grodin, Yaphet Kotto ","Running_time":"PT126M / 2h 6min","Description":"Directed by Martin Brest.  With Robert De Niro, Charles Grodin, Yaphet Kotto, John Ashton. An accountant is chased by bounty hunters, the FBI, and the Mafia after jumping bail.","Rated":"R"}