{"imdbID":"tt0079470","Title":"Life of Brian","Year":"1979","Director":"Terry Jones","Taglines":"A motion picture destined to offend nearly two thirds of the civilized world. And severely annoy the other third. ","Certificate":"R | See all certifications »","Country":"UK","Language":"English, Latin","Also_Known_As":"Monty Python's Life of Brian ","Budget":"$4,000,000 (estimated)","Opening_Weekend":"$26,376 (USA) (30 April 2004)","Gross":"$646,124 (USA) (22 October 2004)","Production_Co":"HandMade Films, Python (Monty) Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"94 min","Sound_Mix":"Dolby","Color":"Color (Eastmancolor)","Aspect_Ratio":"1.85 : 1","Trivia":"In the interview section of Monty Python's Flying Circus: Live at Aspen (1998), John Cleese said that because of the massive protests against the movie from all denominations of Christianity, he would joke with Michael Palin, \"We've brought them all together for the first time in 2000 years!\" See more »","Goofs":"When the Suicide Squad arrives during the crucifixion scene, Otto's first line is clearly dubbed. An earlier scene featuring the Suicide Squad was cut, so Michael Palin needed a different line to introduce them. See more »","Crazy_Credits":"At the end of Idle's song \"Bright Side Of Life\" we can hear him saying \"It's the end of the film. Incidently this record's available in the foyer. Some of us have got to live as well you know. Who do you think pays for all this rubbish? They'll never make their money back, you know. I told him, I said to him, Bernie, I said, they'll never make their money back... That should give you enough.\" See more »","Cast":"Graham Chapman, John Cleese, Terry Gilliam, Eric Idle, Terry Jones, Michael Palin, Terence Bayler, Carol Cleveland, Kenneth Colley, Neil Innes, Charles McKeown, John Young, Gwen Taylor, Sue Jones-Davies, Peter Brett","Plot":"Brian is born on the original Christmas, in the stable next door. He spends his life being mistaken for a messiah. The story of Brian of Nazareth, born on the same day as Jesus of Nazareth, who takes a different path in life that leads to the same conclusion. Brian joins a political resistance movement aiming to get the Romans out of Judea. Brian scores a victory of sorts when he manages to paint political slogans on an entire wall in the city of Jerusalem. The movement is not very effective but somehow Brian becomes a prophet and gathers his own following. His fate is sealed however and he lives a very short life. Written by garykmcd","Genre":"Comedy","Keywords":"judea, jerusalem, satire, ancient rome, british comedy","imdbRating":"8.1","imdbVotes":"262,206","Awards":"","Metascore":"75","Released":"17 August 1979 (USA) ","Location":"Amphitheater, Carthage, Tunis, Tunisia ","Actors":"Graham Chapman, John Cleese, Michael Palin ","Writer":"Graham Chapman, John Cleese | 4 more credits »","Running_time":"PT94M / 1h 34min","Description":"Directed by Terry Jones.  With Graham Chapman, John Cleese, Michael Palin, Terry Gilliam. Brian is born on the original Christmas, in the stable next door. He spends his life being mistaken for a messiah.","Rated":"R"}