{"imdbID":"tt0075860","Title":"Close Encounters of the Third Kind","Year":"1977","Director":"Steven Spielberg","Writer":"Steven Spielberg","Country":"USA","Language":"English, French, Spanish, Hindi","Budget":"$19,400,870 (estimated)","Gross":"$128,300,000 (USA)","Production_Co":"Columbia Pictures Corporation, EMI Films, Julia Phillips and Michael Phillips Productions ","Runtime":"132 min (special edition) | 137 min (director's cut) | 135 min (original)","Cast":"Richard Dreyfuss, François Truffaut, Teri Garr, Melinda Dillon, Bob Balaban, J. Patrick McNamara, Warren J. Kemmerling, Roberts Blossom, Philip Dodds, Cary Guffey, Shawn Bishop, Adrienne Campbell, Justin Dreyfuss, Lance Henriksen, Merrill Connally","Plot":"After an encounter with U.F.O.s, a line worker feels undeniably drawn to an isolated area in the wilderness where something spectacular is about to happen. Two parallel stories are told. In the first, a group of research scientists from a variety of backgrounds are investigating the strange appearance of items in remote locations, primarily desert regions. In continuing their investigation, one of the lead scientists, a Frenchman named Claude Lacombe, incorporates the Kodály method of music education as a means of communication in their work. The response, in turn, at first baffles the researchers, until American cartographer David Laughlin deciphers the meaning of the response. In the second, electric company lineman and family man Roy Neary and single mother Jillian Guiler are among some individuals in Muncie, Indiana who experience some paranormal activity before some flashes of bright lights in the sky, which they believe to be a UFO. Roy becomes obsessed with what he saw, unlike some others, especially in some form of authority, who refuse to acknowledge their belief that it was a UFO in not wanting to appear crazy. That obsession ... Written by Huggo","Genre":"Drama, Sci-Fi","Keywords":"vision, ufo, close encounter of the third kind, mothership, alien","imdbRating":"7.7","imdbVotes":"134,699","Awards":"Won 1 Oscar. Another 13 wins & 37 nominations.","Metascore":"91","Released":"25 December 1977 (USA) ","Location":"Mobile Civic Center, Civic Center Drive, Mobile, Alabama, USA ","Actors":"Richard Dreyfuss, François Truffaut, Teri Garr ","Running_time":"PT137M / 2h 17min","Description":"Directed by Steven Spielberg.  With Richard Dreyfuss, François Truffaut, Teri Garr, Melinda Dillon. After an encounter with U.F.O.s, a line worker feels undeniably drawn to an isolated area in the wilderness where something spectacular is about to happen.","Rated":"PG"}