{"imdbID":"tt0036613","Title":"Arsenic and Old Lace","Year":"1944","Director":"Frank Capra","Taglines":"Strike. You're out! ","Certificate":"Not Rated | See all certifications »","Country":"USA","Language":"English, German","Also_Known_As":"Frank Capra's 'Arsenic and Old Lace' ","Budget":"$1,120,175 (estimated)","Production_Co":"Warner Bros. ","":"Show detailed company contact information on IMDbPro »","Runtime":"118 min","Sound_Mix":"Mono (RCA Sound System)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"The Broadway comedy opened at the Fulton Theatre on January 10, 1941 and ran for 1,444 performances, closing on June 17, 1944. Repeating their stage roles in the movie were \"Brewster siblings\" Josephine Hull, Jean Adair and John Alexander, all three getting time off from the New York play. Boris Karloff was denied permission to go by the play's producers, fearing that the absence of their main star would adversely affect the play's attendance. See more »","Goofs":"When Mortimer Brewster pushes the policeman O'Hara out the front door, he firmly shuts the door behind the policeman. However, he immediately goes to leave the house and, when he approaches the door, it is wide open. See more »","Cast":"Cary Grant, Priscilla Lane, Raymond Massey, Jack Carson, Edward Everett Horton, Peter Lorre, James Gleason, Josephine Hull, Jean Adair, John Alexander, Grant Mitchell, Edward McNamara, Garry Owen, John Ridgely, Vaughan Glaser","Plot":"A drama critic learns on his wedding day that his beloved maiden aunts are homicidal maniacs, and that insanity runs in his family. Mortimer Brewster is a newspaperman and author known for his diatribes against marriage. We watch him being married at city hall in the opening scene. Now all that is required is a quick trip home to tell Mortimer's two maiden aunts. While trying to break the news, he finds out his aunts' hobby; killing lonely old men and burying them in the cellar. It gets worse. Written by John Vogel <jlvogel@comcast.net>","Genre":"Comedy, Crime, Thriller","Keywords":"noir, cellar, critic, insanity, dramatic critic","imdbRating":"8.1","imdbVotes":"53,136","Awards":"1 nomination.","Metascore":"","Released":"23 September 1944 (USA) ","Location":"Stage 19, Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA ","Actors":"Cary Grant, Priscilla Lane, Raymond Massey ","Writer":"Julius J. Epstein (screen play), Philip G. Epstein (screen play) | 1 more credit »","Running_time":"PT118M / 1h 58min","Description":"Directed by Frank Capra.  With Cary Grant, Priscilla Lane, Raymond Massey, Jack Carson. A drama critic learns on his wedding day that his beloved maiden aunts are homicidal maniacs, and that insanity runs in his family.","Rated":"NOT RATED"}