{"imdbID":"tt0028739","Title":"Conquest","Year":"1937","Country":"USA","Language":"English","Budget":"$2,732,000 (estimated)","Gross":"$2,141,000 (USA)","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"113 min","Cast":"Greta Garbo, Charles Boyer, Reginald Owen, Alan Marshal, Henry Stephenson, Leif Erickson, Dame May Whitty, Maria Ouspenskaya, C. Henry Gordon, Claude Gillingwater, Vladimir Sokoloff, George Houston, Raymond Butler","Plot":"A Polish countess becomes Napoleon Bonaparte's mistress at the urging of Polish leaders, who feel she could influence him to make Poland independent. After a brief informal meeting two months earlier when they were impressed with each other, Countess Marie Walewska formally meets Napoleon Bonaparte at a ball in Warsaw. When Napoleon notes her husband is three times her age, and as he is taken with her charms, he unsuccessfully tries to seduce her. She ignores his frequent letters and flowers until a few grim Polish leaders led by Senator Malachowski urge her to give into his desires as a personal sacrifice in order to save Poland. She goes to him despite the humiliation of her husband, who leaves for Rome to annul their marriage. They are extremely happy for a while; Napoleon divorces childless Empress Josephine and Marie eventually becomes pregnant. She is about to tell Napoleon about her baby when he tells her he decided to marry Archduchess Marie Louise of Austria. He explains it will be a political marriage to insure his future son could rule securely with Hapsburg blood in him. It will not affect their relationship, he says, ... Written by Arthur Hausner <genart@volcano.net>","Genre":"Drama, History, Romance","Keywords":"marie walewska, napoleon bonaparte, mistress, opening action scene, rape","imdbRating":"6.7","imdbVotes":"960","Awards":"Nominated for 2 Oscars. Another 1 win.","Metascore":"","Released":"22 October 1937 (USA) ","Location":"Calabasas, California, USA ","Actors":"Greta Garbo, Charles Boyer, Reginald Owen ","Director":"Clarence Brown, Gustav Machatý (uncredited)","Writer":"Waclaw Gasiorowski (novel), S.N. Behrman | 3 more credits »","Running_time":"PT113M / 1h 53min","Description":"Directed by Clarence Brown, Gustav Machatý.  With Greta Garbo, Charles Boyer, Reginald Owen, Alan Marshal. A Polish countess becomes Napoleon Bonaparte's mistress at the urging of Polish leaders, who feel she could influence him to make Poland independent.","Rated":"APPROVED"}