{"imdbID":"tt0056687","Title":"What Ever Happened to Baby Jane?","Year":"1962","Director":"Robert Aldrich","Country":"USA","Language":"English","Budget":"$980,000 (estimated)","Production_Co":"Associates & Aldrich Company, The, Seven Arts Pictures, Warner Bros. ","Runtime":"134 min","Cast":"Bette Davis, Joan Crawford, Victor Buono, Wesley Addy, Julie Allred, Anne Barton, Marjorie Bennett, Bert Freed, Anna Lee, Maidie Norman, Dave Willock, William Aldrich, Russ Conway, Maxine Cooper, Robert Cornthwaite","Plot":"A former child star torments her paraplegic sister in their decaying Hollywood mansion. In a tale that almost redefines sibling rivalry, faded actresses Blanche and 'Baby' Jane Hudson live together. Jane was by far the most famous when she performed with their father in vaudeville but as they got older, it was Blanche who became the finer actress, which Jane still resents. Blanche is now confined to a wheelchair - Jane ran her over with the car while drunk, even though she has no memory of it - and Jane is firmly in control. As time goes by, Jane exercises greater and greater control over her sister, intercepting her letters and ensuring that few if anyone from the outside has any contact with her. As Jane slowly loses her mind, she torments her sister going to ever greater extremes. Written by garykmcd","Genre":"Drama, Horror, Thriller","Keywords":"hollywood, child star, actress, vaudeville, sibling rivalry","imdbRating":"8.1","imdbVotes":"30,183","Awards":"Won 1 Oscar. Another 1 win & 11 nominations.","Metascore":"","Released":"31 October 1962 (USA) ","Location":"172 S. McCadden Pl., Hancock Park, Los Angeles, California, USA ","Actors":"Bette Davis, Joan Crawford, Victor Buono ","Writer":"Henry Farrell (from the novel by), Lukas Heller (screenplay)","Running_time":"PT134M / 2h 14min","Description":"Directed by Robert Aldrich.  With Bette Davis, Joan Crawford, Victor Buono, Wesley Addy. A former child star torments her paraplegic sister in their decaying Hollywood mansion.","Rated":"NOT RATED"}