{"imdbID":"tt0056193","Title":"Lolita","Year":"1962","Director":"Stanley Kubrick","Taglines":"How did they ever make a movie of Lolita? ","Certificate":"Not Rated | See all certifications »","Country":"UK, USA","Language":"English, French","Also_Known_As":"Лолита ","Budget":"$2,000,000 (estimated)","Production_Co":"Metro-Goldwyn-Mayer (MGM), Seven Arts Pictures, A.A. Productions Ltd. ","Runtime":"152 min","Sound_Mix":"Mono (RCA Sound Recording)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"In the novel, Lolita is a brunette. In the film, she is a blonde. See more »","Goofs":"A bottle seen standing on the piano bench in Quilty's house is no longer there when Quilty sits to play at the piano. See more »","Crazy_Credits":"The credits are played over footage of Lolita's toenails being painted. See more »","Cast":"James Mason, Shelley Winters, Sue Lyon, Gary Cockrell, Jerry Stovin, Diana Decker, Lois Maxwell, Cec Linder, Bill Greene, Shirley Douglas, Marianne Stone, Marion Mathie, James Dyrenforth, Maxine Holden, John Harrison","Plot":"A middle-aged college professor becomes infatuated with a fourteen-year-old nymphet. Humbert Humbert, a divorced British professor of French literature, travels to small-town America for a teaching position. He allows himself to be swept into a relationship with Charlotte Haze, his widowed and sexually famished landlady, whom he marries in order that he might pursue the woman's 14-year-old flirtatious daughter, Lolita, with whom he has fallen hopelessly in love, but whose affections shall be thwarted by a devious trickster named Clare Quilty. Written by filmfactsman","Genre":"Crime, Drama, Romance","Keywords":"professor, nymphet, lolita, writer, older man young girl relationship","imdbRating":"7.7","imdbVotes":"65,279","Awards":"Nominated for 1 Oscar. Another 2 wins & 7 nominations.","Metascore":"","Released":"12 June 1962 (USA) ","Location":"Albany, New York, USA ","Actors":"James Mason, Shelley Winters, Sue Lyon ","Writer":"Vladimir Nabokov (screenplay), Vladimir Nabokov (novel)","Running_time":"PT152M / 2h 32min","Description":"Directed by Stanley Kubrick.  With James Mason, Shelley Winters, Sue Lyon, Gary Cockrell. A middle-aged college professor becomes infatuated with a fourteen-year-old nymphet.","Rated":"NOT RATED"}