{"imdbID":"tt0025986","Title":"The White Parade","Year":"1934","Director":"Irving Cummings","Country":"USA","Language":"English","Production_Co":"Fox Film Corporation ","Runtime":"80 min","Cast":"Loretta Young, John Boles, Dorothy Wilson, Muriel Kirkland, Astrid Allwyn, Frank Conroy, Jane Darwell, Sara Haden, Joyce Compton, June Gittelson, Polly Ann Young, Noel Francis, Jane Barnes","Plot":"The title represents the hopeful, ambitious students at a hospital training school and is primarily a story of the stern discipline and laborious physical and mental toil they endure in ... See full summary » The title represents the hopeful, ambitious students at a hospital training school and is primarily a story of the stern discipline and laborious physical and mental toil they endure in order to become nurses and join the White Parade. It is told mainly through the character of June Arden who finds romance with Ronald Hall III on the way, with side stories of the other girls who find failure, success, laughs and tears on the way. The forerunner of umpteen dozens of TV series over the past forty years. Written by Les Adams <longhorn1939@suddenlink.net>","Genre":"Drama","Keywords":"nurse, color in title, student nurse, nursing student, nursing school","imdbRating":"7.2","imdbVotes":"33","Awards":"Nominated for 2 Oscars.","Metascore":"","Released":"16 November 1934 (USA) ","Actors":"Loretta Young, John Boles, Dorothy Wilson ","Writer":"Rian James (screenplay), Jesse Lasky Jr. (screenplay) | 3 more credits »","Running_time":"PT80M / 1h 20min","Description":"Directed by Irving Cummings.  With Loretta Young, John Boles, Dorothy Wilson, Muriel Kirkland. The title represents the hopeful, ambitious students at a hospital training school and is primarily a story of the stern discipline and laborious physical and mental toil they endure in order to become nurses and join the White Parade. It is told mainly through the character of June Arden who finds romance with Ronald Hall III on the way, with side stories of the other girls who find failure, ...","Rated":"APPROVED"}