{"imdbID":"tt0049470","Title":"The Man Who Knew Too Much","Year":"1956","Director":"Alfred Hitchcock","Taglines":"A little knowledge can be a deadly thing! ","Certificate":"Approved | See all certifications »","Country":"USA","Language":"English, French, Arabic","Also_Known_As":"Alfred Hitchcock's The Man Who Knew Too Much ","Budget":"$2,500,000 (estimated)","Production_Co":"Paramount Pictures, Filwite Productions ","Runtime":"120 min","Sound_Mix":"Mono (Western Electric Recording)","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"The Albert Hall sequence lasts 12 minutes without a single word of dialogue and consists of 124 shots. See more »","Goofs":"When Doctor McKenna thinks he is being followed, the man behind him starts off walking in the middle of the sidewalk in one shot then changes to being very near the street in the next. See more »","Crazy_Credits":"Opening credits prologue: A single crash of Cymbals and how it rocked the lives of an American family. See more »","Cast":"James Stewart, Doris Day, Brenda de Banzie, Bernard Miles, Ralph Truman, Daniel Gélin, Mogens Wieth, Alan Mowbray, Hillary Brooke, Christopher Olsen, Reggie Nalder, Richard Wattis, Noel Willman, Alix Talton, Yves Brainville","Plot":"A family vacationing in Morocco accidentally stumble on to an assassination plot and the conspirators are determined to prevent them from interfering. While attending a medical conference in Paris, American physician Dr. Ben McKenna, his wife, retired musical theater actress and singer Jo McKenna née Conway, and their adolescent son Hank McKenna decide to take a side trip to among other places Marrekesh, French Morocco. With a knife plunged into his back, Frenchman Louis Bernard, who the family met earlier in their bus ride into Marrakesh and who is now masquerading as an Arab, approaches Ben, cryptically whispering into Ben's ears that there will be an attempted assassination in London of a statesman, this news whispered just before Bernard dies. Ben is reluctant to provide any information of this news to the authorities because concurrently Hank is kidnapped by British couple, Edward and Lucy Drayton, who also befriended the McKennas in Marrakesh and who probably have taken Hank out of the country back to England. Whoever the unknown people the Draytons are working for have threatened to kill Hank if Ben divulges any information ... Written by Huggo","Genre":"Thriller","Keywords":"inter cultural, assassination, morocco, bus, american","imdbRating":"7.5","imdbVotes":"40,715","Awards":"Won 1 Oscar. Another 1 win & 4 nominations.","Metascore":"","Released":"1 June 1956 (USA) ","Location":"Blenheim Gardens, Brixton, London, England, UK ","Actors":"James Stewart, Doris Day, Brenda de Banzie ","Writer":"John Michael Hayes (screenplay), Charles Bennett (based on a story by) | 1 more credit »","Running_time":"PT120M / 2h","Description":"Directed by Alfred Hitchcock.  With James Stewart, Doris Day, Brenda de Banzie, Bernard Miles. A family vacationing in Morocco accidentally stumble on to an assassination plot and the conspirators are determined to prevent them from interfering.","Rated":"APPROVED"}