{"imdbID":"tt0091167","Title":"Hannah and Her Sisters","Year":"1986","Director":"Woody Allen","Writer":"Woody Allen","Country":"USA","Language":"English","Budget":"$6,400,000 (estimated)","Gross":"$40,084,041 (USA)","Production_Co":"Orion Pictures, Jack Rollins & Charles H. Joffe Productions ","Runtime":"103 min","Cast":"Barbara Hershey, Carrie Fisher, Michael Caine, Mia Farrow, Dianne Wiest, Maureen O'Sullivan, Lloyd Nolan, Max von Sydow, Woody Allen, Lewis Black, Julia Louis-Dreyfus, Christian Clemenson, Julie Kavner, J.T. Walsh, John Turturro","Plot":"Between two Thanksgivings two years apart, Hannah's husband falls in love with her sister Lee, while her hypochondriac ex-husband rekindles his relationship with her sister Holly. During a Thanksgiving Day party we make acquaintance with a numerous and problematic family. The leading characters are three sisters: Lee, the woman of Frederick, an old misanthrope painter; Holly, who dreams of becoming a writer, or an actress, or who knows who...; Hannah, famous actress, beautiful, intelligent, good mother, good wife, good sister, in short perfect, the pivot of the family. The balance begins to break up when Hannah's husband, Elliot, falls in love with Lee, who leaves Frederick. Holly goes through a deep crisis and meets Mickey, the former husband of Hannah, a hypochondriac TV producer. The affairs evolve and at the last Thanksgiving ... Written by Maurizio Semolic <semolic@oat.ts.astro.it>","Genre":"Comedy, Drama","Keywords":"thanksgiving, actress, hypochondriac, writer, painter","imdbRating":"8.0","imdbVotes":"50,957","Awards":"Won 3 Oscars. Another 21 wins & 26 nominations.","Metascore":"90","Released":"14 March 1986 (USA) ","Location":"5th Avenue, Manhattan, New York City, New York, USA ","Actors":"Mia Farrow, Dianne Wiest, Michael Caine ","Running_time":"PT103M / 1h 43min","Description":"Directed by Woody Allen.  With Mia Farrow, Dianne Wiest, Michael Caine, Barbara Hershey. Between two Thanksgivings two years apart, Hannah's husband falls in love with her sister Lee, while her hypochondriac ex-husband rekindles his relationship with her sister Holly.","Rated":"PG-13"}