{"imdbID":"tt0045793","Title":"From Here to Eternity","Year":"1953","Director":"Fred Zinnemann","Country":"USA","Language":"English","Budget":"$1,650,000 (estimated)","Production_Co":"Columbia Pictures Corporation ","Runtime":"118 min","Cast":"Burt Lancaster, Montgomery Clift, Deborah Kerr, Donna Reed, Frank Sinatra, Philip Ober, Mickey Shaughnessy, Harry Bellaver, Ernest Borgnine, Jack Warden, John Dennis, Merle Travis, Tim Ryan, Arthur Keegan, Barbara Morrison","Plot":"In 1941 Hawaii, a private is cruelly punished for not boxing on his unit's team, while his captain's wife and second in command are falling in love. It's 1941. Robert E. Lee Prewitt has requested Army transfer and has ended up at Schofield in Hawaii. His new captain, Dana Holmes, has heard of his boxing prowess and is keen to get him to represent the company. However, 'Prew' is adamant that he doesn't box anymore, so Captain Holmes gets his subordinates to make his life a living hell. Meanwhile Sergeant Warden starts seeing the captain's wife, who has a history of seeking external relief from a troubled marriage. Prew's friend Maggio has a few altercations with the sadistic stockade Sergeant 'Fatso' Judson, and Prew begins falling in love with social club employee Lorene. Unbeknownst to anyone, the Japanese bombing of Pearl Harbor looms in the distance. Written by Ed Sutton <esutton@mindspring.com>","Genre":"Drama, Romance, War","Keywords":"captain, boxing, hawaii, love, sergeant","imdbRating":"7.8","imdbVotes":"33,028","Awards":"Won 8 Oscars. Another 14 wins & 7 nominations.","Metascore":"","Released":"15 October 1953 (Australia) ","Location":"Diamond Head, O'ahu, Hawaii, USA ","Actors":"Burt Lancaster, Montgomery Clift, Deborah Kerr ","Writer":"Daniel Taradash (screen play), James Jones (based upon the novel by)","Running_time":"PT118M / 1h 58min","Description":"Directed by Fred Zinnemann.  With Burt Lancaster, Montgomery Clift, Deborah Kerr, Donna Reed. In 1941 Hawaii, a private is cruelly punished for not boxing on his unit's team, while his captain's wife and second in command are falling in love.","Rated":"NOT RATED"}