{"imdbID":"tt0056801","Title":"8½","Year":"1963","Director":"Federico Fellini","Taglines":"More sensational than \"La Dolce Vita\" ","Certificate":"Not Rated | See all certifications »","Country":"Italy, France","Language":"Italian, English, French, German","Also_Known_As":"8½ ","Opening_Weekend":"$11,947 (USA) (9 April 1999)","Gross":"$50,690 (USA) (23 April 1999)","Production_Co":"Cineriz, Francinex ","":"Show detailed company contact information on IMDbPro »","Runtime":"138 min","Sound_Mix":"Mono","Color":"Black and White","Aspect_Ratio":"1.85 : 1","Trivia":"Was chosen by Entertainment Weekly magazine as one of the \"100 New Classics ranking as #74 in the June 20, 2008 issue. The issue ranked the greatest movies of the previous 25 years. See more »","Goofs":"When Guido and Claudia go out for their drive, they stop near some springs. Guido exits the passenger side of the car (off camera); we hear the door open and close. But when Claudia, who was driving, steps out moments later (also off camera), we never hear her door open or close. See more »","Cast":"Marcello Mastroianni, Claudia Cardinale, Anouk Aimée, Sandra Milo, Rossella Falk, Barbara Steele, Madeleine Lebeau, Caterina Boratto, Eddra Gale, Guido Alberti, Mario Conocchia, Bruno Agostini, Cesarino Miceli Picardi, Jean Rougeul, Mario Pisu","Plot":"A harried movie director retreats into his memories and fantasies. Guido is a film director, trying to relax after his last big hit. He can't get a moment's peace, however, with the people who have worked with him in the past constantly looking for more work. He wrestles with his conscience, but is unable to come up with a new idea. While thinking, he starts to recall major happenings in his life, and all the women he has loved and left. An autobiographical film of Fellini, about the trials and tribulations of film making. Written by Colin Tinto <cst@imdb.com>","Genre":"Drama, Fantasy","Keywords":"film director, writer's block, filmmaking, director, mistress","imdbRating":"8.1","imdbVotes":"75,464","Awards":"Won 2 Oscars. Another 16 wins & 8 nominations.","Metascore":"","Released":"25 June 1963 (USA) ","Location":"Cinecittà Studios, Cinecittà, Rome, Lazio, Italy ","Actors":"Marcello Mastroianni, Anouk Aimée, Claudia Cardinale ","Writer":"Federico Fellini (story), Ennio Flaiano (story) | 4 more credits »","Running_time":"PT138M / 2h 18min","Description":"Directed by Federico Fellini.  With Marcello Mastroianni, Anouk Aimée, Claudia Cardinale, Sandra Milo. A harried movie director retreats into his memories and fantasies.","Rated":"NOT RATED"}