{"imdbID":"tt0050613","Title":"Throne of Blood","Year":"1957","Director":"Akira Kurosawa","Certificate":"Unrated | See all certifications »","Country":"Japan","Language":"Japanese","Also_Known_As":"Throne of Blood ","Production_Co":"Toho Company, Kurosawa Production Co. ","Runtime":"110 min","Sound_Mix":"Mono (Western Electric Recording)| Mono (Perspecta Sound encoding)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"The castle set was built on the volcanic slopes of Mt. Fuji. See more »","Goofs":"When the witch runs in the forest she can briefly be seen wearing sneakers. See more »","Cast":"Toshirô Mifune, Isuzu Yamada, Takashi Shimura, Akira Kubo, Hiroshi Tachikawa, Minoru Chiaki, Takamaru Sasaki, Gen Shimizu, Kokuten Kôdô, Kichijirô Ueda, Eiko Miyoshi, Chieko Naniwa, Nakajirô Tomita, Yû Fujiki, Sachio Sakai","Plot":"A war-hardened general, egged on by his ambitious wife, works to fulfill a prophecy that he would become lord of Spider's Web Castle. After securing a major victory on the battlefield, Taketoti Washizu and one of his commanders, Yoshiaki Miki, find themselves lost in the maze-like Spider's Web forest. They come across a spirit-like seer who tells them of their future: both have been promoted because of their victory that day; Washizu will someday be the Great Lord of the Spider's Web castle while Miki's son will someday rule as Great Lord as well. When they arrive at the castle, they learn that the first part of the prophecy is correct. Washizu has no desire to become Great Lord but his ambitious wife urges him to reconsider. When the current Great Lord makes a surprise visit to his garrison outpost, Washizu is again promoted to commander of his vanguard but his wife reminds him of the danger that comes with the position. As pressure mounts, Wahizu takes action leading to its inevitable conclusion. Written by garykmcd","Genre":"Drama","Keywords":"castle, forest, prophecy, battle, traitor","imdbRating":"8.1","imdbVotes":"29,789","Awards":"3 wins & 1 nomination.","Metascore":"","Released":"22 November 1961 (USA) ","Location":"Gotemba, Shizuoka, Japan ","Actors":"Toshirô Mifune, Minoru Chiaki, Isuzu Yamada ","Writer":"Hideo Oguni (screenplay), Shinobu Hashimoto (screenplay) | 2 more credits »","Running_time":"PT110M / 1h 50min","Description":"Directed by Akira Kurosawa.  With Toshirô Mifune, Minoru Chiaki, Isuzu Yamada, Takashi Shimura. A war-hardened general, egged on by his ambitious wife, works to fulfill a prophecy that he would become lord of Spider's Web Castle.","Rated":"UNRATED"}