{"imdbID":"tt0097322","Title":"The Fabulous Baker Boys","Year":"1989","Director":"Steve Kloves","Writer":"Steve Kloves","Country":"USA","Language":"English","Budget":"$13,000,000 (estimated)","Gross":"$16,823,529 (USA)","Production_Co":"Gladden Entertainment, Mirage, Tobis ","Runtime":"114 min","Cast":"Jeff Bridges, Michelle Pfeiffer, Beau Bridges, Ellie Raab, Xander Berkeley, Dakin Matthews, Ken Lerner, Albert Hall, Terri Treas, Gregory Itzin, Bradford English, David Coburn, Todd Jeffries, Gregory James, Nancy Fish","Plot":"Frank and Jack Baker are professional musicians who play small clubs. They play schmaltzy music and have never needed a day job. Times are changing and dates are becoming more difficult to ... See full summary » Frank and Jack Baker are professional musicians who play small clubs. They play schmaltzy music and have never needed a day job. Times are changing and dates are becoming more difficult to get so they interview female singers. They finally decide on Susie Diamond, a former 'escort' who needs some refinement, but the act begins to take off again. While the act is now successful, both Frank and Jack have problems with their life on the road. Susie becomes the agent that makes them re-evaluate where they are going, and how honest they have been with each other. Written by John Vogel <jlvogel@comcast.net>","Genre":"Drama, Music, Romance","Keywords":"piano, piano player, audition, singing, hotel","imdbRating":"6.8","imdbVotes":"17,232","Awards":"Nominated for 4 Oscars. Another 14 wins & 11 nominations.","Metascore":"","Released":"13 October 1989 (USA) ","Location":"Ambassador Hotel - 3400 Wilshire Boulevard, Los Angeles, California, USA ","Actors":"Jeff Bridges, Michelle Pfeiffer, Beau Bridges ","Running_time":"PT114M / 1h 54min","Description":"Directed by Steve Kloves.  With Jeff Bridges, Michelle Pfeiffer, Beau Bridges, Ellie Raab. Frank and Jack Baker are professional musicians who play small clubs. They play schmaltzy music and have never needed a day job. Times are changing and dates are becoming more difficult to get so they interview female singers. They finally decide on Susie Diamond, a former 'escort' who needs some refinement, but the act begins to take off again. While the act is now successful, both Frank and ...","Rated":"R"}