{"imdbID":"tt0065214","Title":"The Wild Bunch","Year":"1969","Director":"Sam Peckinpah","Taglines":"They came too late and stayed too long. ","Certificate":"R | See all certifications »","Country":"USA","Language":"English, Spanish, German","Also_Known_As":"La pandilla salvaje ","Budget":"$6,244,087 (estimated)","Production_Co":"Warner Brothers/Seven Arts ","":"Show detailed company contact information on IMDbPro »","Runtime":"144 min (director's cut)","Sound_Mix":"70 mm 6-Track (70 mm prints)| DTS (1995 re-release)| Dolby Digital (1995 re-release)| Mono (35 mm prints)| SDDS (1995 re-release)","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Sam Peckinpah stated that one of his goals for this movie was to give the audience \"some idea of what it is to be gunned down\". A memorable incident occurred, to that end, as Peckinpah's crew were consulting him on the \"gunfire\" effects to be used in the film. Not satisfied with the results from the squibs his crew had brought for him, Peckinpah became exasperated; he finally hollered: \"That's not what I want! That's not what I want!\" He then grabbed a real revolver and fired it into a nearby wall. The gun empty, Peckinpah barked at his stunned crew: \"THAT'S the effect I want!!\" He also had the gunfire sound effects changed for the film. Before, all gunshots in Warner Brothers movies sounded identical, regardless of the type of weapon being fired. Peckinpah insisted on each different type of firearm having its own specific sound effect when fired. See more »","Goofs":"When Edmund O Brian or Freddie Sykes in the movie, goes to the rocks to relieve himself, the gang throws a bundle of dynamite at him for a laugh. He pulls out the cap and fuse, however the sound of the cap exploding is never heard. See more »","Cast":"William Holden, Ernest Borgnine, Robert Ryan, Edmond O'Brien, Warren Oates, Jaime Sánchez, Ben Johnson, Emilio Fernández, Strother Martin, L.Q. Jones, Albert Dekker, Bo Hopkins, Dub Taylor, Paul Harper, Jorge Russek","Plot":"An aging group of outlaws look for one last big score as the \"traditional\" American West is disappearing around them. In the Wild Bunch the movie opens with a group of aging outlaw's final score, a bank robbery. The event concludes with a violent and overtly bloody shootout that would generally mark the finale of a movie. This is correct in that it marks the finale of an era, for the characters and the world they live in. They simply can no longer keep up, the times are changing, technology advancing, and they're style of life is getting left behind in the dust that they spent so long galloping through. They abandon their careers for the simpler life of retirement. They enjoy this time, they live their fantasies. During this time the law is always on their tracks, bounty hunters. The further into their fantasy they get, the closer their demise seems to get. When one of their own is captured they are faced with the choice of escape or what is certainly a suicide mission to attempt and free their fallen behind comrade. For them it is not a choice. They all die in what can only be described as a ... Written by VilanTrub@gmail.com","Genre":"Action, Adventure, Western","Keywords":"texas, soldier, friendship, honor, gang","imdbRating":"8.0","imdbVotes":"61,656","Awards":"Nominated for 2 Oscars. Another 5 wins & 4 nominations.","Metascore":"","Released":"18 June 1969 (USA) ","Location":"Bavispe, Sonora, Mexico ","Actors":"William Holden, Ernest Borgnine, Robert Ryan ","Writer":"Walon Green (screenplay), Sam Peckinpah (screenplay) | 2 more credits »","Running_time":"PT145M / 2h 25min","Description":"Directed by Sam Peckinpah.  With William Holden, Ernest Borgnine, Robert Ryan, Edmond O'Brien. An aging group of outlaws look for one last big score as the \"traditional\" American West is disappearing around them.","Rated":"R"}