{"imdbID":"tt0049406","Title":"The Killing","Year":"1956","Director":"Stanley Kubrick","Taglines":"These 5 Men Had a $2,000,000 Secret Until One of them told this Woman! ","Certificate":"Approved | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Bed of Fear ","Budget":"$320,000 (estimated)","Production_Co":"Harris-Kubrick Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"85 min","Sound_Mix":"Mono (RCA Sound System)","Color":"Black and White","Aspect_Ratio":"1.66 : 1","Trivia":"Initial test screenings were poor, citing the non-linear structure as the main problem. Stanley Kubrick was forced to go back and edit the film in a linear fashion, actually making the film even more confusing. In the end, it was released in its original form, and is often cited as being a huge influence on other non-linear films like Reservoir Dogs (1992) and Pulp Fiction (1994). See more »","Goofs":"Every time Johnny Clay pulls up to the hotel you can see the shadow of the boom mic on the road. See more »","Cast":"Sterling Hayden, Coleen Gray, Vince Edwards, Jay C. Flippen, Ted de Corsia, Marie Windsor, Elisha Cook Jr., Joe Sawyer, James Edwards, Timothy Carey, Kola Kwariani, Jay Adler, Tito Vuolo, Dorothy Adams, Herbert Ellis","Plot":"Crooks plan and execute a daring race-track robbery. After getting out of prison, Johnny Clay masterminds a complex race-track heist, but his scheme is complicated by the intervention of the wife of a teller (George Peatty) in on the scheme, the boyfriend of the wife, airport regulations, and a small dog. Written by Andrew Hyatt <dres@uiuc.edu>","Genre":"Crime, Drama, Film-Noir","Keywords":"airport, robbery, racetrack, dog, suitcase","imdbRating":"8.1","imdbVotes":"60,632","Awards":"Nominated for 1 BAFTA Film Award.","Metascore":"","Released":"6 June 1956 (USA) ","Location":"California, USA ","Actors":"Sterling Hayden, Coleen Gray, Vince Edwards ","Writer":"Stanley Kubrick (screenplay), Jim Thompson (dialogue) | 1 more credit »","Running_time":"PT85M / 1h 25min","Description":"Directed by Stanley Kubrick.  With Sterling Hayden, Coleen Gray, Vince Edwards, Jay C. Flippen. Crooks plan and execute a daring race-track robbery.","Rated":"APPROVED"}