{"imdbID":"tt0057877","Title":"Becket","Year":"1964","Director":"Peter Glenville","Country":"UK, USA","Language":"English, Latin, Welsh","Budget":"$3,000,000 (estimated)","Production_Co":"Paramount Pictures, Paramount Film Service, Keep Films ","Runtime":"148 min","Cast":"Richard Burton, Peter O'Toole, John Gielgud, Gino Cervi, Paolo Stoppa, Donald Wolfit, David Weston, Martita Hunt, Pamela Brown, Percy Herbert, Siân Phillips, Inigo Jackson, Felix Aylmer, Niall MacGinnis, Christopher Rhodes","Plot":"An English king comes to terms with his affection for his close friend and confidant, who finds his true honor by observing God's divine will rather than the king's. As the story opens, King Henry II, who ruled England from 1154 to 1189 has entered Canterbury Cathedral to do penance at the tomb of his former friend, Thomas Becket. Bare to the waist, the king kneels to receive a flogging from Saxon monks. He begins to reminisce, recalling at first the carefree, promiscuous adventures with Becket, then his favorite drinking and wenching companion. A violently emotional drama that probes the changing relationship between two young men - between two close friends bound together by similar pride of flesh and spirit who become deadly enemies as they pursue their separate destinies . . . that of king . . . and saint. Written by alfiehitchie","Genre":"Biography, Drama, History","Keywords":"thomas becket, king henry ii, drinking, archbishop, england","imdbRating":"8.0","imdbVotes":"10,848","Awards":"Won 1 Oscar. Another 13 wins & 23 nominations.","Metascore":"68","Released":"11 March 1964 (USA) ","Location":"Alnwick Castle, Alnwick, Northumberland, England, UK ","Actors":"Richard Burton, Peter O'Toole, John Gielgud ","Writer":"Jean Anouilh (play), Lucienne Hill (play) | 1 more credit »","Running_time":"PT148M / 2h 28min","Description":"Directed by Peter Glenville.  With Richard Burton, Peter O'Toole, John Gielgud, Gino Cervi. An English king comes to terms with his affection for his close friend and confidant, who finds his true honor by observing God's divine will rather than the king's.","Rated":"PG-13"}