{"imdbID":"tt0073107","Title":"Hester Street","Year":"1975","Director":"Joan Micklin Silver","Country":"USA","Language":"English, Yiddish","Budget":"$350,000 (estimated)","Production_Co":"Midwest Films ","Runtime":"89 min","Cast":"Steven Keats, Carol Kane, Mel Howard, Dorrie Kavanaugh, Doris Roberts, Stephen Strimpell, Lauren Frost, Paul Freedman, Martin Garner, Leib Lensky, Zane Lasky, Zvee Scooler, Eda Reiss Merin, Robert Lesser, Joanna Merlin","Plot":"It's 1896. Yankel Bogovnik, a Russian Jew, emigrated to the United States three years earlier and has settled where many of his background have, namely on Hester Street on the Lower East ... See full summary » It's 1896. Yankel Bogovnik, a Russian Jew, emigrated to the United States three years earlier and has settled where many of his background have, namely on Hester Street on the Lower East Side of New York City. He has assimilated to American life, having learned English, anglicized his name to Jake, and shaved off his beard. He is working at a $12/week job as a seamster, the money earned to be able to bring his wife Gitl and his son Yossele to America from Russia. Regardless, he has fallen in love with another woman, a dancer named Mamie Fein. Nonetheless, he is excited when he learns that Gitl and Yossele are indeed coming to America. His happiness at their arrival is dampened when he sees that Gitl is not \"American\" looking like Mamie and has troubles assimilating as quickly as he would like. Except to Mamie, he tries to show a public façade that everything is fine at home with Gitl. But can their marriage survive these differences, and if not, will Gitl be able to manage in this new... Written by Huggo","Genre":"Drama, Romance","Keywords":"beard, jew, new york city, immigrant experience, ethnic identity","imdbRating":"7.0","imdbVotes":"898","Awards":"Nominated for 1 Oscar. Another 2 wins & 1 nomination.","Metascore":"","Released":"6 August 1976 (Denmark) ","Location":"7th Avenue, Manhattan, New York City, New York, USA ","Actors":"Steven Keats, Carol Kane, Mel Howard ","Writer":"Joan Micklin Silver (screenplay), Abraham Cahan (novel)","Running_time":"PT89M / 1h 29min","Description":"Directed by Joan Micklin Silver.  With Steven Keats, Carol Kane, Mel Howard, Dorrie Kavanaugh. It's 1896. Yankel Bogovnik, a Russian Jew, emigrated to the United States three years earlier and has settled where many of his background have, namely on Hester Street on the Lower East Side of New York City. He has assimilated to American life, having learned English, anglicized his name to Jake, and shaved off his beard. He is working at a $12/week job as a seamster, the money earned to be ...","Rated":"PG"}