{"imdbID":"tt0079826","Title":"The Rose","Year":"1979","Director":"Mark Rydell","Country":"USA","Language":"English","Budget":"$8,500,000 (estimated)","Gross":"$29,200,000 (USA)","Production_Co":"Twentieth Century Fox Film Corporation ","Runtime":"125 min","Cast":"Bette Midler, Alan Bates, Frederic Forrest, Harry Dean Stanton, Barry Primus, David Keith, Sandra McCabe, Will Hare, Rudy Bond, Don Calfa, James Keane, Doris Roberts, Sandy Ward, Michael Greer, Kenny Sacha","Plot":"The tragic life of a self-destructive female rock star who struggles to deal with the constant pressures of her career and the demands of her ruthless business manager. Bette Midler plays The Rose, a female rock star strikingly similar to Janis Joplin. The film follows Rose's career during her last tour, as she's determined to return to her Florida hometown. Although a success, she's exhausted and lonely but continued working by her gruff and greedy manager. Though loud and brassy, Rose is an insecure alcoholic and former drug user who seems to crave approval in her life. She begins a romance with a limousine driver, who's actually an AWOL sergeant from the United States Army. Her rock and roll lifestyle of Drugs, Sex, and Rock and Roll and constant touring lead her to an inevitable breakdown. Written by R. John Berggren <jberg@nina.pagesz.net>","Genre":"Drama, Music, Romance","Keywords":"roses, drugs, awol, driver, demand","imdbRating":"6.9","imdbVotes":"5,960","Awards":"Nominated for 4 Oscars. Another 4 wins & 8 nominations.","Metascore":"","Released":"7 November 1979 (USA) ","Location":"New York City, New York, USA ","Actors":"Bette Midler, Alan Bates, Frederic Forrest ","Writer":"Bo Goldman (screenplay), Bill Kerby (screenplay) | 1 more credit »","Running_time":"PT125M / 2h 5min","Description":"Directed by Mark Rydell.  With Bette Midler, Alan Bates, Frederic Forrest, Harry Dean Stanton. The tragic life of a self-destructive female rock star who struggles to deal with the constant pressures of her career and the demands of her ruthless business manager.","Rated":"R"}