{"imdbID":"tt0020827","Title":"The Divorcee","Year":"1930","Director":"Robert Z. Leonard (uncredited)","Country":"USA","Language":"English, French","Budget":"$340,691 (estimated)","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"84 min (copyright length) | 82 min (Turner library print)","Cast":"Norma Shearer, Chester Morris, Conrad Nagel, Robert Montgomery, Florence Eldridge, Helene Millard, Robert Elliott, Mary Doran, Tyler Brooke, Zelda Sears, George Irving, Judith Wood","Plot":"When a woman discovers that her husband has been unfaithful to her, she decides to respond to his infidelities in kind. Jerry and Ted are young, in love, and part of the New York 'in-crowd'. Jerry's decision to marry Ted crushes a yearning Paul. Distraught Paul gets drunk and wrecks his car, disfiguring young Dorothy's face in the process. Out of pity, Paul marries Dorothy. Years later, the apparent perfect marriage of Ted and Jerry falls apart from infidelity on both sides. Inwardly unhappy, popular Jerry lives a party life while Ted sinks into a life of alcoholism. Jerry then runs into Paul, who still loves her. After spending time together with Jerry, Paul plans to divorce Dorothy. When Jerry sees Dorothy again, she has second thoughts about where her life is heading. Written by Gary Jackson <garyjack5@cogeco.ca>","Genre":"Romance, Drama","Keywords":"party, marriage, divorce, obsession, hypocrisy","imdbRating":"6.9","imdbVotes":"1,845","Awards":"Won 1 Oscar. Another 3 nominations.","Metascore":"","Released":"19 April 1930 (USA) ","Location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA ","Actors":"Norma Shearer, Robert Montgomery, Chester Morris ","Writer":"Ursula Parrott (based on a novel by), Nick Grinde (treatment) (as Nick Grindé) | 2 more credits »","Running_time":"PT84M / 1h 24min","Description":"Directed by Robert Z. Leonard.  With Norma Shearer, Robert Montgomery, Chester Morris, Conrad Nagel. When a woman discovers that her husband has been unfaithful to her, she decides to respond to his infidelities in kind.","Rated":"PASSED"}