{"imdbID":"tt0045152","Title":"Singin' in the Rain","Year":"1952","Taglines":"MGM's Musical Treasure ! ","Certificate":"See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Cantando bajo la lluvia ","Budget":"$2,540,800 (estimated)","Production_Co":"Metro-Goldwyn-Mayer (MGM), Loew's ","":"Show detailed company contact information on IMDbPro »","Runtime":"103 min","Sound_Mix":"Mono (Western Electric Sound System)","Color":"Color (Technicolor)| Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Debbie Reynolds remarked many years later that making this movie and surviving childbirth were the two hardest things she's ever had to do. See more »","Goofs":"In \"Make 'Em Laugh\", when Cosmo sits down on the couch with the mannequin, his hat is pulled down over his forehead and the brim is flat. In the close-up, however, his hat is pushed back and the brim tilted up. See more »","Cast":"Gene Kelly, Donald O'Connor, Debbie Reynolds, Jean Hagen, Millard Mitchell, Cyd Charisse, Douglas Fowley, Rita Moreno","Plot":"A silent film production company and cast make a difficult transition to sound. 1927 Hollywood. Monumental Pictures' biggest stars, glamorous on-screen couple Lina Lamont and Don Lockwood, are also an off-screen couple if the trade papers and gossip columns are to be believed. Both perpetuate the public perception if only to please their adoring fans and bring people into the movie theaters. In reality, Don barely tolerates her, while Lina, despite thinking Don beneath her, simplemindedly believes what she sees on screen in order to bolster her own stardom and sense of self-importance. R.F. Simpson, Monumental's head, dismisses what he thinks is a flash in the pan: talking pictures. It isn't until The Jazz Singer (1927) becomes a bona fide hit which results in all the movie theaters installing sound equipment that R.F. knows Monumental, most specifically in the form of Don and Lina, have to jump on the talking picture bandwagon, despite no one at the studio knowing anything about the technology. Musician Cosmo Brown, Don's best friend, gets hired as Monumental's ... Written by Huggo","Genre":"Comedy, Musical, Romance","Keywords":"friend, actress, love, fan, chorus girl","imdbRating":"8.3","imdbVotes":"143,969","Awards":"Nominated for 2 Oscars. Another 5 wins & 7 nominations.","Metascore":"","Released":"11 April 1952 (USA) ","Location":"Grauman's Chinese Theater - 6925 Hollywood Blvd., Hollywood, Los Angeles, California, USA ","Actors":"Gene Kelly, Donald O'Connor, Debbie Reynolds ","Director":"Stanley Donen, Gene Kelly","Writer":"Adolph Green (story), Betty Comden (story)","Running_time":"PT103M / 1h 43min","Description":"Directed by Stanley Donen, Gene Kelly.  With Gene Kelly, Donald O'Connor, Debbie Reynolds, Jean Hagen. A silent film production company and cast make a difficult transition to sound.","Rated":"N/A"}