{"imdbID":"tt0042192","Title":"All About Eve","Year":"1950","Director":"Joseph L. Mankiewicz","Writer":"Joseph L. Mankiewicz (written for the screen by)","Taglines":"It's all about women---and their men!","Certificate":"See all certifications »","Country":"USA","Language":"English, French","Also_Known_As":"Alles über Eva ","Budget":"$1,400,000 (estimated)","Opening_Weekend":"$10,177 (USA) (6 October 2000)","Gross":"$10,177 (USA) (6 October 2000)","Production_Co":"Twentieth Century Fox Film Corporation ","":"Show detailed company contact information on IMDbPro »","Runtime":"138 min","Sound_Mix":"Mono (Western Electric Recording)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"The original story \"The Wisdom of Eve\" appeared in \"Cosmopolitan\" magazine in 1946, and was produced as a radio drama for NBC - but every studio rejected it as a film project. Eventually Fox bought the rights for $3500 with no credit stipulations. Joseph L. Mankiewicz combined \"The Wisdom of Eve\" with a story he had been developing about an actress who recalls her life when receiving an award. See more »","Goofs":"In the dressing-room scene at the beginning, Margot turns in her chair to look at Karen. In the subsequent reverse angle, her arm positioning across the back of the chair has completely changed. See more »","Crazy_Credits":"Eddie Fisher is credited in the cast as 'Stage Manager,' although all of his scenes were cut from the released print. This is not the the singer Eddie Fisher, but another actor. See more »","Cast":"Bette Davis, Anne Baxter, George Sanders, Celeste Holm, Gary Merrill, Hugh Marlowe, Gregory Ratoff, Barbara Bates, Marilyn Monroe, Thelma Ritter, Walter Hampden, Randy Stuart, Craig Hill, Leland Harris, Barbara White","Plot":"An ingenue insinuates herself in to the company of an established but aging stage actress and her circle of theater friends. Eve is waiting backstage to meet her \"idol\" aging Broadway Star, Margo Channing. It all seems innocent enough as Eve explains that she has seen Margo in EVERY performance of the current play she is in. Only Playright critic DeWitt sees through Eve's evil plan, which is to take her parts and fiance. When the fiance shows no interest, she tries for Celeste Holmes husband and playwright. But, DeWitt (George Brandt) stops her. After she accepts her award, she decides to skip the after-party and goes to her room, where we find a young woman named Phoebe, who snuck into her room and fell asleep. This is where the \"Circle of Life\" now comes to fruition as Eve is going to get played the way she did Margo.","Genre":"Drama","Keywords":"critic, broadway, star, director, theater","imdbRating":"8.3","imdbVotes":"79,879","Awards":"Won 6 Oscars. Another 16 wins & 17 nominations.","Metascore":"","Released":"15 January 1951 (Sweden) ","Location":"242 West 45th Street, Manhattan, New York City, New York, USA ","Actors":"Bette Davis, Anne Baxter, George Sanders ","Running_time":"PT138M / 2h 18min","Description":"Directed by Joseph L. Mankiewicz.  With Bette Davis, Anne Baxter, George Sanders, Celeste Holm. An ingenue insinuates herself in to the company of an established but aging stage actress and her circle of theater friends.","Rated":"N/A"}