{"imdbID":"tt0025878","Title":"The Thin Man","Year":"1934","Director":"W.S. Van Dyke","Country":"USA","Language":"English","Budget":"$226,408 (estimated)","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"91 min","Cast":"William Powell, Myrna Loy, Maureen O'Sullivan, Nat Pendleton, Minna Gombell, Porter Hall, Henry Wadsworth, William Henry, Harold Huber, Cesar Romero, Natalie Moorhead, Edward Brophy, Edward Ellis, Cyril Thornton","Plot":"Nick and Nora Charles, a former detective and his rich, playful wife, investigate a murder case mostly for the fun of it. After a four year absence, one time detective Nick Charles returns to New York with his new wife Nora and their dog, Asta. Nick re-connects with many of his old cronies, several of whom are eccentric characters, to say the least. He's also approached by Dorothy Wynant whose inventor father Clyde Wynant is suspected of murdering her step-mother. Her father had left on a planned trip some months before and she has had no contact with him. Nick isn't all that keen on resuming his former profession but egged-on by wife Nora, who thinks this all very exciting, he agrees to help out. He solves the case, announcing the identity of the killer at a dinner party for all of the suspects. Written by garykmcd","Genre":"Comedy, Crime, Mystery","Keywords":"murder, sleuth, wedding, mistress, police","imdbRating":"8.1","imdbVotes":"20,227","Awards":"Nominated for 4 Oscars. Another 2 wins.","Metascore":"","Released":"25 May 1934 (USA) ","Location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA","Actors":"William Powell, Myrna Loy, Maureen O'Sullivan ","Writer":"Albert Hackett (screen play), Frances Goodrich (screen play) | 1 more credit »","Running_time":"PT91M / 1h 31min","Description":"Directed by W.S. Van Dyke.  With William Powell, Myrna Loy, Maureen O'Sullivan, Nat Pendleton. Nick and Nora Charles, a former detective and his rich, playful wife, investigate a murder case mostly for the fun of it.","Rated":"NOT RATED"}