{"imdbID":"tt0082979","Title":"Reds","Year":"1981","Director":"Warren Beatty","Country":"USA","Language":"English, Russian, German, French, Finnish","Budget":"$35,000,000 (estimated)","Gross":"SEK 3,179,562 (Sweden)","Production_Co":"Barclays Mercantile Industrial Finance, JRS Productions ","Runtime":"195 min","Cast":"Warren Beatty, Diane Keaton, Edward Herrmann, Jerzy Kosinski, Jack Nicholson, Paul Sorvino, Maureen Stapleton, Nicolas Coster, M. Emmet Walsh, Ian Wolfe, Bessie Love, MacIntyre Dixon, Pat Starr, Eleanor D. Wilson, Max Wright","Plot":"A radical American journalist becomes involved with the Communist revolution in Russia and hopes to bring its spirit and idealism to the United States. This movie tells the true story of John Reed, a radical American journalist around the time of World War I. He soon meets Louise Bryant, a respectable married woman, who dumps her husband for Reed and becomes an important feminist and radical in her own right. After involvement with labor and political disputes in the US, they go to Russia in time for the October Revolution in 1917, when the Communists siezed power. Inspired, they return to the US, hoping to lead a similar revolution. A particularly fascinating aspect of the movie is the inclusion of interviews with \"witnesses\", the real-life surviving participants in the events of the movie. Written by Reid Gagle","Genre":"Biography, Drama, History","Keywords":"russia, interview, cold war era, cold war, written and directed by cast member","imdbRating":"7.5","imdbVotes":"15,848","Awards":"Won 3 Oscars. Another 19 wins & 34 nominations.","Metascore":"","Released":"25 December 1981 (USA) ","Location":"Twickenham Film Studios, St Margarets, Twickenham, Middlesex, England, UK ","Actors":"Warren Beatty, Diane Keaton, Edward Herrmann ","Writer":"Warren Beatty, Trevor Griffiths","Running_time":"PT195M / 3h 15min","Description":"Directed by Warren Beatty.  With Warren Beatty, Diane Keaton, Edward Herrmann, Jerzy Kosinski. A radical American journalist becomes involved with the Communist revolution in Russia and hopes to bring its spirit and idealism to the United States.","Rated":"R"}