{"imdbID":"tt0058777","Title":"Zulu","Year":"1964","Director":"Cy Endfield","Taglines":"These are the days and nights of fury and honor and courage and cowardice that an entire century of empire-making and film-making can never surpass! ","Certificate":"Unrated | See all certifications »","Country":"UK","Language":"English, Zulu","Also_Known_As":"Zulu ","Budget":"$3,500,000 (estimated)","Production_Co":"Diamond Films ","Runtime":"138 min","Sound_Mix":"4-Track Stereo (35 mm magnetic prints)| 70 mm 6-Track (70 mm prints)| Mono (35 mm optical prints)","Color":"Color (Technicolor)","Aspect_Ratio":"2.20 : 1","Trivia":"Still Photographer Bob Martin and Nigel Green visited the Zulu war museum in Ladismith and found a Queen Victoria commemorative silk handkerchief on which was printed, \"Bugle calls to be used in battle\". Green got permission to copy these \"notes\" after practicing for weeks (\"I had not blown a bugle since my navy days years before\") and, armed with the prop bugle, Claude Hitchcock and the sound crew recorded the calls in a gorge (for echo effect) they were used in the final soundtrack of the film. See more »","Goofs":"Camera shadow on a bandaged soldier, after the company roll call. See more »","Crazy_Credits":"The title has fire within its letters, and it flies directly at the screen. Additionally, the title itself doesn't appear on screen until after the opening credits have finished rolling. See more »","Cast":"Stanley Baker, Jack Hawkins, Ulla Jacobsson, James Booth, Michael Caine, Nigel Green, Ivor Emmanuel, Paul Daneman, Glynn Edwards, Neil McCarthy, David Kernan, Gary Bond, Peter Gill, Tom Gerrard, Patrick Magee","Plot":"Outnumbered British soldiers do battle with Zulu warriors at Rorke's Drift. Two Lieutenants, Chard of Engineers and Bromhead find that their 140 man contingent in Natal has been isolated by the destruction of the main British Army column and that 4,000 Zulu warriors will descend on them in hours. Each has a different military background in tactics and they are immediatly in conflict on how to prepare for the attack. Nearly a third of the men are in the infirmary, as the welsh company tries to somehow survive with no help in sight. Based on a true story. Written by John Vogel <jlvogel@comcast.net>","Genre":"Drama, History, War","Keywords":"british, zulu, warrior, battle, army","imdbRating":"7.8","imdbVotes":"28,305","Awards":"Nominated for 1 BAFTA Film Award.","Metascore":"","Released":"17 June 1964 (USA) ","Location":"Amphitheatre, Drakensberg Mountains, South Africa ","Actors":"Stanley Baker, Jack Hawkins, Ulla Jacobsson ","Writer":"John Prebble (original screenplay), Cy Endfield (original screenplay) | 1 more credit »","Running_time":"PT138M / 2h 18min","Description":"Directed by Cy Endfield.  With Stanley Baker, Jack Hawkins, Ulla Jacobsson, James Booth. Outnumbered British soldiers do battle with Zulu warriors at Rorke's Drift.","Rated":"UNRATED"}