{"imdbID":"tt0047396","Title":"Rear Window","Year":"1954","Director":"Alfred Hitchcock","Taglines":"See It! - If your nerves can stand it after PSYCHO! (1962 re-release) ","Certificate":"See all certifications »","Country":"USA","Language":"English","Also_Known_As":"La ventana indiscreta ","Budget":"$1,000,000 (estimated)","Opening_Weekend":"$15,172 (USA) (21 January 2000)","Gross":"$24,500,000 (USA)","Production_Co":"Paramount Pictures, Patron Inc. ","":"Show detailed company contact information on IMDbPro »","Runtime":"112 min","Sound_Mix":"Mono (Western Electric Recording)","Color":"Color (Eastmancolor) (negative)| Color (Technicolor) (prints)","Aspect_Ratio":"1.66 : 1","Trivia":"To accommodate the enormous set, a higher ceiling was required. Alfred Hitchcock had the production company tear out the entire floor of the studio, revealing the basement. What the audience sees as the courtyard was originally the basement level of the studio. See more »","Goofs":"After Lisa sees Thorwald tie up the trunk, and the camera dollies forward to a close up, there are creaks from the floorboards and footsteps heard from the camera crew. See more »","Cast":"James Stewart, Grace Kelly, Wendell Corey, Thelma Ritter, Raymond Burr, Judith Evelyn, Ross Bagdasarian, Georgine Darcy, Sara Berner, Frank Cady, Jesslyn Fax, Rand Harper, Irene Winston, Havis Davenport","Plot":"A wheelchair-bound photographer spies on his neighbours from his apartment window and becomes convinced one of them has committed murder. Professional photographer L.B. \"Jeff\" Jeffries breaks his leg while getting an action shot at an auto race. Confined to his New York apartment, he spends his time looking out of the rear window observing the neighbors. He begins to suspect that a man across the courtyard may have murdered his wife. Jeff enlists the help of his high society fashion-consultant girlfriend Lisa Freemont and his visiting nurse Stella to investigate. Written by Col Needham <col@imdb.com>","Genre":"Mystery, Thriller","Keywords":"apartment, neighbor, dog, wheelchair, killing a dog","imdbRating":"8.5","imdbVotes":"303,434","Awards":"Nominated for 4 Oscars. Another 6 wins & 8 nominations.","Metascore":"","Released":"1 August 1954 (UK) ","Location":"Stage 18, Paramount Studios - 5555 Melrose Avenue, Hollywood, Los Angeles, California, USA ","Actors":"James Stewart, Grace Kelly, Wendell Corey ","Writer":"John Michael Hayes (screenplay), Cornell Woolrich (based on the short story by)","Running_time":"PT112M / 1h 52min","Description":"Directed by Alfred Hitchcock.  With James Stewart, Grace Kelly, Wendell Corey, Thelma Ritter. A wheelchair-bound photographer spies on his neighbours from his apartment window and becomes convinced one of them has committed murder.","Rated":"N/A"}