{"imdbID":"tt0072431","Title":"Young Frankenstein","Year":"1974","Director":"Mel Brooks","Taglines":"The scariest comedy of all time!","Certificate":"PG | See all certifications »","Country":"USA","Language":"English, German","Also_Known_As":"Frankenstein junior ","Budget":"$2,800,000 (estimated)","Gross":"$86,300,000 (USA)","Production_Co":"Gruskoff/Venture Films, Crossbow Productions, Jouer Limited ","Runtime":"106 min","Sound_Mix":"Mono (Westrex Recording System)","Color":"Black and White","Aspect_Ratio":"1.85 : 1","Trivia":"Final film of Oscar Beregi Jr. See more »","Goofs":"In the 'Puttin' on the Ritz' number one of the electric footlights explodes, alarming the monster. The light however stays entire and is still on, and it isn't clear what it is that Frederick is stamping out. See more »","Crazy_Credits":"The zero in the 20th century fox logo at the beginning is slightly tilted. See more »","Cast":"Gene Wilder, Peter Boyle, Marty Feldman, Madeline Kahn, Cloris Leachman, Teri Garr, Kenneth Mars, Richard Haydn, Liam Dunn, Danny Goldman, Oscar Beregi Jr., Arthur Malet, Richard A. Roth, Monte Landis, Rusty Blitz","Plot":"An American grandson of the infamous scientist, struggling to prove that he is not as insane as people believe, travels to his family's home country and discovers the process that reanimates a dead body. A young neurosurgeon (Gene Wilder) inherits the castle of his grandfather, the famous Dr. Victor von Frankenstein. In the castle he finds a funny hunchback called Igor, a pretty lab assistant named Inga and the old housekeeper, frau Blucher -iiiiihhh!-. Young Frankenstein believes that the work of his grandfather is only crap, but when he discovers the book where the mad doctor described his reanimation experiment, he suddenly changes his mind... Written by Flavio Rizzardi <spillo@maya.dei.unpid.it>","Genre":"Comedy","Keywords":"frankenstein's monster, castle, experiment, assistant, scientist","imdbRating":"8.0","imdbVotes":"110,008","Awards":"Nominated for 2 Oscars. Another 10 wins & 5 nominations.","Metascore":"","Released":"15 December 1974 (USA) ","Location":"Mayfair Theatre - 214 Santa Monica Boulevard, Santa Monica, California, USA ","Actors":"Gene Wilder, Madeline Kahn, Marty Feldman ","Writer":"Gene Wilder (screen story and screenplay), Mel Brooks (screen story and screenplay) | 1 more credit »","Running_time":"PT106M / 1h 46min","Description":"Directed by Mel Brooks.  With Gene Wilder, Madeline Kahn, Marty Feldman, Peter Boyle. An American grandson of the infamous scientist, struggling to prove that he is not as insane as people believe, travels to his family's home country and discovers the process that reanimates a dead body.","Rated":"PG"}