{"imdbID":"tt0030341","Title":"The Lady Vanishes","Year":"1938","Director":"Alfred Hitchcock","Taglines":"The Film That Made ALFRED HITCHCOCK Master of Suspense! ","Certificate":"Passed | See all certifications »","Country":"UK","Language":"English, German, French, Italian","Also_Known_As":"La dama desaparece ","Production_Co":"Gainsborough Pictures ","Runtime":"96 min","Sound_Mix":"Mono (British Acoustic Film Full - Range Recording: at Islington, London)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Charters and Caldicott (played by Basil Radford and Naunton Wayne) proved to be such popular characters that they were teamed up in other films. They reappeared in Night Train to Munich (1940) (also starring Margaret Lockwood) and Millions Like Us (1943), two films also written by Sidney Gilliat and Frank Launder. They also starred in the BBC Radio serials \"Crook's Tour (1941)\" (which was also made into a film), and \"Secret Mission 609.\" They were played in the 1979 remake by Arthur Lowe and Ian Carmichael. In 1985, they reappeared in the BBC Television mystery mini-series, Charters & Caldicott (1985), played by Robin Bailey and Michael Aldridge. See more »","Goofs":"In the opening scene of the movie, the camera tracks downward in an aerial view over the side of a snow-covered mountain to show railroad tracks and the front of a train's locomotive buried by an avalanche, close to a train station in a small mountain village. As the camera passes over the train and four railroad officials standing to the left of it, one of the officials swivels to the left and then to the right, as if he were rotating on a pivot. As the camera moves closer to the ground, away from the train station and along a village street at ordinary eye level, it shows an automobile crossing the far end of a street; the string pulling the automobile along the street is plainly visible for an instant. Both this detail and the movement of the railroad official show that the entire opening scene was shot upon a scale-model miniature set. See more »","Cast":"Margaret Lockwood, Michael Redgrave, Paul Lukas, Dame May Whitty, Cecil Parker, Linden Travers, Naunton Wayne, Basil Radford, Mary Clare, Emile Boreo, Googie Withers, Sally Stewart, Philip Leaver, Selma Vaz Dias, Catherine Lacey","Plot":"While traveling in continental Europe, a rich young playgirl realizes that an elderly lady seems to have disappeared from the train. Passengers on a scheduled train out of the mountainous European country of Mandrika are delayed by a day due to an avalanche, and thus get up close and personal with each other out of necessity in the only and what becomes an overcrowded inn in the area. Once the train departs, the one person who it is uncertain is on the train is a middle aged English governess named Miss Froy. Iris Henderson, who was vacationing in Mandrika with girlfriends before heading back to England to get married, is certain that Miss Froy was on the train as they were in the same compartment and they had tea together in the dining car, but all those people who can corroborate her story don't seem to want to do so. Iris' thoughts are easily dismissed as a possible concussion as Iris was hit over the head just before boarding the train. Iris will take anyone's help in finding Miss Froy, even that of an Englishman named Gilbert, a musicologist with who she had a not so pleasant encounter at the inn the evening ... Written by Huggo","Genre":"Comedy, Mystery, Thriller","Keywords":"train, governess, conspiracy, english, dining car","imdbRating":"8.0","imdbVotes":"34,937","Awards":"1 win & 1 nomination.","Metascore":"","Released":"1 November 1938 (USA) ","Location":"Gaumont-British Studios, Lime Grove, Shepherd's Bush, London, England, UK ","Actors":"Margaret Lockwood, Michael Redgrave, Paul Lukas ","Writer":"Ethel Lina White (based upon the story: \"The Wheel Spins\" by), Sidney Gilliat (screen play) (as Sidney Gilliatt) | 1 more credit »","Running_time":"PT96M / 1h 36min","Description":"Directed by Alfred Hitchcock.  With Margaret Lockwood, Michael Redgrave, Paul Lukas, Dame May Whitty. While traveling in continental Europe, a rich young playgirl realizes that an elderly lady seems to have disappeared from the train.","Rated":"PASSED"}