{"imdbID":"tt0073345","Title":"The Man in the Glass Booth","Year":"1975","Director":"Arthur Hiller","Writer":"Edward Anhalt (screenplay)","Country":"USA","Language":"English, German","Production_Co":"Cinévision Ltée, The American Film Theatre, The Ely Landau Organization Inc. ","Runtime":"117 min","Cast":"Maximilian Schell, Lois Nettleton, Lawrence Pressman, Luther Adler, Lloyd Bochner, Robert H. Harris, Henry Brown, Norbert Schiller, Berry Kroeger, Leonardo Cimino, Connie Sawyer, Leonidas Ossetynski, David Nash, Martin Berman, Richard Rasof","Plot":"Arthur Goldman is a rich Jewish industrialist, living in luxury in a Manhattan high-rise. He banters with his assistant Charlie, often shocking Charlie with his outrageousness and ... See full summary » Arthur Goldman is a rich Jewish industrialist, living in luxury in a Manhattan high-rise. He banters with his assistant Charlie, often shocking Charlie with his outrageousness and irreverence about aspects of Jewish life. Nonetheless, Charlie is astonished when, one day, Israeli secret agents burst in and arrest Goldman for being not a Jewish businessman but a Nazi war criminal. Whisked to Israel for trial, Goldman forces his accusers to face not only his presumed guilt--but their own. Written by Jim Beaver <jumblejim@prodigy.net>","Genre":"Drama","Keywords":"jewish, nazi, trial, war crime, genocide","imdbRating":"7.5","imdbVotes":"755","Awards":"Nominated for 1 Oscar. Another 2 nominations.","Metascore":"","Released":"27 January 1975 (USA) ","Location":"20th Century Fox Studios - 10201 Pico Blvd., Century City, Los Angeles, California, USA ","Actors":"Maximilian Schell, Lois Nettleton, Lawrence Pressman ","Running_time":"PT117M / 1h 57min","Description":"Directed by Arthur Hiller.  With Maximilian Schell, Lois Nettleton, Lawrence Pressman, Luther Adler. Arthur Goldman is a rich Jewish industrialist, living in luxury in a Manhattan high-rise. He banters with his assistant Charlie, often shocking Charlie with his outrageousness and irreverence about aspects of Jewish life. Nonetheless, Charlie is astonished when, one day, Israeli secret agents burst in and arrest Goldman for being not a Jewish businessman but a Nazi war criminal. Whisked to Israel...","Rated":"N/A"}