{"imdbID":"tt0021730","Title":"The Champ","Year":"1931","Director":"King Vidor (uncredited)","Country":"USA","Language":"English","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"86 min (Turner library print)","Cast":"Wallace Beery, Jackie Cooper, Irene Rich, Roscoe Ates, Edward Brophy, Hale Hamilton, Jesse Scott, Marcia Mae Jones","Plot":"Dink Purcell loves his alcoholic father, ex-heavyweight champion Andy \"Champ\" Purcell, despite his frequent binges, his frequent gambling and their squalid living conditions. And there's ... See full summary » Dink Purcell loves his alcoholic father, ex-heavyweight champion Andy \"Champ\" Purcell, despite his frequent binges, his frequent gambling and their squalid living conditions. And there's nothing Andy wouldn't do for Dink. When Andy wins a race horse gambling, he gives it to Dink and they race it at a Tijuana track. There, Dink meets Linda Carleton, a race horse owner herself, and they have an immediate rapport. But Linda's rich husband sees Andy and realizes Dink is Linda's son, who she gave up when she and Andy divorced. Andy is bribed $200 to allow Dink to visit with Linda, but refuses to allow Dink to spend six months with the Carletons. When Andy loses the horse gambling and winds up in jail after a drunken tirade, he realizes Dink's place is with his mother. Dink tearfully goes but sneaks out and returns at his first opportunity, filling a depressed Andy with a desire to make good. So Andy goes into training after his managers arrange a boxing match with the Mexican champion. Written by Arthur Hausner <genart@volcano.net>","Genre":"Drama, Family, Sport","Keywords":"gambling, horse, boxing, racetrack, jail","imdbRating":"7.3","imdbVotes":"1,968","Awards":"Won 2 Oscars. Another 3 nominations.","Metascore":"","Released":"21 November 1931 (USA) ","Location":"Agua Caliente Racetrack, Baja California Norte, Mexico ","Actors":"Wallace Beery, Jackie Cooper, Irene Rich ","Writer":"Frances Marion (story), Leonard Praskins (dialogue continuity) | 1 more credit »","Running_time":"PT86M / 1h 26min","Description":"Directed by King Vidor.  With Wallace Beery, Jackie Cooper, Irene Rich, Roscoe Ates. Dink Purcell loves his alcoholic father, ex-heavyweight champion Andy \"Champ\" Purcell, despite his frequent binges, his frequent gambling and their squalid living conditions. And there's nothing Andy wouldn't do for Dink. When Andy wins a race horse gambling, he gives it to Dink and they race it at a Tijuana track. There, Dink meets Linda Carleton, a race horse owner herself, and they have an ...","Rated":"PASSED"}