{"imdbID":"tt0059712","Title":"Ship of Fools","Year":"1965","Director":"Stanley Kramer","Country":"USA","Language":"English, German, Spanish","Production_Co":"Stanley Kramer Productions ","Runtime":"149 min","Cast":"Vivien Leigh, Simone Signoret, José Ferrer, Lee Marvin, Oskar Werner, Elizabeth Ashley, George Segal, José Greco, Michael Dunn, Charles Korvin, Heinz Rühmann, Lilia Skala, BarBara Luna, Alf Kjellin, Christiane Schmidtmer","Plot":"1933: An ocean liner belonging to a second-rate German company is making a twenty-six day voyage from Veracruz, Mexico to Bremerhaven, Germany. Along the way it will stop in Cuba to pick up... See full summary » 1933: An ocean liner belonging to a second-rate German company is making a twenty-six day voyage from Veracruz, Mexico to Bremerhaven, Germany. Along the way it will stop in Cuba to pick up a large group of Spanish farm laborers who are being shipped home and who will be housed like cattle in steerage. There it will also pick up La Condesa, a Spanish countess. It will stop in Tenerife, where the farm workers will disembark and where La Condesa will be sent to a German-run prison for her \"traitorous\" activities in Cuba. This voyage will be the last of three for the ship's doctor, Willi Schumann, who has a serious heart ailment and who thought he could find some meaning to his life through this job. Willi and La Condesa fall in love, with the ship's Captain Thiele, who is Willi's closest friend on board, believing the drug-addicted La Condesa is only using him to get her fixes. Willi and La Condesa have to figure out if there is a future for them after the voyage, as Willi's life also ... Written by Huggo","Genre":"Drama, Romance, War","Keywords":"german, american, love, ship, traveling","imdbRating":"7.2","imdbVotes":"3,671","Awards":"Won 2 Oscars. Another 3 wins & 13 nominations.","Metascore":"","Released":"October 1965 (Austria) ","Actors":"Vivien Leigh, Simone Signoret, José Ferrer ","Writer":"Katherine Anne Porter (novel), Abby Mann (screenplay)","Running_time":"PT149M / 2h 29min","Description":"Directed by Stanley Kramer.  With Vivien Leigh, Simone Signoret, José Ferrer, Lee Marvin. 1933: An ocean liner belonging to a second-rate German company is making a twenty-six day voyage from Veracruz, Mexico to Bremerhaven, Germany. Along the way it will stop in Cuba to pick up a large group of Spanish farm laborers who are being shipped home and who will be housed like cattle in steerage. There it will also pick up La Condesa, a Spanish countess. It will stop in Tenerife, where the ...","Rated":"N/A"}