{"imdbID":"tt0020629","Title":"All Quiet on the Western Front","Year":"1930","Director":"Lewis Milestone","Taglines":"At last....the motion picture!","Certificate":"Unrated | See all certifications »","Country":"USA","Language":"English, French, German, Latin","Also_Known_As":"Sin novedad en el frente ","Budget":"$1,448,864 (estimated)","Production_Co":"Universal Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"145 min (cut) | 147 min (BBFC submission before censorship) | 133 min (restored) | 138 min (copyright length) | 128 min (DVD edition) | 101 min (TV)","Sound_Mix":"Mono (Western Electric Sound System)| Silent (synchronized music score)","Color":"Black and White","Aspect_Ratio":"1.33 : 1","Trivia":"Lewis Milestone deliberately made the film without music so as not to take away from the seriousness of the subject. Much to his chagrin, however, some movie theaters added music in of their own choosing, as they weren't used to having films delivered to them without any form of background scoring. See more »","Goofs":"When the young recruits go out on their first patrol, a dead soldier is still breathing and blinking his eyes. See more »","Crazy_Credits":"Later reissues of the film mentioned that the film was an Academy Award winner in the opening credits. See more »","Cast":"Louis Wolheim, Lew Ayres, John Wray, Arnold Lucy, Ben Alexander, Scott Kolk, Owen Davis Jr., Walter Rogers, William Bakewell, Russell Gleason, Richard Alexander, Harold Goodwin, Slim Summerville, G. Pat Collins, Beryl Mercer","Plot":"A young soldier faces profound disillusionment in the soul-destroying horror of World War I. This is an English language film (made in America) adapted from a novel by German author Erich Maria Remarque. The film follows a group of German schoolboys, talked into enlisting at the beginning of World War 1 by their jingoistic teacher. The story is told entirely through the experiences of the young German recruits and highlights the tragedy of war through the eyes of individuals. As the boys witness death and mutilation all around them, any preconceptions about \"the enemy\" and the \"rights and wrongs\" of the conflict disappear, leaving them angry and bewildered. This is highlighted in the scene where Paul mortally wounds a French soldier and then weeps bitterly as he fights to save his life while trapped in a shell crater with the body. The film is not about heroism but about drudgery and futility and the gulf between the concept of war and the actuality. Written by Michele Wilkinson, University of Cambridge Language Centre, <mw125@cus.cam.ac.uk>","Genre":"Drama, War","Keywords":"soldier, german army, trench warfare, death, german invasion of france","imdbRating":"8.1","imdbVotes":"46,028","Awards":"Won 2 Oscars. Another 5 wins & 2 nominations.","Metascore":"","Released":"24 August 1930 (USA) ","Location":"RKO-Pathé Studios - 9336 Washington Blvd., Culver City, California, USA ","Actors":"Lew Ayres, Louis Wolheim, John Wray ","Writer":"Erich Maria Remarque (by), Maxwell Anderson (adaptation) | 3 more credits »","Running_time":"PT136M / 2h 16min","Description":"Directed by Lewis Milestone.  With Lew Ayres, Louis Wolheim, John Wray, Arnold Lucy. A young soldier faces profound disillusionment in the soul-destroying horror of World War I.","Rated":"UNRATED"}