{"imdbID":"tt0086250","Title":"Scarface","Year":"1983","Director":"Brian De Palma","Writer":"Oliver Stone (screenplay)","Taglines":"The world is yours... ","Certificate":"R | See all certifications »","Country":"USA","Language":"English, Spanish","Also_Known_As":"Caracortada ","Budget":"$25,000,000 (estimated)","Opening_Weekend":"$242,821 (USA) (19 September 2003)","Gross":"$44,700,000 (USA)","Production_Co":"Universal Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"170 min | 142 min (TV)","Sound_Mix":"4-Track Stereo","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Sigourney Weaver was considered for the role of Elvira Hancock. See more »","Goofs":"In the scene where Tony's tiger is first shown, there is a billboard in the background showing the \"New Corvette\" The first '84 vettes where not released until '83. See more »","Crazy_Credits":"In the opening we see a crawl text (with narrator) that reads: \"In May of 1980, Fidel Castro in an effort to normalize relations with the Carter Administration opened the harbor at Mariel, Cuba with the apparent intention of letting some of his people join their relatives in the United States. Within seventy-two hours, 3,000 U.S. boats were headed for Cuba. In the next few weeks, it became evident that Castro was forcing the boat owners to carry back with them not only their relatives but the dregs of his jail population. By the time the port was closed 125,000 'Marielitos' had landed in Florida. An estimated 25,000 had criminal records. This is the story of that minority those they call 'Los Bandidos'.\" See more »","Cast":"Al Pacino, Steven Bauer, Michelle Pfeiffer, Mary Elizabeth Mastrantonio, Robert Loggia, Miriam Colon, F. Murray Abraham, Paul Shenar, Harris Yulin, Ángel Salazar, Arnaldo Santana, Pepe Serna, Michael P. Moran, Al Israel, Dennis Holahan","Plot":"In 1980 Miami, a determined Cuban immigrant takes over a drug cartel while succumbing to greed. Tony Montana manages to leave Cuba during the Mariel exodus of 1980. He finds himself in a Florida refugee camp but his friend Manny has a way out for them: undertake a contract killing and arrangements will be made to get a green card. He's soon working for drug dealer Frank Lopez and shows his mettle when a deal with Colombian drug dealers goes bad. He also brings a new level of violence to Miami. Tony is protective of his younger sister but his mother knows what he does for a living and disowns him. Tony is impatient and wants it all however, including Frank's empire and his mistress Elvira Hancock. Once at the top however, Tony's outrageous actions make him a target and everything comes crumbling down. Written by garykmcd","Genre":"Crime, Drama","Keywords":"cuban american, cocaine, cuban refugee, capitalism, assassination attempt","imdbRating":"8.3","imdbVotes":"516,750","Awards":"Nominated for 3 Golden Globes. Another 4 nominations.","Metascore":"65","Released":"9 December 1983 (USA) ","Location":"485 West Matheson Drive, Key Biscayne, Florida, USA ","Actors":"Al Pacino, Michelle Pfeiffer, Steven Bauer ","Running_time":"PT170M / 2h 50min","Description":"Directed by Brian De Palma.  With Al Pacino, Michelle Pfeiffer, Steven Bauer, Mary Elizabeth Mastrantonio. In 1980 Miami, a determined Cuban immigrant takes over a drug cartel while succumbing to greed.","Rated":"R"}