{"imdbID":"tt0018515","Title":"Two Arabian Knights","Year":"1927","Director":"Lewis Milestone","Country":"USA","Language":"English","Production_Co":"The Caddo Company ","Runtime":"92 min (2004 alternate)","Cast":"William Boyd, Mary Astor, Louis Wolheim, Ian Keith, Michael Vavitch, Michael Visaroff, Boris Karloff, DeWitt Jennings, Nicholas Dunaew, Jean Vachon, David Cavendish","Plot":"Two American soldiers are captured by the Germans on the Western Front during World War One and escape a POW camp only to stumble into further life-threatening adventures when they come across an Arabian king's daughter while on the lam. Americans Sgt. Peter O'Gaffney and one of his soldiers, privileged \"pretty boy\" W. Daingerfield Phelps III (who is always drawing caricatures), are captured and interred at a POW camp in Northern Germany near the end of WWI. Their relationship has always been an antagonistic one based on what Phelps sees as O'Gaffney pushing him around. O'Gaffney's rank is despite being wanted by the police back home as a con man. It is because of these differences that their resulting friendship at camp is so unlikely, the friendship based on both having the nerve to attempt to escape. On a snow covered day, they do manage to escape, in part by stealing white robes to camouflage themselves against the snow. In their adventures and misadventures on the outside in trying to get to safety, those adventures which include being mistaken for Arab prisoners, they find themselves as stowaways on board a cargo ship headed to Arabia. It is there that they meet a beautiful Arab woman named Mirza, who they save ... Written by Huggo","Genre":"Comedy, Romance, Adventure","Keywords":"ship, escape, soldier, snow, arab","imdbRating":"7.0","imdbVotes":"511","Awards":"Won 1 Oscar.","Metascore":"","Released":"23 September 1927 (USA) ","Location":"San Bernardino Mountains, California, USA","Actors":"William Boyd, Mary Astor, Louis Wolheim ","Writer":"Wallace Smith (screen version), Cyril Gardner (screen version) | 3 more credits »","Running_time":"PT92M / 1h 32min","Description":"Directed by Lewis Milestone.  With William Boyd, Mary Astor, Louis Wolheim, Ian Keith. Two American soldiers are captured by the Germans on the Western Front during World War One and escape a POW camp only to stumble into further life-threatening adventures when they come across an Arabian king's daughter while on the lam.","Rated":"TV-G"}