{"imdbID":"tt0091064","Title":"The Fly","Year":"1986","Director":"David Cronenberg","Taglines":"Be afraid. Be very afraid. ","Certificate":"R | See all certifications »","Country":"USA, UK, Canada","Language":"English","Also_Known_As":"La mosca ","Budget":"$15,000,000 (estimated)","Gross":"$37,585,252 (USA)","Production_Co":"SLM Production Group, Brooksfilms ","Runtime":"96 min","Sound_Mix":"Dolby","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The first bar and the last bar of music on the soundtrack is taken from the last bar of music from Puccini's tragic opera 'Madama Butterfly'. Perhaps a reference to the deleted dream sequence of the heroine giving birth to a butterfly. See more »","Goofs":"The camera crew is reflected in the glass of the telepod. See more »","Crazy_Credits":"Jim Smash Issac Sir Guy of Hudson See more »","Cast":"Jeff Goldblum, Geena Davis, John Getz, Joy Boushel, Leslie Carlson, George Chuvalo, Michael Copeman, David Cronenberg, Carol Lazare, Shawn Hewitt","Plot":"A brilliant but eccentric scientist begins to transform into a giant man/fly hybrid after one of his experiments goes horribly wrong. Seth Brundle, a brilliant but eccentric scientist attempts to woo investigative journalist Veronica Quaife by offering her a scoop on his latest research in the field of matter transportation, which against all the expectations of the scientific establishment have proved successful. Up to a point. Brundle thinks he has ironed out the last problem when he successfully transports a living creature, but when he attempts to teleport himself a fly enters one of the transmission booths, and Brundle finds he is a changed man. This Science-Gone-Mad film is the source of the quotable quote \"Be afraid. Be very afraid.\" Written by Mark Thompson <mrt@oasis.icl.co.uk>","Genre":"Drama, Horror, Sci-Fi","Keywords":"psychotronic, cult film, scientist, eccentric scientist, experiment","imdbRating":"7.5","imdbVotes":"114,109","Awards":"Won 1 Oscar. Another 5 wins & 11 nominations.","Metascore":"79","Released":"15 August 1986 (USA) ","Location":"135 Liberty Steet, Toronto, Ontario, Canada ","Actors":"Jeff Goldblum, Geena Davis, John Getz ","Writer":"George Langelaan (short story), Charles Edward Pogue (screenplay) | 1 more credit »","Running_time":"PT96M / 1h 36min","Description":"Directed by David Cronenberg.  With Jeff Goldblum, Geena Davis, John Getz, Joy Boushel. A brilliant but eccentric scientist begins to transform into a giant man/fly hybrid after one of his experiments goes horribly wrong.","Rated":"R"}