{"imdbID":"tt0037280","Title":"Since You Went Away","Year":"1944","Country":"USA","Language":"English, Yiddish","Budget":"$2,400,000 (estimated)","Production_Co":"Vanguard Films, Selznick International Pictures ","Runtime":"130 min (1949 re-release) | 177 min (DVD) | 172 min (copyright length)","Cast":"Claudette Colbert, Jennifer Jones, Joseph Cotten, Shirley Temple, Monty Woolley, Lionel Barrymore, Robert Walker, Hattie McDaniel, Agnes Moorehead, Alla Nazimova, Albert Bassermann, Gordon Oliver, Keenan Wynn, Guy Madison, Craig Stevens","Plot":"While husband Tim is away during World War II, Anne Hilton copes with problems on the homefront. Taking in a lodger, Colonel Smollett, to help make ends meet and dealing with shortages and ... See full summary » While husband Tim is away during World War II, Anne Hilton copes with problems on the homefront. Taking in a lodger, Colonel Smollett, to help make ends meet and dealing with shortages and rationing are minor inconveniences compared to the love affair daughter Jane and the Colonel's grandson conduct. Written by Ron Kerrigan <mvg@whidbey.com>","Genre":"Drama, Romance, War","Keywords":"homefront, rationing, lodger, war effort, teenage girl","imdbRating":"7.6","imdbVotes":"3,279","Awards":"Won 1 Oscar. Another 8 nominations.","Metascore":"","Released":"20 July 1944 (USA) ","Location":"Church of the Angels - 1100 Avenue 64, Pasadena, California, USA ","Actors":"Claudette Colbert, Jennifer Jones, Joseph Cotten ","Director":"John Cromwell, Edward F. Cline (uncredited) | 2 more credits »","Writer":"Margaret Buell Wilder (book), Margaret Buell Wilder (adaptation) | 1 more credit »","Running_time":"PT177M / 2h 57min","Description":"Directed by John Cromwell, Edward F. Cline, Tay Garnett.  With Claudette Colbert, Jennifer Jones, Joseph Cotten, Shirley Temple. While husband Tim is away during World War II, Anne Hilton copes with problems on the homefront. Taking in a lodger, Colonel Smollett, to help make ends meet and dealing with shortages and rationing are minor inconveniences compared to the love affair daughter Jane and the Colonel's grandson conduct.","Rated":"APPROVED"}