{"imdbID":"tt0099674","Title":"The Godfather: Part III","Year":"1990","Director":"Francis Ford Coppola","Country":"USA","Language":"English, Italian, German, Latin","Budget":"$54,000,000 (estimated)","Gross":"$66,676,062 (USA)","Production_Co":"Paramount Pictures, Zoetrope Studios ","Runtime":"162 min | 170 min (The Godfather Trilogy 1901-1980 VHS Special Edition)","Cast":"Al Pacino, Diane Keaton, Talia Shire, Andy Garcia, Eli Wallach, Joe Mantegna, George Hamilton, Bridget Fonda, Sofia Coppola, Raf Vallone, Franc D'Ambrosio, Donal Donnelly, Richard Bright, Helmut Berger, Don Novello","Plot":"In the midst of trying to legitimize his business dealings in New York and Italy in 1979, aging Mafia don Michael Corleone seeks to avow for his sins while taking a young protégé under his wing. In the final instalment of the Godfather Trilogy, an aging Don Michael Corleone seeks to legitimize his crime family's interests and remove himself from the violent underworld but is kept back by the ambitions of the young. While he attempts to link the Corleone's finances with the Vatican, Michael must deal with the machinations of a hungrier gangster seeking to upset the existing Mafioso order and a young protoge's love affair with his daughter. Written by Keith Loh <loh@sfu.ca>","Genre":"Crime, Drama","Keywords":"repeating history, family relationships, mob hit, 1970s, opera","imdbRating":"7.6","imdbVotes":"257,128","Awards":"Nominated for 7 Oscars. Another 5 wins & 13 nominations.","Metascore":"60","Released":"25 December 1990 (USA) ","Location":"Palazzo Farnese, Caprarola, Viterbo, Lazio, Italy ","Actors":"Al Pacino, Diane Keaton, Andy Garcia ","Writer":"Mario Puzo, Francis Ford Coppola","Running_time":"PT162M / 2h 42min","Description":"Directed by Francis Ford Coppola.  With Al Pacino, Diane Keaton, Andy Garcia, Talia Shire. In the midst of trying to legitimize his business dealings in New York and Italy in 1979, aging Mafia don Michael Corleone seeks to avow for his sins while taking a young protégé under his wing.","Rated":"R"}