{"imdbID":"tt0040522","Title":"Ladri di biciclette","Year":"1948","Director":"Vittorio De Sica","Certificate":"See all certifications »","Country":"Italy","Language":"Italian","Also_Known_As":"Bicycle Thieves ","Budget":"$133,000 (estimated)","Opening_Weekend":"$11,845 (USA) (2 October 1998)","Gross":"$332,930 (USA) (3 September 1999)","Production_Co":"Produzioni De Sica (PDS), Produzioni De Sica ","":"Show detailed company contact information on IMDbPro »","Runtime":"89 min | 80 min (DVD edition)","Sound_Mix":"Mono","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Vittorio De Sica claimed he selected the actors for the characters of both Bruno and Antonio because of their walks. See more »","Cast":"Lamberto Maggiorani, Enzo Staiola, Lianella Carell, Gino Saltamerenda, Vittorio Antonucci, Giulio Chiari, Elena Altieri, Carlo Jachino, Michele Sakara, Emma Druetti, Fausto Guerzoni","Plot":"Set in Post-WWII Italy, a working class man's bicycle is stolen. He and his son set out to find it. Ricci, an unemployed man in the depressed post-WWII economy of Italy, gets at last a good job - for which he needs a bike - hanging up posters. But soon his bicycle is stolen. He and his son walk the streets of Rome, looking for the bicycle. Ricci finally manages to locate the thief but with no proof, he has to abandon his cause. But he and his son know perfectly well that without a bike, Ricci won't be able to keep his job. Written by jolusoma","Genre":"Drama","Keywords":"bicycle, job, thief, search, poster","imdbRating":"8.4","imdbVotes":"89,980","Awards":"Nominated for 1 Oscar. Another 18 wins.","Metascore":"","Released":"24 November 1948 (Italy) ","Location":"Citta Valmelaina, Via Salaria, Rome, Lazio, Italy ","Actors":"Lamberto Maggiorani, Enzo Staiola, Lianella Carell ","Writer":"Cesare Zavattini (story), Luigi Bartolini (novel) | 7 more credits »","Running_time":"PT89M / 1h 29min","Description":"Directed by Vittorio De Sica.  With Lamberto Maggiorani, Enzo Staiola, Lianella Carell, Gino Saltamerenda. Set in Post-WWII Italy, a working class man's bicycle is stolen. He and his son set out to find it.","Rated":"N/A"}