{"imdbID":"tt0054047","Title":"The Magnificent Seven","Year":"1960","Director":"John Sturges","Writer":"William Roberts (screenplay)","Taglines":"They were seven - And they fought like seven hundred! ","Certificate":"Not Rated | See all certifications »","Country":"USA","Language":"English, Spanish","Also_Known_As":"Die glorreichen Sieben ","Budget":"$2,000,000 (estimated)","Production_Co":"Mirisch Company, The, Alpha Productions, Alpha ","Runtime":"128 min","Sound_Mix":"Mono (Westrex Recording System)","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"In later years, Yul Brynner and Steve McQueen reconciled. McQueen, dying of cancer, called Brynner to thank him. \"What for?\" queried Brynner. \"You coulda had me kicked off the movie when I rattled you,\" replied McQueen, \"but you let me stay and that picture made me, so thanks\". Brynner told him, \"I am the king and you are the rebel prince: every bit as royal... and dangerous to cross.\" McQueen said, \"I had to make it up with Yul 'cos without him I wouldn't have been in that picture.\" See more »","Goofs":"The first man Calvera kills near the beginning of the movie has no wounds on his back after being shot and falling to the ground. When the villagers run to the body to look at the man, there are two wounds on his back. See more »","Crazy_Credits":"And Introducing Horst Buchholz See more »","Cast":"Yul Brynner, Eli Wallach, Steve McQueen, Charles Bronson, Robert Vaughn, Brad Dexter, James Coburn, Jorge Martínez de Hoyos, Vladimir Sokoloff, Rosenda Monteros, Rico Alaniz, Pepe Hern, Natividad Vacío, Mario Navarro, Danny Bravo","Plot":"An oppressed Mexican peasant village assembles seven gunfighters to help defend their homes. A bandit terrorizes a small Mexican farming village each year. Several of the village elders send three of the farmers into the United States to search for gunmen to defend them. They end up with seven, each of whom comes for a different reason. They must prepare the town to repulse an army of forty bandits who will arrive wanting food. Written by John Vogel <jlvogel@comcast.net>","Genre":"Action, Adventure, Western","Keywords":"friendship, remake, cowboy hat, village, bandit","imdbRating":"7.8","imdbVotes":"61,993","Awards":"Nominated for 1 Oscar. Another 1 win & 5 nominations.","Metascore":"","Released":"23 October 1960 (USA) ","Location":"State of Morelos, Mexico ","Actors":"Yul Brynner, Steve McQueen, Charles Bronson ","Running_time":"PT128M / 2h 8min","Description":"Directed by John Sturges.  With Yul Brynner, Steve McQueen, Charles Bronson, Eli Wallach. An oppressed Mexican peasant village assembles seven gunfighters to help defend their homes.","Rated":"NOT RATED"}