{"imdbID":"tt0056592","Title":"To Kill a Mockingbird","Year":"1962","Director":"Robert Mulligan","Taglines":"The most beloved Pulitzer Prize book now comes vividly alive on the screen! ","Certificate":"See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Matar a un ruiseñor ","Budget":"$2,000,000 (estimated)","Production_Co":"Universal International Pictures (UI), Pakula-Mulligan, Brentwood Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"129 min","Sound_Mix":"Mono (Westrex Recording System)","Color":"Black and White","Aspect_Ratio":"1.85 : 1","Trivia":"Eight actors from this movie appeared in Star Trek.John Megna as Dill Harris appeared in Star Trek: Miri (1966) as Little BoyFrank Overton as Sherrif Heck Tate appears in Star Trek: This Side of Paradise (1967) as Elias SandovalBrock Peters as Tom Robinson appears in Star Trek IV: The Voyage Home (1986) and Star Trek VI: The Undiscovered Country (1991) as Admiral Cartwright. He had a recurring role as Joseph Sisko on Star Trek: Deep Space Nine (1993).Paul Fix as Judge Taylor appeared in Star Trek: Where No Man Has Gone Before (1966) as Dr Mark PiperWilliam Windom as Mr. Gilmer appears in Star Trek: The Doomsday Machine (1967) as Commodore DeckerRichard Hale as Nathan Radley appears in Star Trek: The Paradise Syndrome (1968) as GoroNoble 'Kid' Chissell as Courtroom Spectator appears in Star Trek: The City on the Edge of Forever (1967) as WaiterKim Hamilton as Helen Robinson appears in Star Trek: The Next Generation: Final Mission (1990) as Songi See more »","Goofs":"After speaking with Mrs. Dubose, Scout, Jem and Dill walk with Atticus towards the Finch home. When the camera angle shifts, Dill is no longer walking with them, but is all the way on the other side of the house walking towards them. See more »","Crazy_Credits":"introducing / Mary Badham as Scout / Phillip Alford as Jem See more »","Cast":"Gregory Peck, John Megna, Frank Overton, Rosemary Murphy, Ruth White, Brock Peters, Estelle Evans, Paul Fix, Collin Wilcox Paxton, James Anderson, Alice Ghostley, Robert Duvall, William Windom, Crahan Denton, Richard Hale","Plot":"Atticus Finch, a lawyer in the Depression-era South, defends a black man against an undeserved rape charge, and his kids against prejudice. Based on Harper Lee's Pulitzer Prize winning book of 1961. Atticus Finch is a lawyer in the fictional town of Maycomb, a racially divided Alabama town, set in the early 1930s, and modeled after Monroeville where Harper Lee grew up. Finch agrees to defend a young black man who is accused of raping a white woman. Many of the townspeople try to get Atticus to pull out of the trial, but he decides to go ahead. How will the trial turn out - and will it effect any changes in racial attitudes in Maycomb? Written by Brian Daly <bd64kcmo@aol.com>","Genre":"Crime, Drama","Keywords":"trial, lawyer, alabama, 1930s, six year old","imdbRating":"8.4","imdbVotes":"205,662","Awards":"Won 3 Oscars. Another 10 wins & 16 nominations.","Metascore":"","Released":"16 March 1963 (USA) ","Location":"Courthouse Square, Backlot, Universal Studios - 100 Universal City Plaza, Universal City, California, USA ","Actors":"Gregory Peck, John Megna, Frank Overton ","Writer":"Harper Lee (based on her novel \"To Kill a Mockingbird\"), Horton Foote (screenplay)","Running_time":"PT129M / 2h 9min","Description":"Directed by Robert Mulligan.  With Gregory Peck, John Megna, Frank Overton, Rosemary Murphy. Atticus Finch, a lawyer in the Depression-era South, defends a black man against an undeserved rape charge, and his kids against prejudice.","Rated":"N/A"}