{"imdbID":"tt0043459","Title":"Decision Before Dawn","Year":"1951","Director":"Anatole Litvak","Country":"USA","Language":"English, French, German","Production_Co":"Twentieth Century Fox Film Corporation, Bavaria Film ","Runtime":"119 min","Cast":"Richard Basehart, Gary Merrill, Oskar Werner, Hildegard Knef, Dominique Blanchar, O.E. Hasse, Wilfried Seyferth, Hans Christian Blech, Helene Thimig, Robert Freitag, George Tyne, C.A. Amos, Harold Benedict, H.W. Briggs, D.G. Devine","Plot":"As the US Army approaches Nazi Germany, they recruit German prisoners to spy behind German lines. WWII is entering its last phase: Germany is in ruins, but does not yield. The US army lacks crucial knowledge about the German units operating on the opposite side of the Rhine, and decides to send two German prisoners to gather information. The scheme is risky: the Gestapo retains a terribly efficient network to identify and capture spies and deserters. Moreover, it is not clear that \"Tiger\", who does not mind any dirty work as long as the price is right, and war-weary \"Happy\", who might be easily betrayed by his feelings, are dependable agents. After Tiger and another American agent are successfully infiltrated, Happy is parachuted in Bavaria. His duty: find out the whereabouts of a powerful German armored unit moving towards the western front. Written by Eduardo Casais <eduardo.casais@research.nokia.com>","Genre":"Drama, War","Keywords":"germany, prisoner, spy, nazi germany, civilian","imdbRating":"7.4","imdbVotes":"1,629","Awards":"Nominated for 2 Oscars. Another 1 win & 2 nominations.","Metascore":"","Released":"25 February 1952 (Norway) ","Location":"Bavaria Studios, Bavariafilmplatz 7, Geiselgasteig, Grünwald, Bavaria, Germany ","Actors":"Richard Basehart, Gary Merrill, Oskar Werner ","Writer":"Peter Viertel (screenplay), George Howe (novel)","Running_time":"PT119M / 1h 59min","Description":"Directed by Anatole Litvak.  With Richard Basehart, Gary Merrill, Oskar Werner, Hildegard Knef. As the US Army approaches Nazi Germany, they recruit German prisoners to spy behind German lines.","Rated":"NOT RATED"}