{"imdbID":"tt0037096","Title":"Mrs. Parkington","Year":"1944","Director":"Tay Garnett","Country":"USA","Language":"English","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Cast":"Greer Garson, Walter Pidgeon, Edward Arnold, Agnes Moorehead, Cecil Kellaway, Gladys Cooper, Frances Rafferty, Tom Drake, Peter Lawford, Dan Duryea, Hugh Marlowe, Selena Royle, Fortunio Bonanova, Lee Patrick, St. Luke's Episcopal Church Choristers","Plot":"In this family saga, Mrs. Parkington recounts the story of her life, beginning as a hotel maid in frontier Nevada where she is swept off her feet by mine owner and financier Augustus ... See full summary » In this family saga, Mrs. Parkington recounts the story of her life, beginning as a hotel maid in frontier Nevada where she is swept off her feet by mine owner and financier Augustus Parkington. He moves them to New York, tries to remake her into a society woman, and establishes their home among the wealthiest of New York's high society. Family and social life is not always peaceful, however, and she guides us, in flashbacks, through the rises and falls of the Parkington family fortunes. Written by Eric Wees <eric_wees@ccmail.chin.doc.ca>","Genre":"Drama, Romance","Keywords":"nevada, maid, humiliation, hotel, flashback","imdbRating":"7.0","imdbVotes":"912","Awards":"Nominated for 2 Oscars. Another 1 win.","Metascore":"","Released":"November 1944 (USA) ","Location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA ","Actors":"Greer Garson, Walter Pidgeon, Edward Arnold ","Writer":"Robert Thoeren (screenplay), Polly James (screenplay) | 1 more credit »","Running_time":"PT124M / 2h 4min","Description":"Directed by Tay Garnett.  With Greer Garson, Walter Pidgeon, Edward Arnold, Agnes Moorehead. In this family saga, Mrs. Parkington recounts the story of her life, beginning as a hotel maid in frontier Nevada where she is swept off her feet by mine owner and financier Augustus Parkington. He moves them to New York, tries to remake her into a society woman, and establishes their home among the wealthiest of New York's high society. Family and social life is not always peaceful, however, and...","Rated":"NOT RATED"}