{"imdbID":"tt0030993","Title":"You Can't Take It With You","Year":"1938","Director":"Frank Capra","Country":"USA","Language":"English, Russian","Budget":"$1,644,736 (estimated)","Production_Co":"Columbia Pictures Corporation ","Runtime":"126 min","Cast":"Jean Arthur, Lionel Barrymore, James Stewart, Edward Arnold, Mischa Auer, Ann Miller, Spring Byington, Samuel S. Hinds, Donald Meek, H.B. Warner, Halliwell Hobbes, Dub Taylor, Mary Forbes, Lillian Yarbo, Eddie 'Rochester' Anderson","Plot":"A man from a family of rich snobs becomes engaged to a woman from a good-natured but decidedly eccentric family. The stenographer Alice Sycamore is in love with her boss Tony Kirby, who is the vice-president of the powerful company owned by his greedy father Anthony P. Kirby. Kirby Sr. is dealing a monopoly in the trade of weapons, and needs to buy one last house in a twelve block area owned by Alice's grandparent Martin Vanderhof. However, Martin is the patriarch of an anarchic and eccentric family where the members do not care for money but for having fun and making friends. When Tony proposes Alice, she states that it would be mandatory to introduce her simple and lunatic family to the snobbish Kirbys, and Tone decides to visit Alice with his parents one day before the scheduled. There is an inevitable clash of classes and lifestyles, the Kirbys spurn the Sycamores and Alice breaks with Tony, changing the lives of the Kirby family. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Comedy, Drama, Romance","Keywords":"house, stenographer, love, eccentric, friend","imdbRating":"8.0","imdbVotes":"17,334","Awards":"Won 2 Oscars. Another 6 nominations.","Metascore":"","Released":"3 November 1938 (France) ","Location":"Columbia/Sunset Gower Studios - 1438 N. Gower Street, Hollywood, Los Angeles, California, USA ","Actors":"Jean Arthur, James Stewart, Lionel Barrymore ","Writer":"Robert Riskin (screen play), George S. Kaufman (based upon the play by) | 1 more credit »","Running_time":"PT126M / 2h 6min","Description":"Directed by Frank Capra.  With Jean Arthur, James Stewart, Lionel Barrymore, Edward Arnold. A man from a family of rich snobs becomes engaged to a woman from a good-natured but decidedly eccentric family.","Rated":"APPROVED"}