{"imdbID":"tt0043265","Title":"The African Queen","Year":"1951","Director":"John Huston","Country":"USA, UK","Language":"English, German, Swahili","Production_Co":"Romulus Films, Horizon Pictures ","Runtime":"105 min","Cast":"Humphrey Bogart, Katharine Hepburn, Robert Morley, Peter Bull, Theodore Bikel, Walter Gotell, Peter Swanwick, Richard Marner","Plot":"In Africa during WWI, a gin-swilling riverboat captain is persuaded by a strait-laced missionary to use his boat to attack an enemy warship. September 1914, news reaches the colony German Eastern Africa that Germany is at war, so Reverend Samuel Sayer became a hostile foreigner. German imperial troops burn down his mission; he is beaten and dies of fever. His well-educated, snobbish sister Rose Sayer buries him and leaves by the only available transport, the dilapidated river steamboat 'African Queen' of grumpy Charlie Allnut. As if a long difficult journey without any comfort weren't bad enough for such odd companions, she is determined to find a way to do their bit for the British war effort (and avenge her brother) and aims high, as God is obviously on their side: construct their own equipment, a torpedo and the converted steamboat, to take out a huge German warship, the Louisa, which is hard to find on the giant lake and first of all to reach, in fact as daunting an expedition as anyone attempted since the late adventurous explorer John Speakes, but she presses till Charlie accepts to steam up the Ulana, about to brave... Written by KGF Vissers","Genre":"Adventure, Drama, Romance","Keywords":"german, river, africa, reverend, african","imdbRating":"7.9","imdbVotes":"57,205","Awards":"Won 1 Oscar. Another 2 wins & 9 nominations.","Metascore":"","Released":"20 February 1952 (USA) ","Location":"Isleworth Studios, London Road, Isleworth, Middlesex, England, UK ","Actors":"Humphrey Bogart, Katharine Hepburn, Robert Morley ","Writer":"C.S. Forester (novel), James Agee (adapted for the screen by) | 1 more credit »","Running_time":"PT105M / 1h 45min","Description":"Directed by John Huston.  With Humphrey Bogart, Katharine Hepburn, Robert Morley, Peter Bull. In Africa during WWI, a gin-swilling riverboat captain is persuaded by a strait-laced missionary to use his boat to attack an enemy warship.","Rated":"PG"}