{"imdbID":"tt0049730","Title":"The Searchers","Year":"1956","Director":"John Ford","Taglines":"The story that sweeps from the great Southwest to the Canadian border in VistaVision. ","Certificate":"Approved | See all certifications »","Country":"USA","Language":"English, Navajo, Spanish","Also_Known_As":"Más corazón que odio ","Budget":"$3,750,000 (estimated)","Production_Co":"Warner Bros., C.V. Whitney Pictures ","Runtime":"119 min","Sound_Mix":"Mono (RCA Sound Recording)","Color":"Color (Technicolor)","Aspect_Ratio":"1.75 : 1","Trivia":"John Ford was willing to allow John Wayne to back out of this movie in order to star in Seven Men from Now (1956). Wayne chose to star in this film instead. See more »","Goofs":"In the buffalo stampede, where Ethan and Martin are supposed to be alone, there are horsemen (wranglers?) riding in the background of the third and fourth shot after the first buffalo falls. See more »","Crazy_Credits":"This Warner Brothers film was said to be in VistaVision, according to the credits - this may be the only Warner film in VistaVision. See more »","Cast":"John Wayne, Jeffrey Hunter, Vera Miles, Ward Bond, Natalie Wood, John Qualen, Olive Carey, Henry Brandon, Ken Curtis, Harry Carey Jr., Antonio Moreno, Hank Worden, Beulah Archuletta, Walter Coy, Dorothy Jordan","Plot":"A Civil War veteran embarks on a journey to rescue his niece from an Indian tribe. Ethan Edwards, returned from the Civil War to the Texas ranch of his brother, hopes to find a home with his family and to be near the woman he obviously but secretly loves. But a Comanche raid destroys these plans, and Ethan sets out, along with his 1/8 Indian nephew Martin, on a years-long journey to find the niece kidnapped by the Indians under Chief Scar. But as the quest goes on, Martin begins to realize that his uncle's hatred for the Indians is beginning to spill over onto his now-assimilated niece. Martin becomes uncertain whether Ethan plans to rescue Debbie...or kill her. Written by Jim Beaver <jumblejim@prodigy.net>","Genre":"Adventure, Drama, Western","Keywords":"indian, rescue, indian war, hatred, civil war veteran","imdbRating":"8.0","imdbVotes":"60,190","Awards":"Won 1 Golden Globe. Another 2 wins & 2 nominations.","Metascore":"","Released":"13 March 1956 (USA) ","Location":"Kayenta, Arizona, USA ","Actors":"John Wayne, Jeffrey Hunter, Vera Miles ","Writer":"Frank S. Nugent (screenplay), Alan Le May (from the novel by) (as Alan LeMay)","Running_time":"PT119M / 1h 59min","Description":"Directed by John Ford.  With John Wayne, Jeffrey Hunter, Vera Miles, Ward Bond. A Civil War veteran embarks on a journey to rescue his niece from an Indian tribe.","Rated":"APPROVED"}