{"imdbID":"tt0058708","Title":"The Unsinkable Molly Brown","Year":"1964","Director":"Charles Walters","Country":"USA","Language":"English","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"128 min","Cast":"Debbie Reynolds, Harve Presnell, Ed Begley, Jack Kruschen, Hermione Baddeley, Vassili Lambrinos, Fred Essler, Harvey Lembeck, Lauren Gilbert, Kathryn Card, Hayden Rorke, Harry Holcombe, Amy Douglass, George Mitchell, Martita Hunt","Plot":"Molly is an uneducated, poor, mountain girl who leaves her mountain cabin in search of a wealthy husband, respect and a better life. Majestic mountains are in the background and a waterfall in the foreground. Is that a canoe on the river? No it's a cradle with a baby. The buoyant Molly Brown has survived the first crisis of her life -- a flood. Sixteen years later she sets out to make her way in the world. Can she sing and play the piano? She assures the Leadville saloon keeper that she can and learns quickly. Soon she is the bride of Johnny Brown, who in a few years will be able to replace the original cigar wrapper wedding ring with a replica in gold and gemstones. But it takes more than a few million dollars to be accepted by Denver society. The Browns head for Europe and bring a few crowned heads back to Denver for a party that turns into a ballroom brawl. Molly goes to Europe alone, returning on the Titanic. She didn't survive a flood as a baby for the story to end here. Written by Dale O'Connor <daleoc@interaccess.com>","Genre":"Biography, Comedy, Musical","Keywords":"titanic, inscribed ring, based on stage musical, wealth, titanic survivor","imdbRating":"6.8","imdbVotes":"2,335","Awards":"Nominated for 6 Oscars. Another 5 wins & 7 nominations.","Metascore":"","Released":"11 June 1964 (USA) ","Location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA ","Actors":"Debbie Reynolds, Harve Presnell, Ed Begley ","Writer":"Helen Deutsch, Richard Morris (play)","Running_time":"PT128M / 2h 8min","Description":"Directed by Charles Walters.  With Debbie Reynolds, Harve Presnell, Ed Begley, Jack Kruschen. Molly is an uneducated, poor, mountain girl who leaves her mountain cabin in search of a wealthy husband, respect and a better life.","Rated":"APPROVED"}