{"imdbID":"tt0057187","Title":"Irma la Douce","Year":"1963","Director":"Billy Wilder","Country":"USA","Language":"English","Budget":"$5,000,000 (estimated)","Production_Co":"Mirisch Corporation, The, Phalanx Productions ","Runtime":"147 min","Cast":"Jack Lemmon, Shirley MacLaine, Lou Jacobi, Bruce Yarnell, Herschel Bernardi, Hope Holiday, Joan Shawlee, Grace Lee Whitney, Paul Dubov, Howard McNear, Cliff Osmond, Diki Lerner, Herb Jones, Ruth Earl, Jane Earl","Plot":"In Paris, an ex-cop falls in love with a prostitute, and tries to get her out of that life by paying for all of her time. Not so easy... Naive, by the book French police officer Nester Patou, is transferred to the Red Light district. Upon witnessing what must be a brothel, he calls the station and organizes a raid, transporting all the 'ladies' to the jail. This unfortunately disrupts the well organized system of the police and the Pimps union. Not to mention inadvertently netting his station superior at the brothel. Fired, he goes to a bar to drink, is befriended by Irma, beats up her pimp, and finds he is now Irma's new pimp. Nester's doesn't like the thought of his girl seeing other men, so comes up with a plan. Written by Brian W Martz <B.Martz@Genie.com>","Genre":"Comedy, Romance","Keywords":"pimp, police, red light district, police officer, prostitute","imdbRating":"7.4","imdbVotes":"12,445","Awards":"Won 1 Oscar. Another 5 wins & 7 nominations.","Metascore":"","Released":"5 June 1963 (USA) ","Location":"Samuel Goldwyn Studios - 7200 Santa Monica Boulevard, West Hollywood, California, USA","Actors":"Jack Lemmon, Shirley MacLaine, Lou Jacobi ","Writer":"Alexandre Breffort (play), Billy Wilder | 1 more credit »","Running_time":"PT147M / 2h 27min","Description":"Directed by Billy Wilder.  With Jack Lemmon, Shirley MacLaine, Lou Jacobi, Bruce Yarnell. In Paris, an ex-cop falls in love with a prostitute, and tries to get her out of that life by paying for all of her time. Not so easy...","Rated":"UNRATED"}