{"imdbID":"tt0072684","Title":"Barry Lyndon","Year":"1975","Director":"Stanley Kubrick","Taglines":"After reaching the top, where can you go...except down? ","Certificate":"PG | See all certifications »","Country":"UK, USA, Ireland","Language":"English, German, French","Also_Known_As":"Beri Lindon ","Budget":"$11,000,000 (estimated)","Gross":"SEK 2,016,185 (Sweden)","Production_Co":"Peregrine, Hawk Films, Warner Bros. ","":"Show detailed company contact information on IMDbPro »","Runtime":"184 min","Sound_Mix":"Mono","Color":"Color (Metrocolor)| Color (Eastmancolor)","Aspect_Ratio":"1.66 : 1","Trivia":"Warner Bros. would only finance the film on the condition that Stanley Kubrick cast a Top 10 Box Office Star (from the annual Quigley Poll of Top Money-Making Stars) in the lead. Ryan O'Neal was the #2 Box Office Star of 1973, topped only by Clint Eastwood. Ironically, this was his only time in the top 10, as exhibitors - who voted the list - attributed the success of Love Story (1970) (one of the top grossers at the time) to O'Neal's co-star Ali MacGraw, and named her to the list in 1971. The other top 10 stars were 3. Steve McQueen, 4. Burt Reynolds, 5. Robert Redford, 6. Barbra Streisand, 7. Paul Newman, 8. Charles Bronson, 9. John Wayne, and 10. Marlon Brando. Thus, the only actors Kubrick could cast in the role and receive Warners' financial backing for his decidedly noncommercial project were O'Neal and Redford. The other Top 10 stars were too old or inappropriate for the role (particularly in the case of #6, who would not assay a \"male\" role until Yentl (1983) in 1983). Both O'Neal and Redford were Irish, both had box office appeal, and both were young enough to play the role, though Redford was five years older than the thirty-two-year old O'Neal in 1973. At the time, O'Neal was the bigger star, having also garnered a Best Actor Oscar nomination for \"Love Story\". However, Kubrick apparently offered the part to Redford first, but he turned it down, and thus O'Neal was cast. Redford's star would soon eclipse O'Neal's, as he would zoom to the top of the Box Office charts the next year after the successes of The Sting (1973) and The Way We Were (1973), clocking in at #1 in 1974, a position he also would anchor in 1975 and 1976. O'Neal dropped off the Top 10 list after 1973. His '73 appearance to this day, represents his sole appearance on that premier barometer of box office success for a thespian. See more »","Goofs":"The drinking cup in the hand of Seamus Feeny, when Barry first meets Captain Feeny and Seamus at the inn. See more »","Cast":"Ryan O'Neal, Marisa Berenson, Patrick Magee, Hardy Krüger, Steven Berkoff, Gay Hamilton, Marie Kean, Diana Körner, Murray Melvin, Frank Middlemass, André Morell, Arthur O'Sullivan, Godfrey Quigley, Leonard Rossiter, Philip Stone","Plot":"An Irish rogue wins the heart of a rich widow and assumes her dead husband's aristocratic position in 18th-century England. In the Eighteenth Century, in a small village in Ireland, Redmond Barry is a young farm boy in love with his cousin Nora Brady. When Nora gets engaged to the British Captain John Quin, Barry challenges him to a duel of pistols. He wins and escapes to Dublin but is robbed on the road. Without an alternative, Barry joins the British Army to fight in the Seven Years War. He deserts and is forced to join the Prussian Army where he saves the life of his captain and becomes his protégé and spy of the Irish gambler Chevalier de Balibari. He helps Chevalier and becomes his associate until he decides to marry the wealthy Lady Lyndon. They move to England and Barry, in his obsession of nobility, dissipates her fortune and makes a dangerous and revengeful enemy. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Adventure, Drama, History","Keywords":"rise and fall, rural setting, wealth, england, 18th century","imdbRating":"8.1","imdbVotes":"97,224","Awards":"Won 4 Oscars. Another 13 wins & 13 nominations.","Metascore":"","Released":"18 December 1975 (USA) ","Location":"Royal Victoria Park, Bath, Somerset, England, UK ","Actors":"Ryan O'Neal, Marisa Berenson, Patrick Magee ","Writer":"Stanley Kubrick (written for the screen by), William Makepeace Thackeray (novel)","Running_time":"PT184M / 3h 4min","Description":"Directed by Stanley Kubrick.  With Ryan O'Neal, Marisa Berenson, Patrick Magee, Hardy Krüger. An Irish rogue wins the heart of a rich widow and assumes her dead husband's aristocratic position in 18th-century England.","Rated":"PG"}