{"imdbID":"tt0073486","Title":"One Flew Over the Cuckoo's Nest","Year":"1975","Director":"Milos Forman","Taglines":"If he's crazy, what does that make you?","Certificate":"See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Atrapado sin salida ","Budget":"$4,400,000 (estimated)","Gross":"$112,000,000 (USA)","Production_Co":"Fantasy Films ","":"Show detailed company contact information on IMDbPro »","Runtime":"133 min","Sound_Mix":"Mono","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"During most of the film's shooting, William Redfield was ill. He died several months after the film was completed. See more »","Goofs":"When Cheswick is spilling the drink from the bottle to the jar, it is colorless. But when he is dumping the drink, with the hose, in the mouth of the patients, it is red. See more »","Crazy_Credits":"The cast is credited in alphabetical order in the end credits, except for Brad Dourif, who is listed last as follows: \"and introducing / Brad Dourif as Billy Bibbit\". See more »","Cast":"Michael Berryman, Peter Brocco, Dean R. Brooks, Alonzo Brown, Scatman Crothers, Mwako Cumbuka, Danny DeVito, William Duell, Josip Elic, Lan Fendors, Louise Fletcher, Nathan George, Ken Kenny, Mel Lambert, Sydney Lassick","Plot":"A criminal pleads insanity after getting into trouble again and once in the mental institution rebels against the oppressive nurse and rallies up the scared patients. McMurphy has a criminal past and has once again gotten himself into trouble and is sentenced by the court. To escape labor duties in prison, McMurphy pleads insanity and is sent to a ward for the mentally unstable. Once here, McMurphy both endures and stands witness to the abuse and degradation of the oppressive Nurse Ratched, who gains superiority and power through the flaws of the other inmates. McMurphy and the other inmates band together to make a rebellious stance against the atrocious Nurse. Written by Jacob Oberfrank","Genre":"Drama","Keywords":"mental institution, mental illness, 1960s, nurse, patient","imdbRating":"8.7","imdbVotes":"654,681","Awards":"Won 5 Oscars. Another 30 wins & 13 nominations.","Metascore":"79","Released":"21 November 1975 (USA) ","Location":"Depoe Bay, Oregon, USA ","Actors":"Jack Nicholson, Louise Fletcher, Michael Berryman ","Writer":"Lawrence Hauben (screenplay), Bo Goldman (screenplay) | 2 more credits »","Running_time":"PT133M / 2h 13min","Description":"Directed by Milos Forman.  With Jack Nicholson, Louise Fletcher, Michael Berryman, Peter Brocco. A criminal pleads insanity after getting into trouble again and once in the mental institution rebels against the oppressive nurse and rallies up the scared patients.","Rated":"N/A"}