{"imdbID":"tt0064116","Title":"Once Upon a Time in the West","Year":"1968","Director":"Sergio Leone","Taglines":"There were three men in her life. One to take her... one to love her... and one to kill her.","Country":"Italy, USA, Spain","Language":"English, Spanish, Italian","Also_Known_As":"Once Upon a Time in the West ","Budget":"$5,000,000 (estimated)","Production_Co":"Rafran Cinematografica, Finanzia San Marco, Paramount Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"165 min (international) | 137 min (1970) | 145 min (theatrical)","Sound_Mix":"Mono | Dolby (2003 DVD release)","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"\"Premiere\" Magazine voted this as one of \"The 25 Most Dangerous Movies\". See more »","Goofs":"During the final flashback (\"Keep your lovin' brother happy\") from shot to shot the harmonica changes back and forth from clean and undamaged to dented and dirty. See more »","Crazy_Credits":"Sergio Leone's director credit swings down in an arc as if to stop the train. See more »","Cast":"Claudia Cardinale, Henry Fonda, Jason Robards, Charles Bronson, Gabriele Ferzetti, Paolo Stoppa, Woody Strode, Jack Elam, Keenan Wynn, Frank Wolff, Lionel Stander","Plot":"Epic story of a mysterious stranger with a harmonica who joins forces with a notorious desperado to protect a beautiful widow from a ruthless assassin working for the railroad. Story of a young woman, Mrs. McBain, who moves from New Orleans to frontier Utah, on the very edge of the American West. She arrives to find her new husband and family slaughtered, but by whom? The prime suspect, coffee-lover Cheyenne, befriends her and offers to go after the real killer, assassin gang leader Frank, in her honor. He is accompanied by Harmonica, a man already on a quest to get even. Written by DrGoodBeat / edited by statmanjeff","Genre":"Western","Keywords":"harmonica, woman in bathtub, killing, gun, gang","imdbRating":"8.6","imdbVotes":"207,792","Awards":"4 wins & 5 nominations.","Metascore":"80","Released":"21 December 1968 (Italy) ","Location":"Bavispe, Sonora, Mexico ","Actors":"Henry Fonda, Charles Bronson, Claudia Cardinale ","Writer":"Sergio Donati (screenplay), Sergio Leone (screenplay) | 3 more credits »","Running_time":"PT175M / 2h 55min","Description":"Directed by Sergio Leone.  With Henry Fonda, Charles Bronson, Claudia Cardinale, Jason Robards. Epic story of a mysterious stranger with a harmonica who joins forces with a notorious desperado to protect a beautiful widow from a ruthless assassin working for the railroad.","Rated":"PG-13"}