{"imdbID":"tt0033467","Title":"Citizen Kane","Year":"1941","Director":"Orson Welles","Taglines":"It's Terrific! ","Certificate":"See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Ciudadano Kane ","Budget":"$686,033 (estimated)","Production_Co":"RKO Radio Pictures, Mercury Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"119 min","Sound_Mix":"Mono (RCA Sound System)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"In the scene where Kane and his entourage set off for the beach from Xanadu, large birds are seen flying across the background. In fact, the background was lifted from a science fiction film to reduce costs, and the birds are, in fact, pterodactyls. The prehistoric beasties were probably lifted from either King Kong (1933) or The Son of Kong (1933). See more »","Goofs":"One of the posters advertising Susan Alexander's opera appearance shown in the newsreel misspells her first name \"Suzan\". See more »","Crazy_Credits":"The end credits show previous scenes from the film showcasing the Mercury Theatre performers. See more »","Cast":"Joseph Cotten, Dorothy Comingore, Agnes Moorehead, Ruth Warrick, Ray Collins, Erskine Sanford, Everett Sloane, William Alland, Paul Stewart, George Coulouris, Fortunio Bonanova, Gus Schilling, Philip Van Zandt, Georgia Backus, Harry Shannon","Plot":"Following the death of a publishing tycoon, news reporters scramble to discover the meaning of his final utterance. A group of reporters are trying to decipher the last word ever spoken by Charles Foster Kane, the millionaire newspaper tycoon: \"Rosebud.\" The film begins with a news reel detailing Kane's life for the masses, and then from there, we are shown flashbacks from Kane's life. As the reporters investigate further, the viewers see a display of a fascinating man's rise to fame, and how he eventually fell off the top of the world. Written by Zack H.","Genre":"Drama, Mystery","Keywords":"death, deathbed, drunkenness, divorce, attempted suicide","imdbRating":"8.4","imdbVotes":"287,698","Awards":"Won 1 Oscar. Another 7 wins & 12 nominations.","Metascore":"","Released":"5 September 1941 (USA) ","Location":"California, USA ","Actors":"Orson Welles, Joseph Cotten, Dorothy Comingore ","Writer":"Herman J. Mankiewicz (original screen play), Orson Welles (original screen play)","Running_time":"PT119M / 1h 59min","Description":"Directed by Orson Welles.  With Orson Welles, Joseph Cotten, Dorothy Comingore, Agnes Moorehead. Following the death of a publishing tycoon, news reporters scramble to discover the meaning of his final utterance.","Rated":"N/A"}