{"imdbID":"tt0046816","Title":"The Caine Mutiny","Year":"1954","Director":"Edward Dmytryk","Country":"USA","Language":"English","Budget":"$2,000,000 (estimated)","Gross":"$21,750,000 (USA)","Production_Co":"Columbia Pictures Corporation ","Runtime":"124 min","Cast":"Humphrey Bogart, José Ferrer, Van Johnson, Fred MacMurray, Robert Francis, May Wynn, Tom Tully, E.G. Marshall, Arthur Franz, Lee Marvin, Warner Anderson, Claude Akins, Katherine Warren, Jerry Paris, Steve Brodie","Plot":"When a US Naval captain shows signs of mental instability that jeopardizes the ship, the first officer relieves him of command and faces court martial for mutiny. During the Second World War, onboard a small insignificant ship in the U.S. Pacific Fleet, an event occurs unlike any that the United States Navy has ever experianced. A Ship's Captain is removed from his command by his Executive Officer in an apparent outright act of mutiny. As the trial of the mutineers unfold, it is then learned that the Captain of the ship was mentally unstable, perhaps even insane. The Navy must then decide: was the Caine Mutiny a criminal act? Or an act of courage to save a ship from destruction at the hands of her Captain. Written by Anthony Hughes <husnock31@hotmail.com>","Genre":"Drama, War","Keywords":"mutiny, ship captain, court martial, united states navy, naval","imdbRating":"7.9","imdbVotes":"19,631","Awards":"Nominated for 7 Oscars. Another 6 nominations.","Metascore":"","Released":"24 June 1954 (USA) ","Location":"Ahwanee Hotel, Yosemite Valley, Yosemite National Park, California, USA ","Actors":"Humphrey Bogart, José Ferrer, Van Johnson ","Writer":"Stanley Roberts (screen play), Michael Blankfort (additional dialogue) | 1 more credit »","Running_time":"PT124M / 2h 4min","Description":"Directed by Edward Dmytryk.  With Humphrey Bogart, José Ferrer, Van Johnson, Fred MacMurray. When a US Naval captain shows signs of mental instability that jeopardizes the ship, the first officer relieves him of command and faces court martial for mutiny.","Rated":"APPROVED"}