{"imdbID":"tt0057578","Title":"This Sporting Life","Year":"1963","Director":"Lindsay Anderson","Country":"UK","Language":"English","Production_Co":"Independent Artists, Julian Wintle/Leslie Parkyn Productions ","Runtime":"134 min","Cast":"Richard Harris, Rachel Roberts, Alan Badel, William Hartnell, Colin Blakely, Vanda Godsell, Anne Cunningham, Jack Watson, Arthur Lowe, Harry Markham, George Sewell, Leonard Rossiter, Katherine Parr, Bernadette Benson, Andrew Nolan","Plot":"Despite success on the field, a rising rugby star senses the emerging emptiness of his life as his inner angst begins to materialize through aggression and brutality, so he attempts to woo his landlady in hopes of finding reason to live. In Northern England in the early 1960s, Frank Machin is mean, tough and ambitious enough to become an immediate star in the rugby league team run by local employer Weaver. Machin lodges with Mrs Hammond, whose husband was killed in an accident at Weaver's, but his impulsive and angry nature stop him from being able to reach her as he would like. He becomes increasingly frustrated with his situation, and this is not helped by the more straightforward enticements of Mrs Weaver. Written by Jeremy Perkins <jwp@aber.ac.uk>","Genre":"Drama, Sport","Keywords":"rugby, rugby league, character says you don't understand at all, character says i've got no need for them, british new wave","imdbRating":"7.9","imdbVotes":"4,359","Awards":"Nominated for 2 Oscars. Another 3 wins & 8 nominations.","Metascore":"","Released":"January 1963 (UK) ","Location":"St Paul's Church, Back Lane, Drighlington, West Yorkshire, England, UK ","Actors":"Richard Harris, Rachel Roberts, Alan Badel ","Writer":"David Storey (based on the novel by), David Storey (screenplay)","Running_time":"PT134M / 2h 14min","Description":"Directed by Lindsay Anderson.  With Richard Harris, Rachel Roberts, Alan Badel, William Hartnell. Despite success on the field, a rising rugby star senses the emerging emptiness of his life as his inner angst begins to materialize through aggression and brutality, so he attempts to woo his landlady in hopes of finding reason to live.","Rated":"NOT RATED"}