{"imdbID":"tt0054354","Title":"Sunrise at Campobello","Year":"1960","Director":"Vincent J. Donehue","Country":"USA","Language":"English, French","Production_Co":"Dore Schary Productions ","Runtime":"144 min","Cast":"Ralph Bellamy, Greer Garson, Hume Cronyn, Jean Hagen, Ann Shoemaker, Alan Bunce, Tim Considine, Zina Bethune, Frank Ferguson, Pat Close, Robin Warga, Tom Carty, Lyle Talbot, David White, Walter Sande","Plot":"The story of Franklin Roosevelt's bout with polio at age 40 in 1921 and how his family (and especially wife Eleanor) cope with his illness. From being stricken while vacationing at ... See full summary » The story of Franklin Roosevelt's bout with polio at age 40 in 1921 and how his family (and especially wife Eleanor) cope with his illness. From being stricken while vacationing at Campobello to his triumphant nominating speech for Al Smith's presidency in 1924, the story follows the various influences on his life and his determination to recover - based on the award winning Broadway play of the same name. Written by Ed Lorusso","Genre":"Biography, Drama","Keywords":"paralysis, polio, disease, convention, 1920s","imdbRating":"7.1","imdbVotes":"766","Awards":"Nominated for 4 Oscars. Another 3 wins & 3 nominations.","Metascore":"","Released":"28 September 1960 (USA) ","Location":"FDR estate, Hyde Park, New York, USA ","Actors":"Ralph Bellamy, Greer Garson, Hume Cronyn ","Writer":"Dore Schary (screenplay), Dore Schary (story)","Running_time":"PT144M / 2h 24min","Description":"Directed by Vincent J. Donehue.  With Ralph Bellamy, Greer Garson, Hume Cronyn, Jean Hagen. The story of Franklin Roosevelt's bout with polio at age 40 in 1921 and how his family (and especially wife Eleanor) cope with his illness. From being stricken while vacationing at Campobello to his triumphant nominating speech for Al Smith's presidency in 1924, the story follows the various influences on his life and his determination to recover - based on the award winning Broadway play of the ...","Rated":"NOT RATED"}