{"imdbID":"tt0074811","Title":"The Tenant","Year":"1976","Director":"Roman Polanski","Taglines":"No one does it to you like Roman Polanski. ","Certificate":"R | See all certifications »","Country":"France","Language":"French, English","Also_Known_As":"The Tenant ","Production_Co":"Marianne Productions ","Runtime":"126 min","Sound_Mix":"Mono","Color":"Color (Eastmancolor)","Aspect_Ratio":"1.85 : 1","Trivia":"One of numerous screen-writing collaborations of scriptwriter Gérard Brach and director Roman Polanski. See more »","Goofs":"When Trelkovsky is unpacking as he moves into the apartment, a crew member is reflected in the small mirror adjacent to the kitchen sink. Two crew members are then reflected in the armoire's mirror as Trelkovsky opens it. See more »","Crazy_Credits":"The film has no end credits; only the Paramount logo. See more »","Cast":"Roman Polanski, Isabelle Adjani, Melvyn Douglas, Jo Van Fleet, Bernard Fresson, Lila Kedrova, Claude Dauphin, Claude Piéplu, Rufus, Romain Bouteille, Jacques Monod, Patrice Alexsandre, Jean-Pierre Bagot, Josiane Balasko, Michel Blanc","Plot":"A bureaucrat rents a Paris apartment where he finds himself drawn into a rabbit hole of dangerous paranoia. In Paris, the shy bureaucrat Trelkovsky rents an old apartment without bathroom where the previous tenant, the Egyptologist Simone Choule, committed suicide. The unfriendly concierge (Shelley Winters) and the tough landlord Mr. Zy establish stringent rules of behavior and Trelkovsky feels ridden by his neighbors. Meanwhile he visits Simone in the hospital and befriends her girlfriend Stella. After the death of Simone, Trelkovsky feels obsessed for her and believes his landlord and neighbors are plotting a scheme to force him to also commit suicide. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Thriller","Keywords":"apartment, suicide, concierge, paranoia, landlord tenant relationship","imdbRating":"7.8","imdbVotes":"26,547","Awards":"2 nominations.","Metascore":"","Released":"11 June 1976 (USA) ","Location":"Rue la Bruyère, Paris 9, Paris, France ","Actors":"Roman Polanski, Isabelle Adjani, Melvyn Douglas ","Writer":"Roland Topor (novel), Gérard Brach (screenplay) | 1 more credit »","Running_time":"PT126M / 2h 6min","Description":"Directed by Roman Polanski.  With Roman Polanski, Isabelle Adjani, Melvyn Douglas, Jo Van Fleet. A bureaucrat rents a Paris apartment where he finds himself drawn into a rabbit hole of dangerous paranoia.","Rated":"R"}