{"imdbID":"tt0071562","Title":"The Godfather: Part II","Year":"1974","Director":"Francis Ford Coppola","Certificate":"See all certifications »","Country":"USA","Language":"English, Italian, Spanish, Latin, Sicilian","Also_Known_As":"El padrino II ","Budget":"$13,000,000 (estimated)","Gross":"$57,300,000 (USA)","Production_Co":"Paramount Pictures, The Coppola Company ","":"Show detailed company contact information on IMDbPro »","Runtime":"202 min | 220 min (The Godfather Trilogy 1901-1980 VHS Special Edition)","Sound_Mix":"Mono","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Though it claims to be based on the novel by Mario Puzo, only the scenes about the young Vito Corleone (Robert De Niro) have any basis in the book. Only one chapter in the book is devoted to Vito's youth and young adulthood. The story revolving around Michael (Al Pacino) and family in Las Vegas is entirely unique to the film. See more »","Goofs":"After the attempted assassination on Michael, Tom and Rocco are overlooking the discovery of the dead bodies in the water. When Rocco turns away from Tom to ask where Michael is, his lips do not move while the soundtrack says \"Where's Mike?\". See more »","Crazy_Credits":"As with the first film no opening credits are shown. Although it is now commonplace for films not to have opening credits, it was considered innovative in 1974. See more »","Cast":"Al Pacino, Robert Duvall, Diane Keaton, Robert De Niro, John Cazale, Talia Shire, Lee Strasberg, Michael V. Gazzo, G.D. Spradlin, Richard Bright, Gastone Moschin, Tom Rosqui, Bruno Kirby, Frank Sivero, Francesca De Sapio","Plot":"The early life and career of Vito Corleone in 1920s New York is portrayed while his son, Michael, expands and tightens his grip on his crime syndicate stretching from Lake Tahoe, Nevada to pre-revolution 1958 Cuba. The continuing saga of the Corleone crime family tells the story of a young Vito Corleone growing up in Sicily and in 1910s New York; and follows Michael Corleone in the 1950s as he attempts to expand the family business into Las Vegas, Hollywood and Cuba. Written by Keith Loh <loh@sfu.ca>","Genre":"Crime, Drama","Keywords":"corrupt politician, revenge, 1950s, lake tahoe nevada, melancholy","imdbRating":"9.0","imdbVotes":"757,275","Awards":"Won 6 Oscars. Another 10 wins & 20 nominations.","Metascore":"80","Released":"20 December 1974 (USA) ","Location":"2045 N. Hibiscus Drive, North Miami, Florida, USA ","Actors":"Al Pacino, Robert De Niro, Robert Duvall ","Writer":"Francis Ford Coppola (screenplay), Mario Puzo (screenplay) | 1 more credit »","Running_time":"PT202M / 3h 22min","Description":"Directed by Francis Ford Coppola.  With Al Pacino, Robert De Niro, Robert Duvall, Diane Keaton. The early life and career of Vito Corleone in 1920s New York is portrayed while his son, Michael, expands and tightens his grip on his crime syndicate stretching from Lake Tahoe, Nevada to pre-revolution 1958 Cuba.","Rated":"N/A"}