{"imdbID":"tt0079522","Title":"Manhattan","Year":"1979","Director":"Woody Allen","Taglines":"Woody Allen's New Comedy Hit","Certificate":"R | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Manhetenas ","Gross":"$45,700,000 (USA)","Production_Co":"Jack Rollins & Charles H. Joffe Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"96 min","Sound_Mix":"Mono","Color":"Black and White","Aspect_Ratio":"2.35 : 1","Trivia":"Isaac (Woody Allen) expresses annoyance with Mary's habit of pronouncing the name 'van Gogh' as rhyming with the word 'Loch' (as in 'Loch Ness') instead of rhyming with 'low'. In actuality, Mary's version is closer to how the Dutch name van Gogh is properly pronounced. See more »","Goofs":"Camera and crew reflected on passing cars while following Isaac running down the street. See more »","Crazy_Credits":"There are no opening credits, save the production company bumper and the film's title, which appears as part of a flashing neon sign in New York City. See more »","Cast":"Woody Allen, Diane Keaton, Michael Murphy, Mariel Hemingway, Meryl Streep, Anne Byrne Hoffman, Karen Ludwig, Michael O'Donoghue, Victor Truro, Tisa Farrow, Helen Hanft, Bella Abzug, Gary Weis, Kenny Vance, Charles Levin","Plot":"The life of a divorced television writer dating a teenage girl is further complicated when he falls in love with his best friend's mistress. Forty-two year old Isaac Davis has a romanticized view of his hometown, New York City, most specifically Manhattan, as channeled through the lead character in the first book he is writing, despite his own Manhattan-based life being more of a tragicomedy. He has just quit his job as a hack writer for a bad television comedy, he, beyond the ten second rush of endorphins during the actual act of quitting, now regretting the decision, especially as he isn't sure he can live off his book writing career. He is paying two alimonies, his second ex-wife, Jill Davis, a lesbian, who is writing her own tell-all book of their acrimonious split. The one somewhat positive aspect of his life is that he is dating a young woman named Tracy, although she is only seventeen and still in high school. Largely because of their differences a big part of which is due to their ages, he does not see a long term future with her. His life has the potential to be even more tragicomical when he meets journalist Mary... Written by Huggo","Genre":"Comedy, Drama, Romance","Keywords":"book, writing, love, writer, dating","imdbRating":"8.0","imdbVotes":"101,055","Awards":"Nominated for 2 Oscars. Another 15 wins & 21 nominations.","Metascore":"82","Released":"25 April 1979 (USA) ","Location":"Washington Mews, Manhattan, New York City, New York, USA ","Actors":"Woody Allen, Diane Keaton, Mariel Hemingway ","Writer":"Woody Allen, Marshall Brickman","Running_time":"PT96M / 1h 36min","Description":"Directed by Woody Allen.  With Woody Allen, Diane Keaton, Mariel Hemingway, Michael Murphy. The life of a divorced television writer dating a teenage girl is further complicated when he falls in love with his best friend's mistress.","Rated":"R"}