{"imdbID":"tt0048563","Title":"The Rose Tattoo","Year":"1955","Director":"Daniel Mann","Country":"USA","Language":"English, Italian","Production_Co":"Paramount Pictures ","Runtime":"117 min","Cast":"Anna Magnani, Burt Lancaster, Marisa Pavan, Ben Cooper, Virginia Grey, Jo Van Fleet, Sandro Giglio, Mimi Aguglia, Florence Sundstrom","Plot":"An Italian-American neighborhood in Louisiana is disturbed when truck driver Rosario Delle Rose is killed by police while smuggling. His buxom widow Serafina miscarries, then over a period ... See full summary » An Italian-American neighborhood in Louisiana is disturbed when truck driver Rosario Delle Rose is killed by police while smuggling. His buxom widow Serafina miscarries, then over a period of years draws more and more into herself, trying to force her lovely teenaged daughter Rosa to do likewise. On one eventful day, Rose finally breaks away; Serafina learns of Rosario's affair with another woman; and a new carefree, handsome Italian truck driver enters her life... Written by Rod Crawford <puffinus@u.washington.edu>","Genre":"Comedy, Drama, Romance","Keywords":"smuggling, louisiana, truck driver, widow, italian american","imdbRating":"7.2","imdbVotes":"2,525","Awards":"Won 3 Oscars. Another 7 wins & 7 nominations.","Metascore":"","Released":"1956 (Brazil) ","Location":"Key West, Florida Keys, Florida, USA ","Actors":"Anna Magnani, Burt Lancaster, Marisa Pavan ","Writer":"Tennessee Williams (screenplay), Hal Kanter (adaptation) | 1 more credit »","Running_time":"PT117M / 1h 57min","Description":"Directed by Daniel Mann.  With Anna Magnani, Burt Lancaster, Marisa Pavan, Ben Cooper. An Italian-American neighborhood in Louisiana is disturbed when truck driver Rosario Delle Rose is killed by police while smuggling. His buxom widow Serafina miscarries, then over a period of years draws more and more into herself, trying to force her lovely teenaged daughter Rosa to do likewise. On one eventful day, Rose finally breaks away; Serafina learns of Rosario's affair with another woman...","Rated":"UNRATED"}