{"imdbID":"tt0047296","Title":"On the Waterfront","Year":"1954","Director":"Elia Kazan","Taglines":"Tender love...terrifying conflict! ","Certificate":"Not Rated | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Bottom of the River ","Budget":"$910,000 (estimated)","Gross":"$9,600,000 (USA)","Production_Co":"Columbia Pictures Corporation, Horizon Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"108 min","Sound_Mix":"Mono (Western Electric Recording)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Marlon Brando and Eva Marie Saint were the same age, although Terry Malloy is supposed to be several years older than Edie Doyle. See more »","Goofs":"When Friendly is pushed into the river, the splash, and the sound it makes, are seen and heard twice in succession, instead of just once. See more »","Crazy_Credits":"Opening credits are shown over a bamboo-type mat background. See more »","Cast":"Marlon Brando, Karl Malden, Lee J. Cobb, Rod Steiger, Pat Henning, Leif Erickson, James Westerfield, Tony Galento, Tami Mauriello, John F. Hamilton, John Heldabrand, Rudy Bond, Don Blackman, Arthur Keegan, Abe Simon","Plot":"An ex-prize fighter turned longshoreman struggles to stand up to his corrupt union bosses. Terry Malloy dreams about being a prize fighter, while tending his pigeons and running errands at the docks for Johnny Friendly, the corrupt boss of the dockers union. Terry witnesses a murder by two of Johnny's thugs, and later meets the dead man's sister and feels responsible for his death. She introduces him to Father Barry, who tries to force him to provide information for the courts that will smash the dock racketeers. Written by Colin Tinto <cst@imdb.com>","Genre":"Crime, Drama, Sci-Fi","Keywords":"union, murder, dock, longshoreman, death","imdbRating":"8.3","imdbVotes":"96,566","Awards":"Won 8 Oscars. Another 21 wins & 9 nominations.","Metascore":"88","Released":"22 June 1954 (Japan) ","Location":"Court Street, Hoboken, New Jersey, USA ","Actors":"Marlon Brando, Karl Malden, Lee J. Cobb ","Writer":"Budd Schulberg (screenplay), Budd Schulberg (based upon an original story by) | 1 more credit »","Running_time":"PT108M / 1h 48min","Description":"Directed by Elia Kazan.  With Marlon Brando, Karl Malden, Lee J. Cobb, Rod Steiger. An ex-prize fighter turned longshoreman struggles to stand up to his corrupt union bosses.","Rated":"NOT RATED"}