{"imdbID":"tt0017136","Title":"Metropolis","Year":"1927","Director":"Fritz Lang","Taglines":"There can be no understanding between the hands and the brain unless the heart acts as mediator. ","Certificate":"See all certifications »","Country":"Germany","Language":"German","Also_Known_As":"Metrópolis ","Budget":"DEM 6,000,000 (estimated)","Opening_Weekend":"$1,070 (USA) (8 August 2003)","Gross":"$26,435 (USA) (11 November 2011)","Production_Co":"Universum Film (UFA) ","":"Show detailed company contact information on IMDbPro »","Runtime":"153 min | 210 min (premiere cut) | 93 min (re-release) | 114 min (1927 cut) | 123 min (2002 Murnau Foundation 75th aniversary restored) | 119 min (DVD edition) (2002 Murnau Foundation 75th aniversary restored) | 80 min (Giorgio Moroder) | 145 min (2010 restored)","Sound_Mix":"Dolby Digital (1995 restored version)| Silent (original release)","Color":"Black and White","Aspect_Ratio":"1.33 : 1","Trivia":"When Rotwang shows Fredersen the robot, it is Brigitte Helm, not a stunt performer, inside the robot costume. See more »","Goofs":"After having worked at the machine for ten hours, Freder is clearly exhausted when he enters the catacombs and goes down the last stairwell. When he relieved Georgy (worker 11811) earlier in the film, Georgy was sweating--implying Freder should now be sweating too. However, when he takes off his beanie in the catacombs, his hair isn't wet from sweat at all. See more »","Crazy_Credits":"Restoration based on the version in the Filmmuseum Munich and material preserved in the Bundesarchiv-Filmarchiv See more »","Cast":"Alfred Abel, Gustav Fröhlich, Rudolf Klein-Rogge, Fritz Rasp, Theodor Loos, Erwin Biswanger, Heinrich George, Brigitte Helm","Plot":"In a futuristic city sharply divided between the working class and the city planners, the son of the city's mastermind falls in love with a working class prophet who predicts the coming of a savior to mediate their differences. Sometime in the future, the city of Metropolis is home to a Utopian society where its wealthy residents live a carefree life. One of those is Freder Fredersen. One day, he spots a beautiful woman with a group of children, she and the children who quickly disappear. Trying to follow her, he, oblivious to such, is horrified to find an underground world of workers, apparently who run the machinery which keeps the above ground Utopian world functioning. One of the few people above ground who knows about the world below is Freder's father, Joh Fredersen, who is the founder and master of Metropolis. Freder learns that the woman is Maria, who espouses the need to join the \"hands\" - the workers - to the \"head\" - those in power above - by a mediator or the \"heart\". Freder wants to help the plight of the workers in the want for a better life. But when Joh learns of what Maria is espousing and that Freder is joining their cause, Joh, with the assistance of an old colleague and now nemesis named ... Written by Huggo","Genre":"Drama, Sci-Fi","Keywords":"worker, dance, silent film, bible quote, love at first sight","imdbRating":"8.3","imdbVotes":"107,293","Awards":"3 wins & 4 nominations.","Metascore":"98","Released":"5 March 1927 (Denmark) ","Location":"Filmwerke Staaken, Staaken, Spandau, Berlin, Germany ","Actors":"Brigitte Helm, Alfred Abel, Gustav Fröhlich ","Writer":"Thea von Harbou (screenplay), Thea von Harbou (novel)","Running_time":"PT153M / 2h 33min","Description":"Directed by Fritz Lang.  With Brigitte Helm, Alfred Abel, Gustav Fröhlich, Rudolf Klein-Rogge. In a futuristic city sharply divided between the working class and the city planners, the son of the city's mastermind falls in love with a working class prophet who predicts the coming of a savior to mediate their differences.","Rated":"N/A"}