{"imdbID":"tt0065037","Title":"The Sterile Cuckoo","Year":"1969","Director":"Alan J. Pakula","Country":"USA","Language":"English","Production_Co":"Boardwalk Productions ","Runtime":"107 min","Cast":"Liza Minnelli, Wendell Burton, Tim McIntire","Plot":"Two students from neighboring colleges in upstate New York are swept up in a tragic romantic interlude calling for a maturity of vision beyond their experience of capabilities. Pookie Adams... See full summary » Two students from neighboring colleges in upstate New York are swept up in a tragic romantic interlude calling for a maturity of vision beyond their experience of capabilities. Pookie Adams - a kooky, lonely misfit with no family and no place to go, insists on calling all those who won't participate in her world, \"weirdos,\" clings to a quiet studious Jerry, who has the ability to make a choice of living in Pookie's private little world or be accepted by the society that Pookie rejects. Unwittingly, it is through their awkward relationship that Pookie actually prepares Jerry for the world of \"weirdos\" that she doesn't fit into or wish to be apart of. Written by alfiehitchie","Genre":"Comedy, Drama","Keywords":"college, three word title, oddball, father daughter estrangement, estranged father","imdbRating":"6.9","imdbVotes":"1,413","Awards":"Nominated for 2 Oscars. Another 3 wins & 4 nominations.","Metascore":"","Released":"22 October 1969 (USA) ","Location":"Howell Furniture and Hardware/The Bank Block, 300 S. Euclid Ave., Ontario, California, USA ","Actors":"Liza Minnelli, Wendell Burton, Tim McIntire ","Writer":"John Nichols (novel), Alvin Sargent (screenplay)","Running_time":"PT107M / 1h 47min","Description":"Directed by Alan J. Pakula.  With Liza Minnelli, Wendell Burton, Tim McIntire, Anita Alberts. Two students from neighboring colleges in upstate New York are swept up in a tragic romantic interlude calling for a maturity of vision beyond their experience of capabilities. Pookie Adams - a kooky, lonely misfit with no family and no place to go, insists on calling all those who won't participate in her world, \"weirdos,\" clings to a quiet studious Jerry, who has the ability to make a choice of...","Rated":"M"}