{"imdbID":"tt0093779","Title":"The Princess Bride","Year":"1987","Director":"Rob Reiner","Taglines":"Heroes, giants, villains, wizards, true love ","Certificate":"PG | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Die Braut des Prinzen ","Budget":"$16,000,000 (estimated)","Gross":"$30,857,814 (USA)","Production_Co":"Act III Communications, Buttercup Films Ltd., The Princess Bride Ltd. ","":"Show detailed company contact information on IMDbPro »","Runtime":"98 min","Sound_Mix":"Dolby","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Buttercup says that her lover's eyes are like the \"sea after a storm\", which is a reference to a painting of the same name by Irish painter Francis Darby in 1824. This could be a hint that the film is set after 1824. See more »","Goofs":"When Buttercup is talking to the Man in Black on the hill, some obviously modern houses are visible in the valley behind her. See more »","Cast":"Cary Elwes, Mandy Patinkin, Chris Sarandon, Christopher Guest, Wallace Shawn, André the Giant, Fred Savage, Robin Wright, Peter Falk, Peter Cook, Mel Smith, Carol Kane, Billy Crystal, Anne Dyson, Margery Mason","Plot":"While home sick in bed, a young boy's grandfather reads him a story called The Princess Bride. An elderly man reads the book \"The Princess Bride\" to his sick and thus currently bedridden adolescent grandson, the reading of the book which has been passed down within the family for generations. The grandson is sure he won't like the story, with a romance at its core, he preferring something with lots of action and \"no kissing\". But the grandson is powerless to stop his grandfather, whose feelings he doesn't want to hurt. The story centers on Buttercup, a former farm girl who has been chosen as the princess bride to Prince Humperdinck of Florian. Buttercup does not love him, she who still laments the death of her one true love, Westley, five years ago. Westley was a hired hand on the farm, his stock answer of \"as you wish\" to any request she made of him which she came to understand was his way of saying that he loved her. But Westley went away to sea, only to be killed by the Dread Pirate Roberts. On a horse ride to clear her mind of her upcoming predicament of marriage, Buttercup... Written by Huggo","Genre":"Adventure, Comedy, Family","Keywords":"true love, fairy tale, pirate, princess, giant","imdbRating":"8.1","imdbVotes":"282,919","Awards":"Nominated for 1 Oscar. Another 6 wins & 8 nominations.","Metascore":"77","Released":"9 October 1987 (USA) ","Location":"Penshurst Place, Penshurst, Kent, England, UK ","Actors":"Cary Elwes, Mandy Patinkin, Robin Wright ","Writer":"William Goldman (book), William Goldman (screenplay)","Running_time":"PT98M / 1h 38min","Description":"Directed by Rob Reiner.  With Cary Elwes, Mandy Patinkin, Robin Wright, Chris Sarandon. While home sick in bed, a young boy's grandfather reads him a story called The Princess Bride.","Rated":"PG"}