{"imdbID":"tt0062622","Title":"2001: A Space Odyssey","Year":"1968","Director":"Stanley Kubrick","Taglines":"the time is now. [2001 re-release] ","Certificate":"See all certifications »","Country":"USA, UK","Language":"English, Russian","Also_Known_As":"2001: Odisea del espacio ","Budget":"$10,500,000 (estimated)","Gross":"$56,715,371 (USA)","Production_Co":"Metro-Goldwyn-Mayer (MGM), Stanley Kubrick Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"149 min | 142 min (theatrical release) | 161 min (initial release)","Sound_Mix":"4-Track Stereo (35 mm magnetic prints)| 70 mm 6-Track (70 mm prints)| DTS 70 mm (2001 re-release)","Color":"Color (Technicolor)","Aspect_Ratio":"2.20 : 1","Trivia":"Stanley Kubrick cut 19 minutes from the film's original 158-minute running time after its New York premiere, mostly to speed up the pacing. See more »","Goofs":"As the moon shuttle lands it kicks up swirling clouds of dust. In the vacuum of space the dust would shoot out straight, as with the real-life Apollo Lunar Modules. See more »","Crazy_Credits":"In the 2001 UK cinema re-release, the music carries on for 10-15 minutes after the end of the credits. See more »","Cast":"Keir Dullea, Gary Lockwood, William Sylvester, Daniel Richter, Leonard Rossiter, Margaret Tyzack, Robert Beatty, Sean Sullivan, Douglas Rain, Frank Miller, Bill Weston, Ed Bishop, Glenn Beck, Alan Gifford, Ann Gillis","Plot":"Humanity finds a mysterious, obviously artificial object buried beneath the Lunar surface and, with the intelligent computer H.A.L. 9000, sets off on a quest. \"2001\" is a story of evolution. Sometime in the distant past, someone or something nudged evolution by placing a monolith on Earth (presumably elsewhere throughout the universe as well). Evolution then enabled humankind to reach the moon's surface, where yet another monolith is found, one that signals the monolith placers that humankind has evolved that far. Now a race begins between computers (HAL) and human (Bowman) to reach the monolith placers. The winner will achieve the next step in evolution, whatever that may be. Written by Larry Cousins","Genre":"Mystery, Sci-Fi","Keywords":"monolith, message from outer space, star child, famous line, ancient astronaut","imdbRating":"8.3","imdbVotes":"408,786","Awards":"Won 1 Oscar. Another 13 wins & 7 nominations.","Metascore":"86","Released":"15 May 1968 (UK) ","Location":"Shepperton Studios, Shepperton, Surrey, England, UK ","Actors":"Keir Dullea, Gary Lockwood, William Sylvester ","Writer":"Stanley Kubrick (screenplay), Arthur C. Clarke (screenplay)","Running_time":"PT149M / 2h 29min","Description":"Directed by Stanley Kubrick.  With Keir Dullea, Gary Lockwood, William Sylvester, Daniel Richter. Humanity finds a mysterious, obviously artificial object buried beneath the Lunar surface and, with the intelligent computer H.A.L. 9000, sets off on a quest.","Rated":"N/A"}