{"imdbID":"tt0083922","Title":"Fanny and Alexander","Year":"1982","Director":"Ingmar Bergman","Writer":"Ingmar Bergman","Country":"Sweden, France, West Germany","Language":"Swedish, German, Yiddish, English","Budget":"$6,000,000 (estimated)","Gross":"SEK 21,041,492 (Sweden)","Production_Co":"Cinematograph AB, Svenska Filminstitutet (SFI), Gaumont ","Runtime":"188 min | 312 min (TV miniseries)","Cast":"Kristina Adolphson, Börje Ahlstedt, Pernilla Allwin, Kristian Almgren, Carl Billquist, Axel Düberg, Allan Edwall, Siv Ericks, Ewa Fröling, Patricia Gélin, Majlis Granlund, Maria Granlund, Bertil Guve, Eva von Hanno, Sonya Hedenbratt","Plot":"Two young Swedish children experience the many comedies and tragedies of their family, the Ekdahls. It's the early twentieth century Sweden. Adolescent siblings Alexander and Fanny Ekdahl lead a relatively joyous and exuberant life with their well-off extended paternal family, led by the family matriarch, their grandmother, Helena Ekdahl. The openness of the family culture is exemplified by Helena's now deceased husband ending up becoming best friends with one of her lovers, a Jewish puppet maker named Isak Jacobi, and their Uncle Gustav Adolf's open liaison with one of the family maids, Maj, who everyone in the family adores, even Gustav Adolf's wife, Alma. Between the siblings, Alexander in particular has inherited the family's love of storytelling, his parents and his grandmother who are actors and who manage their own theater. Things change for Alexander and Fanny when their father, Oscar, dies shortly after Christmas 1907. Although she truly does believe she loves him, the children's mother, Emilie, decides to marry Bishop Edvard Vergérus, who she first met as the officiate at ... Written by Huggo","Genre":"Drama","Keywords":"man undressing a boy, bishop, christmas, jewish, theater","imdbRating":"8.1","imdbVotes":"41,509","Awards":"Won 4 Oscars. Another 19 wins & 10 nominations.","Metascore":"100","Released":"17 December 1982 (Sweden) ","Location":"Valvgatan, Uppsala, Uppsala Län, Sweden ","Actors":"Bertil Guve, Pernilla Allwin, Kristina Adolphson ","Running_time":"PT188M / 3h 8min","Description":"Directed by Ingmar Bergman.  With Bertil Guve, Pernilla Allwin, Kristina Adolphson, Börje Ahlstedt. Two young Swedish children experience the many comedies and tragedies of their family, the Ekdahls.","Rated":"R"}