{"imdbID":"tt0089853","Title":"The Purple Rose of Cairo","Year":"1985","Director":"Woody Allen","Writer":"Woody Allen","Taglines":"She's finally met the man of her dreams. He's not real but you can't have everything. [Video]","Certificate":"PG | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"La rosa púrpura del Cairo ","Budget":"$15,000,000 (estimated)","Gross":"$10,600,000 (USA)","Production_Co":"Orion Pictures ","Runtime":"82 min","Sound_Mix":"Mono","Color":"Black and White | Color","Aspect_Ratio":"1.85 : 1","Trivia":"Part of the movie is in black-and-white, which is all the scenes which feature the film within a film, \"The Purple Rose of Cairo\". The film is one of a number of pictures which were filmed in black-and-white by director Woody Allen during his immediate post-Annie Hall (1977) period between the late 1970s and early-mid 1980s. The films also include Manhattan (1979), Stardust Memories (1980), Zelig (1983) (also in color) and Broadway Danny Rose (1984). After The Purple Rose of Cairo (1985), Allen would then not make another b&w film for about another six years, until Shadows and Fog (1991) in 1991. See more »","Goofs":"Although the film's fictional namesake has scenes filmed in the Copacabana club in New York, the club was not open until November 1940. This is not consistent with the actual film, which is set during the Great Depression. See more »","Crazy_Credits":"Alexander Cohen's name is listed as \"Alexander H. Cohen\" in the opening credits, although the middle initial is dropped in the end credits. See more »","Cast":"Mia Farrow, Jeff Daniels, Danny Aiello, Irving Metzman, Stephanie Farrow, David Kieserman, Elaine Grollman, Victoria Zussin, Mark Hammond, Wade Barnes, Joseph G. Graham, Don Quigley, Maurice Brenner, Paul Herman, Rick Petrucelli","Plot":"In 1930s New Jersey, a movie character walks off the screen and into the real world. Cecilia is a waitress in New Jersey during the Depression and is searching for an escape from her dreary life. Tom Baxter is a dashing young archaeologist in the film \"The Purple Rose of Cairo.\" After losing her job Cecilia goes to see the film in hopes of raising her spirits. Much to her surprise Tom Baxter walks off the screen and into her life. There's only one problem..Tom isn't real. Meanwhile Hollywood is up in arms when they dicover that other Tom Baxters are trying to leave the screen in other theatres. Will Tom ever return and finish the film or will he decide to stay in the real world? Written by Ricky Darbonne <nsdar8115@alpha.nsula.edu>","Genre":"Comedy, Fantasy, Romance","Keywords":"film within a film, 1930s, movie theater, film industry, entering movie via screen","imdbRating":"7.8","imdbVotes":"34,960","Awards":"Nominated for 1 Oscar. Another 14 wins & 14 nominations.","Metascore":"75","Released":"19 April 1985 (USA) ","Location":"Kent Theater, 1170 Coney Island Avenue, Ocean Parkway, Brooklyn, New York City, New York, USA ","Actors":"Mia Farrow, Jeff Daniels, Danny Aiello ","Running_time":"PT82M / 1h 22min","Description":"Directed by Woody Allen.  With Mia Farrow, Jeff Daniels, Danny Aiello, Irving Metzman. In 1930s New Jersey, a movie character walks off the screen and into the real world.","Rated":"PG"}