{"imdbID":"tt0024216","Title":"King Kong","Year":"1933","Taglines":"King Kong Comes. ","Certificate":"Unrated | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"King Ape ","Budget":"$670,000 (estimated)","Production_Co":"RKO Radio Pictures ","Runtime":"100 min | 104 min (restored) | 125 min (original cut)","Sound_Mix":"Mono (RCA Photophone System)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Jean Harlow refused the lead part. See more »","Goofs":"(at around 1h 24 mins) During the show in New York, Carl Denham refers to Jack Driscoll as \"John Driscoll.\" This is not incorrect, however, as Jack was once commonly used as a diminutive name for men named John. See more »","Cast":"Fay Wray, Robert Armstrong, Bruce Cabot, Frank Reicher, Sam Hardy, Noble Johnson, Steve Clemente, James Flavin, King Kong","Plot":"A film crew goes to a tropical island for an exotic location shoot and discovers a colossal giant gorilla who takes a shine to their female blonde star. Then he's captured and brought back to New York City for public exhibition. Carl Denham needs to finish his movie and has the perfect location; Skull Island. But he still needs to find a leading lady. This 'soon-to-be-unfortunate' soul is Ann Darrow. No one knows what they will encounter on this island and why it is so mysterious, but once they reach it, they will soon find out. Living on this hidden island is a giant gorilla and this beast now has Ann in it's grasps. Carl and Ann's new love, Jack Driscoll must travel through the jungle looking for Kong and Ann, whilst avoiding all sorts of creatures and beasts. Written by Film_Fan","Genre":"Adventure, Fantasy","Keywords":"giant ape, king kong, island, gorilla, beast","imdbRating":"8.0","imdbVotes":"63,004","Awards":"3 wins & 3 nominations.","Metascore":"","Released":"7 April 1933 (USA) ","Location":"RKO-Pathé Studios - 9336 Washington Blvd., Culver City, California, USA ","Actors":"Fay Wray, Robert Armstrong, Bruce Cabot ","Director":"Merian C. Cooper (uncredited), Ernest B. Schoedsack (uncredited)","Writer":"James Ashmore Creelman (screen play) (as James Creelman), Ruth Rose (screen play) | 2 more credits »","Running_time":"PT100M / 1h 40min","Description":"Directed by Merian C. Cooper, Ernest B. Schoedsack.  With Fay Wray, Robert Armstrong, Bruce Cabot, Frank Reicher. A film crew goes to a tropical island for an exotic location shoot and discovers a colossal giant gorilla who takes a shine to their female blonde star. Then he's captured and brought back to New York City for public exhibition.","Rated":"UNRATED"}