{"imdbID":"tt0079116","Title":"Escape from Alcatraz","Year":"1979","Director":"Don Siegel (as Donald Siegel)","Taglines":"No one has ever escaped from Alcatraz... And no one ever will!","Certificate":"PG | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Flucht von Alcatraz ","Budget":"$8,000,000 (estimated)","Gross":"$36,500,000 (USA)","Production_Co":"Paramount Pictures, Malpaso Company, The ","Runtime":"112 min","Sound_Mix":"Mono","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The cast and crew noted that production for this film was particularly harsh and unpleasant due to the physical environment and shooting limitations. The weather was often rainy, windy, and severe, and the cast and crew had to endure the bitter cold without any heat source. Also, Alcatraz's roles as a nationally-historic site and major tourist attraction required film workers to be careful not to damage the location. See more »","Goofs":"Frank Morris sticks a mirror out of his cell to spot the guard, but the angle he's holding it at is for the benefit of the camera. He can only see the back of the mirror. See more »","Crazy_Credits":"Opening credits prologue: JANUARY 18, 1960 SAN FRANCISCO See more »","Cast":"Clint Eastwood, Patrick McGoohan, Roberts Blossom, Jack Thibeau, Fred Ward, Paul Benjamin, Larry Hankin, Bruce M. Fischer, Frank Ronzio, Fred Stuthman, David Cryer, Madison Arnold, Blair Burrows, Bob Balhatchet, Matthew Locricchio","Plot":"Alcatraz is the most secure prison of its time. It is believed that no one can ever escape from it, until three daring men make a possible successful attempt at escaping from the most infamous prisons in the world. The true story of three inmates who attempt a daring escape from the infamous prison, Alcatraz Island. Although no-one had managed to escape before, bank robber Frank Morris masterminded this elaborately detailed and, as far as anyone knows, ultimately successful, escape. In 29 years, this seemingly impenetrable federal penitentiary, which housed Al Capone and \"Birdman\" Robert Stroud, was only broken once by three inmates never heard of again. Written by Niz","Genre":"Biography, Crime, Drama","Keywords":"escape, alcatraz, prison, inmate, island","imdbRating":"7.6","imdbVotes":"84,268","Awards":"","Metascore":"","Released":"22 June 1979 (USA) ","Location":"Alcatraz Island, San Francisco Bay, California, USA ","Actors":"Clint Eastwood, Patrick McGoohan, Roberts Blossom ","Writer":"J. Campbell Bruce (book), Richard Tuggle (screenplay)","Running_time":"PT112M / 1h 52min","Description":"Directed by Don Siegel.  With Clint Eastwood, Patrick McGoohan, Roberts Blossom, Jack Thibeau. Alcatraz is the most secure prison of its time. It is believed that no one can ever escape from it, until three daring men make a possible successful attempt at escaping from the most infamous prisons in the world.","Rated":"PG"}