{"imdbID":"tt0058500","Title":"The Pumpkin Eater","Year":"1964","Director":"Jack Clayton","Country":"UK","Language":"English","Production_Co":"Romulus Films ","Runtime":"110 min (TCM Print)","Cast":"Anne Bancroft, Peter Finch, James Mason, Janine Gray, Cedric Hardwicke, Rosalind Atkinson, Alan Webb, Richard Johnson, Maggie Smith, Eric Porter, Cyril Luckham, Anthony Nicholls, John Franklyn-Robbins, John Junkin, Yootha Joyce","Plot":"Film screenwriter Jake Armitage and his wife Jo Armitage live in London with six of Jo's eight children, with the two eldest boys at boarding school. The children are spread over Jo's three... See full summary » Film screenwriter Jake Armitage and his wife Jo Armitage live in London with six of Jo's eight children, with the two eldest boys at boarding school. The children are spread over Jo's three marriages, with only the youngest being Jake's biological child, although he treats them all as his own. Jo left her second husband Giles after meeting Giles' friend Jake, the two who were immediately attracted to each other. Their upper middle class life is much different than Giles and Jo's, who lived in a barn in the English countryside. But Jo is ruminating about her strained marriage to Jake, with issues on both sides. Jo suspects Jake of chronic infidelity, she only confronting him with her suspicions whenever evidence presents itself. And Jo's psychiatrist believes that Jo uses childbirth as a rationale for sex, which he believes she finds vulgar. These issues in combination have placed Jo in a fragile mental state. They both state that they love the other, but neither really seems to like ... Written by Huggo","Genre":"Drama","Keywords":"marriage, children, barn, writer, screenwriter","imdbRating":"7.4","imdbVotes":"1,309","Awards":"Nominated for 1 Oscar. Another 6 wins & 5 nominations.","Metascore":"","Released":"9 November 1964 (USA) ","Location":"London Zoo, Regent's Park, London, England, UK ","Actors":"Anne Bancroft, Peter Finch, James Mason ","Writer":"Penelope Mortimer (novel), Harold Pinter (screenplay)","Running_time":"PT118M / 1h 58min","Description":"Directed by Jack Clayton.  With Anne Bancroft, Peter Finch, James Mason, Janine Gray. Film screenwriter Jake Armitage and his wife Jo Armitage live in London with six of Jo's eight children, with the two eldest boys at boarding school. The children are spread over Jo's three marriages, with only the youngest being Jake's biological child, although he treats them all as his own. Jo left her second husband Giles after meeting Giles' friend Jake, the two who were immediately ...","Rated":"N/A"}