{"imdbID":"tt0087892","Title":"A Passage to India","Year":"1984","Director":"David Lean","Country":"UK, USA","Language":"English, Hindi","Budget":"$16,000,000 (estimated)","Gross":"$26,400,000 (USA)","Production_Co":"EMI Films, Home Box Office (HBO), Thorn EMI Screen Entertainment ","Runtime":"164 min","Cast":"Judy Davis, Victor Banerjee, Peggy Ashcroft, James Fox, Alec Guinness, Nigel Havers, Richard Wilson, Antonia Pemberton, Michael Culver, Art Malik, Saeed Jaffrey, Clive Swift, Ann Firbank, Roshan Seth, Sandra Hotz","Plot":"Cultural mistrust and false accusations doom a friendship in British colonial India between an Indian doctor, an Englishwoman engaged to marry a city magistrate, and an English educator. Circa 1920, during the Indian British rule, Dr. Aziz H. Ahmed was born and brought up in India. He is proficient in English, and wears Western style clothing. He meets an old lady, Mrs. Moore, at a mosque, who asks him to accompany her and her companion, Adela Quested, for sight-seeing around some caves. Thereafter the organized life of Aziz is turned upside down when Adela accuses him of molesting her in a cave. Aziz is arrested and brought before the courts, where he learns that the entire British administration is against him, and would like to see him found guilty and punished severely, to teach all native Indians what it means to molest a British citizen. Aziz is all set to witness the \"fairness\" of the British system, whose unofficial motto is \"guilty until proved innocent.\" Written by rAjOo (gunwanti@hotmail.com)","Genre":"Adventure, Drama, History","Keywords":"india, mosque, magistrate, english, doctor","imdbRating":"7.4","imdbVotes":"12,578","Awards":"Won 2 Oscars. Another 19 wins & 26 nominations.","Metascore":"","Released":"1 February 1985 (USA) ","Location":"Bangalore Palace, Bangalore, Karnataka, India ","Actors":"Judy Davis, Victor Banerjee, Peggy Ashcroft ","Writer":"E.M. Forster (by), E.M. Forster (based on the novel by) | 2 more credits »","Running_time":"PT164M / 2h 44min","Description":"Directed by David Lean.  With Judy Davis, Victor Banerjee, Peggy Ashcroft, James Fox. Cultural mistrust and false accusations doom a friendship in British colonial India between an Indian doctor, an Englishwoman engaged to marry a city magistrate, and an English educator.","Rated":"PG"}