{"imdbID":"tt0045186","Title":"The Star","Year":"1952","Director":"Stuart Heisler","Country":"USA","Language":"English","Production_Co":"Bert E. Friedlob Productions ","Runtime":"89 min","Cast":"Bette Davis, Sterling Hayden, Natalie Wood, Warner Anderson, Minor Watson, June Travis, Paul Frees, Robert Warwick, Barbara Lawrence, Fay Baker, Herb Vigran","Plot":"A washed-up movie queen finds romance, but still desires a comeback. Middle-aged Oscar winning actress Margaret Elliot - Maggie to those that know her - is a Hollywood has-been. Her life is in shambles. She clings to the hope of resurrecting her past movie stardom as a leading ingénue. No one will hire her, she's penniless with creditors selling off anything that she owns that is of monetary value, and she has no one to turn to that can see her through financially. She has in the past supported her sister and brother-in-law, who still want to use her as their meal ticket. Divorced from her actor husband, she shares joint custody of their teen-aged daughter Gretchen, from who Maggie tries to hide her problems. When it looks as if Maggie has hit rock bottom, Jim Johannsen re-enters her life. Jim, who once had the stage name Barry Lester, got his big break in Hollywood movies by Maggie. He came to the quick realization that he was neither good as an actor or that he wanted to do it as a profession. He now works as a boat parts supplier and mechanic. Jim ... Written by Huggo","Genre":"Drama, Romance","Keywords":"hollywood, actor, career, oscar, mechanic","imdbRating":"7.3","imdbVotes":"2,216","Awards":"Nominated for 1 Oscar.","Metascore":"","Released":"11 December 1952 (USA) ","Location":"Hollywood Boulevard, Hollywood, Los Angeles, California, USA ","Actors":"Bette Davis, Sterling Hayden, Natalie Wood ","Writer":"Dale Eunson (original screenplay), Katherine Albert (original screenplay)","Running_time":"PT89M / 1h 29min","Description":"Directed by Stuart Heisler.  With Bette Davis, Sterling Hayden, Natalie Wood, Warner Anderson. A washed-up movie queen finds romance, but still desires a comeback.","Rated":"APPROVED"}