{"imdbID":"tt0019553","Title":"The Way of All Flesh","Year":"1927","Director":"Victor Fleming","Country":"USA","Production_Co":"Paramount Pictures ","Runtime":"94 min","Cast":"Emil Jannings, Belle Bennett, Phyllis Haver, Donald Keith, Fred Kohler, Philippe De Lacy, Mickey McBan, Betsy Ann Hisle, Carmencita Johnson, Gordon Thorpe, Jackie Combs, Dean Harrell, Anne Sheridan, Nancy Drexel","Plot":"The story takes place in Milwaukee during the early 1900s with a bank clerk named August Schiller who is happy with both his job and his family. He is tasked with transporting $1,000 in ... See full summary » The story takes place in Milwaukee during the early 1900s with a bank clerk named August Schiller who is happy with both his job and his family. He is tasked with transporting $1,000 in securities to Chicago. On the train he meets a blond seductress who convinces him to buy her a bottle of champagne, and takes him to a saloon. The next morning he awakes alone in a dilapidated bedroom and without the securities. He finds the woman and pleads with her to return the stolen securities. When he also threatens her he is knocked unconscious by the saloon owner and dragged to a nearby railroad track. As the crooks strips him of his ID and papers, Schiller recovers and struggles with the saloon owner, ultimately throwing him into the path of an oncoming train, killing him. Schiller flees and, as he is about to take his own life, sees in a newspaper that he is supposedly dead. The saloon owner's mangled body had been identified as Schiller's. Twenty years pass. Schiller is now aged and unkempt,... Written by Anonymous","Genre":"Drama","Keywords":"children, lost film","imdbRating":"7.3","imdbVotes":"70","Awards":"Won 1 Oscar.","Metascore":"","Released":"1 October 1927 (USA) ","Location":"Paramount Studios - 5555 Melrose Avenue, Hollywood, Los Angeles, California, USA","Actors":"Emil Jannings, Belle Bennett, Phyllis Haver ","Writer":"Perley Poore Sheehan (story), Lajos Biró (adaptation) | 2 more credits »","Running_time":"PT94M / 1h 34min","Description":"Directed by Victor Fleming.  With Emil Jannings, Belle Bennett, Phyllis Haver, Donald Keith. The story takes place in Milwaukee during the early 1900s with a bank clerk named August Schiller who is happy with both his job and his family. He is tasked with transporting $1,000 in securities to Chicago. On the train he meets a blond seductress who convinces him to buy her a bottle of champagne, and takes him to a saloon. The next morning he awakes alone in a dilapidated bedroom and without ...","Rated":"N/A"}