{"imdbID":"tt0070511","Title":"Papillon","Year":"1973","Director":"Franklin J. Schaffner","Taglines":"Two men with nothing in common but a will to live and a place to die ","Certificate":"R | See all certifications »","Country":"France, USA","Language":"English, Spanish","Also_Known_As":"Leptir ","Budget":"$12,000,000 (estimated)","Gross":"$53,267,000 (USA)","Production_Co":"Allied Artists Pictures, Corona-General, Solar Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"151 min","Sound_Mix":"4-Track Stereo (magnetic prints)| Mono (optical prints)","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"When Dustin Hoffman's driver hit a pedestrian and caused serious injury, the actor, not the driver, began receiving death threats from the locals. See more »","Goofs":"When the random prisoner has his head cut off, if you watch it slowly, you can see the blade come down and stop, then the next cut (at the same angle) has a dummy's head rolling. Additionally, in the latter cut the Sun's position has changed, so it is now in the frame. See more »","Cast":"Steve McQueen, Dustin Hoffman, Victor Jory, Don Gordon, Anthony Zerbe, Robert Deman, Woodrow Parfrey, Bill Mumy, George Coulouris, Ratna Assan, William Smithers, Val Avery, Gregory Sierra, Vic Tayback, Mills Watson","Plot":"A man befriends a fellow criminal as the two of them begin serving their sentence on a dreadful prison island, which inspires the man to plot his escape. Henri \"Papillon\" Charierre is sentenced to life in prison and transported to the penal in French Guyana. Aboard ship on the voyage over, he meets Louis Dega, a forger. They form a bond that will last them a great many years. The conditions at the penal colony are horrific and Papillon desperately wants to escape. His first attempt ends quickly in failure and as a result he spends 2 years in solitary confinement. His next attempt is somewhat more successful and he actually spends a idyllic time with a tribe of Central America Indians. Once caught however, he does 5 years in solitary confinement. Once released, he decides to make one final attempt at freedom. Written by garykmcd","Genre":"Biography, Crime, Drama","Keywords":"escape, butterfly, solitary confinement, prison, island","imdbRating":"8.0","imdbVotes":"95,008","Awards":"Nominated for 1 Oscar. Another 2 wins & 1 nomination.","Metascore":"","Released":"16 December 1973 (USA) ","Location":"Higuerote, Estado Miranda, Venezuela ","Actors":"Steve McQueen, Dustin Hoffman, Victor Jory ","Writer":"Dalton Trumbo (screenplay), Lorenzo Semple Jr. (screenplay) | 1 more credit »","Running_time":"PT151M / 2h 31min","Description":"Directed by Franklin J. Schaffner.  With Steve McQueen, Dustin Hoffman, Victor Jory, Don Gordon. A man befriends a fellow criminal as the two of them begin serving their sentence on a dreadful prison island, which inspires the man to plot his escape.","Rated":"R"}