{"imdbID":"tt0044741","Title":"Ikiru","Year":"1952","Director":"Akira Kurosawa","Certificate":"Not Rated | See all certifications »","Country":"Japan","Language":"Japanese","Also_Known_As":"Ikiru ","Opening_Weekend":"$7,590 (USA) (3 January 2003)","Gross":"$55,240 (USA) (26 September 2003)","Production_Co":"Toho Company ","Runtime":"143 min | 123 min (cut)","Sound_Mix":"Mono","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"The only Akira Kurosawa film between Drunken Angel (1948) (Drunken Angel) and Red Beard (1965) (Red Beard) not to feature Toshirô Mifune. See more »","Goofs":"In the last scene with Toyo (in the restaurant with the birthday party going on), the position of the bell on the mechanical bunny changes, even though neither actor has touched the bunny. See more »","Cast":"Takashi Shimura, Shin'ichi Himori, Haruo Tanaka, Minoru Chiaki, Miki Odagiri, Bokuzen Hidari, Minosuke Yamada, Kamatari Fujiwara, Makoto Kobori, Nobuo Kaneko, Nobuo Nakamura, Atsushi Watanabe, Isao Kimura, Masao Shimizu, Yûnosuke Itô","Plot":"A bureaucrat tries to find a meaning in his life after he discovers he has terminal cancer. Kanji Watanabe is a longtime bureaucrat in a city office who, along with the rest of the office, spends his entire working life doing nothing. He learns he is dying of cancer and wants to find some meaning in his life. He finds himself unable to talk with his family, and spends a night on the town with a novelist, but that leaves him unfulfilled. He next spends time with a young woman from his office, but finally decides he can make a difference through his job... After Watanabe's death, co-workers at his funeral discuss his behavior over the last several months and debate why he suddenly became assertive in his job to promote a city park, and resolve to be more like Watanabe. Written by Mike Rosenlof <mrosenlof@qualcomm.com>","Genre":"Drama","Keywords":"old age, family relationships, existentialism, father son relationship, terminal illness","imdbRating":"8.3","imdbVotes":"40,245","Awards":"Nominated for 1 BAFTA Film Award. Another 5 wins.","Metascore":"","Released":"25 March 1956 (USA) ","Location":"Japan","Actors":"Takashi Shimura, Nobuo Kaneko, Shin'ichi Himori ","Writer":"Akira Kurosawa, Shinobu Hashimoto | 1 more credit »","Running_time":"PT143M / 2h 23min","Description":"Directed by Akira Kurosawa.  With Takashi Shimura, Nobuo Kaneko, Shin'ichi Himori, Haruo Tanaka. A bureaucrat tries to find a meaning in his life after he discovers he has terminal cancer.","Rated":"NOT RATED"}