{"imdbID":"tt0032904","Title":"The Philadelphia Story","Year":"1940","Director":"George Cukor","Country":"USA","Language":"English, French","Production_Co":"Metro-Goldwyn-Mayer (MGM), Loew's ","Runtime":"112 min","Cast":"Cary Grant, Katharine Hepburn, James Stewart, Ruth Hussey, John Howard, Roland Young, John Halliday, Mary Nash, Virginia Weidler, Henry Daniell, Lionel Pape, Rex Evans","Plot":"When a rich woman's ex-husband and a tabloid-type reporter turn up just before her planned remarriage, she begins to learn the truth about herself. Philadelphia socialites Tracy Lord and C.K. Dexter Haven married impulsively, with their marriage and subsequent divorce being equally passionate. They broke up when Dexter's drinking became excessive, it a mechanism to cope with Tracy's unforgiving manner to the imperfect, imperfections which Dexter admits he readily has. Two years after their break-up, Tracy is about to remarry, the ceremony to take place at the Lord mansion. Tracy's bridegroom is nouveau riche businessman and aspiring politician George Kittredge, who is otherwise a rather ordinary man and who idolizes Tracy. The day before the wedding, three unexpected guests show up at the Lord mansion: Macaulay Connor (Mike to his friends), Elizabeth Imbrie - the two who are friends of Tracy's absent brother, Junior - and Dexter himself. Dexter, an employee of the tabloid Spy magazine, made a deal with its publisher and editor Sidney Kidd to get a story on Tracy's wedding - the wedding of the year - in return for Kidd not ... Written by Huggo","Genre":"Comedy, Romance","Keywords":"wedding, reporter, socialite, love triangle, marriage","imdbRating":"8.1","imdbVotes":"49,078","Awards":"Won 2 Oscars. Another 3 wins & 5 nominations.","Metascore":"","Released":"26 December 1940 (USA) ","Location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA","Actors":"Cary Grant, Katharine Hepburn, James Stewart ","Writer":"Donald Ogden Stewart (screen play), Philip Barry (based on the play by)","Running_time":"PT112M / 1h 52min","Description":"Directed by George Cukor.  With Cary Grant, Katharine Hepburn, James Stewart, Ruth Hussey. When a rich woman's ex-husband and a tabloid-type reporter turn up just before her planned remarriage, she begins to learn the truth about herself.","Rated":"NOT RATED"}