{"imdbID":"tt0046247","Title":"The Robe","Year":"1953","Director":"Henry Koster","Country":"USA","Language":"English","Budget":"$5,000,000 (estimated)","Gross":"$36,000,000 (USA)","Production_Co":"Twentieth Century Fox Film Corporation ","Runtime":"135 min","Cast":"Richard Burton, Jean Simmons, Victor Mature, Michael Rennie, Jay Robinson, Dean Jagger, Torin Thatcher, Richard Boone, Betta St. John, Jeff Morrow, Ernest Thesiger, Dawn Addams, Leon Askin","Plot":"Marcellus is a tribune in the time of Christ. He is in charge of the group that is assigned to crucify Jesus. Drunk, he wins Jesus' homespun robe after the crucifixion. He is tormented by ... See full summary » Marcellus is a tribune in the time of Christ. He is in charge of the group that is assigned to crucify Jesus. Drunk, he wins Jesus' homespun robe after the crucifixion. He is tormented by nightmares and delusions after the event. Hoping to find a way to live with what he has done, and still not believing in Jesus, he returns to Palestine to try and learn what he can of the man he killed. Written by John Vogel <jlvogel@comcast.net>","Genre":"Drama, History","Keywords":"nightmare, palestine, robe, crucifixion, box office hit","imdbRating":"6.8","imdbVotes":"6,041","Awards":"Won 2 Oscars. Another 3 wins & 4 nominations.","Metascore":"","Released":"4 December 1953 (France) ","Location":"Corriganville, Ray Corrigan Ranch, Simi Valley, California, USA ","Actors":"Richard Burton, Jean Simmons, Victor Mature ","Writer":"Philip Dunne (screenplay), Gina Kaus (adaptation) | 2 more credits »","Running_time":"PT135M / 2h 15min","Description":"Directed by Henry Koster.  With Richard Burton, Jean Simmons, Victor Mature, Michael Rennie. Marcellus is a tribune in the time of Christ. He is in charge of the group that is assigned to crucify Jesus. Drunk, he wins Jesus' homespun robe after the crucifixion. He is tormented by nightmares and delusions after the event. Hoping to find a way to live with what he has done, and still not believing in Jesus, he returns to Palestine to try and learn what he can of the man he killed.","Rated":"UNRATED"}