{"imdbID":"tt0030149","Title":"Four Daughters","Year":"1938","Director":"Michael Curtiz","Country":"USA","Language":"English, French","Production_Co":"Warner Bros. ","Runtime":"90 min","Cast":"Claude Rains, Jeffrey Lynn, John Garfield, Frank McHugh, May Robson, Gale Page, Dick Foran, Vera Lewis, Tom Dugan, Eddie Acuff, Donald Kerr, Priscilla Lane, Rosemary Lane, Lola Lane","Plot":"Adam Lemp, the Dean of the Briarwood Music Foundation, has passed on his love of music to his four early adult daughters - Thea, Emma, Kay and Ann - who live with him and his sister, the ... See full summary » Adam Lemp, the Dean of the Briarwood Music Foundation, has passed on his love of music to his four early adult daughters - Thea, Emma, Kay and Ann - who live with him and his sister, the girls' Aunt Etta, in the long time family home. Of the four, Kay has the greatest promise as a musical performer, specifically as a singer. Theirs is a loving family, however much the girls exasperate their father with their love of popular music, since he loves only the classics, most specifically Beethoven. The girls support each other however they can, but each is an individual with her own distinct personality and wants, including the type of man each wants as a husband. Practical but deep in her heart romantic Emma has long been courted by their next door neighbor, unassuming florist Ernest Talbot, and clever Thea wants to be Mrs. Ben Crowley, he a wealthy up and coming banker with prospects. Only the youngest, the fun loving Ann, states that she doesn't want to get married. Their collective ... Written by Huggo","Genre":"Drama, Music, Romance","Keywords":"daughter, composer, source music, orchestral music score, classical music","imdbRating":"7.1","imdbVotes":"1,212","Awards":"Nominated for 5 Oscars. Another 2 nominations.","Metascore":"","Released":"9 August 1938 (USA) ","Actors":"Claude Rains, John Garfield, Jeffrey Lynn ","Writer":"Julius J. Epstein (screen play), Lenore J. Coffee (screen play) (as Lenore Coffee) | 1 more credit »","Running_time":"PT90M / 1h 30min","Description":"Directed by Michael Curtiz.  With Claude Rains, John Garfield, Jeffrey Lynn, Frank McHugh. Adam Lemp, the Dean of the Briarwood Music Foundation, has passed on his love of music to his four early adult daughters - Thea, Emma, Kay and Ann - who live with him and his sister, the girls' Aunt Etta, in the long time family home. Of the four, Kay has the greatest promise as a musical performer, specifically as a singer. Theirs is a loving family, however much the girls exasperate their ...","Rated":"APPROVED"}