{"imdbID":"tt0030848","Title":"Test Pilot","Year":"1938","Director":"Victor Fleming","Country":"USA","Language":"English","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"119 min (Turner library print)","Cast":"Clark Gable, Myrna Loy, Spencer Tracy, Lionel Barrymore, Samuel S. Hinds, Marjorie Main, Ted Pearson, Gloria Holden, Louis Jean Heydt, Virginia Grey, Priscilla Lawson, Claudia Coleman, Arthur Aylesworth","Plot":"Jim is a test pilot. His wife Ann and best friend Gunner try their best to keep him sober. But the life of a test pilot is anything but safe. Jim Lane is a test pilot, whose professional life is dangerous, and whose personal life compensates for that danger by fast living and recklessness. As such, he lives from paycheck to paycheck, and is often in debt, but knows his lucrative job will eventually get him out of those debts. On a coast to coast record attempt speed flight, Jim's plane, the Drake Bullet (named after the company's owner), hits some mechanical problems and Jim is forced to make an emergency landing on a farmer's field in Kansas. The farm belongs to the Barton family, whose straight talking daughter, Ann Barton, falls for Jim, and visa versa. They impulsively decide to get married and live in New York. Jim's sidekick and mechanic, \"Gunner\" Morris, doesn't know if Jim and marriage go hand in hand, both because of the type of person he is and his profession. Ann too soon learns that she plays second fiddle to Jim's work, she referring to the sky as Jim's mistress. Ann also truly comes to understand the dangers ... Written by Huggo","Genre":"Drama, Romance","Keywords":"pilot, marriage, danger, mechanic, farm","imdbRating":"7.0","imdbVotes":"1,454","Awards":"Nominated for 3 Oscars. Another 1 nomination.","Metascore":"","Released":"22 April 1938 (USA) ","Location":"Lake Norconian Club, Norco, California, USA ","Actors":"Clark Gable, Myrna Loy, Spencer Tracy ","Writer":"Vincent Lawrence (screen play), Waldemar Young (screen play) | 1 more credit »","Running_time":"PT119M / 1h 59min","Description":"Directed by Victor Fleming.  With Clark Gable, Myrna Loy, Spencer Tracy, Lionel Barrymore. Jim is a test pilot. His wife Ann and best friend Gunner try their best to keep him sober. But the life of a test pilot is anything but safe.","Rated":"PASSED"}