{"imdbID":"tt0030973","Title":"White Banners","Year":"1938","Director":"Edmund Goulding","Country":"USA","Language":"English","Production_Co":"Warner Bros. ","Runtime":"92 min","Cast":"Claude Rains, Fay Bainter, Jackie Cooper, Bonita Granville, Henry O'Neill, Kay Johnson, James Stephenson, J. Farrell MacDonald, William Pawley, Edward Pawley, John Ridgely, Mary Field, Edward McWade","Plot":"A homeless woman named Hannah drifts into the lives of the kindly Ward family, in a small Indiana town in 1919. Hannah makes herself useful as a cook and housekeeper and stays with the ... See full summary » A homeless woman named Hannah drifts into the lives of the kindly Ward family, in a small Indiana town in 1919. Hannah makes herself useful as a cook and housekeeper and stays with the Wards... but her real interest is in meeting their neighbor, teenager Peter Trimble. It turns out that Peter is the son she bore out of wedlock and gave up for adoption, and now Hannah has returned to town to see what sort of young man her son has become. Written by Dan Navarro <daneldorado@yahoo.com>","Genre":"Drama","Keywords":"housekeeper, orchestral music score, struggle, secret, midwest","imdbRating":"7.2","imdbVotes":"302","Awards":"Nominated for 1 Oscar. Another 1 nomination.","Metascore":"","Released":"23 June 1938 (USA) ","Location":"Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA","Actors":"Claude Rains, Fay Bainter, Jackie Cooper ","Writer":"Lloyd C. Douglas (by), Lenore J. Coffee (screenplay) | 3 more credits »","Running_time":"PT92M / 1h 32min","Description":"Directed by Edmund Goulding.  With Claude Rains, Fay Bainter, Jackie Cooper, Bonita Granville. A homeless woman named Hannah drifts into the lives of the kindly Ward family, in a small Indiana town in 1919. Hannah makes herself useful as a cook and housekeeper and stays with the Wards... but her real interest is in meeting their neighbor, teenager Peter Trimble. It turns out that Peter is the son she bore out of wedlock and gave up for adoption, and now Hannah has returned to town to see ...","Rated":"APPROVED"}