{"imdbID":"tt0023969","Title":"Duck Soup","Year":"1933","Director":"Leo McCarey","Taglines":"War Is Swell ...when the Marx Brothers are in it. They'll be out of the trenches by Christmas...if the food doesn't improve","Certificate":"Not Rated | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Cracked Ice ","Production_Co":"Paramount Pictures ","Runtime":"68 min","Sound_Mix":"Mono (Western Electric Noiseless Recording)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"An early draft of the script introduces Freedonia's new dictator Rufus T. Firefly as an agent for an ammunition company, which led to lots of ammunition-salesman jokes and intertwined with the movie's war theme. See more »","Goofs":"When we first see Edgar Kennedy (the lemonade vendor), a cord is visibly hanging from the back of his derby. The cord then disappears and reappears when Pinky switches hats with him. See more »","Cast":"The Marx Brothers, Groucho Marx, Harpo Marx, Chico Marx, Zeppo Marx, Margaret Dumont, Raquel Torres, Louis Calhern, Edmund Breese, Leonid Kinskey, Charles Middleton, Edgar Kennedy","Plot":"Rufus T. Firefly is named president/dictator of bankrupt Freedonia and declares war on neighboring Sylvania over the love of wealthy Mrs. Teasdale. The small state of Freedonia is in a financial mess, borrowing a huge sum of cash from wealthy widow Mrs. Teasdale. She insists on replacing the current president with crazy Rufus T. Firefly and mayhem erupts. To make matters worse, the neighboring state sends inept spies Chicolini and Pinky to obtain top secret information, creating even more chaos! Written by Col Needham <col@imdb.com>","Genre":"Comedy, Musical, War","Keywords":"widow, dowager, dictator, spy, ambassador","imdbRating":"8.0","imdbVotes":"46,152","Awards":"2 wins.","Metascore":"","Released":"17 November 1933 (USA) ","Location":"Sierra de Loja, Granada, Andalucía, Spain ","Actors":"Groucho Marx, Harpo Marx, Chico Marx ","Writer":"Bert Kalmar (story), Harry Ruby (story) | 2 more credits »","Running_time":"PT68M / 1h 8min","Description":"Directed by Leo McCarey.  With Groucho Marx, Harpo Marx, Chico Marx, Zeppo Marx. Rufus T. Firefly is named president/dictator of bankrupt Freedonia and declares war on neighboring Sylvania over the love of wealthy Mrs. Teasdale.","Rated":"NOT RATED"}