{"imdbID":"tt0068361","Title":"The Discreet Charm of the Bourgeoisie","Year":"1972","Director":"Luis Buñuel (as Luis Bunuel)","Certificate":"PG | See all certifications »","Country":"France","Language":"French, Spanish","Also_Known_As":"The Discreet Charm of the Bourgeoisie ","Budget":"$800,000 (estimated)","Opening_Weekend":"$12,864 (USA) (12 May 2000)","Gross":"$198,809 (USA) (1 December 2000)","Production_Co":"Greenwich Film Productions ","Runtime":"102 min","Sound_Mix":"Mono","Color":"Color (Eastmancolor)","Aspect_Ratio":"1.66 : 1","Trivia":"In an interview, John Landis confessed that this film is one of his favorites and that the \"dreams within dreams\" gag in An American Werewolf in London (1981) was heavily inspired by the plot of this film. See more »","Goofs":"After Rafael gives the terrorist champagne, his position in the chair changes between shots. See more »","Cast":"Fernando Rey, Paul Frankeur, Delphine Seyrig, Bulle Ogier, Stéphane Audran, Jean-Pierre Cassel, Julien Bertheau, Milena Vukotic, Maria Gabriella Maione, Claude Piéplu, Muni, Pierre Maguelon, François Maistre, Michel Piccoli, Ellen Bahl","Plot":"A surreal, virtually plotless series of dreams centered around six middle-class people and their consistently interrupted attempts to have a meal together. Several bourgeois friends planning to get together for dinner experience a succession of highly unusual occurrences that interfere with their expected dining enjoyment. Written by Ed Cannon <ecannon@mail.utexas.edu>","Genre":"Comedy, Drama, Fantasy","Keywords":"dream, class, dinner, vomiting, boredom","imdbRating":"8.0","imdbVotes":"26,207","Awards":"Won 1 Oscar. Another 6 wins & 9 nominations.","Metascore":"93","Released":"22 October 1972 (USA) ","Location":"Paris, France ","Actors":"Fernando Rey, Delphine Seyrig, Paul Frankeur ","Writer":"Luis Buñuel (scenario) (as Luis Bunuel), Jean-Claude Carrière (in collaboration with)","Running_time":"PT102M / 1h 42min","Description":"Directed by Luis Buñuel.  With Fernando Rey, Delphine Seyrig, Paul Frankeur, Bulle Ogier. A surreal, virtually plotless series of dreams centered around six middle-class people and their consistently interrupted attempts to have a meal together.","Rated":"PG"}