{"imdbID":"tt0055913","Title":"Divorce Italian Style","Year":"1961","Director":"Pietro Germi","Country":"Italy","Language":"Italian","Production_Co":"Lux Film, Vides Cinematografica, Galatea Film ","Runtime":"105 min","Cast":"Marcello Mastroianni, Daniela Rocca, Stefania Sandrelli, Leopoldo Trieste, Odoardo Spadaro, Margherita Girelli, Angela Cardile, Lando Buzzanca, Pietro Tordi, Ugo Torrente, Antonio Acqua, Bianca Castagnetta, Giovanni Fassiolo, Ignazio Roberto Daidone, Francesco Nicastro","Plot":"A married Sicilian baron falls in love with his cousin and vows to wed her, but with divorce illegal he must concoct a crime of passion to do away with his wife. Baron Fefé Cefalù is a Sicilian nobleman bored of life and of wife Rosalia: he falls in love with young and beautiful cousin Angela, who spends summers in the same palace. Since divorce is impossible in Italy in the 1960s, he decides to kill the wife, knowing that sentence would be very light if he proved that he committed murder for a matter of honour, i.e. when he found the wife together with another man. Therefore, he starts finding a lover for Rosalia, using Carmelo Patané, a painter well-known by her. Written by Alessio F. Bragadini <alessio@dsnet.it>","Genre":"Comedy, Drama, Romance","Keywords":"sicilian, divorce, 1960s, italy, painter","imdbRating":"8.3","imdbVotes":"7,935","Awards":"Won 1 Oscar. Another 11 wins & 9 nominations.","Metascore":"","Released":"17 September 1962 (USA) ","Location":"De Paolis Studios, Rome, Lazio, Italy ","Actors":"Marcello Mastroianni, Daniela Rocca, Stefania Sandrelli ","Writer":"Ennio De Concini (story), Pietro Germi (story) | 4 more credits »","Running_time":"PT105M / 1h 45min","Description":"Directed by Pietro Germi.  With Marcello Mastroianni, Daniela Rocca, Stefania Sandrelli, Leopoldo Trieste. A married Sicilian baron falls in love with his cousin and vows to wed her, but with divorce illegal he must concoct a crime of passion to do away with his wife.","Rated":"NOT RATED"}