{"imdbID":"tt0052738","Title":"The Diary of Anne Frank","Year":"1959","Director":"George Stevens","Country":"USA","Language":"English, German","Budget":"$3,000,000 (estimated)","Production_Co":"Twentieth Century Fox Film Corporation, George Stevens Productions ","Runtime":"180 min | 171 min (FMC Library Print)","Cast":"Millie Perkins, Joseph Schildkraut, Shelley Winters, Richard Beymer, Gusti Huber, Lou Jacobi, Diane Baker, Douglas Spencer, Dodie Heath, Ed Wynn","Plot":"Harrowing story of a young Jewish girl who, with her family and their friends, is forced into hiding in an attic in Nazi-occupied Amsterdam. Based on Anne Frank's diary, and the stage play that was adapted from it: In Nazi-occupied Holland, Otto Frank and his family have decided to go into hiding, because of the increasing persecutions against Jews. The businessman Kraler and his assistant Miep prepare a hiding place in the rooms above their place of business, and arrange for the Franks and another family, the Van Daans, to stay there. Later on, they are joined by the dentist Dussel. Together, they try to avoid detection while hoping for Holland to be liberated by the Allies, but even meeting basic needs can become a challenge, and even minor incidents could present a grave risk. Written by Snow Leopard","Genre":"Biography, Drama, Family","Keywords":"attic, jewish, dentist, diary, fear","imdbRating":"7.4","imdbVotes":"9,378","Awards":"Won 3 Oscars. Another 6 wins & 15 nominations.","Metascore":"","Released":"17 April 1959 (Netherlands) ","Location":"Amsterdam, Noord-Holland, Netherlands ","Actors":"Millie Perkins, Shelley Winters, Joseph Schildkraut ","Writer":"Frances Goodrich (screenplay), Albert Hackett (screenplay) | 3 more credits »","Running_time":"PT180M / 3h","Description":"Directed by George Stevens.  With Millie Perkins, Shelley Winters, Joseph Schildkraut, Richard Beymer. Harrowing story of a young Jewish girl who, with her family and their friends, is forced into hiding in an attic in Nazi-occupied Amsterdam.","Rated":"APPROVED"}