{"imdbID":"tt0037094","Title":"Mr. Skeffington","Year":"1944","Director":"Vincent Sherman","Country":"USA","Language":"English","Production_Co":"Warner Bros. ","Runtime":"146 min","Cast":"Bette Davis, Claude Rains, Walter Abel, George Coulouris, Richard Waring, Marjorie Riordan, Robert Shayne, John Alexander, Jerome Cowan, Johnny Mitchell, Dorothy Peterson, Peter Whitney, Bill Kennedy, Ann Codee, Antonio Filauri","Plot":"Popular and beautiful Fanny Trellis is forced into a loveless marriage with an older man, Jewish banker Job Skeffington, in order to save her beloved brother Trippy from an embezzlement charge and predictable complications result. It's 1914 in New York City. Adult brother and sister Trippy Trellis and Fanny Trellis, whose parents are now deceased, were once wealthy, but Trippy squandered away the family fortune, about which no one knows except their cousin George Trellis and their many creditors. Fanny and Trippy still put on the façade to the outside world that they have money. The beautiful Fanny can have any man that she wants to marry, but she sets her sights on Job Skeffington, the son of Russian-Jewish immigrants. Job's wealth was self-made in finance. They met as Trippy was once employed by Job in his brokerage house. Fanny and Job, who is now aware of the Trellis' financial straits, ultimately do get married, much to the consternation of Fanny's many suitors, but most specifically to Trippy, who knows the reason why Fanny married him. Job also realizes that Fanny does not love him, but is unaware of the real reason she agreed to marry him. After their marriage, Fanny's suitors are still around with more... Written by Huggo","Genre":"Drama, Romance","Keywords":"suitor, jewish, embezzlement, loveless marriage, illness","imdbRating":"7.8","imdbVotes":"3,973","Awards":"Nominated for 2 Oscars.","Metascore":"","Released":"25 May 1944 (USA) ","Location":"Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA","Actors":"Bette Davis, Claude Rains, Walter Abel ","Writer":"Julius J. Epstein (screen play), Philip G. Epstein (screen play) | 1 more credit »","Running_time":"PT146M / 2h 26min","Description":"Directed by Vincent Sherman.  With Bette Davis, Claude Rains, Walter Abel, George Coulouris. Popular and beautiful Fanny Trellis is forced into a loveless marriage with an older man, Jewish banker Job Skeffington, in order to save her beloved brother Trippy from an embezzlement charge and predictable complications result.","Rated":"APPROVED"}