{"imdbID":"tt0064940","Title":"Fellini Satyricon","Year":"1969","Director":"Federico Fellini","Country":"Italy","Language":"Italian, Latin","Budget":"$3,000,000 (estimated)","Production_Co":"Produzioni Europee Associati (PEA) ","Runtime":"128 min","Cast":"Martin Potter, Hiram Keller, Max Born, Salvo Randone, Mario Romagnoli, Magali Noël, Capucine, Alain Cuny, Fanfulla, Danika La Loggia, Giuseppe Sanvitale, Genius, Lucia Bosé, Joseph Wheeler, Hylette Adolphe","Plot":"A series of disjointed mythical tales set in first century Rome. In first century Rome, two student friends, Encolpio and Ascilto, argue about ownership of the boy Gitone, divide their belongings and split up. The boy, allowed to choose who he goes with, chooses Ascilto. Only a sudden earthquake saves Encolpio from suicide. We follow Encolpio through a series of adventures, where he is eventually reunited with Ascilto, and which culminates in them helping a man kidnap a hermaphrodite demi-god from a temple. The god dies, and as punishment Encolpio becomes impotent. We then follow them in search of a cure. The film is loosely based on the book Satyricon by Gaius Petronius Arbiter, the \"Arbiter of Elegance\" in the court of Nero. The book has only survived in fragments, and the film reflects this by being very fragmentary itself, even stopping in mid-sentence. Written by Steven Pemberton <Steven.Pemberton@cwi.nl>","Genre":"Drama, Fantasy, History","Keywords":"roman bath, gay wedding, gay interest, gay kiss, gay","imdbRating":"6.9","imdbVotes":"11,473","Awards":"Nominated for 1 Oscar. Another 5 wins & 7 nominations.","Metascore":"","Released":"11 March 1970 (USA) ","Location":"Cinecittà Studios, Cinecittà, Rome, Lazio, Italy ","Actors":"Martin Potter, Hiram Keller, Max Born ","Writer":"Petronius (book), Federico Fellini (adaptation) | 2 more credits »","Running_time":"PT128M / 2h 8min","Description":"Directed by Federico Fellini.  With Martin Potter, Hiram Keller, Max Born, Salvo Randone. A series of disjointed mythical tales set in first century Rome.","Rated":"R"}