{"imdbID":"tt0050825","Title":"Paths of Glory","Year":"1957","Director":"Stanley Kubrick","Taglines":"BOMBSHELL! the roll of the drums... the click of the rifle-bolts... the last cigarette... and then... the shattering impact of this story... perhaps the most explosive motion picture in 25 years! ","Certificate":"See all certifications »","Country":"USA, West Germany","Language":"English, German, Latin","Also_Known_As":"La patrulla infernal ","Budget":"$935,000 (estimated)","Production_Co":"Bryna Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"88 min","Sound_Mix":"Mono","Color":"Black and White","Aspect_Ratio":"1.66 : 1","Trivia":"Dore Schary, then head of production at MGM, liked The Killing (1956) and hired Stanley Kubrick and James B. Harris to develop film stories from MGM's slush pile of scripts and purchased novels. Finding nothing they liked, Kubrick remembered reading Cobb's book years before and suggested it as their next project. Schary strongly doubted the commercial success of the story, which had already been turned down by every other major studio. After Schary was fired by MGM in a major shake-up, Kubrick and Harris managed to interest Kirk Douglas in a script version that Kubrick had done with Calder Willingham. United Artists agreed to back it with Douglas as the star. See more »","Goofs":"The priest says \"et spiritui sancti\" instead of the correct \"et spiritus sancti\". See more »","Cast":"Kirk Douglas, Ralph Meeker, Adolphe Menjou, George Macready, Wayne Morris, Richard Anderson, Joe Turkel, Christiane Kubrick, Jerry Hausner, Peter Capell, Emile Meyer, Bert Freed, Kem Dibbs, Timothy Carey, Fred Bell","Plot":"After refusing to attack an enemy position, a general accuses the soldiers of cowardice and their commanding officer must defend them. The futility and irony of the war in the trenches in WWI is shown as a unit commander in the French army must deal with the mutiny of his men and a glory-seeking general after part of his force falls back under fire in an impossible attack. Written by Keith Loh <loh@sfu.ca>","Genre":"Drama, War","Keywords":"general, soldier, cannon fodder, french army, cowardice","imdbRating":"8.5","imdbVotes":"115,683","Awards":"Nominated for 1 BAFTA Film Award. Another 4 wins & 2 nominations.","Metascore":"","Released":"25 October 1957 (West Germany) ","Location":"Munich, Bavaria, Germany ","Actors":"Kirk Douglas, Ralph Meeker, Adolphe Menjou ","Writer":"Stanley Kubrick (screenplay), Calder Willingham (screenplay) | 2 more credits »","Running_time":"PT88M / 1h 28min","Description":"Directed by Stanley Kubrick.  With Kirk Douglas, Ralph Meeker, Adolphe Menjou, George Macready. After refusing to attack an enemy position, a general accuses the soldiers of cowardice and their commanding officer must defend them.","Rated":"N/A"}