{"imdbID":"tt0053131","Title":"The Nun's Story","Year":"1959","Director":"Fred Zinnemann","Country":"USA","Language":"English","Budget":"$3,500,000 (estimated)","Runtime":"149 min","Cast":"Audrey Hepburn, Peter Finch, Edith Evans, Peggy Ashcroft, Dean Jagger, Mildred Dunnock, Beatrice Straight, Patricia Collinge, Rosalie Crutchley, Ruth White, Barbara O'Neil, Margaret Phillips, Patricia Bosworth, Colleen Dewhurst, Stephen Murray","Plot":"After leaving a wealthy Belgian family to become a nun, Sister Luke struggles with her devotion to her vows during crisis, disappointment, and World War II. In 1930, in Belgium, Gabrielle van der Mal is the stubborn daughter of the prominent surgeon Dr. Pascin Van Der Mal that decides to leave her the upper-class family to enter to a convent, expecting to work as nun in Congo with tropical diseases. She says good-bye to her sisters Louise and Marie; to her brother Pierre; and to her beloved father, and subjects herself to the stringent rules of the retrograde institution, including interior silent and excessive humbleness and humiliation. After a long period working in a mental institution, Gaby is finally assigned to go to Congo, where she works with the Atheist and cynical, but brilliant, Dr. Fortunati. Sister Luke proves to be very efficient nurse and assistant, and Dr. Fortunati miraculous heals her tuberculosis. Years later, she is ordered to return to Belgium and when her motherland is invaded by the Germans, she learns that her beloved father was murdered by the enemy while he was helping wounded members of the resistance. Sister ... Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Drama","Keywords":"congo, nun, belgium, convent, nurse","imdbRating":"7.6","imdbVotes":"6,848","Awards":"Nominated for 8 Oscars. Another 11 wins & 15 nominations.","Metascore":"","Released":"18 July 1959 (USA) ","Location":"Belgium ","Actors":"Audrey Hepburn, Peter Finch, Edith Evans ","Writer":"Robert Anderson (screenplay), Kathryn Hulme (book) (as Kathryn C. Hulme)","Running_time":"PT149M / 2h 29min","Description":"Directed by Fred Zinnemann.  With Audrey Hepburn, Peter Finch, Edith Evans, Peggy Ashcroft. After leaving a wealthy Belgian family to become a nun, Sister Luke struggles with her devotion to her vows during crisis, disappointment, and World War II.","Rated":"NOT RATED"}