{"imdbID":"tt0077416","Title":"The Deer Hunter","Year":"1978","Director":"Michael Cimino","Taglines":"One of the most important and powerful films of all time! ","Certificate":"R | See all certifications »","Country":"UK, USA","Language":"English, Russian, Vietnamese, French","Also_Known_As":"The Man Who Came to Play ","Budget":"$15,000,000 (estimated)","Gross":"SEK 10,994,967 (Sweden)","Production_Co":"EMI Films, Universal Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"183 min","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby Stereo (35 mm prints)","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"The church used in the wedding sequence was the Theodosius Russian Orthodox Cathedral located in Cleveland, Ohio. One can clearly see the name plaque in one scene. See more »","Goofs":"During a brief moment, the whole camera crew becomes visible in a shop window. See more »","Crazy_Credits":"We gratefully acknowledge the cooperation of our Thai crew in the production of \"The Deer Hunter\" See more »","Cast":"Robert De Niro, John Cazale, John Savage, Christopher Walken, Meryl Streep, George Dzundza, Chuck Aspegren, Shirley Stoler, Rutanya Alda, Pierre Segui, Mady Kaplan, Amy Wright, Mary Ann Haenel, Richard Kuss, Joe Grifasi","Plot":"An in-depth examination of the ways in which the U.S. Vietnam war impacts and disrupts the lives of people in a small industrial town in Pennsylvania. Michael, Steven and Nick are young factory workers from Pennsylvania who enlist into the Army to fight in Vietnam. Before they go, Steven marries the pregnant Angela, and their wedding party also serves as the men's farewell party. After some time and many horrors, the three friends fall in the hands of the Vietcong and are brought to a prison camp in which they are forced to play Russian roulette against each other. Michael makes it possible for them to escape, but they soon get separated again. Written by Leon Wolters <wolters@strw.LeidenUniv.nl>","Genre":"Drama, War","Keywords":"pittsburgh steelers, vietnam, escape, party, friend","imdbRating":"8.2","imdbVotes":"224,646","Awards":"Won 5 Oscars. Another 17 wins & 26 nominations.","Metascore":"73","Released":"23 February 1979 (USA) ","Location":"Mingo Junction, Ohio, USA ","Actors":"Robert De Niro, Christopher Walken, John Cazale ","Writer":"Michael Cimino (story), Deric Washburn (story) | 3 more credits »","Running_time":"PT183M / 3h 3min","Description":"Directed by Michael Cimino.  With Robert De Niro, Christopher Walken, John Cazale, John Savage. An in-depth examination of the ways in which the U.S. Vietnam war impacts and disrupts the lives of people in a small industrial town in Pennsylvania.","Rated":"R"}