{"imdbID":"tt0049833","Title":"The Ten Commandments","Year":"1956","Director":"Cecil B. DeMille (as Cecil B. de Mille)","Country":"USA","Language":"English","Budget":"$13,282,712 (estimated)","Gross":"$80,000,000 (USA)","Production_Co":"Motion Picture Associates (II) ","Runtime":"220 min","Cast":"Charlton Heston, Yul Brynner, Anne Baxter, Edward G. Robinson, Yvonne De Carlo, Debra Paget, John Derek, Cedric Hardwicke, Nina Foch, Martha Scott, Judith Anderson, Vincent Price, John Carradine, Olive Deering, Douglass Dumbrille","Plot":"The Egyptian Prince, Moses, learns of his true heritage as a Hebrew and his divine mission as the deliverer of his people. To escape the edict of Egypt's Pharoah, Rameses I, condemning all newborn Hebrew males, the infant Moses is set adrift on the Nile in a reed basket. Saved by the pharaoh's daughter Bithiah, he is adopted by her and brought up in the court of her brother, Pharaoh Seti. Moses gains Seti's favor and the love of the throne princess Nefertiri, as well as the hatred of Seti's son, Rameses. When his Hebrew heritage is revealed, Moses is cast out of Egypt, and makes his way across the desert where he marries, has a son and is commanded by God to return to Egypt to free the Hebrews from slavery. In Egypt, Moses' fiercest enemy proves to be not Rameses, but someone near to him who can 'harden his heart'. Written by Ron Kerrigan <mvg@whidbey.com>","Genre":"Adventure, Biography, Drama","Keywords":"egypt, hebrew, pharaoh, desert, well","imdbRating":"7.9","imdbVotes":"46,041","Awards":"Won 1 Oscar. Another 5 wins & 8 nominations.","Metascore":"","Released":"5 October 1956 (USA) ","Location":"Ras Safsafa, South Sinai Governorate, Egypt ","Actors":"Charlton Heston, Yul Brynner, Anne Baxter ","Writer":"Dorothy Clarke Wilson (this work contains material from the book \"Prince of Egypt\"), J.H. Ingraham (this work contains material from the book \"Pillar of Fire\") (as Rev. J. H. Ingraham) | 5 more credits »","Running_time":"PT220M / 3h 40min","Description":"Directed by Cecil B. DeMille.  With Charlton Heston, Yul Brynner, Anne Baxter, Edward G. Robinson. The Egyptian Prince, Moses, learns of his true heritage as a Hebrew and his divine mission as the deliverer of his people.","Rated":"APPROVED"}