{"imdbID":"tt0032599","Title":"His Girl Friday","Year":"1940","Director":"Howard Hawks","Taglines":"She learned about men from him! ","Certificate":"Approved | See all certifications »","Country":"USA","Language":"English, French","Also_Known_As":"Howard Hawks' His Girl Friday ","Production_Co":"Columbia Pictures Corporation ","Runtime":"92 min","Sound_Mix":"Mono (Western Electric Mirrophonic Recording)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"In the play the film was based on (\"The Front Page\"), the part of Hildy was played by a man. When director Howard Hawks was planning to make the film, he was going to cast a man. While auditioning actors, a secretary would read the lines belonging to Hildy. Hawks loved the words coming from a woman so much, they decided to rewrite the part for a woman. See more »","Goofs":"When Hildy lights her cigarette in the restaurant, she takes it out of her mouth and waves out the match. There is a an instant cut to over her shoulder and the cigarette is in her mouth again. See more »","Crazy_Credits":"Opening credits are shown over a newspaper background. See more »","Cast":"Cary Grant, Rosalind Russell, Ralph Bellamy, Gene Lockhart, Porter Hall, Ernest Truex, Cliff Edwards, Clarence Kolb, Roscoe Karns, Frank Jenks, Regis Toomey, Abner Biberman, Frank Orth, John Qualen, Helen Mack","Plot":"A newspaper editor uses every trick in the book to keep his ace reporter ex-wife from remarrying. Having been away for four months, Hildy Johnson walks into the offices of the New York City based The Morning Post, where she is a star reporter, to tell her boss, editor Walter Burns, that she is quitting. The reason for her absence was among other things to get a Reno divorce, from, of all people, Walter, who admits he was a bad husband. Hildy divorced Walter largely because she wanted more of a home life, whereas Walter saw her more as a driven hard-boiled reporter than subservient homemaker. Hildy has also come to tell Walter that she is taking the afternoon train to Albany, where she will be getting married tomorrow to staid straight-laced insurance agent, Bruce Baldwin, with whose mother they will live, at least for the first year. Walter doesn't want to lose Hildy, either as a reporter or a wife, and if he does, doesn't believe Bruce is worthy of her. Walter does whatever he can at least to delay Hildy and Bruce's trip, long enough to persuade Hildy to stay for good. His plan ... Written by Huggo","Genre":"Comedy, Drama, Romance","Keywords":"reporter, newspaper, newspaper editor, mayor, insurance agent","imdbRating":"8.0","imdbVotes":"40,099","Awards":"1 win.","Metascore":"","Released":"18 January 1940 (USA) ","Location":"Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA","Actors":"Cary Grant, Rosalind Russell, Ralph Bellamy ","Writer":"Charles Lederer (screen play), Ben Hecht (from the play \"The Front Page\") | 1 more credit »","Running_time":"PT92M / 1h 32min","Description":"Directed by Howard Hawks.  With Cary Grant, Rosalind Russell, Ralph Bellamy, Gene Lockhart. A newspaper editor uses every trick in the book to keep his ace reporter ex-wife from remarrying.","Rated":"APPROVED"}