{"imdbID":"tt0024264","Title":"Little Women","Year":"1933","Director":"George Cukor","Country":"USA","Language":"English, German","Budget":"$424,000 (estimated)","Production_Co":"RKO Radio Pictures ","Runtime":"115 min","Cast":"Katharine Hepburn, Joan Bennett, Paul Lukas, Edna May Oliver, Jean Parker, Frances Dee, Henry Stephenson, Douglass Montgomery, John Lodge, Spring Byington, Samuel S. Hinds, Mabel Colcord, Marion Ballou, Nydia Westman, Harry Beresford","Plot":"Little Women is a \"coming of age\" drama tracing the lives of four sisters: Meg, Jo, Beth and Amy. During the American Civil War, the girls father is away serving as a minister to the troops... See full summary » Little Women is a \"coming of age\" drama tracing the lives of four sisters: Meg, Jo, Beth and Amy. During the American Civil War, the girls father is away serving as a minister to the troops. The family, headed by thier beloved Marmee, must struggle to make ends meet, with the help of their kind and wealthy neighbor, Mr. Laurence, and his high spirited grandson Laurie. Written by Liza Esser <essereli@student.msu.edu>","Genre":"Drama, Family, Romance","Keywords":"american civil war, neighbor, scarlet fever, proposal, love","imdbRating":"7.4","imdbVotes":"4,605","Awards":"Won 1 Oscar. Another 3 wins & 3 nominations.","Metascore":"","Released":"24 November 1933 (USA) ","Location":"Lancaster's Lake, Sunland, Los Angeles, California, USA ","Actors":"Katharine Hepburn, Joan Bennett, Paul Lukas ","Writer":"Louisa May Alcott (by) (as Louisa M. Alcott), Sarah Y. Mason (screen play) | 1 more credit »","Running_time":"PT115M / 1h 55min","Description":"Directed by George Cukor.  With Katharine Hepburn, Joan Bennett, Paul Lukas, Edna May Oliver. Little Women is a \"coming of age\" drama tracing the lives of four sisters: Meg, Jo, Beth and Amy. During the American Civil War, the girls father is away serving as a minister to the troops. The family, headed by thier beloved Marmee, must struggle to make ends meet, with the help of their kind and wealthy neighbor, Mr. Laurence, and his high spirited grandson Laurie.","Rated":"NOT RATED"}