{"imdbID":"tt0026029","Title":"The 39 Steps","Year":"1935","Director":"Alfred Hitchcock","Taglines":"Fated to be Mated with the One Man She Hated ","Certificate":"Unrated | See all certifications »","Country":"UK","Language":"English","Also_Known_As":"Les 39 marches ","Production_Co":"Gaumont British Picture Corporation ","Runtime":"86 min","Sound_Mix":"Mono (British Acoustic Film Full Range Recording System: at Shepherd's Bush London)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"The failure of the original copyright holder to renew the film's copyright resulted in it falling into public domain, meaning that virtually anyone could duplicate and sell a VHS/DVD copy of the film. Therefore, many of the versions of this film available on the market are either severely (and usually badly) edited and/or of extremely poor quality, having been duplicated from second- or third-generation (or more) copies of the film. See more »","Goofs":"The serial number of the autogyro has been reversed, showing that the stock shot has been reversed for effect. See more »","Cast":"Robert Donat, Madeleine Carroll, Lucie Mannheim, Godfrey Tearle, Peggy Ashcroft, John Laurie, Helen Haye, Frank Cellier, Wylie Watson, Gus McNaughton, Jerry Verno, Peggy Simpson","Plot":"A man in London tries to help a counterespionage agent. But when the agent is killed and the man stands accused, he must go on the run to both save himself and also stop a spy ring which is trying to steal top secret information. Richard Hannay is a Canadian visitor to London. At the end of \"Mr Memory\"'s show in a music hall, he meets Annabella Smith who is running away from secret agents. He accepts to hide her in his flat, but in the night she is murdered. Fearing he could be accused on the girl's murder, Hannay goes on the run to break the spy ring. Written by Claudio Sandrini <pulp99@geocities.com>","Genre":"Mystery, Thriller","Keywords":"british noir, on the run, spy, scotland, police","imdbRating":"7.8","imdbVotes":"38,965","Awards":"1 win & 1 nomination.","Metascore":"","Released":"1 August 1935 (USA) ","Location":"Edinburgh, Scotland, UK ","Actors":"Robert Donat, Madeleine Carroll, Lucie Mannheim ","Writer":"John Buchan (adapted from the novel by), Charles Bennett (adaptation) | 1 more credit »","Running_time":"PT86M / 1h 26min","Description":"Directed by Alfred Hitchcock.  With Robert Donat, Madeleine Carroll, Lucie Mannheim, Godfrey Tearle. A man in London tries to help a counterespionage agent. But when the agent is killed and the man stands accused, he must go on the run to both save himself and also stop a spy ring which is trying to steal top secret information.","Rated":"UNRATED"}