{"imdbID":"tt0099685","Title":"Goodfellas","Year":"1990","Director":"Martin Scorsese","Taglines":"Murderers come with smiles. ","Certificate":"A | See all certifications »","Country":"USA","Language":"English, Italian","Also_Known_As":"Buenos muchachos ","Budget":"$25,000,000 (estimated)","Gross":"$46,836,394 (USA)","Production_Co":"Warner Bros. ","":"Show detailed company contact information on IMDbPro »","Runtime":"146 min","Sound_Mix":"Dolby SR","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"According to Martin Scorsese, Marlon Brando tried to persuade him to not make the film. See more »","Goofs":"Shadow in Henry's house when he is talking with Marie about the Lufthansa heist. See more »","Cast":"Robert De Niro, Ray Liotta, Joe Pesci, Lorraine Bracco, Paul Sorvino, Frank Sivero, Tony Darrow, Mike Starr, Frank Vincent, Chuck Low, Frank DiLeo, Henny Youngman, Gina Mastrogiacomo, Catherine Scorsese, Charles Scorsese","Plot":"Henry Hill and his friends work their way up through the mob hierarchy. Henry Hill is a small time gangster, who takes part in a robbery with Jimmy Conway and Tommy De Vito, two other gangsters who have set their sights a bit higher. His two partners kill off everyone else involved in the robbery, and slowly start to climb up through the hierarchy of the Mob. Henry, however, is badly affected by his partners' success, but will he stoop low enough to bring about the downfall of Jimmy and Tommy? Written by Colin Tinto <cst@imdb.com>","Genre":"Biography, Crime, Drama","Keywords":"gangster, organized crime, mafia, betrayal, robbery","imdbRating":"8.7","imdbVotes":"699,434","Awards":"Won 1 Oscar. Another 37 wins & 31 nominations.","Metascore":"89","Released":"21 September 1990 (USA) ","Location":"19 Alfred Lane, New Rochelle, New York, USA ","Actors":"Robert De Niro, Ray Liotta, Joe Pesci ","Writer":"Nicholas Pileggi (book), Nicholas Pileggi (screenplay) | 1 more credit »","Running_time":"PT146M / 2h 26min","Description":"Directed by Martin Scorsese.  With Robert De Niro, Ray Liotta, Joe Pesci, Lorraine Bracco. Henry Hill and his friends work their way up through the mob hierarchy.","Rated":"A"}