{"imdbID":"tt0038213","Title":"The Valley of Decision","Year":"1945","Director":"Tay Garnett","Country":"USA","Language":"English","Budget":"$2,160,000 (estimated)","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"119 min","Cast":"Greer Garson, Gregory Peck, Donald Crisp, Lionel Barrymore, Preston Foster, Marsha Hunt, Gladys Cooper, Reginald Owen, Dan Duryea, Jessica Tandy, Barbara Everest, Marshall Thompson, Geraldine Wall, Evelyn Dockson, John Warburton","Plot":"Mary Rafferty comes from a poor family of steel mill workers in 19th Century Pittsburgh. Her family objects when she goes to work as a maid for the wealthy Scott family which controls the ... See full summary » Mary Rafferty comes from a poor family of steel mill workers in 19th Century Pittsburgh. Her family objects when she goes to work as a maid for the wealthy Scott family which controls the mill. Mary catches the attention of handsome scion Paul Scott, but their romance is complicated by Paul's engagement to someone else and a bitter strike among the mill workers. Written by Daniel Bubbeo <dbubbeo@cmp.com>","Genre":"Drama","Keywords":"strike, union, steel mill, maid, immigrant","imdbRating":"7.5","imdbVotes":"1,234","Awards":"Nominated for 2 Oscars. Another 1 win.","Metascore":"","Released":"June 1945 (USA) ","Location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA ","Actors":"Greer Garson, Gregory Peck, Donald Crisp ","Writer":"John Meehan (screen play), Sonya Levien (screen play) | 1 more credit »","Running_time":"PT119M / 1h 59min","Description":"Directed by Tay Garnett.  With Greer Garson, Gregory Peck, Donald Crisp, Lionel Barrymore. Mary Rafferty comes from a poor family of steel mill workers in 19th Century Pittsburgh. Her family objects when she goes to work as a maid for the wealthy Scott family which controls the mill. Mary catches the attention of handsome scion Paul Scott, but their romance is complicated by Paul's engagement to someone else and a bitter strike among the mill workers.","Rated":"PASSED"}