{"imdbID":"tt0096874","Title":"Back to the Future Part II","Year":"1989","Director":"Robert Zemeckis","Taglines":"Synchronize your watches. The future's coming back... ","Certificate":"PG | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Paradox ","Budget":"$40,000,000 (estimated)","Gross":"$118,500,000 (USA)","Production_Co":"Universal Pictures, Amblin Entertainment, U-Drive Productions ","Runtime":"108 min","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby SR (35 mm prints)","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Renowned scientist Carl Sagan considered this the greatest time travel movie ever made. He praised the accuracy in handling the multiple time lines as what would really happen if time travel were possible. In Back to the Future: The Game, Carl Sagan is the alias used by Doc Brown when visiting Hill Valley in 1931. See more »","Goofs":"When Biff hits Lorraine to the floor in their hotel, her shoes are on. In the next shot, they're off. In the next shot, they're on again. See more »","Crazy_Credits":"The theatrical version had a teaser for Back to the Future Part III (1990). Some later versions do not have a teaser at all, only showing \"To Be Concluded\", and skip to the credits. Some have \"To Be Concluded\" followed by \"Back To The Future III\". Some cable versions retain the teaser for Back To The Future Part III, but, of course, do not say \"Coming Summer 1990\". It was, however, added back to the film for its digital download and Blu-Ray versions. See more »","Cast":"Michael J. Fox, Christopher Lloyd, Lea Thompson, Thomas F. Wilson, Elisabeth Shue, James Tolkan, Jeffrey Weissman, Casey Siemaszko, Billy Zane, J.J. Cohen, Charles Fleischer, E. Casanova Evans, Jay Koch, Charles Gherardi, Ricky Dean Logan","Plot":"After visiting 2015, Marty McFly must repeat his visit to 1955 to prevent disastrous changes to 1985... without interfering with his first trip. Marty McFly has only just gotten back from the past, when he is once again picked up by Dr. Emmett Brown and sent through time to the future. Marty's job in the future is to pose as his own son to prevent him from being thrown in prison. Unfortunately, things get worse when the future changes the present. Written by FilmFanUk","Genre":"Adventure, Comedy, Sci-Fi","Keywords":"year 2015, second part, same actor playing two characters simultaneously on screen, younger version of character, adult actor playing teenage boy","imdbRating":"7.8","imdbVotes":"324,201","Awards":"Nominated for 1 Oscar. Another 9 wins & 6 nominations.","Metascore":"57","Released":"22 November 1989 (USA) ","Location":"161 N. Magnolia Avenue, Monrovia, California, USA ","Actors":"Michael J. Fox, Christopher Lloyd, Lea Thompson ","Writer":"Robert Zemeckis (characters), Bob Gale (characters) | 3 more credits »","Running_time":"PT108M / 1h 48min","Description":"Directed by Robert Zemeckis.  With Michael J. Fox, Christopher Lloyd, Lea Thompson, Thomas F. Wilson. After visiting 2015, Marty McFly must repeat his visit to 1955 to prevent disastrous changes to 1985... without interfering with his first trip.","Rated":"PG"}