{"imdbID":"tt0015864","Title":"The Gold Rush","Year":"1925","Director":"Charles Chaplin","Writer":"Charles Chaplin","Certificate":"Not Rated | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"La quimera del oro ","Budget":"$923,000 (estimated)","Production_Co":"Charles Chaplin Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"95 min (original) | 72 min (1942 re-release) | 81 min (edited)","Sound_Mix":"Mono (RCA Sound System) (1942 re-issue)| Silent (original release)","Color":"Black and White","Aspect_Ratio":"1.33 : 1","Trivia":"A real American Black Bear was used for the scene where the \"Lone Prospector\" encounters the beast. This was unusual for the time, when it was normal for very phoney-looking costumed men to play large animals. See more »","Goofs":"The second cabin scene where they teeter over the edge of a cliff is supposed to be taking place in the daytime. But gaps in the planks of wood making up the cabin reveal a dark background indicating the film was shot indoors on a stage. When the cabin is tilting back and forth a stage light is occasionally visible through a gap in the upper right side of the cabin wall. See more »","Cast":"Charles Chaplin, Mack Swain, Tom Murray, Henry Bergman, Malcolm Waite, Georgia Hale","Plot":"A prospector goes to the Klondike in search of gold and finds it and more. A lone prospector ventures into Alaska looking for gold. He gets mixed up with some burly characters and falls in love with the beautiful Georgia. He tries to win her heart with his singular charm. Written by John J. Magee <magee@helix.mgh.harvard.edu>","Genre":"Adventure, Comedy, Drama","Keywords":"little tramp, gold, klondike, dance hall, dance","imdbRating":"8.3","imdbVotes":"64,675","Awards":"Nominated for 2 Oscars. Another 3 wins & 1 nomination.","Metascore":"","Released":"1925 (Germany) ","Location":"California, USA ","Actors":"Charles Chaplin, Mack Swain, Tom Murray ","Running_time":"PT95M / 1h 35min","Description":"Directed by Charles Chaplin.  With Charles Chaplin, Mack Swain, Tom Murray, Henry Bergman. A prospector goes to the Klondike in search of gold and finds it and more.","Rated":"NOT RATED"}