{"imdbID":"tt0061578","Title":"The Dirty Dozen","Year":"1967","Director":"Robert Aldrich","Taglines":"Train them! Excite them! Arm them!...Then turn them loose on the Nazis! ","Certificate":"Not Rated | See all certifications »","Country":"UK, USA","Language":"English, German, French, Spanish, Latin","Also_Known_As":"Das dreckige Dutzend ","Gross":"SEK 8,990,000 (Sweden)","Production_Co":"Metro-Goldwyn-Mayer (MGM), MKH, Seven Arts Pictures ","Runtime":"150 min","Sound_Mix":"Stereo | 70 mm 6-Track (70 mm prints)","Color":"Color (Metrocolor)","Aspect_Ratio":"1.75 : 1","Trivia":"Jack Palance turned down the Telly Savalas role because he disapproved of the character's racist overtones. See more »","Goofs":"General Worden's barracks cap has gold braid on the visor, incorrect for the World War II period. Douglas MacArthur was the only U.S. Army general who wore a cap (of his own design) with unauthorized gold-braid on the visor during WWII. See more »","Crazy_Credits":"The opening credits don't occur until 10 minutes into the film. While it is common nowadays for films to have a pre-credits sequence, it was considered innovative in 1967. See more »","Cast":"Lee Marvin, Ernest Borgnine, Charles Bronson, Jim Brown, John Cassavetes, Richard Jaeckel, George Kennedy, Trini López, Ralph Meeker, Robert Ryan, Telly Savalas, Donald Sutherland, Clint Walker, Robert Webber, Tom Busby","Plot":"A US Army Major is assigned a dozen convicted murderers to train and lead them into a mass assassination mission of German officers in World War II. A Major with an attitude problem and a history of getting things done is told to interview military prisoners with death sentences or long terms for a dangerous mission; To parachute behind enemy lines and cause havoc for the German Generals at a rest house on the eve of D-Day. Written by John Vogel <jlvogel@comcast.net>","Genre":"Action, Adventure, Thriller","Keywords":"commando mission, major, mission, general, u.s. army","imdbRating":"7.8","imdbVotes":"51,425","Awards":"Won 1 Oscar. Another 3 wins & 8 nominations.","Metascore":"","Released":"15 June 1967 (USA) ","Location":"Aldbury, Hertfordshire, England, UK ","Actors":"Lee Marvin, Ernest Borgnine, Charles Bronson ","Writer":"Nunnally Johnson (screenplay), Lukas Heller (screenplay) | 1 more credit »","Running_time":"PT150M / 2h 30min","Description":"Directed by Robert Aldrich.  With Lee Marvin, Ernest Borgnine, Charles Bronson, John Cassavetes. A US Army Major is assigned a dozen convicted murderers to train and lead them into a mass assassination mission of German officers in World War II.","Rated":"NOT RATED"}