{"imdbID":"tt0046912","Title":"Dial M for Murder","Year":"1954","Director":"Alfred Hitchcock","Taglines":"Is this the man she was waiting for... or the man who was waiting for her? ","Certificate":"PG | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Alfred Hitchcock's Dial M for Murder ","Budget":"$1,400,000 (estimated)","Opening_Weekend":"$12,562 (USA) (9 April 1999)","Gross":"$12,562 (USA) (9 April 1999)","Production_Co":"Warner Bros. ","":"Show detailed company contact information on IMDbPro »","Runtime":"105 min","Sound_Mix":"Mono (RCA Sound System)","Color":"Color (WarnerColor)","Aspect_Ratio":"1.85 : 1","Trivia":"Grace Kelly made three of her eleven films with Alfred Hitchcock, they are Dial M for Murder (1954), To Catch a Thief (1955) & Rear Window (1954). See more »","Goofs":"Wendice shows the Inspector the photo of him and Swann at the reunion. You can see the empty spot on the wall where the photo was. After some conversation between the Inspector and Margo, the photo is back on the wall. See more »","Crazy_Credits":"The title is shown on a background of a British telephone dial; its MN/6 marking is replaced by a single large M which forms the single M of the title. See more »","Cast":"Ray Milland, Grace Kelly, Robert Cummings, John Williams, Anthony Dawson, Leo Britt, Patrick Allen, George Leigh, George Alderson, Robin Hughes","Plot":"An ex-tennis pro carries out a plot to murder his wife. When things go wrong, he improvises a brilliant plan B. In London, wealthy Margot Mary Wendice had a brief love affair with the American writer Mark Halliday while her husband and professional tennis player Tony Wendice was on a tennis tour. Tony quits playing to dedicate to his wife and finds a regular job. She decides to give him a second chance for their marriage. When Mark arrives from America to visit the couple, Margot tells him that she had destroyed all his letters but one that was stolen. Subsequently she was blackmailed, but she had never retrieved the stolen letter. Tony arrives home, claims that he needs to work and asks Margot to go with Mark to the theater. Meanwhile Tony calls Captain Lesgate (aka Charles Alexander Swann who studied with him at college) and blackmails him to murder his wife, so that he can inherit her fortune. But there is no perfect crime, and things do not work as planned. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Crime, Thriller","Keywords":"murder, blackmail, writer, evidence, letter","imdbRating":"8.2","imdbVotes":"101,456","Awards":"Nominated for 1 BAFTA Film Award. Another 3 wins & 2 nominations.","Metascore":"","Released":"29 May 1954 (USA) ","Location":"Stage 20, Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA ","Actors":"Ray Milland, Grace Kelly, Robert Cummings ","Writer":"Frederick Knott (screen play), Frederick Knott (adapted from his play)","Running_time":"PT105M / 1h 45min","Description":"Directed by Alfred Hitchcock.  With Ray Milland, Grace Kelly, Robert Cummings, John Williams. An ex-tennis pro carries out a plot to murder his wife. When things go wrong, he improvises a brilliant plan B.","Rated":"PG"}