{"imdbID":"tt0070917","Title":"The Wicker Man","Year":"1973","Director":"Robin Hardy","Writer":"Anthony Shaffer (screenplay)","Taglines":"Flesh to touch...Flesh to burn! Don't keep the Wicker Man waiting! ","Certificate":"R | See all certifications »","Country":"UK","Language":"English","Also_Known_As":"El culto siniestro ","Budget":"£500,000 (estimated)","Opening_Weekend":"$5,493 (USA) (27 September 2013)","Gross":"$60,891 (USA) (10 January 2014)","Production_Co":"British Lion Film Corporation ","Runtime":"88 min | 99 min (extended) | 94 min (final cut)","Sound_Mix":"Mono","Color":"Color (Eastmancolor)","Aspect_Ratio":"1.37 : 1","Trivia":"The company's advertising executives were appalled by the film's ending, and wanted Anthony Shaffer and Robin Hardy to re-shoot the scene, suggesting a sudden rainstorm which would douse the wicker man's flames, and save Sergeant Howie's life. They refused. See more »","Goofs":"In the scene where Sgt Howie is in the classroom, he places the blackboard duster at an angle on the desk lid where Miss Rose sits, later when he goes to open the desk lid the blackboard duster is now level at the top the desk. See more »","Crazy_Credits":"[Short Version only] A message from the producers thanks \"The Lord Summerisle and the people of his island\" for co-operating in the making of the film. This is despite both the lord and the island being totally fictitious. See more »","Cast":"Edward Woodward, Christopher Lee, Diane Cilento, Britt Ekland, Ingrid Pitt, Lindsay Kemp, Russell Waters, Aubrey Morris, Irene Sunters, Walter Carr, Ian Campbell, Leslie Blackater, Roy Boyd, Peter Brewis, Barbara Rafferty","Plot":"A police sergeant is sent to a Scottish island village in search of a missing girl whom the townsfolk claim never existed. Stranger still are the rites that take place there. Sgt. Howie travels to Summerisle to investigate the disappearance of a young girl. He discovers that the locals are weird and unhelpful, and becomes determined to get to the bottom of the disappearance. Written by Sean Taylor <st52@cornell.edu>","Genre":"Horror, Musical, Mystery","Keywords":"paganism, disappearance, ritual, secret society, religious sacrifice","imdbRating":"7.6","imdbVotes":"45,794","Awards":"1 win & 6 nominations.","Metascore":"","Released":"June 1975 (USA) ","Location":"Burrow Head, Isle of Whithorn, Dumfries & Galloway, Scotland, UK ","Actors":"Edward Woodward, Christopher Lee, Diane Cilento ","Running_time":"PT88M / 1h 28min","Description":"Directed by Robin Hardy.  With Edward Woodward, Christopher Lee, Diane Cilento, Britt Ekland. A police sergeant is sent to a Scottish island village in search of a missing girl whom the townsfolk claim never existed. Stranger still are the rites that take place there.","Rated":"R"}