{"imdbID":"tt0071315","Title":"Chinatown","Year":"1974","Director":"Roman Polanski","Writer":"Robert Towne","Certificate":"See all certifications »","Country":"USA","Language":"English, Cantonese, Spanish","Also_Known_As":"Barrio Chino ","Budget":"$6,000,000 (estimated)","Production_Co":"Paramount Pictures, Penthouse, Long Road Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"130 min","Sound_Mix":"Mono","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Included among the \"1001 Movies You Must See Before You Die\", edited by Steven Schneider. See more »","Goofs":"When Jake gets home after following Mrs. Mulwray and his phone rings, it is clearly not the sound of a 1937 telephone. The sound of his placing the receiver on the cradle is authentic, but the ringer is no earlier than the sixties. See more »","Cast":"Jack Nicholson, Faye Dunaway, John Huston, Perry Lopez, John Hillerman, Darrell Zwerling, Diane Ladd, Roy Jenson, Roman Polanski, Richard Bakalyan, Joe Mantell, Bruce Glover, Nandu Hinds, James O'Rear, James Hong","Plot":"A private detective hired to expose an adulterer finds himself caught up in a web of deceit, corruption and murder. JJ 'Jake' Gittes is a private detective who seems to specialize in matrimonial cases. He is hired by Evelyn Mulwray when she suspects her husband Hollis, builder of the city's water supply system, of having an affair. Gittes does what he does best and photographs him with a young girl but in the ensuing scandal, it seems he was hired by an impersonator and not the real Mrs. Mulwray. When Mr. Mulwray is found dead, Jake is plunged into a complex web of deceit involving murder, incest and municipal corruption all related to the city's water supply. Written by garykmcd","Genre":"Drama, Mystery, Thriller","Keywords":"murder, police, surveillance, neo noir, water","imdbRating":"8.3","imdbVotes":"208,185","Awards":"Won 1 Oscar. Another 20 wins & 23 nominations.","Metascore":"86","Released":"20 June 1974 (USA) ","Location":"Trident Ranch (actor Walter Brennan's then-home), 3240 Sunset Valley Road, Moorpark, California, USA ","Actors":"Jack Nicholson, Faye Dunaway, John Huston ","Running_time":"PT130M / 2h 10min","Description":"Directed by Roman Polanski.  With Jack Nicholson, Faye Dunaway, John Huston, Perry Lopez. A private detective hired to expose an adulterer finds himself caught up in a web of deceit, corruption and murder.","Rated":"N/A"}