{"imdbID":"tt0086190","Title":"Star Wars: Episode VI - Return of the Jedi","Year":"1983","Director":"Richard Marquand","Taglines":"The Saga Continues. ","Country":"USA","Language":"English","Also_Known_As":"El regreso del Jedi ","Budget":"$32,500,000 (estimated)","Opening_Weekend":"$16,293,531 (USA) (14 March 1997)","Gross":"$309,125,409 (USA) (6 June 1997)","Production_Co":"Lucasfilm ","":"Show detailed company contact information on IMDbPro »","Runtime":"131 min | 134 min (special edition)","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby (35 mm prints)","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"In the part where Paploo was barely hanging onto the speeder bike, Paploo was played by stuntman Tony Cox. The crew propped the bike up vertically and filmed Cox dangling from the handlebars, then simply rotated the camera. See more »","Goofs":"When Leia offers Wicket something to eat, as he approaches Leia, you can see her smiling and moving her lips saying something, however, the only thing you hear her say is, \"Come on,\" in a serious tone. See more »","Crazy_Credits":"There are no opening credits. See more »","Cast":"Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, Anthony Daniels, Peter Mayhew, Sebastian Shaw, Ian McDiarmid, Frank Oz, James Earl Jones, David Prowse, Alec Guinness, Kenny Baker, Michael Pennington, Kenneth Colley","Plot":"After rescuing Han Solo from the palace of Jabba the Hutt, the rebels attempt to destroy the second Death Star, while Luke struggles to make Vader return from the dark side of the Force. Darth Vader and the Empire are building a new, indestructible Death Star. Meanwhile, Han Solo has been imprisoned, and Luke Skywalker has sent R2-D2 and C-3PO to try and free him. Princess Leia - disguised as a bounty hunter - and Chewbacca go along as well. The final battle takes place on the moon of Endor, with its natural inhabitants, the Ewoks, lending a hand to the Rebels. Will Darth Vader and the Dark Side overcome the Rebels and take over the universe? Written by Colin Tinto <cst@imdb.com>","Genre":"Action, Adventure, Fantasy","Keywords":"death star, rebel, empire, princess, emperor","imdbRating":"8.4","imdbVotes":"647,633","Awards":"Nominated for 4 Oscars. Another 15 wins & 16 nominations.","Metascore":"52","Released":"25 May 1983 (USA) ","Location":"Castle Dome Peak, Yuma, Arizona, USA ","Actors":"Mark Hamill, Harrison Ford, Carrie Fisher ","Writer":"Lawrence Kasdan (screenplay), George Lucas (screenplay) | 1 more credit »","Running_time":"PT131M / 2h 11min","Description":"Directed by Richard Marquand.  With Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams. After rescuing Han Solo from the palace of Jabba the Hutt, the rebels attempt to destroy the second Death Star, while Luke struggles to make Vader return from the dark side of the Force.","Rated":"PG"}