{"imdbID":"tt0091763","Title":"Platoon","Year":"1986","Director":"Oliver Stone","Writer":"Oliver Stone","Taglines":"The first casualty of war is innocence.","Certificate":"R | See all certifications »","Country":"UK, USA","Language":"English, Vietnamese","Also_Known_As":"Platoon ","Budget":"$6,000,000 (estimated)","Gross":"$137,963,328 (USA)","Production_Co":"Hemdale Film, Cinema 86 ","":"Show detailed company contact information on IMDbPro »","Runtime":"120 min","Sound_Mix":"Stereo (Dolby Stereo)","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Special packs of Marlboro cigarettes were made for the movie on the insistence of Oliver Stone, who wanted the cherry-red color on the pack to more closely match those made during the late 1960s. See more »","Goofs":"When the soldiers are celebrating in the tent early in the film, they are drinking Budweiser from two-piece stay-tab cans with UPC symbols. Container companies introduced the two-piece can in 1974, the stay-tab in 1975 and the UPC symbol in 1978. Budweiser introduced the can style used in the movie in 1981. See more »","Cast":"Tom Berenger, Keith David, Willem Dafoe, Forest Whitaker, Francesco Quinn, Kevin Dillon, John C. McGinley, Reggie Johnson, Mark Moses, Corey Glover, Johnny Depp, Chris Pedersen, Bob Orwig, Corkey Ford, David Neidorf","Plot":"A young recruit in Vietnam faces a moral crisis when confronted with the horrors of war and the duality of man. Chris Taylor is a young, naive American who gives up college and volunteers for combat in Vietnam. Upon arrival, he quickly discovers that his presence is quite nonessential, and is considered insignificant to the other soldiers, as he has not fought for as long as the rest of them and felt the effects of combat. Chris has two non-commissioned officers, the ill-tempered and indestructible Staff Sergeant Robert Barnes and the more pleasant and cooperative Sergeant Elias Grodin. A line is drawn between the two NCOs and a number of men in the platoon when an illegal killing occurs during a village raid. As the war continues, Chris himself draws towards psychological meltdown. And as he struggles for survival, he soon realizes he is fighting two battles, the conflict with the enemy and the conflict between the men within his platoon. Written by Jeremy Thomson","Genre":"Drama, War","Keywords":"vietnam war, vietnam, famous score, hero, 1960s","imdbRating":"8.1","imdbVotes":"281,624","Awards":"Won 4 Oscars. Another 19 wins & 14 nominations.","Metascore":"","Released":"6 February 1987 (USA) ","Location":"Luzon, Philippines ","Actors":"Charlie Sheen, Tom Berenger, Willem Dafoe ","Running_time":"PT120M / 2h","Description":"Directed by Oliver Stone.  With Charlie Sheen, Tom Berenger, Willem Dafoe, Keith David. A young recruit in Vietnam faces a moral crisis when confronted with the horrors of war and the duality of man.","Rated":"R"}