{"imdbID":"tt0094226","Title":"The Untouchables","Year":"1987","Director":"Brian De Palma","Taglines":"What are you prepared to do? ","Certificate":"R | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Los intocables ","Budget":"$25,000,000 (estimated)","Gross":"$76,270,454 (USA)","Production_Co":"Paramount Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"119 min","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby (35 mm prints)","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"The only scenes that have both Kevin Costner and Robert De Niro together are the scenes in the hotel lobby and the courtroom. See more »","Goofs":"While the judge at Capone's trial should have allowed the defense to examine and approve the new jurors when the jury was exchanged, the defense objected and was overruled, so this would be a point for appeal. Also the jury switch is almost exactly how it happened in real life, exception that is was prior to the trial Capone was found to bribe the jury. See more »","Crazy_Credits":"The title of the aria \"Vesti la giubba\" from Leoncavallo's opera \"Pagliacci\" is misspelled in the closing credits of the film: \"Vesti la guibba\". See more »","Cast":"Kevin Costner, Sean Connery, Charles Martin Smith, Andy Garcia, Robert De Niro, Richard Bradford, Jack Kehoe, Brad Sullivan, Billy Drago, Patricia Clarkson, Vito D'Ambrosio, Steven Goldstein, Peter Aylward, Don Harvey, Robert Swan","Plot":"Federal Agent Eliot Ness sets out to stop Al Capone; because of rampant corruption, he assembles a small, hand-picked team. Federal agent Elliot Ness assembles a personal team of mob fighters to bring Chicago crime boss Al Capone to justice using unconventional means during the mob wars of the 1920s. This fictionalized account of the arrest of Al Capone is heavy on style and gunfire. The end shootout combines a baby carriage and stairs with a nod to Eisenstein's _The Battleship Potemkin_. Written by Keith Loh <loh@sfu.ca>","Genre":"Crime, Drama, Thriller","Keywords":"tax evasion, year 1930, tough cop, white suit, corrupt judge","imdbRating":"8.0","imdbVotes":"213,016","Awards":"Won 1 Oscar. Another 10 wins & 15 nominations.","Metascore":"79","Released":"3 June 1987 (USA) ","Location":"209 S LaSalle St, Chicago, Illinois, USA ","Actors":"Kevin Costner, Sean Connery, Robert De Niro ","Writer":"Oscar Fraley (suggested by book), Eliot Ness (suggested by book) | 1 more credit »","Running_time":"PT119M / 1h 59min","Description":"Directed by Brian De Palma.  With Kevin Costner, Sean Connery, Robert De Niro, Charles Martin Smith. Federal Agent Eliot Ness sets out to stop Al Capone; because of rampant corruption, he assembles a small, hand-picked team.","Rated":"R"}