{"imdbID":"tt0097814","Title":"Kiki's Delivery Service","Year":"1989","Director":"Hayao Miyazaki","Taglines":"I was feeling blue, but I'm better now.","Certificate":"G | See all certifications »","Country":"Japan","Language":"Japanese, English","Also_Known_As":"Kiki's Delivery Service ","Budget":"JPY 800,000,000 (estimated)","Opening_Weekend":"$735,603 (France) (2 April 2004)","Gross":"$735,603 (France) (2 April 2004)","Production_Co":"Nibariki, Nippon Television Network (NTV), Studio Ghibli ","Runtime":"103 min","Sound_Mix":"Dolby","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"67,317 traditional \"cels\" were used for this movie. See more »","Goofs":"The Disney dub refers several times to the airship as a \"dirigible\", which is correct, but also as a \"blimp\", which it isn't; it is a zeppelin, a rigid airship with an internal skeleton that holds it in shape, not a blimp, which is basically a big helium-inflated balloon held in shape by the helium. See more »","Crazy_Credits":"In the Disney english version:In Memory of Phil Hartman 1948-1998 See more »","Cast":"Minami Takayama, Rei Sakuma, Kappei Yamaguchi, Keiko Toda, Mieko Nobusawa, Kôichi Miura, Haruko Katô, Hiroko Seki, Yuriko Fuchizaki, Kôichi Yamadera, Kikuko Inoue, Yûko Kobayashi, Mika Doi, Takaya Hashi, Chika Sakamoto","Plot":"A young witch, on her mandatory year of independent life, finds fitting into a new community difficult while she supports herself by running an air courier service. This is the story of a young witch, named Kiki who is now thirteen years old. But she is still a little green and plenty headstrong, but also resourceful, imaginative, and determined. With her trusty wisp of a talking cat named Jiji by her side she's ready to take on the world, or at least the quaintly European seaside village she's chosen as her new home. Written by Anthony Pereyra (hypersonic91@yahoo.com)","Genre":"Animation, Adventure, Drama","Keywords":"goodwill, based on book, witch, talking cat, cat","imdbRating":"7.9","imdbVotes":"72,395","Awards":"4 wins.","Metascore":"","Released":"29 July 1989 (Japan) ","Actors":"Kirsten Dunst, Minami Takayama, Rei Sakuma ","Writer":"Eiko Kadono (novel), Hayao Miyazaki (screenplay)","Running_time":"PT103M / 1h 43min","Description":"Directed by Hayao Miyazaki.  With Kirsten Dunst, Minami Takayama, Rei Sakuma, Kappei Yamaguchi. A young witch, on her mandatory year of independent life, finds fitting into a new community difficult while she supports herself by running an air courier service.","Rated":"G"}