{"imdbID":"tt0080339","Title":"Airplane!","Year":"1980","Taglines":"The craziest flight you'll ever take! ","Certificate":"PG | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Kentucky Fried Airplane ","Budget":"$3,500,000 (estimated)","Gross":"$83,400,000 (USA)","Production_Co":"Paramount Pictures ","Runtime":"88 min","Sound_Mix":"4-Track Stereo","Color":"Color (Metrocolor)","Aspect_Ratio":"1.85 : 1","Trivia":"The shots of the planes taking off were taken by directors Jim Abrahams, David Zucker and Jerry Zucker. As this was their first big-budget film, they didn't realize that the 2nd unit should have been taking shots like this. See more »","Goofs":"Cracks can be seen in the control tower window before McCroskey jumps through it. See more »","Crazy_Credits":"The closing credits are followed by a brief scene of California tax revolt leader Howard Jarvis in the abandoned taxi from earlier in the film, still waiting for the driver to come back and saying \"Well, I'll give him another twenty minutes, but that's it!\" See more »","Cast":"Kareem Abdul-Jabbar, Lloyd Bridges, Peter Graves, Julie Hagerty, Robert Hays, Leslie Nielsen, Lorna Patterson, Robert Stack, Stephen Stucker, Otto, Jim Abrahams, Frank Ashmore, Jonathan Banks, Craig Berenson, Barbara Billingsley","Plot":"A man afraid to fly must ensure that a plane lands safely after the pilots become sick. Still craving for the love of his life, Ted Striker follows Elaine onto the flight that she is working on as a member of the cabin crew. Elaine doesn't want to be with Ted anymore, but when the crew and passengers fall ill from food poisoning, all eyes are on Ted. Written by FilmFanUk","Genre":"Comedy","Keywords":"pilot, air traffic controller, airport, airplane, spoof","imdbRating":"7.8","imdbVotes":"155,086","Awards":"Nominated for 1 Golden Globe. Another 2 wins & 6 nominations.","Metascore":"","Released":"2 July 1980 (USA) ","Location":"Westward Beach - Westward Beach Road, Malibu, California, USA ","Actors":"Robert Hays, Julie Hagerty, Leslie Nielsen ","Director":"Jim Abrahams, David Zucker | 1 more credit »","Writer":"Jim Abrahams (written for the screen by), David Zucker (written for the screen by) | 1 more credit »","Running_time":"PT88M / 1h 28min","Description":"Directed by Jim Abrahams, David Zucker, Jerry Zucker.  With Robert Hays, Julie Hagerty, Leslie Nielsen, Kareem Abdul-Jabbar. A man afraid to fly must ensure that a plane lands safely after the pilots become sick.","Rated":"PG"}