{"imdbID":"tt0028950","Title":"La Grande Illusion","Year":"1937","Director":"Jean Renoir","Country":"France","Language":"French, German, English, Russian","Gross":"$172,885 (USA) (30 November 2012)","Production_Co":"Réalisation d'art cinématographique (RAC) ","Runtime":"114 min | 94 min (1937 release)","Cast":"Jean Gabin, Dita Parlo, Pierre Fresnay, Erich von Stroheim, Julien Carette, Georges Péclet, Werner Florian, Jean Dasté, Sylvain Itkine, Gaston Modot, Marcel Dalio","Plot":"During the first World War, two French soldiers are captured and imprisoned in a German P.O.W. camp. Several escape attempts follow until they are sent to a seemingly impenetrable fortress which seems impossible to escape from. During 1st WW, two French officers are captured. Captain De Boeldieu is an aristocrat while Lieutenant Marechal was a mechanic in civilian life. They meet other prisoners from various backgrounds, as Rosenthal, son of wealthy Jewish bankers. They are separated from Rosenthal before managing to escape. A few months later, they meet again in a fortress commanded by the aristocrat Van Rauffenstein. De Boeldieu strikes up a friendship with him but Marechal and Rosenthal still want to escape... Written by Yepok","Genre":"Drama, War","Keywords":"world war one, pow, escape, captain, military","imdbRating":"8.1","imdbVotes":"25,657","Awards":"Nominated for 1 Oscar. Another 5 wins & 1 nomination.","Metascore":"","Released":"12 September 1938 (USA) ","Location":"Chamonix, Haute-Savoie, France ","Actors":"Jean Gabin, Dita Parlo, Pierre Fresnay ","Writer":"Charles Spaak (scenario and dialogue), Jean Renoir (scenario and dialogue)","Running_time":"PT114M / 1h 54min","Description":"Directed by Jean Renoir.  With Jean Gabin, Dita Parlo, Pierre Fresnay, Erich von Stroheim. During the first World War, two French soldiers are captured and imprisoned in a German P.O.W. camp. Several escape attempts follow until they are sent to a seemingly impenetrable fortress which seems impossible to escape from.","Rated":"UNRATED"}