{"imdbID":"tt0026056","Title":"Alice Adams","Year":"1935","Director":"George Stevens","Country":"USA","Language":"English","Production_Co":"RKO Radio Pictures ","Runtime":"99 min","Cast":"Katharine Hepburn, Fred MacMurray, Fred Stone, Evelyn Venable, Frank Albertson, Ann Shoemaker, Charley Grapewin, Grady Sutton, Hedda Hopper, Jonathan Hale, Hattie McDaniel, Walter Brennan","Plot":"The misadventures of two social-climbing women in small town America. In the small town of South Renford, Alice Adams comes from a working class background, although she aspires to be among the upper class. Alice's mother blames her husband for their low social standing, despite his working hard and Alice not blaming him for anything. Regardless, Alice tries to do whatever necessary to put on appearances of wealth and social standing, despite everyone in that class in town knowing who she is, and thus largely ignoring her because of her false airs. First meeting at a society ball, Alice surprisingly catches the eye of Arthur Russell, surprisingly as he purportedly is engaged to débutante Mildred Palmer. As Alice continues to hide her true social standing from Arthur as he courts her, Mrs. Adams pressures Mr. Adams into doing something he doesn't want to do in an effort truly to become part of the business class, that measure which entails sinking all his money into a business venture. Beyond the time when Arthur finds out the true nature behind Alice's ... Written by Huggo","Genre":"Comedy, Drama, Romance","Keywords":"small town, wealth, dinner, garment button, sewing","imdbRating":"7.1","imdbVotes":"2,669","Awards":"Nominated for 2 Oscars. Another 1 win & 1 nomination.","Metascore":"","Released":"13 November 1935 (Argentina) ","Location":"RKO Encino Ranch - Balboa Boulevard & Burbank Boulevard, Encino, Los Angeles, California, USA","Actors":"Katharine Hepburn, Fred MacMurray, Fred Stone ","Writer":"Booth Tarkington (novel), Dorothy Yost (screen play) | 2 more credits »","Running_time":"PT99M / 1h 39min","Description":"Directed by George Stevens.  With Katharine Hepburn, Fred MacMurray, Fred Stone, Evelyn Venable. The misadventures of two social-climbing women in small town America.","Rated":"APPROVED"}