{"imdbID":"tt0086879","Title":"Amadeus","Year":"1984","Director":"Milos Forman","Taglines":"The man... The music... The madness... The murder... The motion picture... ","Country":"USA, France","Language":"English, Italian, Latin, German","Also_Known_As":"Amadeus: The Director's Cut ","Budget":"$18,000,000 (estimated)","Opening_Weekend":"$86,764 (USA) (5 April 2002)","Gross":"$51,600,000 (USA)","Production_Co":"AMLF, The Saul Zaentz Company ","":"Show detailed company contact information on IMDbPro »","Runtime":"160 min | 180 min (director's cut)","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby Digital (director's cut)| Dolby (35 mm prints)","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Tom Hulce and F. Murray Abraham had a deliberately distant working relationship during the making of the film, much their characters do. See more »","Goofs":"Near the end when the bed-ridden Mozart is dictating a movement of his Requiem to Salieri, he tells him to write the bass instruments' notes as the \"tonic and dominant\" pitches in the key of A minor. But the notes that play, and the notes that actually appear in the score, are the tonic and sub-dominant. See more »","Crazy_Credits":"The producer, screenplay writer and director thank the following for their boundless assistance in our effort to present the physical authenticity and aura you have seen and felt in \"Amadeus\": -The National Theatre of Czechoslovakia and Prague's Tyl Theatre management for allowing us to film in the Tyl sequences from the operas: \"Abduction from the Seraglio,\" \"The Marriage of Figaro,\" and \"Don Giovanni.\" It was actually in this magnificently preserved theatre that Wolfgang Amadeus Mozart conducted the premiere performance of \"Don Giovanni\" on October 29, 1787. -His Eminence Cardinal Frantisek Tomasek for his kindness in permitting us to use his beautiful residence headquarters in Prague as the Emperor's palace. -The Barrandov Studios and CS Filmexport for their help in filming \"Amadeus\" in Prague and in castles and palaces throughout Czechoslovakia. See more »","Cast":"F. Murray Abraham, Tom Hulce, Elizabeth Berridge, Roy Dotrice, Simon Callow, Christine Ebersole, Jeffrey Jones, Charles Kay, Kenneth McMillan, Kenny Baker, Lisbeth Bartlett, Barbara Bryne, Martin Cavina, Roderick Cook, Milan Demjanenko","Plot":"The incredible story of Wolfgang Amadeus Mozart, told by his peer and secret rival Antonio Salieri - now confined to an insane asylum. Antonio Salieri believes that Wolfgang Amadeus Mozart's music is divine and miraculous. He wishes he was himself as good a musician as Mozart so that he can praise the Lord through composing. He began his career as a devout man who believes his success and talent as a composer are God's rewards for his piety. He's also content as the respected, financially well-off, court composer of Austrian Emperor Joseph II. But he's shocked to learn that Mozart is such a vulgar creature, and can't understand why God favored Mozart to be his instrument. Salieri's envy has made him an enemy of God whose greatness was evident in Mozart. He is ready to take revenge against God and Mozart for his own musical mediocrity. Written by Khaled Salem","Genre":"Biography, Drama, Music","Keywords":"composer, classical composer, opera, first person narration, 1800s","imdbRating":"8.3","imdbVotes":"260,282","Awards":"Won 8 Oscars. Another 33 wins & 14 nominations.","Metascore":"93","Released":"5 April 1985 (USA) ","Location":"Tyl Theatre, Plzen, Czech Republic ","Actors":"F. Murray Abraham, Tom Hulce, Elizabeth Berridge ","Writer":"Peter Shaffer (original stage play), Peter Shaffer (original screenplay)","Running_time":"PT160M / 2h 40min","Description":"Directed by Milos Forman.  With F. Murray Abraham, Tom Hulce, Elizabeth Berridge, Roy Dotrice. The incredible story of Wolfgang Amadeus Mozart, told by his peer and secret rival Antonio Salieri - now confined to an insane asylum.","Rated":"R"}