{"imdbID":"tt0061138","Title":"A Man and a Woman","Year":"1966","Director":"Claude Lelouch","Writer":"Pierre Uytterhoeven","Country":"France","Language":"French","Production_Co":"Les Films 13 ","Runtime":"102 min","Cast":"Anouk Aimée, Jean-Louis Trintignant, Pierre Barouh, Valérie Lagrange, Antoine Sire, Souad Amidou, Henri Chemin, Yane Barry, Paul Le Person, Simone Paris, Gérard Sire","Plot":"A man and a woman meet by accident on a Sunday evening at their childrens' boarding school. Slowly they reveal themselves to each other, finding that each is a widow/widower. Each is slow ... See full summary » A man and a woman meet by accident on a Sunday evening at their childrens' boarding school. Slowly they reveal themselves to each other, finding that each is a widow/widower. Each is slow to reveal anything personal so that each revelation is hidden by a misperception. They become friends, then close friends, and then she reveals that she can't have a lover because, for her, her husband's memory is still too strong. Much of the film is told wordlessly in action, or through hearing one of their thoughts as they go about their day. Written by John Vogel <jlvogel@comcast.net>","Genre":"Drama, Romance","Keywords":"deauville, car chase, paris france, love, famous theme","imdbRating":"7.7","imdbVotes":"6,614","Awards":"Won 2 Oscars. Another 11 wins & 10 nominations.","Metascore":"","Released":"12 July 1966 (USA) ","Location":"Saintes-Maries-de-la-Mer, France ","Actors":"Anouk Aimée, Jean-Louis Trintignant, Pierre Barouh ","Running_time":"PT102M / 1h 42min","Description":"Directed by Claude Lelouch.  With Anouk Aimée, Jean-Louis Trintignant, Pierre Barouh, Valérie Lagrange. A man and a woman meet by accident on a Sunday evening at their childrens' boarding school. Slowly they reveal themselves to each other, finding that each is a widow/widower. Each is slow to reveal anything personal so that each revelation is hidden by a misperception. They become friends, then close friends, and then she reveals that she can't have a lover because, for her, her husband's memory ...","Rated":"UNRATED"}