{"imdbID":"tt0058946","Title":"The Battle of Algiers","Year":"1966","Director":"Gillo Pontecorvo","Taglines":"The French Colonel...who was forced even to torture! One of the many women...who stopped at nothing to win! The Algerian Street Boy...who became a rebel hero! ","Certificate":"Not Rated | See all certifications »","Country":"Italy, Algeria","Language":"French, Arabic, English","Also_Known_As":"The Battle of Algiers ","Budget":"$800,000 (estimated)","Opening_Weekend":"$64,870 (USA) (9 January 2004)","Gross":"$815,345 (USA) (10 September 2004)","Production_Co":"Igor Film, Casbah Film ","Runtime":"121 min","Sound_Mix":"Mono","Color":"Black and White","Aspect_Ratio":"1.85 : 1","Trivia":"Director Gillo Pontecorvo and composer Ennio Morricone had regular disagreements over the movie's score. At one point, Pontecorvo had a melody stuck in his mind which he desperately wanted as a theme in the movie. He went to Morricone's apartment to play it for him, and hummed the tune all the way up to the top floor. Then Morricone asked him to wait with the tune, since he had conceived a melody of his own. To Pontecorvo's surprise, the tune was exactly the same as the one he had in mind, and he was delighted to find out that after all those months of struggling, they had finally found something, separate from each other, on which they could agree. It wasn't until months later at the Venice film festival that Morricone admitted that he had pulled a prank on him; he had already heard Pontecorvo humming the song while coming up the stairs, and decided to pretend he had come up with the same melody himself. See more »","Goofs":"The foot responsible for tripping Ali when running down the street changes from the right to the left foot between cuts. See more »","Cast":"Jean Martin, Yacef Saadi, Brahim Hadjadj, Samia Kerbash, Tommaso Neri, Ugo Paletti, Fusia El Kader, Franco Moruzzi, Mohamed Ben Kassen","Plot":"In the 1950s, fear and violence escalate as the people of Algiers fight for independence from the French government. A film commissioned by the Algerian government that shows the Algerian revolution from both sides. The French foreign legion has left Vietnam in defeat and has something to prove. The Algerians are seeking independence. The two clash. The torture used by the French is contrasted with the Algerian's use of bombs in soda shops. A look at war as a nasty thing that harms and sullies everyone who participates in it. Written by John Vogel <jlvogel@comcast.net>","Genre":"Drama, War","Keywords":"algerian, independence, military, torture, bomb","imdbRating":"8.1","imdbVotes":"35,487","Awards":"Nominated for 3 Oscars. Another 9 wins & 5 nominations.","Metascore":"94","Released":"20 September 1967 (USA) ","Location":"Algeria ","Actors":"Brahim Hadjadj, Jean Martin, Yacef Saadi ","Writer":"Franco Solinas, Franco Solinas (story) (as F. Solinas) | 1 more credit »","Running_time":"PT121M / 2h 1min","Description":"Directed by Gillo Pontecorvo.  With Brahim Hadjadj, Jean Martin, Yacef Saadi, Samia Kerbash. In the 1950s, fear and violence escalate as the people of Algiers fight for independence from the French government.","Rated":"NOT RATED"}