{"imdbID":"tt0074285","Title":"Carrie","Year":"1976","Director":"Brian De Palma","Country":"USA","Language":"English","Budget":"$1,800,000 (estimated)","Production_Co":"Red Bank Films ","Runtime":"98 min","Cast":"Sissy Spacek, Piper Laurie, Amy Irving, William Katt, John Travolta, Nancy Allen, Betty Buckley, P.J. Soles, Priscilla Pointer, Sydney Lassick, Stefan Gierasch, Michael Talbott, Doug Cox, Harry Gold, Noelle North","Plot":"Carrie White, a shy and outcast 17 year-old girl who is sheltered by her domineering, religious mother, unleashes her telekinetic powers after being humiliated by her classmates at her senior prom. It's nearing the end of the school year. High school senior Carrie White is a social outcast, largely due to being unwise to the ways of the world based on her upbringing. Her mother, Margaret White, is a religious fanatic, her extreme views primarily targeted against sex, which she believes is a sin. She even believes natural associated processes such as menstruation are a sin, about which she has refused to mention to Carrie. Mrs. White's beliefs were taken to that extreme largely because of her own failed marriage and her husband Ralph long ago having run off with another woman. The only adult authority figure who tries to help Carrie with her life is her phys ed teacher, Miss Collins, who is nonetheless warned not to get too close to go against how Mrs. White chooses to raise Carrie, Mrs. White whose beliefs are well known in the community. An impromptu event that happens among Carrie's phys ed classmates against her leads to her classmates being punished. One of those students, ... Written by Huggo","Genre":"Fantasy, Horror","Keywords":"telekinesis, blood, prank, female full frontal nudity, bad mother","imdbRating":"7.4","imdbVotes":"121,685","Awards":"Nominated for 2 Oscars. Another 3 wins & 5 nominations.","Metascore":"","Released":"3 November 1976 (USA) ","Location":"124 N 7th St, Santa Paula, California, USA ","Actors":"Sissy Spacek, Piper Laurie, Amy Irving ","Writer":"Stephen King (novel), Lawrence D. Cohen (screenplay)","Running_time":"PT98M / 1h 38min","Description":"Directed by Brian De Palma.  With Sissy Spacek, Piper Laurie, Amy Irving, John Travolta. Carrie White, a shy and outcast 17 year-old girl who is sheltered by her domineering, religious mother, unleashes her telekinetic powers after being humiliated by her classmates at her senior prom.","Rated":"R"}