{"imdbID":"tt0020938","Title":"The Green Goddess","Year":"1930","Director":"Alfred E. Green (as Alfred Green)","Country":"USA","Language":"English","Production_Co":"Warner Bros. ","Runtime":"73 min","Cast":"George Arliss, Ralph Forbes, H.B. Warner, Alice Joyce, Ivan F. Simpson, Reginald Sheffield, Betty Boyd, Nigel De Brulier, David Tearle","Plot":"An airplane carrying three Brits--Major Crespin, his wife Lucille, and Dr. Trahern--crash lands in the kingdom of Rukh. The Rajah holds them prisoner because the British are about to ... See full summary » An airplane carrying three Brits--Major Crespin, his wife Lucille, and Dr. Trahern--crash lands in the kingdom of Rukh. The Rajah holds them prisoner because the British are about to execute his three half-brothers in neighboring India. His subjects believe that their Green Goddess has given them the lives of the three Brits as payment for the lives of the Rajah's brothers. They will execute them when the brothers are executed. Trahern and the Crespins must figure a way to use the Rajah's radio to call India for help. Written by Anonymous","Genre":"Adventure","Keywords":"india, pre code, british colonial, based on play","imdbRating":"5.5","imdbVotes":"198","Awards":"Nominated for 1 Oscar.","Metascore":"","Released":"13 February 1930 (USA) ","Location":"Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA ","Actors":"George Arliss, Ralph Forbes, H.B. Warner ","Writer":"William Archer (by), Julien Josephson (screen version)","Running_time":"PT73M / 1h 13min","Description":"Directed by Alfred E. Green.  With George Arliss, Ralph Forbes, H.B. Warner, Alice Joyce. An airplane carrying three Brits--Major Crespin, his wife Lucille, and Dr. Trahern--crash lands in the kingdom of Rukh. The Rajah holds them prisoner because the British are about to execute his three half-brothers in neighboring India. His subjects believe that their Green Goddess has given them the lives of the three Brits as payment for the lives of the Rajah's brothers. They will execute them...","Rated":"PASSED"}