{"imdbID":"tt0021931","Title":"The Guardsman","Year":"1931","Director":"Sidney Franklin","Country":"USA","Language":"English","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"82 min","Cast":"Alfred Lunt, Lynn Fontanne, Roland Young, Zasu Pitts, Maude Eburne, Herman Bing","Plot":"A Vienna based acting couple make magic when they perform together on stage. Unknown to the theater going public and despite being married for only six months, that magic seems no longer to... See full summary » A Vienna based acting couple make magic when they perform together on stage. Unknown to the theater going public and despite being married for only six months, that magic seems no longer to translate to their personal life, where they are constantly arguing, even under their breaths during on-stage curtain calls. These arguments stem from the actress' moody behavior, which the actor believes means that she no longer loves him and that she is looking for another man to replace him in her personal life. He believes she even scans the audience for potential suitors, probably being most attracted to the soldier type. Their feuding is at a point where they take pot shots at each other about everything in their lives, even the quality of the other's acting. The actor may have a valid point as the actress has been receiving bouquets of roses of late and a Russian guardsman has been seen hanging around outside their home. The actor knows these things as he is that Russian guardsman (who is ... Written by Huggo","Genre":"Comedy, Drama","Keywords":"actor, russian, actress, soldier, marriage","imdbRating":"6.7","imdbVotes":"323","Awards":"Nominated for 2 Oscars. Another 1 win.","Metascore":"","Released":"7 November 1931 (USA) ","Actors":"Alfred Lunt, Lynn Fontanne, Roland Young ","Writer":"Ferenc Molnár (from the play by) (as Ferenc Molnar), Ernest Vajda (screen play) | 1 more credit »","Running_time":"PT82M / 1h 22min","Description":"Directed by Sidney Franklin.  With Alfred Lunt, Lynn Fontanne, Roland Young, Zasu Pitts. A Vienna based acting couple make magic when they perform together on stage. Unknown to the theater going public and despite being married for only six months, that magic seems no longer to translate to their personal life, where they are constantly arguing, even under their breaths during on-stage curtain calls. These arguments stem from the actress' moody behavior, which the actor believes ...","Rated":"PASSED"}