{"imdbID":"tt0050839","Title":"Peyton Place","Year":"1957","Director":"Mark Robson","Country":"USA","Language":"English","Gross":"$25,600,000 (USA)","Production_Co":"Twentieth Century Fox Film Corporation, Jerry Wald Productions ","Runtime":"157 min","Cast":"Lana Turner, Lee Philips, Lloyd Nolan, Arthur Kennedy, Russ Tamblyn, Terry Moore, Hope Lange, Diane Varsi, David Nelson, Barry Coe, Betty Field, Mildred Dunnock, Leon Ames, Lorne Greene, Robert H. Harris","Plot":"A peaceful New England town hides secrets and scandals. It's the pre-WWII era. Peyton Place is a small town in New England, whose leading adult citizens rule the town with their high moral standards, which they try to pass on to their offspring. The adults, especially those that wield power largely through their positions and/or through their wealth, will not tolerate anything they believe morally improper, even if there is a hint of impropriety without comprehensive evidence to back up the hints. As their offspring grow from teenagers to adults, the offspring learn that there is much hypocrisy by the adults lying underneath that façade of proper Christian morals. The offspring begin to rebel in different ways, which is brought to public scrutiny with the arrival into town of an \"outsider\", the new young high school principal Michael Rossi, and through a murder trial. Written by Huggo","Genre":"Drama, Romance","Keywords":"rape, raped by stepfather, rape of a minor, new england, trial","imdbRating":"7.2","imdbVotes":"3,888","Awards":"Nominated for 9 Oscars. Another 2 wins & 8 nominations.","Metascore":"","Released":"3 March 1958 (Sweden) ","Location":"Belfast, Maine, USA ","Actors":"Lana Turner, Lee Philips, Lloyd Nolan ","Writer":"John Michael Hayes (screenplay), Grace Metalious (from the novel by)","Running_time":"PT157M / 2h 37min","Description":"Directed by Mark Robson.  With Lana Turner, Lee Philips, Lloyd Nolan, Arthur Kennedy. A peaceful New England town hides secrets and scandals.","Rated":"APPROVED"}