{"imdbID":"tt0054997","Title":"The Hustler","Year":"1961","Director":"Robert Rossen","Taglines":"They called him \"Fast Eddie\"... He was a winner... He was a loser... He was a hustler. ","Certificate":"Unrated | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Robert Rossen's The Hustler ","Budget":"$2,000,000 (estimated)","Production_Co":"Rossen Films, Twentieth Century Fox Film Corporation ","":"Show detailed company contact information on IMDbPro »","Runtime":"134 min","Sound_Mix":"Mono (Westrex Recording System)","Color":"Black and White","Aspect_Ratio":"2.35 : 1","Trivia":"Gen. Colin Powell lists this as one of his favorite movies. See more »","Goofs":"Just before Eddie makes the cross corner shot, Fats in the background has the pool cue in his left hand. After Eddie makes the cross corner shot, Fats is tapping his cue on the floor with his right hand. See more »","Cast":"Paul Newman, Jackie Gleason, Piper Laurie, George C. Scott, Myron McCormick, Murray Hamilton, Michael Constantine, Stefan Gierasch, Clifford A. Pellow, Jake LaMotta, Gordon B. Clarke, Alexander Rose, Carolyn Coates, Carl York, Vincent Gardenia","Plot":"An up-and-coming pool player plays a long-time champion in a single high-stakes match. \"Fast\" Eddie Felson is a small-time pool hustler with a lot of talent but a self-destructive attitude. His bravado causes him to challenge the legendary \"Minnesota Fats\" to a high-stakes match, but he loses in a heartbreaking marathon. Now broke and without his long-time manager, Felson faces an uphill battle to regain his confidence and his game. It isn't until he hits rock bottom that he agrees to join up with ruthless and cutthroat manager Bert Gordon. Gordon agrees to take him on the road to learn the ropes. But Felson soon realizes that making it to the top could cost him his soul, and perhaps his girlfriend. Will he decide that this is too steep a price to pay in time to save himself? Written by <jgp3553@yahoo.com>","Genre":"Drama, Sport","Keywords":"manager, pool hall, drink, partner, money","imdbRating":"8.1","imdbVotes":"61,508","Awards":"Won 2 Oscars. Another 11 wins & 19 nominations.","Metascore":"","Released":"25 September 1961 (USA) ","Location":"Downtown, Los Angeles, California, USA ","Actors":"Paul Newman, Jackie Gleason, Piper Laurie ","Writer":"Sidney Carroll (screenplay) (as Sydney Carroll), Robert Rossen (screenplay) | 1 more credit »","Running_time":"PT134M / 2h 14min","Description":"Directed by Robert Rossen.  With Paul Newman, Jackie Gleason, Piper Laurie, George C. Scott. An up-and-coming pool player plays a long-time champion in a single high-stakes match.","Rated":"UNRATED"}