{"imdbID":"tt0089424","Title":"Kiss of the Spider Woman","Year":"1985","Director":"Hector Babenco","Country":"Brazil, USA","Language":"English, French, Portuguese, German","Gross":"$4,952,880 (USA)","Production_Co":"HB Filmes, FilmDallas Pictures ","Runtime":"120 min","Cast":"William Hurt, Raul Julia, Sonia Braga, José Lewgoy, Milton Gonçalves, Míriam Pires, Nuno Leal Maia, Fernando Torres, Patricio Bisso, Herson Capri, Denise Dumont, Nildo Parente, Antônio Petrin, Wilson Grey, Miguel Falabella","Plot":"Luis Molina and Valentin Arregui are cell mates in a South American prison. Luis, a trans individual, is found guilty of immoral behavior and Valentin is a political prisoner. To escape ... See full summary » Luis Molina and Valentin Arregui are cell mates in a South American prison. Luis, a trans individual, is found guilty of immoral behavior and Valentin is a political prisoner. To escape reality Luis invents romantic movies, while Valentin tries to keep his mind on the situation he's in. During the time they spend together, the two men come to understand and respect one another. Written by Leon Wolters <wolters@strw.LeidenUniv.nl>","Genre":"Drama, Romance","Keywords":"prison, homosexual, revolutionary, nazi propaganda, nazi","imdbRating":"7.5","imdbVotes":"10,445","Awards":"Won 1 Oscar. Another 10 wins & 11 nominations.","Metascore":"80","Released":"26 July 1985 (USA) ","Location":"Julio Prestes Train Station, São Paulo, Brazil ","Actors":"William Hurt, Raul Julia, Sonia Braga ","Writer":"Manuel Puig (based on the novel by), Leonard Schrader","Running_time":"PT120M / 2h","Description":"Directed by Hector Babenco.  With William Hurt, Raul Julia, Sonia Braga, José Lewgoy. Luis Molina and Valentin Arregui are cell mates in a South American prison. Luis, a trans individual, is found guilty of immoral behavior and Valentin is a political prisoner. To escape reality Luis invents romantic movies, while Valentin tries to keep his mind on the situation he's in. During the time they spend together, the two men come to understand and respect one another.","Rated":"R"}