{"imdbID":"tt0053125","Title":"North by Northwest","Year":"1959","Director":"Alfred Hitchcock","Writer":"Ernest Lehman","Taglines":"A 2000 MILE CHASE . . . That blazes a trail of TERROR to a gripping, spine-chilling climax ! ","Certificate":"See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Intriga internacional ","Budget":"$3,101,000 (estimated)","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","":"Show detailed company contact information on IMDbPro »","Runtime":"136 min","Sound_Mix":"Mono (Westrex Recording System)| Dolby SR | Dolby Digital","Color":"Color (Technicolor)","Aspect_Ratio":"1.75 : 1","Trivia":"MGM tried to persuade Alfred Hitchcock to use their Ultra-Panavision system which utilized a 65mm negative with a slight anamorphic squeeze. When projected, the image would be free of grain and quite wide. Hitchcock reportedly balked at using this large format, and instead insisted on going with Vistavision which was the format used in several of his Paramount productions. Going with Ultra-Panavision would have meant Bernard Herrmann's score would have been heard in magnetic stereo. The Vistavision prints utilized optical mono sound. Ironic that the version shown now has an entirely new soundtrack mixed in stereo. See more »","Goofs":"The line \"our friend who's assembling the General Assembly\" is a deliberate play on words, and it's in the script. It is not a case of Thornhill (or actor Cary Grant) erroneously saying \"assembling\" instead of \"addressing\". See more »","Crazy_Credits":"The Leo the Lion/MGM trademark preceding the credits is on a green field, to match the green field used in the credits proper. See more »","Cast":"Cary Grant, Eva Marie Saint, James Mason, Jessie Royce Landis, Leo G. Carroll, Josephine Hutchinson, Philip Ober, Martin Landau, Adam Williams, Edward Platt, Robert Ellenstein, Les Tremayne, Philip Coolidge, Patrick McVey, Edward Binns","Plot":"A hapless New York advertising executive is mistaken for a government agent by a group of foreign spies, and is pursued across the country while he looks for a way to survive. Madison Avenue advertising man Roger Thornhill finds himself thrust into the world of spies when he is mistaken for a man by the name of George Kaplan. Foreign spy Philip Vandamm and his henchman Leonard try to eliminate him but when Thornhill tries to make sense of the case, he is framed for murder. Now on the run from the police, he manages to board the 20th Century Limited bound for Chicago where he meets a beautiful blond, Eve Kendall, who helps him to evade the authorities. His world is turned upside down yet again when he learns that Eve isn't the innocent bystander he thought she was. Not all is as it seems however, leading to a dramatic rescue and escape at the top of Mt. Rushmore. Written by garykmcd","Genre":"Adventure, Crime, Mystery","Keywords":"spy, government agent, fugitive, on the run, unlikely hero","imdbRating":"8.4","imdbVotes":"212,760","Awards":"Nominated for 3 Oscars. Another 8 wins & 4 nominations.","Metascore":"","Released":"26 September 1959 (Japan) ","Location":"Garces Highway 1/10th mile East from Corcoran Road and Kern National Wildlife Preserve, Kern County, California, USA ","Actors":"Cary Grant, Eva Marie Saint, James Mason ","Running_time":"PT136M / 2h 16min","Description":"Directed by Alfred Hitchcock.  With Cary Grant, Eva Marie Saint, James Mason, Jessie Royce Landis. A hapless New York advertising executive is mistaken for a government agent by a group of foreign spies, and is pursued across the country while he looks for a way to survive.","Rated":"N/A"}