{"imdbID":"tt0047580","Title":"Three Coins in the Fountain","Year":"1954","Director":"Jean Negulesco","Country":"USA","Language":"English, Italian","Production_Co":"Twentieth Century Fox Film Corporation ","Runtime":"102 min","Cast":"Clifton Webb, Dorothy McGuire, Jean Peters, Louis Jourdan, Maggie McNamara, Rossano Brazzi, Howard St. John, Kathryn Givney, Cathleen Nesbitt","Plot":"American girls dream of finding romance in Rome, but there is none for secretaries, Anita tells her replacement at the USDA. But Maria soon meets Prince Dino de Cessi at a party at her ... See full summary » American girls dream of finding romance in Rome, but there is none for secretaries, Anita tells her replacement at the USDA. But Maria soon meets Prince Dino de Cessi at a party at her boss's home who invites her to fly to Venice in his private plane. Frances, who has been in Rome for 15 years as the secretary of a successful American writer who talks a lot like George Bernard Shaw and is just as elusive as Professor Henry Higgins in \"My Fair Lady,\" tells her at first to say \"no\" and then decides that together they can handle the man nicknamed the predatory prince. Coins tossed in the Trevi Fountain can indeed work magic. Written by Dale O'Connor <daleoc@interaccess.com>","Genre":"Drama","Keywords":"fountain, secretary, prince, coin, italian","imdbRating":"6.3","imdbVotes":"2,112","Awards":"Won 2 Oscars. Another 3 nominations.","Metascore":"","Released":"May 1954 (USA) ","Location":"Dolomite Mountains, Italy ","Actors":"Clifton Webb, Dorothy McGuire, Jean Peters ","Writer":"John Patrick (screen play), John H. Secondari (from a novel by)","Running_time":"PT102M / 1h 42min","Description":"Directed by Jean Negulesco.  With Clifton Webb, Dorothy McGuire, Jean Peters, Louis Jourdan. American girls dream of finding romance in Rome, but there is none for secretaries, Anita tells her replacement at the USDA. But Maria soon meets Prince Dino de Cessi at a party at her boss's home who invites her to fly to Venice in his private plane. Frances, who has been in Rome for 15 years as the secretary of a successful American writer who talks a lot like George Bernard Shaw and is just as...","Rated":"UNRATED"}