{"imdbID":"tt0015648","Title":"Battleship Potemkin","Year":"1925","Director":"Sergei M. Eisenstein (as S.M. Eisenstein)","Writer":"Nina Agadzhanova (script by) (as N.F. Agadzhanova-Shutko)","Taglines":"Revolution is the only lawful, equal, effectual war. It was in Russia that this war was declared and begun.","Certificate":"Unrated | See all certifications »","Country":"Soviet Union","Language":"Russian","Also_Known_As":"Battleship Potemkin ","Opening_Weekend":"$2,283 (USA) (21 January 2011)","Gross":"$50,970 (USA) (13 January 2012)","Production_Co":"Goskino, Mosfilm ","Runtime":"75 min | 68 min (DVD edition) | 72 min (Blu-ray)","Sound_Mix":"Silent","Color":"Black and White","Aspect_Ratio":"1.25 : 1","Trivia":"The staircase sequence in this film inspired the famous staircase shootout scene in, \"The Untouchables.\" See more »","Goofs":"In the firing squad scene, just before the mutiny, the ship's priest taps a crucifix upon his right hand, holding it in his left. As the shot cuts to a close-up of the cross, it instantly switches hands. See more »","Cast":"Aleksandr Antonov, Vladimir Barsky, Grigori Aleksandrov, Ivan Bobrov, Mikhail Gomorov, Aleksandr Levshin, N. Poltavtseva, Konstantin Feldman, Prokopenko, A. Glauberman, Beatrice Vitoldi, Daniil Antonovich, Brodsky, Julia Eisenstein, Sergei M. Eisenstein","Plot":"A dramatized account of a great Russian naval mutiny and a resulting street demonstration which brought on a police massacre. Based on the historical events the movie tells the story of a riot at the battleship Potemkin. What started as a protest strike when the crew was given rotten meat for dinner ended in a riot. The sailors raised the red flag and tried to ignite the revolution in their home port Odessa. Written by Konstantin Dlutskii <ked@falcon.cc.ukans.edu>","Genre":"Drama, History, War","Keywords":"revolt, russian navy, social discontent, russian revolution, year 1905","imdbRating":"8.0","imdbVotes":"38,998","Awards":"1 win.","Metascore":"","Released":"24 December 1925 (Soviet Union) ","Location":"Alupka, Crimea, Ukraine ","Actors":"Aleksandr Antonov, Vladimir Barsky, Grigori Aleksandrov ","Running_time":"PT66M / 1h 6min","Description":"Directed by Sergei M. Eisenstein.  With Aleksandr Antonov, Vladimir Barsky, Grigori Aleksandrov, Ivan Bobrov. A dramatized account of a great Russian naval mutiny and a resulting street demonstration which brought on a police massacre.","Rated":"UNRATED"}