{"imdbID":"tt0049223","Title":"Forbidden Planet","Year":"1956","Director":"Fred M. Wilcox (as Fred McLeod Wilcox)","Taglines":"Amazing! ","Certificate":"Passed | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Alarm im Weltall ","Budget":"$1,900,000 (estimated)","Gross":"$3,000,000 (USA)","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"98 min","Sound_Mix":"Mono (Perspecta Sound encoding) (Western Electric Sound System)","Color":"Color (Eastmancolor) (as Eastman Color)","Aspect_Ratio":"2.55 : 1","Trivia":"The famous poster for the film shows a menacing robot carrying a struggling pretty girl - a staple of \"monster movie\" posters from the 1950's. In fact, no such scene occurs in the film itself and the robot portrayed in the poster is of course actually the very likeable Robby the Robot. See more »","Goofs":"When the Monster is burning/melting the metal door, as it turns white hot and lumps start to fall, you can see a member of the crew in a heatproof suit prodding the material from behind to make it fall. Watch the second and third holes for movement behind the door. Then again, this motion could be taken to be the monster doing the poking... See more »","Cast":"Walter Pidgeon, Anne Francis, Leslie Nielsen, Warren Stevens, Jack Kelly, Richard Anderson, Earl Holliman, Robby the Robot, George Wallace, Robert Dix, Jimmy Thompson, James Drury, Harry Harvey Jr., Roger McGee, Peter Miller","Plot":"A starship crew goes to investigate the silence of a planet's colony only to find two survivors and a deadly secret that one of them has. When Adams and his crew are sent to investigate the silence from a planet inhabited by scientists, he finds all but two have died. Dr. Morbius and his daughter Altaira have somehow survived a hideous monster which roams the planet. Unknown to Adams, Morbius has made a discovery, and has no intention of sharing it (or his daughter!) with anyone. Written by Rob Hartill","Genre":"Action, Adventure, Family","Keywords":"spaceship, nightmare, cult film, alien civilization, flying saucer","imdbRating":"7.7","imdbVotes":"32,822","Awards":"Nominated for 1 Oscar. Another 1 win & 1 nomination.","Metascore":"","Released":"15 March 1956 (USA) ","Location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA","Actors":"Walter Pidgeon, Anne Francis, Leslie Nielsen ","Writer":"Cyril Hume (screen play), Irving Block (based on a story by) | 1 more credit »","Running_time":"PT98M / 1h 38min","Description":"Directed by Fred M. Wilcox.  With Walter Pidgeon, Anne Francis, Leslie Nielsen, Warren Stevens. A starship crew goes to investigate the silence of a planet's colony only to find two survivors and a deadly secret that one of them has.","Rated":"PASSED"}