{"imdbID":"tt0052311","Title":"Touch of Evil","Year":"1958","Director":"Orson Welles","Taglines":"The Strangest Vengeance Ever Planned! ","Country":"USA","Language":"English, Spanish","Also_Known_As":"Badge of Evil ","Budget":"$829,000 (estimated)","Opening_Weekend":"$70,725 (USA) (11 September 1998)","Gross":"$2,237,659 (USA) (1 January 1999)","Production_Co":"Universal International Pictures (UI) ","":"Show detailed company contact information on IMDbPro »","Runtime":"95 min | 111 min (1998 alternate) | 108 min (1975 alternate) | 112 min (director's cut) | 106 min (DVD edition) | 111 min (restored)","Sound_Mix":"Mono (Westrex Recording System)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Captain Quinlan is not seen without his hat during the entire film. See more »","Goofs":"When Susan Vargas (Janet Leigh) came into her Mirador Motel's room for the first time the shadow of a boom mic is reflected in the ceiling. See more »","Crazy_Credits":"In the 111-minute restored version, there are no credits at all until the end of the film. See more »","Cast":"Charlton Heston, Janet Leigh, Orson Welles, Joseph Calleia, Akim Tamiroff, Joanna Moore, Ray Collins, Dennis Weaver, Valentin de Vargas, Mort Mills, Victor Millan, Lalo Rios, Michael Sargent, Phil Harvey, Joi Lansing","Plot":"A stark, perverse story of murder, kidnapping, and police corruption in a Mexican border town. Mexican Narcotics officer Ramon Miguel 'Mike' Vargas has to interrupt his honeymoon on the Mexican-US border when an American building contractor is killed after someone places a bomb in his car. He's killed on the US side of the border but it's clear that the bomb was planted on the Mexican side. As a result, Vargas delays his return to Mexico City where he has been mounting a case against the Grandi family crime and narcotics syndicate. Police Captain Hank Quinlan is in charge on the US side and he soon has a suspect, a Mexican named Manolo Sanchez. Vargas is soon onto Quinlan and his Sergeant, Pete Menzies, when he catches them planting evidence to convict Sanchez. With his new American wife, Susie, safely tucked away in a hotel on the US side of the border - or so he thinks - he starts to review Quinlan's earlier cases. While concentrating on the corrupt policeman however, the Grandis have their own plans for Vargas and they start with his wife Susie. Written by garykmcd","Genre":"Crime, Film-Noir, Thriller","Keywords":"mexican, border, honeymoon, evidence, investigation","imdbRating":"8.1","imdbVotes":"70,144","Awards":"6 wins & 1 nomination.","Metascore":"","Released":"1 May 1958 (UK) ","Location":"Universal Studios - 100 Universal City Plaza, Universal City, California, USA ","Actors":"Charlton Heston, Orson Welles, Janet Leigh ","Writer":"Orson Welles (screenplay), Whit Masterson (based on the novel \"Badge Of Evil\" by)","Running_time":"PT95M / 1h 35min","Description":"Directed by Orson Welles.  With Charlton Heston, Orson Welles, Janet Leigh, Joseph Calleia. A stark, perverse story of murder, kidnapping, and police corruption in a Mexican border town.","Rated":"PG-13"}