{"imdbID":"tt0099566","Title":"The Field","Year":"1990","Director":"Jim Sheridan","Country":"Ireland","Language":"English","Budget":"IEP 5,000,000 (estimated)","Gross":"$1,414,017 (USA)","Production_Co":"Granada Television, Noel Pearson, Sovereign Pictures ","Runtime":"107 min","Cast":"Richard Harris, Sean Bean, Frances Tomelty, Brenda Fricker, John Hurt, Ruth McCabe, Jer O'Leary, Noel O'Donovan, John Cowley, Ronan Wilmot, Jenny Conroy, Joan Sheehy, Sean McGinley, Malachy McCourt, Frank McDonald","Plot":"\"Bull\" McCabe's family has farmed a field for generations, sacrificing endlessly for the sake of the land. And when the widow who owns the field decides to sell the field in a public ... See full summary » \"Bull\" McCabe's family has farmed a field for generations, sacrificing endlessly for the sake of the land. And when the widow who owns the field decides to sell the field in a public auction, McCabe knows that he must own it. But while no one in the village would dare bid against him, an American with deep pockets decides that he needs the field to build a highway. The Bull and his son decide to convince the American to give up bidding on the field, but things go horribly wrong. Written by Kathy Li","Genre":"Drama, Thriller","Keywords":"field, american, widow, land, public auction","imdbRating":"7.4","imdbVotes":"4,054","Awards":"Nominated for 1 Oscar. Another 3 nominations.","Metascore":"","Released":"March 1991 (USA) ","Location":"Aasleigh Church, Aasleigh, County Galway, Ireland ","Actors":"Richard Harris, John Hurt, Sean Bean ","Writer":"Jim Sheridan (screenplay), John B. Keane (play)","Running_time":"PT107M / 1h 47min","Description":"Directed by Jim Sheridan.  With Richard Harris, John Hurt, Sean Bean, Frances Tomelty. \"Bull\" McCabe's family has farmed a field for generations, sacrificing endlessly for the sake of the land. And when the widow who owns the field decides to sell the field in a public auction, McCabe knows that he must own it. But while no one in the village would dare bid against him, an American with deep pockets decides that he needs the field to build a highway. The Bull and his son decide to ...","Rated":"PG-13"}