{"imdbID":"tt0090557","Title":"'Round Midnight","Year":"1986","Director":"Bertrand Tavernier","Country":"USA, France","Language":"English, French","Gross":"$3,272,600 (USA)","Production_Co":"Little Bear, PECF ","Runtime":"133 min","Cast":"Dexter Gordon, François Cluzet, Gabrielle Haker, Sandra Reaves-Phillips, Lonette McKee, Christine Pascal, Herbie Hancock, Bobby Hutcherson, Pierre Trabaud, Frédérique Meininger, Hart Leroy Bibbs, Liliane Rovère, Ged Marlon, Benoît Régent, Victoria Gabrielle Platt","Plot":"In 'Round Midnight, real-life jazz legend Dexter Gordon brilliantly portrays the fictional tenor sax player Dale Turner, a musician slowly losing the battle with alcoholism, estranged from ... See full summary » In 'Round Midnight, real-life jazz legend Dexter Gordon brilliantly portrays the fictional tenor sax player Dale Turner, a musician slowly losing the battle with alcoholism, estranged from his family, and hanging on by a thread in the 1950's New York jazz world. Dale gets an offer to play in Paris, where, like many other black American musicians at the time, he enjoys a respect for his humanity that is not based upon the color of his skin. A Parisian man who is obsessed with Turner's music befriends him and attempts to save Turner from himself. Although for Dale the damage is already done, his poignant relationship with the man and his young daughter re-kindles his spirit and his music as the end draws near. Written by Siddy DeRosser","Genre":"Drama, Music","Keywords":"musician, jazz, alcoholism, jazz music, self destructiveness","imdbRating":"7.4","imdbVotes":"3,685","Awards":"Won 1 Oscar. Another 9 wins & 11 nominations.","Metascore":"","Released":"3 October 1986 (USA) ","Location":"Lyon, Rhône, Rhône-Alpes, France ","Actors":"Dexter Gordon, François Cluzet, Gabrielle Haker ","Writer":"David Rayfiel (screenplay), Bertrand Tavernier (screenplay) | 1 more credit »","Running_time":"PT133M / 2h 13min","Description":"Directed by Bertrand Tavernier.  With Dexter Gordon, François Cluzet, Gabrielle Haker, Sandra Reaves-Phillips. In 'Round Midnight, real-life jazz legend Dexter Gordon brilliantly portrays the fictional tenor sax player Dale Turner, a musician slowly losing the battle with alcoholism, estranged from his family, and hanging on by a thread in the 1950's New York jazz world. Dale gets an offer to play in Paris, where, like many other black American musicians at the time, he enjoys a respect for his humanity ...","Rated":"R"}