{"imdbID":"tt0058182","Title":"A Hard Day's Night","Year":"1964","Director":"Richard Lester","Writer":"Alun Owen (original screenplay)","Taglines":"THE BEATLES in Their First Full Length, Hilarious Action-Packed Film ","Certificate":"Approved | See all certifications »","Country":"UK","Language":"English, German, French","Also_Known_As":"Quatre garçons dans le vent ","Budget":"$560,000 (estimated)","Opening_Weekend":"$50,445 (USA) (1 December 2000)","Gross":"$515,005 (USA) (18 July 2014)","Production_Co":"Proscenium Films, Walter Shenson Films, Maljack Productions ","Runtime":"87 min","Sound_Mix":"Mono (RCA Sound Recording)","Color":"Black and White","Aspect_Ratio":"1.75 : 1","Trivia":"When shooting began, The Beatles had not yet joined Equity, the British actors' union. They were hastily inducted on the set with Wilfrid Brambell proposing their membership, and Norman Rossington seconding the motion. See more »","Goofs":"The final concert contains 3 songs (\"If I Fell\", \"I Should Have Known Better\", \"She Loves You\") for which John played an acoustic guitar on rhythm. However, he plays his electric guitar throughout the concert. See more »","Crazy_Credits":"The opening credits are superimposed over the action. The Beatles are running from a mob of fans while the title track plays. See more »","Cast":"The Beatles, John Lennon, Paul McCartney, George Harrison, Ringo Starr, Wilfrid Brambell, Norman Rossington, John Junkin, Victor Spinetti, Anna Quayle, Deryck Guyler, Richard Vernon, Edward Malin, Robin Ray, Lionel Blair","Plot":"A 'typical' day in the life of the Beatles, including many of their famous songs. The Beatles--the world's most famous rock and roll band--travel from their home town of Liverpool to London to perform in a television broadcast. Along the way they must rescue Paul's unconventional grandfather from various misadventures and drummer Ringo goes missing just before the crucial concert. Written by Jim Beaver <jumblejim@prodigy.net>","Genre":"Comedy, Musical","Keywords":"manager, television, concert, boy, drummer","imdbRating":"7.7","imdbVotes":"30,551","Awards":"Nominated for 2 Oscars. Another 2 wins & 5 nominations.","Metascore":"96","Released":"6 July 1964 (UK) ","Location":"Charlotte Street, Fitzrovia, London, England, UK ","Actors":"John Lennon, Paul McCartney, George Harrison ","Running_time":"PT87M / 1h 27min","Description":"Directed by Richard Lester.  With John Lennon, Paul McCartney, George Harrison, Ringo Starr. A 'typical' day in the life of the Beatles, including many of their famous songs.","Rated":"APPROVED"}