{"imdbID":"tt0078902","Title":"Breaking Away","Year":"1979","Director":"Peter Yates","Writer":"Steve Tesich","Country":"USA","Language":"English, Italian, French","Production_Co":"Twentieth Century Fox Film Corporation ","Runtime":"101 min","Cast":"Dennis Christopher, Dennis Quaid, Daniel Stern, Jackie Earle Haley, Barbara Barrie, Paul Dooley, Robyn Douglass, Hart Bochner, Amy Wright, Peter Maloney, John Ashton, Lisa Shure, Jennifer K. Mickel, P.J. Soles, David K. Blase","Plot":"A small-town boy obsessed with the Italian cycling team vies for the affections of a college girl. Best friends Dave, Mike, Cyril and Moocher have just graduated from high school. Living in the college town of Bloomington, Indiana, they are considered \"cutters\": the working class of the town so named since most of the middle aged generation, such as their parents, worked at the local limestone quarry, which is now a swimming hole. There is great animosity between the cutters and the generally wealthy Indiana University students, each group who have their own turf in town. The dichotomy is that the limestone was used to build the university, which is now seen as being too good for the locals who built it. Although each of the four is a totally different personality from the other three, they also have in common the fact of being unfocused and unmotivated in life. The one slight exception is Dave. Although he has no job and doesn't know what to do with his life, he is a champion bicycle racer. He idolizes the Italian cycling team so much he pretends to be Italian, much to the chagrin... Written by Huggo","Genre":"Comedy, Drama, Sport","Keywords":"italian, cycling, indiana, college town, swimming","imdbRating":"7.7","imdbVotes":"16,888","Awards":"Won 1 Oscar. Another 10 wins & 14 nominations.","Metascore":"","Released":"20 July 1979 (USA) ","Location":"Highway 37/Dixie Highway ","Actors":"Dennis Christopher, Dennis Quaid, Daniel Stern ","Running_time":"PT101M / 1h 41min","Description":"Directed by Peter Yates.  With Dennis Christopher, Dennis Quaid, Daniel Stern, Jackie Earle Haley. A small-town boy obsessed with the Italian cycling team vies for the affections of a college girl.","Rated":"PG"}