{"imdbID":"tt0038499","Title":"Duel in the Sun","Year":"1946","Country":"USA","Language":"English","Budget":"$8,000,000 (estimated)","Gross":"$20,400,000 (USA)","Production_Co":"Selznick Studio, The, Vanguard Films ","Runtime":"144 min (roadshow)","Cast":"Jennifer Jones, Joseph Cotten, Gregory Peck, Lionel Barrymore, Herbert Marshall, Lillian Gish, Walter Huston, Charles Bickford, Harry Carey, Joan Tetzel, Tilly Losch, Butterfly McQueen, Scott McKay, Otto Kruger, Sidney Blackmer","Plot":"Beautiful half-breed Pearl Chavez becomes the ward of her dead father's first love and finds herself torn between her sons, one good and the other bad. When her father is hanged for shooting his wife and her lover, half-breed Pearl Chavez goes to live with distant relatives in Texas. Welcomed by Laura Belle and her elder lawyer son Jesse, she meets with hostility from the ranch-owner himself, wheelchair-bound Senator Jackson McCanles, and with lustful interest from womanising, unruly younger son Lewt. Almost at once, already existing family tensions are exacerbated by her presence and the way she is physically drawn to Lewt. Written by Jeremy Perkins {J-26}","Genre":"Drama, Romance, Western","Keywords":"half breed, shooting, texas, noir, box office hit","imdbRating":"6.9","imdbVotes":"6,165","Awards":"Nominated for 2 Oscars. Another 1 win & 1 nomination.","Metascore":"","Released":"12 September 1947 (Mexico) ","Location":"Tucson Mountain Park, Tucson, Arizona, USA ","Actors":"Jennifer Jones, Joseph Cotten, Gregory Peck ","Director":"King Vidor, Otto Brower (uncredited) | 5 more credits »","Writer":"David O. Selznick (screenplay), Niven Busch (suggested by a novel by) | 1 more credit »","Running_time":"PT129M / 2h 9min","Description":"Directed by King Vidor, Otto Brower, William Dieterle.  With Jennifer Jones, Joseph Cotten, Gregory Peck, Lionel Barrymore. Beautiful half-breed Pearl Chavez becomes the ward of her dead father's first love and finds herself torn between her sons, one good and the other bad.","Rated":"UNRATED"}