{"imdbID":"tt0032671","Title":"Kitty Foyle","Year":"1940","Director":"Sam Wood","Country":"USA","Language":"English","Production_Co":"RKO Radio Pictures ","Runtime":"108 min","Cast":"Ginger Rogers, Dennis Morgan, James Craig, Eduardo Ciannelli, Ernest Cossart, Gladys Cooper, Odette Myrtil, Mary Treen, K.T. Stevens, Walter Kingsford, Cecil Cunningham, Nella Walker, Edward Fielding, Kay Linaker, Richard Nichols","Plot":"Kitty Foyle, a hard-working white-collar girl from a Philadelphia, Pennsylvania low, middle-class family, meets and falls in love with young socialite Wyn Strafford but his family is against her. A white collar worker from a blue collar family, Kitty Foyle has spent her so far short adult life in her hometown of Philadelphia or New York City. She has had two serious relationships, one associated with each city and each man with who she falls in love but in vastly different ways. \"Philadelphia\" is blue blooded Wyn Strafford VI. Wyn hires Kitty to be his secretary, he the editor for his pet project, a magazine, which is funded by family money. Kitty's now deceased father, despite liking Wyn as a person, warned Kitty against falling in love with him, regardless of his outward intentions, as his type always returned to his own kind. If she believes her father, Kitty may come to the realization that if a union with Wyn were to ever happen, it would not only be to him but to his family and their traditions, they who may have some say in the matter. After the magazine folds, it not making any money, Kitty is forced to look for another job, she feeling she would have more ... Written by Huggo","Genre":"Drama, Romance","Keywords":"single mother, socialite, department store, divorce, marriage","imdbRating":"7.1","imdbVotes":"2,198","Awards":"Won 1 Oscar. Another 4 nominations.","Metascore":"","Released":"27 December 1940 (USA) ","Actors":"Ginger Rogers, Dennis Morgan, James Craig ","Writer":"Christopher Morley (A novel by), Dalton Trumbo (screen play) | 1 more credit »","Running_time":"PT108M / 1h 48min","Description":"Directed by Sam Wood.  With Ginger Rogers, Dennis Morgan, James Craig, Eduardo Ciannelli. Kitty Foyle, a hard-working white-collar girl from a Philadelphia, Pennsylvania low, middle-class family, meets and falls in love with young socialite Wyn Strafford but his family is against her.","Rated":"APPROVED"}