{"imdbID":"tt0084787","Title":"The Thing","Year":"1982","Director":"John Carpenter","Taglines":"The ultimate in alien terror. ","Certificate":"R | See all certifications »","Country":"USA","Language":"English, Norwegian","Also_Known_As":"John Carpenter's The Thing ","Budget":"$15,000,000 (estimated)","Opening_Weekend":"$3,107,897 (USA) (2 July 1982)","Gross":"$13,782,838 (USA)","Production_Co":"Universal Pictures, Turman-Foster Company ","":"Show detailed company contact information on IMDbPro »","Runtime":"109 min","Sound_Mix":"Dolby Stereo (35 mm prints)| 70 mm 6-Track (70 mm prints)","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Some examples of the vitriol that greeted the film - David Ansen of Newsweek called it \"an example of the New Aesthetic - atrocity for atrocity's sake\" while Alan Spencer for Starlog contended that \"John Carpenter was never meant to direct science fiction horror movies. He's better suited to direct traffic accidents, train wrecks and public floggings\". See more »","Goofs":"We see McCready drinking at the beginning of the film. He is shown in a camera shot from below and we see what appears to be a long, messy, shaggy beard. A few minutes later when he gets into the helicopter his beard is neatly trimmed and combed. See more »","Cast":"Kurt Russell, Wilford Brimley, T.K. Carter, David Clennon, Keith David, Richard Dysart, Charles Hallahan, Peter Maloney, Richard Masur, Donald Moffat, Joel Polis, Thomas G. Waites, Norbert Weisser, Larry J. Franco, Nate Irwin","Plot":"It's the first week of winter in 1982. An American Research Base is greeted by an alien force, that can assimilate anything it touches. It's up to the members to stay alive, and be sure of who is human, and who has become one of the Things. An American scientific expedition to the frozen wastes of the Antarctic is interrupted by a group of seemingly mad Norwegians pursuing and shooting a dog. The helicopter pursuing the dog explodes, eventually leaving no explanation for the chase. During the night, the dog mutates and attacks other dogs in the cage and members of the team that investigate. The team soon realizes that an alien life-form with the ability to take over other bodies is on the loose and they don't know who may already have been taken over. Written by Goth <brooks@odie.ee.wits.ac.za>","Genre":"Horror, Sci-Fi","Keywords":"antarctica, isolation, alien life form, paranoia, alien creature","imdbRating":"8.2","imdbVotes":"247,003","Awards":"3 nominations.","Metascore":"","Released":"25 June 1982 (USA) ","Location":"Juneau, Alaska, USA ","Actors":"Kurt Russell, Wilford Brimley, Keith David ","Writer":"Bill Lancaster (screenplay), John W. Campbell Jr. (story)","Running_time":"PT109M / 1h 49min","Description":"Directed by John Carpenter.  With Kurt Russell, Wilford Brimley, Keith David, Richard Masur. It's the first week of winter in 1982. An American Research Base is greeted by an alien force, that can assimilate anything it touches. It's up to the members to stay alive, and be sure of who is human, and who has become one of the Things.","Rated":"R"}