{"imdbID":"tt0082416","Title":"The French Lieutenant's Woman","Year":"1981","Director":"Karel Reisz","Country":"UK","Language":"English","Gross":"SEK 4,392,234 (Sweden)","Production_Co":"Juniper Films ","Runtime":"124 min","Cast":"Meryl Streep, Jeremy Irons, Hilton McRae, Emily Morgan, Charlotte Mitchell, Lynsey Baxter, Jean Faulds, Peter Vaughan, Colin Jeavons, Liz Smith, Patience Collier, John Barrett, Leo McKern, Arabella Weir, Ben Forster","Plot":"A film is being made of a story, set in 19th century England, about Charles, a biologist who's engaged to be married, but who falls in love with outcast Sarah, whose melancholy makes her ... See full summary » A film is being made of a story, set in 19th century England, about Charles, a biologist who's engaged to be married, but who falls in love with outcast Sarah, whose melancholy makes her leave him after a short, but passionate affair. Anna and Mike, who play the characters of Sarah and Charles, go, during the shooting of the film, through a relationship that runs parallel to that of their characters. Written by Leon Wolters <wolters@strw.LeidenUniv.nl>","Genre":"Drama, Romance","Keywords":"lieutenant, 19th century, love, melancholy, actress","imdbRating":"7.0","imdbVotes":"8,884","Awards":"Nominated for 5 Oscars. Another 9 wins & 14 nominations.","Metascore":"","Released":"16 October 1981 (USA) ","Location":"Exeter Saint Davids Station, Exeter, England ","Actors":"Meryl Streep, Jeremy Irons, Hilton McRae ","Writer":"John Fowles (novel), Harold Pinter (screenplay)","Running_time":"PT124M / 2h 4min","Description":"Directed by Karel Reisz.  With Meryl Streep, Jeremy Irons, Hilton McRae, Emily Morgan. A film is being made of a story, set in 19th century England, about Charles, a biologist who's engaged to be married, but who falls in love with outcast Sarah, whose melancholy makes her leave him after a short, but passionate affair. Anna and Mike, who play the characters of Sarah and Charles, go, during the shooting of the film, through a relationship that runs parallel to that of their ...","Rated":"R"}