{"imdbID":"tt0019729","Title":"The Broadway Melody","Year":"1929","Director":"Harry Beaumont","Country":"USA","Language":"English","Budget":"$379,000 (estimated)","Gross":"$2,808,000 (USA)","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"100 min (TCM print)","Cast":"Charles King, Anita Page, Bessie Love","Plot":"Harriet and Queenie Mahoney, a vaudeville act, come to Broadway, where their friend Eddie Kerns needs them for his number in one of Francis Zanfield's shows. Eddie was in love with Harriet,... See full summary » Harriet and Queenie Mahoney, a vaudeville act, come to Broadway, where their friend Eddie Kerns needs them for his number in one of Francis Zanfield's shows. Eddie was in love with Harriet, but when he meets Queenie, he falls in love to her, but she is courted by Jock Warriner, a member of the New Yorker high society. It takes a while till Queenie recognizes, that she is for Jock nothing more than a toy, and it also takes a while till Harriet recognizes, that Eddie is in love with Queenie. Written by Stephan Eichenberg <eichenbe@fak-cbg.tu-muenchen.de>","Genre":"Musical, Romance","Keywords":"box office hit, partially lost film, early sound film, singer, wisecrack humor","imdbRating":"6.4","imdbVotes":"4,370","Awards":"Won 1 Oscar. Another 2 nominations.","Metascore":"","Released":"6 June 1929 (USA) ","Location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA","Actors":"Bessie Love, Anita Page, Charles King ","Writer":"Edmund Goulding (story), Sarah Y. Mason (continuity) | 2 more credits »","Running_time":"PT100M / 1h 40min","Description":"Directed by Harry Beaumont.  With Bessie Love, Anita Page, Charles King, The Angeles Twins. Harriet and Queenie Mahoney, a vaudeville act, come to Broadway, where their friend Eddie Kerns needs them for his number in one of Francis Zanfield's shows. Eddie was in love with Harriet, but when he meets Queenie, he falls in love to her, but she is courted by Jock Warriner, a member of the New Yorker high society. It takes a while till Queenie recognizes, that she is for Jock nothing more ...","Rated":"PASSED"}