{"imdbID":"tt0073195","Title":"Jaws","Year":"1975","Director":"Steven Spielberg","Taglines":"Amity Island had everything. Clear skies. Gentle surf. Warm water. People flocked there every summer. It was the perfect feeding ground. ","Certificate":"PG | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Stillness in the Water ","Budget":"$8,000,000 (estimated)","Gross":"$260,000,000 (USA)","Production_Co":"Zanuck/Brown Productions, Universal Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"124 min | 130 min (Extended Edition)","Sound_Mix":"Mono (Westrex Recording System)| Dolby Digital (Dolby 5.1)| DTS (DTS 5.1)| Dolby Surround 7.1 (DTS HD Master Audio)","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Voted #3 in Total Film's 100 Greatest Movies Of All Time list (November 2005). See more »","Goofs":"At the Hospital, when Ellen leaves with Sean, Brody looks over and sees Larry standing at the reception. In the next shot when Brody approaches Larry, a black ashtray, which was not there in the previous shot, has appeared on the counter. See more »","Crazy_Credits":"During the end credits, if you look carefully, you can see Brody and Hooper slowly floating to the shore. See more »","Cast":"Roy Scheider, Robert Shaw, Richard Dreyfuss, Lorraine Gary, Murray Hamilton, Carl Gottlieb, Jeffrey Kramer, Susan Backlinie, Jonathan Filley, Ted Grossman, Chris Rebello, Jay Mello, Lee Fierro, Jeffrey Voorhees, Craig Kingsbury","Plot":"When a gigantic great white shark begins to menace the small island community of Amity, a police chief, a marine scientist and a grizzled fisherman set out to stop it. It's a hot summer on Amity Island, a small community whose main business is its beaches. When new Sheriff Martin Brody discovers the remains of a shark attack victim, his first inclination is to close the beaches to swimmers. This doesn't sit well with Mayor Larry Vaughn and several of the local businessmen. Brody backs down to his regret as that weekend a young boy is killed by the predator. The dead boy's mother puts out a bounty on the shark and Amity is soon swamped with amateur hunters and fisherman hoping to cash in on the reward. A local fisherman with much experience hunting sharks, Quint, offers to hunt down the creature for a hefty fee. Soon Quint, Brody and Matt Hooper from the Oceanographic Institute are at sea hunting the Great White shark. As Brody succinctly surmises after their first encounter with the creature, they're going to need a bigger boat. Written by garykmcd","Genre":"Adventure, Drama, Thriller","Keywords":"shark, great white shark, beach, blockbuster, fishing","imdbRating":"8.1","imdbVotes":"395,729","Awards":"Won 3 Oscars. Another 10 wins & 16 nominations.","Metascore":"79","Released":"20 June 1975 (USA) ","Location":"Martha's Vineyard, Massachusetts, USA ","Actors":"Roy Scheider, Robert Shaw, Richard Dreyfuss ","Writer":"Peter Benchley (screenplay), Carl Gottlieb (screenplay) | 1 more credit »","Running_time":"PT124M / 2h 4min","Description":"Directed by Steven Spielberg.  With Roy Scheider, Robert Shaw, Richard Dreyfuss, Lorraine Gary. When a gigantic great white shark begins to menace the small island community of Amity, a police chief, a marine scientist and a grizzled fisherman set out to stop it.","Rated":"PG"}