{"imdbID":"tt0048545","Title":"Rebel Without a Cause","Year":"1955","Director":"Nicholas Ray","Taglines":"Teenage terror torn from today's headlines ","Country":"USA","Language":"English","Also_Known_As":"Rebelde sin causa ","Budget":"$1,500,000 (estimated)","Production_Co":"Warner Bros. ","Runtime":"111 min","Sound_Mix":"Mono (optical prints)| 4-Track Stereo (RCA Sound Recording) (magnetic prints)| Dolby Digital (DVD version)","Color":"Color (WarnerColor)","Aspect_Ratio":"2.55 : 1","Trivia":"Director Nicholas Ray researched L.A. gangs by riding around with them for several nights. See more »","Goofs":"When police backup arrives at the Griffith Observatory, the officer approaches the vehicle on the driver's side to talk to the Juvenile Division officer in the back seat. There are two cutaway shots and now the conversation continues on the passenger's side of the car. The officers within the car change sides of the vehicle, too. See more »","Cast":"James Dean, Natalie Wood, Sal Mineo, Jim Backus, Ann Doran, Corey Allen, William Hopper, Rochelle Hudson, Dennis Hopper, Edward Platt, Steffi Sidney, Marietta Canty, Virginia Brissac, Beverly Long, Ian Wolfe","Plot":"A rebellious young man with a troubled past comes to a new town, finding friends and enemies. Jim Stark is the new kid in town. He has been in trouble elsewhere; that's why his family has had to move before. Here he hopes to find the love he doesn't get from his middle-class family. Though he finds some of this in his relation with Judy, and a form of it in both Plato's adulation and Ray's real concern for him, Jim must still prove himself to his peers in switchblade knife fights and \"chickie\" games in which cars race toward a seaside cliff. Written by Ed Stephan <stephan@cc.wwu.edu>","Genre":"Drama","Keywords":"juvenile delinquent, man wearing woman's apron, switchblade, juvenile hall, henpecked husband","imdbRating":"7.8","imdbVotes":"61,403","Awards":"Nominated for 3 Oscars. Another 2 wins & 3 nominations.","Metascore":"","Released":"27 October 1955 (USA) ","Location":"7529 Franklin Avenue, Hollywood, Los Angeles, California, USA ","Actors":"James Dean, Natalie Wood, Sal Mineo ","Writer":"Stewart Stern (screen play), Irving Shulman (adaptation) | 1 more credit »","Running_time":"PT111M / 1h 51min","Description":"Directed by Nicholas Ray.  With James Dean, Natalie Wood, Sal Mineo, Jim Backus. A rebellious young man with a troubled past comes to a new town, finding friends and enemies.","Rated":"PG-13"}