{"imdbID":"tt0059573","Title":"A Patch of Blue","Year":"1965","Director":"Guy Green","Country":"USA","Language":"English","Budget":"$800,000 (estimated)","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"105 min","Cast":"Sidney Poitier, Shelley Winters, Elizabeth Hartman, Wallace Ford, Ivan Dixon, Elisabeth Fraser, John Qualen, Kelly Flynn, Debi Storm, Renata Vanni, Saverio LoMedico","Plot":"A blind, uneducated white girl is befriended by a black man, who becomes determined to help her escape her impoverished and abusive home life. Accidentally blinded by her prostitute mother Rose-Ann at the age of five, Selina D'Arcey spends the next 13 years confined in the tiny Los Angeles apartment that they share with \"Ole Pa\", Selina's grandfather. One afternoon at the local park, Selina meets Gordon Ralfe, a thoughtful young office worker whose kind-hearted treatment of her results in her falling in love with him, unaware that he is black. They continue to meet in the park every afternoon and he teaches her how to get along in the city. But when the cruel, domineering Rose-Ann learns of their relationship, she forbids her to have anything more to do with him because he is black. Selina continues to meet Gordon despite Rose-Ann's fury, who is determined to end the relationship for good. Written by alfiehitchie","Genre":"Drama, Romance","Keywords":"park, prostitute, tenement, friendship, beads","imdbRating":"8.0","imdbVotes":"5,292","Awards":"Won 1 Oscar. Another 3 wins & 15 nominations.","Metascore":"","Released":"10 December 1965 (USA) ","Location":"Culver City, California, USA","Actors":"Sidney Poitier, Shelley Winters, Elizabeth Hartman ","Writer":"Elizabeth Kata (novel), Guy Green","Running_time":"PT105M / 1h 45min","Description":"Directed by Guy Green.  With Sidney Poitier, Shelley Winters, Elizabeth Hartman, Wallace Ford. A blind, uneducated white girl is befriended by a black man, who becomes determined to help her escape her impoverished and abusive home life.","Rated":"UNRATED"}