{"imdbID":"tt0052027","Title":"The Old Man and the Sea","Year":"1958","Country":"USA","Language":"English","Budget":"$5,000,000 (estimated)","Production_Co":"Leland Hayward Productions, Warner Bros. ","Runtime":"86 min","Cast":"Spencer Tracy, Felipe Pazos, Harry Bellaver, Don Diamond, Don Blackman, Joey Ray, Mary Hemingway, Richard Alameda, Tony Rosa, Carlos Rivero, Robert Alderette, Mauritz Hugo","Plot":"An old Cuban fisherman's dry spell is broken when he hooks a gigantic fish that drags him out to sea. Based on Ernest Hemingway's story. Now an old man, a lifelong fisherman sets out to sea to ply his trade as he has done all of his life. He's not had much good fortune of late and has gone almost three months without a major catch while others are catching one or even two large marlins every week. Many of the locals make fun of him and some say he's too old now to be fishing but he still loves what he does and is encouraged by a young boy who loves him and has faith in him. On this day he hooks the fish of a lifetime, a marlin that is larger than his skiff. As it slowly pulls him out to sea, the old man reminisces about his past, his successes and the high points of his life. When he does finally manage to land the fish he has to fight off sharks who are feeding on it as he tries to return to his Cuban village. Written by garykmcd","Genre":"Adventure, Drama","Keywords":"fisherman, sea, fish, old man, marlin","imdbRating":"7.0","imdbVotes":"5,215","Awards":"Won 1 Oscar. Another 5 wins & 4 nominations.","Metascore":"","Released":"11 October 1958 (USA) ","Location":"Cojimar Bay, Havana, & Boca de Jaruco, Cuba ","Actors":"Spencer Tracy, Felipe Pazos, Harry Bellaver ","Director":"John Sturges, Henry King (uncredited) | 1 more credit »","Writer":"Ernest Hemingway (novel), Peter Viertel","Running_time":"PT86M / 1h 26min","Description":"Directed by John Sturges, Henry King, Fred Zinnemann.  With Spencer Tracy, Felipe Pazos, Harry Bellaver, Don Diamond. An old Cuban fisherman's dry spell is broken when he hooks a gigantic fish that drags him out to sea. Based on Ernest Hemingway's story.","Rated":"N/A"}