{"imdbID":"tt0059575","Title":"The Pawnbroker","Year":"1964","Director":"Sidney Lumet","Country":"USA","Language":"English, Spanish, German","Budget":"$500,000 (estimated)","Production_Co":"Landau Company, The Pawnbroker Company ","Runtime":"116 min","Cast":"Rod Steiger, Geraldine Fitzgerald, Brock Peters, Jaime Sánchez, Thelma Oliver, Marketa Kimbrell, Baruch Lumet, Juano Hernandez, Linda Geiser, Nancy R. Pollock, Raymond St. Jacques, John McCurry, Charles Dierkop, Eusebia Cosme, Warren Finnerty","Plot":"A Jewish pawnbroker, victim of Nazi persecution, loses all faith in his fellow man until he realizes too late the tragedy of his actions. In a poor neighborhood of New York, the bitter and lonely Jewish pawnbroker Sol Nazerman is a survivor from Auschwitz that has no emotions or feelings. Sol lost his dearest family and friends in the war and his faith in God and belief in mankind. Now he only cares for money and is haunted by daydreams, actually flashbacks from the period of the concentration camp. Sol's assistant is the ambitious Latino Jesus Ortiz, who wants to learn with Sol how to run a business of his own. When Sol realizes that the obscure laundry business he has with the powerful gangster Rodriguez comes also from brothels, Sol recalls the fate of his beloved wife in the concentration camp and has a nervous breakdown. His attitude leads Jesus Ortiz to tragedy and Sol finds a way to cry. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Drama","Keywords":"concentration camp, flashback, nazi, jewish, pawnbroker","imdbRating":"7.8","imdbVotes":"5,809","Awards":"Nominated for 1 Oscar. Another 6 wins & 8 nominations.","Metascore":"","Released":"20 April 1965 (USA) ","Location":"185 N Marginal Road, Jericho, New York, USA ","Actors":"Rod Steiger, Geraldine Fitzgerald, Brock Peters ","Writer":"Morton S. Fine (screenplay) (as Morton Fine), David Friedkin (screenplay) | 1 more credit »","Running_time":"PT116M / 1h 56min","Description":"Directed by Sidney Lumet.  With Rod Steiger, Geraldine Fitzgerald, Brock Peters, Jaime Sánchez. A Jewish pawnbroker, victim of Nazi persecution, loses all faith in his fellow man until he realizes too late the tragedy of his actions.","Rated":"APPROVED"}