{"imdbID":"tt0089881","Title":"Ran","Year":"1985","Director":"Akira Kurosawa","Certificate":"R | See all certifications »","Country":"Japan, France","Language":"Japanese","Also_Known_As":"Ran ","Budget":"$11,500,000 (estimated)","Opening_Weekend":"$3,567 (USA) (30 June 2000)","Gross":"$3,522,421 (USA)","Production_Co":"Greenwich Film Productions, Herald Ace, Nippon Herald Films ","":"Show detailed company contact information on IMDbPro »","Runtime":"162 min","Sound_Mix":"Dolby (35 mm prints)| 70 mm 6-Track (70 mm prints)","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Akira Kurosawa referred to his previous film, Kagemusha (1980), as a \"dress rehearsal\" for this film. He spent ten years storyboarding every shot in the film as paintings. The resulting collection of images was published with the screenplay. See more »","Goofs":"When Saburo's men ride away from the Third Castle, you can see that the path before them has already been trampeled from previous takes. See more »","Cast":"Tatsuya Nakadai, Akira Terao, Jinpachi Nezu, Daisuke Ryû, Mieko Harada, Yoshiko Miyazaki, Hisashi Igawa, Pîtâ, Masayuki Yui, Kazuo Katô, Norio Matsui, Toshiya Ito, Kenji Kodama, Takashi Watanabe, Mansai Nomura","Plot":"An elderly lord abdicates to his three sons, and the two corrupt ones turn against him. Japanese warlord Hidetori Ichimonji decides the time has come to retire and divide his fiefdom among his three sons. His eldest and middle sons - Taro and Jiro - agree with his decision and promise to support him for his remaining days. The youngest son Saburo disagrees with all of them arguing that there is little likelihood the three brothers will remain united. Insulted by his son's brashness, the warlord banishes Saburo. As the warlord begins his retirement, he quickly realizes that his two eldest sons selfish and have no intention of keeping their promises. It leads to war and only banished Saburo c an possibly save him. Written by garykmcd","Genre":"Action, Drama, War","Keywords":"warlord, power, greed, blood, japanese","imdbRating":"8.3","imdbVotes":"74,280","Awards":"Won 1 Oscar. Another 25 wins & 22 nominations.","Metascore":"90","Released":"1 June 1985 (Japan) ","Location":"Aso, Kumamoto, Japan ","Actors":"Tatsuya Nakadai, Akira Terao, Jinpachi Nezu ","Writer":"Akira Kurosawa (screenplay), Hideo Oguni (screenplay) | 2 more credits »","Running_time":"PT162M / 2h 42min","Description":"Directed by Akira Kurosawa.  With Tatsuya Nakadai, Akira Terao, Jinpachi Nezu, Daisuke Ryû. An elderly lord abdicates to his three sons, and the two corrupt ones turn against him.","Rated":"R"}