{"imdbID":"tt0054387","Title":"The Time Machine","Year":"1960","Director":"George Pal","Taglines":"You Will Orbit into the Fantastic Future! ","Certificate":"Approved | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"H. G. Wells' The Time Machine ","Budget":"$750,000 (estimated)","Production_Co":"George Pal Productions, Galaxy Films Inc. ","Runtime":"103 min | 89 min (video)","Sound_Mix":"Mono (35 mm optical prints)| 4-Track Stereo (Westrex Recording System) (35 mm magnetic prints)","Color":"Color (Metrocolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Rod Taylor wanted Shirley Knight for the role of Weena. See more »","Goofs":"After George discovers the Morlocks have taken his machine inside the temple, he and Weena gather sticks to make a fire. He throws several pieces of wood on the pile while Weena is sitting there. One of the pieces sticks out of the pile against her dress and in the next scene, the wood is no longer sticking up. See more »","Cast":"Rod Taylor, Alan Young, Yvette Mimieux, Sebastian Cabot, Tom Helmore, Whit Bissell, Doris Lloyd","Plot":"A man's vision for a utopian society is disillusioned when travelling forward into time reveals a dark and dangerous society. On January 5, 1900, a disheveled looking H.G. Wells - George to his friends - arrives late to his own dinner party. He tells his guests of his travels in his time machine, the work about which his friends knew. They were also unbelieving, and skeptical of any practical use if it did indeed work. George knew that his machine was stationary in geographic position, but he did not account for changes in what happens over time to that location. He also learns that the machine is not impervious and he is not immune to those who do not understand him or the machine's purpose. George tells his friends that he did not find the Utopian society he so wished had developed. He mentions specifically a civilization several thousand years into the future which consists of the subterranean morlocks and the surface dwelling eloi, who on first glance lead a carefree life. Despite all these issues, love can still bloom over the spread of millennia. Written by Huggo","Genre":"Adventure, Romance, Sci-Fi","Keywords":"future, time machine, distant future, steampunk, post apocalypse","imdbRating":"7.6","imdbVotes":"26,143","Awards":"Won 1 Oscar. Another 1 nomination.","Metascore":"","Released":"17 August 1960 (USA) ","Location":"Culver City, California, USA ","Actors":"Rod Taylor, Alan Young, Yvette Mimieux ","Writer":"David Duncan (screenplay), H.G. Wells (novel)","Running_time":"PT103M / 1h 43min","Description":"Directed by George Pal.  With Rod Taylor, Alan Young, Yvette Mimieux, Sebastian Cabot. A man's vision for a utopian society is disillusioned when travelling forward into time reveals a dark and dangerous society.","Rated":"APPROVED"}