{"imdbID":"tt0056869","Title":"The Birds","Year":"1963","Director":"Alfred Hitchcock","Taglines":"Nothing You Have Ever Witnessed Before Has Prepared You for Such Sheer Stabbing Shock! ","Certificate":"PG-13 | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Alfred Hitchcock's The Birds ","Budget":"$2,500,000 (estimated)","Production_Co":"Alfred J. Hitchcock Productions ","Runtime":"119 min","Sound_Mix":"Mono (Westrex Recording System) (uncredited)","Color":"Color (Technicolor)","Aspect_Ratio":"1.37 : 1","Trivia":"A scene in the film shows a service station where a bird knocks over an attendant filling a car with gas. The gas flows across the street where a man lights his cigarette igniting the gas. The fire follows the gas stream to the pump and explodes. The service station was located across from \"The Tides\" restaurant and pier. In reality this service station did not exist at the time of the filming. However, several years later a service station was built and is still located at the spot shown in the film. See more »","Goofs":"When the gas station attendant is hit by a gull, he falls face down, and his body is angled toward the camera. Mitch and some other men go to help him, and in the last shot of them together, he is face up and his body is angled to the left. There is quick cutting in this sequence, and not enough time between shots for the men to have moved the attendant. See more »","Crazy_Credits":"There were no ending credits. And in the opening credits the title \"THE BIRDS\" was slowly pecked away by the passing crows. See more »","Cast":"Tippi Hedren, Suzanne Pleshette, Rod Taylor, Jessica Tandy, Veronica Cartwright, Ethel Griffies, Charles McGraw, Doreen Lang, Ruth McDevitt, Joe Mantell, Malcolm Atterbury, Karl Swenson, Elizabeth Wilson, Lonny Chapman, Doodles Weaver","Plot":"A wealthy San Francisco socialite pursues a potential boyfriend to a small Northern California town that slowly takes a turn for the bizarre when birds of all kinds suddenly begin to attack people. Melanie Daniels is the modern rich socialite, part of the jet-set who always gets what she wants. When lawyer Mitch Brenner sees her in a pet shop, he plays something of a practical joke on her, and she decides to return the favor. She drives about an hour north of San Francisco to Bodega Bay, where Mitch spends the weekends with his mother Lydia and younger sister Cathy. Soon after her arrival, however, the birds in the area begin to act strangely. A seagull attacks Melanie as she is crossing the bay in a small boat, and then, Lydia finds her neighbor dead, obviously the victim of a bird attack. Soon, birds in the hundreds and thousands are attacking anyone they find out of doors. There is no explanation as to why this might be happening, and as the birds continue their vicious attacks, survival becomes the priority. Written by garykmcd","Genre":"Horror","Keywords":"bird attack, socialite, seagull, children, birthday","imdbRating":"7.7","imdbVotes":"124,344","Awards":"Nominated for 1 Oscar. Another 2 wins & 5 nominations.","Metascore":"","Released":"29 March 1963 (USA) ","Location":"17110 Bodega Lane, Bodega, California, USA ","Actors":"Rod Taylor, Tippi Hedren, Suzanne Pleshette ","Writer":"Daphne Du Maurier (from the story by), Evan Hunter (screenplay)","Running_time":"PT119M / 1h 59min","Description":"Directed by Alfred Hitchcock.  With Rod Taylor, Tippi Hedren, Suzanne Pleshette, Jessica Tandy. A wealthy San Francisco socialite pursues a potential boyfriend to a small Northern California town that slowly takes a turn for the bizarre when birds of all kinds suddenly begin to attack people.","Rated":"PG-13"}