{"imdbID":"tt0096438","Title":"Who Framed Roger Rabbit","Year":"1988","Director":"Robert Zemeckis","Taglines":"It's the story of a man, a woman, and a rabbit in a triangle of trouble.","Certificate":"PG | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Dead Toons Don't Pay Bills ","Budget":"$70,000,000 (estimated)","Gross":"$154,222,492 (USA)","Production_Co":"Touchstone Pictures, Amblin Entertainment, Silver Screen Partners III ","Runtime":"104 min","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby (35 mm prints)","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The stove in the animated opening has the brand name Hotternell, a play on the phrase \"hotter than hell\". See more »","Goofs":"After Maroon takes the wet handkerchief that Roger blew his nose in, he walks to throw it in the trash. As Maroon is walking, the handkerchief should be wet from Roger blowing his nose and crying, but moves as if it were dry. See more »","Crazy_Credits":"There are no opening credits after the title has been shown. See more »","Cast":"Bob Hoskins, Christopher Lloyd, Joanna Cassidy, Charles Fleischer, Stubby Kaye, Alan Tilvern, Richard LeParmentier, Lou Hirsch, Betsy Brantley, Joel Silver, Paul Springer, Richard Ridings, Edwin Craig, Lindsay Holiday, Mike Edmonds","Plot":"A toon hating detective is a cartoon rabbit's only hope to prove his innocence when he is accused of murder. 'Toon star Roger is worried that his wife Jessica is playing pattycake with someone else, so the studio hires detective Eddie Valiant to snoop on her. But the stakes are quickly raised when Marvin Acme is found dead and Roger is the prime suspect. Groundbreaking interaction between the live and animated characters, and lots of references to classic animation. Written by Jon Reeves <jreeves@imdb.com>","Genre":"Animation, Comedy, Crime","Keywords":"roger rabbit, maroon cartoon, 1940s, year 1947, sexy woman","imdbRating":"7.7","imdbVotes":"135,439","Awards":"Won 3 Oscars. Another 19 wins & 21 nominations.","Metascore":"83","Released":"22 June 1988 (USA) ","Location":"USA ","Actors":"Bob Hoskins, Christopher Lloyd, Joanna Cassidy ","Writer":"Gary K. Wolf (novel), Jeffrey Price (screenplay) | 1 more credit »","Running_time":"PT104M / 1h 44min","Description":"Directed by Robert Zemeckis.  With Bob Hoskins, Christopher Lloyd, Joanna Cassidy, Charles Fleischer. A toon hating detective is a cartoon rabbit's only hope to prove his innocence when he is accused of murder.","Rated":"PG"}