{"imdbID":"tt0019557","Title":"Weary River","Year":"1929","Director":"Frank Lloyd","Country":"USA","Language":"English","Production_Co":"First National Pictures ","Cast":"Richard Barthelmess, Betty Compson, William Holden, Louis Natheaux, George E. Stone, Ray Turner, Gladden James","Plot":"A gangster is put in prison, but finds salvation through music while serving his time. Again on the outside, he finds success elusive and temptations abound. Jerry Larabee (Richard Barthelmess)is a gangster who can play piano and sing, mostly to entertain his girl Alice (Betty Compson), who is quite visibly thrilled by his crooning. But as the result of a gangland shootout he had with rival mobster Spadoni (Louis Natheaux), Larabee must do a stretch in prison. The kindly warden (William Holden) sees a potential for redemption in him, and talks Mary into giving him up, so he will break all contact with his previous life. Through his musical talents, Jerry is soon doing radio broadcasts with the prison orchestra, and one of his own compositions, \"Weary River\" is a smash hit with listeners. In no time, he's released, with a concert tour lined up. unfortunately, hecklers cause the overly sensitive ex-gunman to lose his confidence and he's a flop. Down on his luck, he drifts back to his old gang buddies and Mary, who's never stopped loving him. After learning that his stint up the river was a frame-up by Spadoni, a showdown is arranged at their... Written by WesternOne","Genre":"Drama, Romance","Keywords":"warden, prison, shootout, gangster, police","imdbRating":"6.8","imdbVotes":"252","Awards":"Nominated for 1 Oscar.","Metascore":"","Released":"10 February 1929 (USA) ","Location":"Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA","Actors":"Richard Barthelmess, Betty Compson, William Holden ","Writer":"Courtney Ryley Cooper (story) (as Courtney Riley Cooper), Bradley King (screen version) | 1 more credit »","Running_time":"PT86M / 1h 26min","Description":"Directed by Frank Lloyd.  With Richard Barthelmess, Betty Compson, William Holden, Louis Natheaux. A gangster is put in prison, but finds salvation through music while serving his time. Again on the outside, he finds success elusive and temptations abound.","Rated":"PASSED"}