{"imdbID":"tt0067411","Title":"McCabe & Mrs. Miller","Year":"1971","Director":"Robert Altman","Country":"USA","Language":"English, Cantonese","Gross":"SEK 867,412 (Sweden)","Production_Co":"David Foster Productions, Warner Bros. ","Runtime":"120 min","Cast":"Warren Beatty, Julie Christie, Rene Auberjonois, William Devane, John Schuck, Corey Fischer, Bert Remsen, Shelley Duvall, Keith Carradine, Michael Murphy, Antony Holland, Hugh Millais, Manfred Schulz, Jace Van Der Veen, Jackie Crossland","Plot":"A gambler and a prostitute become business partners in a remote Old West mining town, and their enterprise thrives until a large corporation arrives on the scene. Set in winter in the Old West. Charismatic but dumb John McCabe arrives in a young Pacific Northwest town to set up a whorehouse/tavern. The shrewd Mrs. Miller, a professional madam, arrives soon after construction begins. She offers to use her experience to help McCabe run his business, while sharing in the profits. The whorehouse thrives and McCabe and Mrs. Miller draw closer, despite their conflicting intelligences and philosophies. Soon, however, the mining deposits in the town attract the attention of a major corporation, which wants to buy out McCabe along with the rest. He refuses, and his decision has major repercussions for him, Mrs. Miller, and the town. Written by John J. Magee <magee@helix.mgh.harvard.edu>","Genre":"Drama, Western","Keywords":"bathhouse, pacific northwest, mining town, bordello, church","imdbRating":"7.7","imdbVotes":"15,521","Awards":"Nominated for 1 Oscar. Another 1 win & 3 nominations.","Metascore":"","Released":"24 June 1971 (USA) ","Location":"British Columbia, Canada ","Actors":"Warren Beatty, Julie Christie, Rene Auberjonois ","Writer":"Edmund Naughton (novel), Robert Altman (screenplay) | 1 more credit »","Running_time":"PT120M / 2h","Description":"Directed by Robert Altman.  With Warren Beatty, Julie Christie, Rene Auberjonois, William Devane. A gambler and a prostitute become business partners in a remote Old West mining town, and their enterprise thrives until a large corporation arrives on the scene.","Rated":"R"}