{"imdbID":"tt0065207","Title":"Where Eagles Dare","Year":"1968","Director":"Brian G. Hutton","Taglines":"One weekend Major Smith, Lieutenant Schaffer and a beautiful blonde named Mary decided to win World War II. ","Certificate":"M | See all certifications »","Country":"UK, USA","Language":"English, German","Also_Known_As":"Agenten sterben einsam ","Budget":"$7,700,000 (estimated)","Gross":"SEK 11,639,000 (Sweden)","Production_Co":"Metro-Goldwyn-Mayer (MGM), Jerry Gershwin Productions, Elliott Kastner Productions ","Runtime":"158 min","Sound_Mix":"70 mm 6-Track (70 mm prints)| Mono (35 mm prints)","Color":"Color (Metrocolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Derren Nesbitt (as Maj. Von Hapen) sports (bleached) blonde hair, which he'll still sport in The Prisoner, as Number 2, which was filmed during this same time. See more »","Goofs":"The group waits for a train to pass the railway station before entering the village. The sound effects suggest that the locomotive passed only seconds earlier, but there is no smoke or steam lingering in the air. See more »","Cast":"Richard Burton, Clint Eastwood, Mary Ure, Patrick Wymark, Michael Hordern, Donald Houston, Peter Barkworth, William Squire, Robert Beatty, Brook Williams, Neil McCarthy, Vincent Ball, Anton Diffring, Ferdy Mayne, Derren Nesbitt","Plot":"Allied agents stage a daring raid on a castle where the Nazis are holding an American General prisoner... but that's not all that's really going on. During WW2 a British aircraft is shot down and crashes in Nazi held territory. The Germans capture the only survivor, an American General, and take him to the nearest SS headquarters. Unknown to the Germans the General has full knowledge of the D-Day operation. The British decide that the General must not be allowed to divulge any details of the Normandy landing at all cost and order Major John Smith to lead a crack commando team to rescue him. Amongst the team is an American Ranger, Lieutenant Schaffer, who is puzzled by his inclusion in an all British operation. When one of the team dies after the parachute drop, Schaffer suspects that Smith's mission has a much more secret objective. Written by Dave Jenkins <david.jenkins@smallworld.co.uk>","Genre":"Action, Adventure, War","Keywords":"parachute drop, world war two, american, general, british","imdbRating":"7.7","imdbVotes":"39,323","Awards":"1 win & 2 nominations.","Metascore":"","Released":"12 March 1969 (USA) ","Location":"Festung Hohenwerfen, Salzburg, Austria ","Actors":"Richard Burton, Clint Eastwood, Mary Ure ","Writer":"Alistair MacLean (story), Alistair MacLean (screenplay)","Running_time":"PT158M / 2h 38min","Description":"Directed by Brian G. Hutton.  With Richard Burton, Clint Eastwood, Mary Ure, Patrick Wymark. Allied agents stage a daring raid on a castle where the Nazis are holding an American General prisoner... but that's not all that's really going on.","Rated":"M"}