{"imdbID":"tt0038650","Title":"It's a Wonderful Life","Year":"1946","Director":"Frank Capra","Taglines":"Wonderful news...about wonderful people!...in a wonderful picture! It's a wonderful love! It's a wonderful laugh! ","Country":"USA","Language":"English","Also_Known_As":"Ist das Leben nicht schön? ","Budget":"$3,180,000 (estimated)","Opening_Weekend":"£49,845 (UK) (19 December 2008)","Gross":"£682,222 (UK) (24 December 2010)","Production_Co":"Liberty Films (II) ","":"Show detailed company contact information on IMDbPro »","Runtime":"130 min | 118 min (DVD edition)","Sound_Mix":"Mono (RCA Sound System)","Color":"Color (colorized)| Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"While this film was a box-office flop, it became a cherished holiday tradition in the US. This was because it was repeated dozens of times on many local stations during the holiday season between Thanksgiving and Christmas Day. Due to a clerical error in the copyright office of NTA (its then-rights holder) in 1974, the movie's copyright wasn't renewed. The rights supposedly became public domain, so anyone who could obtain a print of the film could broadcast it without paying royalties to NTA, so stations could run the film virtually for free minus the cost of the station overhead. In the 1990s a series of court battles led to NTA'S successor, Republic Pictures, reacquiring the rights to the film by virtue of the source material (\"The Greatest Gift\") and the film's score, which were still copyrighted. So now NBC exclusively rebroadcasts the film at least twice annually during the holiday season. See more »","Goofs":"When George and Mary are throwing rocks at the dilapidated house on the way home from the dance, when George throw his rock, the window that Mary is supposed to throw a rock at is missing. Then when Mary gets ready to throw her rock the window is there. See more »","Crazy_Credits":"A ringing facsimile of the Liberty Bell (without the crack) forms the backdrop for the studio logo, which is Liberty Films, and the opening credits are in a scrapbook with Christmas decorations. The bell reappears before the end credits, and the end credits have a Christmas card picture as a backdrop. See more »","Cast":"James Stewart, Donna Reed, Lionel Barrymore, Thomas Mitchell, Henry Travers, Beulah Bondi, Frank Faylen, Ward Bond, Gloria Grahame, H.B. Warner, Todd Karns, Samuel S. Hinds, Mary Treen, Frank Albertson, Virginia Patton","Plot":"An angel helps a compassionate but despairingly frustrated businessman by showing what life would have been like if he never existed. George Bailey has spent his entire life giving of himself to the people of Bedford Falls. He has always longed to travel but never had the opportunity in order to prevent rich skinflint Mr. Potter from taking over the entire town. All that prevents him from doing so is George's modest building and loan company, which was founded by his generous father. But on Christmas Eve, George's Uncle Billy loses the business's $8,000 while intending to deposit it in the bank. Potter finds the misplaced money and hides it from Billy. When the bank examiner discovers the shortage later that night, George realizes that he will be held responsible and sent to jail and the company will collapse, finally allowing Potter to take over the town. Thinking of his wife, their young children, and others he loves will be better off with him dead, he contemplates suicide. But the prayers of his loved ones result in a gentle angel named Clarence coming to earth to help George, with the promise of earning his ... Written by alfiehitchie","Genre":"Drama, Family, Fantasy","Keywords":"guardian angel, second chance, small town life, angel, small town","imdbRating":"8.6","imdbVotes":"265,317","Awards":"Nominated for 5 Oscars. Another 6 wins & 1 nomination.","Metascore":"","Released":"7 January 1947 (USA) ","Location":"California, USA ","Actors":"James Stewart, Donna Reed, Lionel Barrymore ","Writer":"Frances Goodrich (screenplay), Albert Hackett (screenplay) | 3 more credits »","Running_time":"PT130M / 2h 10min","Description":"Directed by Frank Capra.  With James Stewart, Donna Reed, Lionel Barrymore, Thomas Mitchell. An angel helps a compassionate but despairingly frustrated businessman by showing what life would have been like if he never existed.","Rated":"PG"}