{"imdbID":"tt0021322","Title":"The Royal Family of Broadway","Year":"1930","Country":"USA","Language":"English","Production_Co":"Paramount Pictures ","Runtime":"82 min","Cast":"Ina Claire, Fredric March, Mary Brian, Henrietta Crosman, Charles Starrett, Arnold Korff, Frank Conroy, Royal C. Stout, Elsie Esmond, Murray Alper, Wesley Stark, Herschel Mayall","Plot":"Julie Cavendish comes from a family of great Broadway actors. Her mother Fanny staunchly continues acting. Her boisterous brother Tony is fleeing a breach of promise suit in Hollywood. Her ... See full summary » Julie Cavendish comes from a family of great Broadway actors. Her mother Fanny staunchly continues acting. Her boisterous brother Tony is fleeing a breach of promise suit in Hollywood. Her daughter Gwen must decide between going on stage, or settling down in a conventional marriage. Julie is just thinking that it would be nice to retire and get married, when who should turn up but her old beau, Gilmore Marshal, the platinum magnate from South America. Written by Will Gilbert","Genre":"Comedy","Keywords":"new york, theater, based on play","imdbRating":"6.9","imdbVotes":"179","Awards":"Nominated for 1 Oscar.","Metascore":"","Released":"11 January 1933 (Denmark) ","Location":"Kaufman Astoria Studios - 3412 36th Street, Astoria, Queens, New York City, New York, USA","Actors":"Ina Claire, Fredric March, Henrietta Crosman ","Director":"George Cukor, Cyril Gardner","Writer":"Edna Ferber (play), George S. Kaufman (play) | 2 more credits »","Running_time":"PT82M / 1h 22min","Description":"Directed by George Cukor, Cyril Gardner.  With Ina Claire, Fredric March, Henrietta Crosman, Mary Brian. Julie Cavendish comes from a family of great Broadway actors. Her mother Fanny staunchly continues acting. Her boisterous brother Tony is fleeing a breach of promise suit in Hollywood. Her daughter Gwen must decide between going on stage, or settling down in a conventional marriage. Julie is just thinking that it would be nice to retire and get married, when who should turn up but her old beau, ...","Rated":"N/A"}