{"imdbID":"tt0091042","Title":"Ferris Bueller's Day Off","Year":"1986","Director":"John Hughes","Writer":"John Hughes","Taglines":"While the rest of us were just thinking about it...Ferris borrowed a Ferrari and did it...all in a day. ","Certificate":"PG-13 | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Un experto en diversión ","Budget":"$6,000,000 (estimated)","Gross":"$70,136,369 (USA)","Production_Co":"Paramount Pictures ","Runtime":"103 min","Sound_Mix":"Dolby","Color":"Color (Metrocolor)","Aspect_Ratio":"2.35 : 1","Trivia":"There is a poster for Simple Minds' song \"Don't You Forget About Me\" on Ferris' wall. This song was featured prominently in director John Hughes' earlier film The Breakfast Club (1985). See more »","Goofs":"Although the girls in the restaurant are playing a Karate Champ arcade game, the sound effects played are *not* from Karate Champ, but actually from Pac-Man. Keep in mind that this was an arcade/pizza parlor full of arcade games, so there could've been a Pac-Man game there as well that this sound effect came from. See more »","Crazy_Credits":"Mr. Rooney, having been chewed up by the dog, is walking down the street. A school bus driver lets him onto the bus, where the students are staring at him. Rooney notices one student has \"SAVE FERRIS\" written on his binder. See more »","Cast":"Matthew Broderick, Alan Ruck, Mia Sara, Jeffrey Jones, Jennifer Grey, Cindy Pickett, Lyman Ward, Edie McClurg, Charlie Sheen, Ben Stein, Del Close, Virginia Capers, Richard Edson, Larry Flash Jenkins, Kristy Swanson","Plot":"A high school wise guy is determined to have a day off from school, despite what the principal thinks of that. High school student Ferris Bueller wants a day off from school and he's developed an incredibly sophisticated plan to pull it off. He talks his friend Cameron into taking his father's prized Ferrari and with his girlfriend Sloane head into Chicago for the day. While they are taking in what the city has to offer school principal Ed Rooney is convinced that Ferris is, not for the first time, playing hooky for the day and is hell bent to catch him out. Ferris has anticipated that, much to Rooney's chagrin. Written by garykmcd","Genre":"Comedy","Keywords":"jersey the garment, talking to the audience, truancy, skipping school, rolling back the odometer","imdbRating":"7.9","imdbVotes":"234,069","Awards":"Nominated for 1 Golden Globe. Another 1 win.","Metascore":"61","Released":"11 June 1986 (USA) ","Location":"22 West Schiller Street, Chicago, Illinois, USA ","Actors":"Matthew Broderick, Alan Ruck, Mia Sara ","Running_time":"PT103M / 1h 43min","Description":"Directed by John Hughes.  With Matthew Broderick, Alan Ruck, Mia Sara, Jeffrey Jones. A high school wise guy is determined to have a day off from school, despite what the principal thinks of that.","Rated":"PG-13"}