{"imdbID":"tt0069762","Title":"Badlands","Year":"1973","Director":"Terrence Malick","Writer":"Terrence Malick","Taglines":"He was 25 years old. He combed his hair like James Dean. She was 15. She took music lessons and could twirl a baton. For a while they lived together in a tree house. In 1959, she watched while he killed a lot of people. ","Certificate":"PG | See all certifications »","Country":"USA","Language":"English, Spanish","Also_Known_As":"La balade sauvage ","Budget":"$450,000 (estimated)","Production_Co":"Warner Bros., Pressman-Williams, Jill Jakes Production ","Runtime":"94 min","Sound_Mix":"Mono","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The film opened in the USA within a short-time span of two other outlaw-couple Bonnie and Clyde (1967)-type road movies. The three movies were Terrence Malick's Badlands (1973), Robert Altman's Thieves Like Us (1974), and Steven Spielberg's The Sugarland Express (1974) See more »","Goofs":"The soldiers at the end are using M16 rifles, although they were not adopted by the U.S. Military until 1962. See more »","Cast":"Martin Sheen, Sissy Spacek, Warren Oates, Ramon Bieri, Alan Vint, Gary Littlejohn, John Carter, Bryan Montgomery, Gail Threlkeld, Charles Fitzpatrick, Howard Ragsdale, John Womack Jr., Dona Baldwin, Ben Bravo","Plot":"An impressionable teen girl from a dead-end town and her older greaser boyfriend go on a killing spree in the South Dakota badlands. It's the late 1950s. Mid-twenty-something Kit is a restless and unfocused young man with a James Dean vibe and swagger which he has heard mentioned about him more than once. Fifteen year old Holly has a somewhat cold relationship with her sign painter father, if only because she is the primary reminder of his wife, who died of pneumonia when Holly was a child. The two meet when Holly and her father move from Texas to the small town where Kit lives, Fort Dupree, South Dakota. They slowly fall in love, something about which she cannot tell her father because of their age difference and Kit coming from the wrong side of the tracks. When he tries to take Holly away with him, Kit, on an impulse, shoots her father dead. After letting the initial emotions of the situation settle down, Holly decides voluntarily to go with Kit, they trying to make it look like they committed suicide in a house fire. But they soon learn that their plan did not work, there being a bounty on their heads. As such,... Written by Huggo","Genre":"Crime, Drama","Keywords":"cult director, serial killer, cult film, south dakota, killing spree","imdbRating":"7.9","imdbVotes":"45,376","Awards":"Nominated for 1 BAFTA Film Award. Another 3 wins.","Metascore":"90","Released":"5 January 1974 (Brazil) ","Location":"Bloom Mansion - 312 E Main Street, Trinidad, Colorado, USA ","Actors":"Martin Sheen, Sissy Spacek, Warren Oates ","Running_time":"PT94M / 1h 34min","Description":"Directed by Terrence Malick.  With Martin Sheen, Sissy Spacek, Warren Oates, Ramon Bieri. An impressionable teen girl from a dead-end town and her older greaser boyfriend go on a killing spree in the South Dakota badlands.","Rated":"PG"}