{"imdbID":"tt0044706","Title":"High Noon","Year":"1952","Director":"Fred Zinnemann","Taglines":"The story of a man who was too proud to run. ","Country":"USA","Language":"English, Spanish","Also_Known_As":"A la hora señalada ","Budget":"$750,000 (estimated)","Production_Co":"Stanley Kramer Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"85 min","Sound_Mix":"Mono (Western Electric Recording)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Gary Cooper became a close friend of Carl Foreman during filming, and they continued to correspond for the rest of Cooper's life. See more »","Goofs":"When Amy is watching out of the office window at the showdown, the very next shot is from a high angle. This give the impression that she had been looking from or above the second floor. See more »","Cast":"Gary Cooper, Thomas Mitchell, Lloyd Bridges, Katy Jurado, Grace Kelly, Otto Kruger, Lon Chaney Jr., Harry Morgan, Ian MacDonald, Eve McVeagh, Morgan Farley, Harry Shannon, Lee Van Cleef, Robert J. Wilke, Sheb Wooley","Plot":"A marshall, personally compelled to face a returning deadly enemy, finds that his own town refuses to help him. On the day he gets married and hangs up his badge, lawman Will Kane is told that a man he sent to prison years before, Frank Miller, is returning on the noon train to exact his revenge. Having initially decided to leave with his new spouse, Will decides he must go back and face Miller. However, when he seeks the help of the townspeople he has protected for so long, they turn their backs on him. It seems Kane may have to face Miller alone, as well as the rest of Miller's gang, who are waiting for him at the station... Written by Man_With_No_Name_126","Genre":"Western","Keywords":"one against many, appeasement, street shootout, justice, frontier justice","imdbRating":"8.1","imdbVotes":"77,316","Awards":"Won 4 Oscars. Another 13 wins & 10 nominations.","Metascore":"89","Released":"30 July 1952 (USA) ","Location":"Brooks Ranch, Jamestown, California, USA ","Actors":"Gary Cooper, Grace Kelly, Thomas Mitchell ","Writer":"Carl Foreman (screenplay), John W. Cunningham (magazine story \"The Tin Star\")","Running_time":"PT85M / 1h 25min","Description":"Directed by Fred Zinnemann.  With Gary Cooper, Grace Kelly, Thomas Mitchell, Lloyd Bridges. A marshall, personally compelled to face a returning deadly enemy, finds that his own town refuses to help him.","Rated":"PG"}