{"imdbID":"tt0043350","Title":"The Blue Veil","Year":"1951","Country":"USA","Language":"English","Production_Co":"Wald/Krasna Productions ","Runtime":"113 min","Cast":"Jane Wyman, Charles Laughton, Joan Blondell, Richard Carlson, Agnes Moorehead, Don Taylor, Audrey Totter, Cyril Cusack, Everett Sloane, Natalie Wood, Vivian Vance, Carleton G. Young, Alan Napier, Warner Anderson, Les Tremayne","Plot":"Louise Mason is a young widow who fills her empty life with the task of becoming a children's nurse. As the years pass, and the widow tries to find her own place in life, her young charges,... See full summary » Louise Mason is a young widow who fills her empty life with the task of becoming a children's nurse. As the years pass, and the widow tries to find her own place in life, her young charges, the children of various employers, grow and soon find themselves ready to face the world. When it seems that she will be alone, the nurse finds that her 'children' have ideas of their own in regards to helping their beloved mentor. Written by alfiehitchie","Genre":"Drama","Keywords":"widow, foreign language adaptation, custody battle, child care, single mother","imdbRating":"7.5","imdbVotes":"237","Awards":"Nominated for 2 Oscars. Another 1 win.","Metascore":"","Released":"10 January 1952 (Portugal) ","Actors":"Jane Wyman, Charles Laughton, Joan Blondell ","Director":"Curtis Bernhardt, Busby Berkeley (uncredited)","Writer":"François Campaux (story), Norman Corwin","Running_time":"PT113M / 1h 53min","Description":"Directed by Curtis Bernhardt, Busby Berkeley.  With Jane Wyman, Charles Laughton, Joan Blondell, Richard Carlson. Louise Mason is a young widow who fills her empty life with the task of becoming a children's nurse. As the years pass, and the widow tries to find her own place in life, her young charges, the children of various employers, grow and soon find themselves ready to face the world. When it seems that she will be alone, the nurse finds that her 'children' have ideas of their own in regards to helping...","Rated":"N/A"}