{"imdbID":"tt0077928","Title":"Midnight Express","Year":"1978","Director":"Alan Parker","Country":"UK, USA","Language":"English, Maltese, French, Turkish","Budget":"$1,800,000 (estimated)","Gross":"$35,000,000 (USA)","Production_Co":"Columbia Pictures, Casablanca Filmworks ","Runtime":"121 min","Cast":"Brad Davis, Irene Miracle, Bo Hopkins, Paolo Bonacelli, Paul L. Smith, Randy Quaid, Norbert Weisser, John Hurt, Mike Kellin, Franco Diogene, Michael Ensign, Gigi Ballista, Kevork Malikyan, Peter Jeffrey, Joe Zammit Cordina","Plot":"The true story of Billy Hayes, an American college student who is caught smuggling drugs out of Turkey and thrown into prison. On October 6, 1970 while boarding an international flight out of Istanbul Airport, American Billy Hayes is caught attempting to smuggle 2 kilos of hashish out of the country, the drugs strapped to his body. He is told that he will be released if he cooperates with the authorities in identifying the person who actually sold him the hash. Billy's troubles really begin when after that assistance, he makes a run for it and is recaptured. He is initially sentenced to just over four years for possession, with no time for the more harsh crime of smuggling. The prison environment is inhospitable in every sense, with a sadistic prison guard named Hamidou ruling the prison, he who relishes the mental and physical torture he inflicts on the prisoners for whatever reason. Told to trust no one, Billy does befriend a few of the other inmates, namely fellow American Jimmy Booth (in for stealing two candlesticks from a mosque), a Swede named Erich, and one of the senior prisoners having already ... Written by Huggo","Genre":"Biography, Crime, Drama","Keywords":"prison, prisoner, drugs, student, smuggling","imdbRating":"7.7","imdbVotes":"52,251","Awards":"Won 2 Oscars. Another 14 wins & 14 nominations.","Metascore":"","Released":"6 October 1978 (USA) ","Location":"Fort St.Elmo, Valletta, Malta ","Actors":"Brad Davis, Irene Miracle, Bo Hopkins ","Writer":"Billy Hayes (book) (as William Hayes), William Hoffer (book) | 1 more credit »","Running_time":"PT121M / 2h 1min","Description":"Directed by Alan Parker.  With Brad Davis, Irene Miracle, Bo Hopkins, Paolo Bonacelli. The true story of Billy Hayes, an American college student who is caught smuggling drugs out of Turkey and thrown into prison.","Rated":"R"}