{"imdbID":"tt0053291","Title":"Some Like It Hot","Year":"1959","Director":"Billy Wilder","Taglines":"Marilyn Monroe and her bosom companions ","Certificate":"See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Una Eva y dos Adanes ","Budget":"$2,883,848 (estimated)","Gross":"$25,000,000 (USA)","Production_Co":"Ashton Productions, Mirisch Corporation, The ","":"Show detailed company contact information on IMDbPro »","Runtime":"120 min","Sound_Mix":"Mono (Westrex Recording System)","Color":"Black and White","Aspect_Ratio":"1.66 : 1","Trivia":"Included among the \"1001 Movies You Must See Before You Die\", edited by Steven Schneider. See more »","Goofs":"From his vantage in the lobby, Mulligan could not have witnessed Spats and his crew getting patted down, as they were in a walk-in closet behind a folded screen. See more »","Cast":"Marilyn Monroe, Tony Curtis, Jack Lemmon, George Raft, Pat O'Brien, Joe E. Brown, Nehemiah Persoff, Joan Shawlee, Billy Gray, George E. Stone, Dave Barry, Mike Mazurki, Harry Wilson, Beverly Wills, Barbara Drew","Plot":"When two musicians witness a mob hit, they flee the state in an all-female band disguised as women, but further complications set in. When two Chicago musicians, Joe and Jerry, witness the the St. Valentine's Day massacre, they want to get out of town and get away from the gangster responsible, Spats Colombo. They're desperate to get a gig out of town but the only job they know of is in an all-girl band heading to Florida. They show up at the train station as Josephine and Daphne, the replacement saxophone and bass players. They certainly enjoy being around the girls, especially Sugar Kane Kowalczyk who sings and plays the ukulele. Joe in particular sets out to woo her while Jerry/Daphne is wooed by a millionaire, Osgood Fielding III. Mayhem ensues as the two men try to keep their true identities hidden and Spats Colombo and his crew show up for a meeting with several other crime lords. Written by garykmcd","Genre":"Comedy, Romance","Keywords":"cross dressing, band, musician, spats, all girl band","imdbRating":"8.3","imdbVotes":"168,684","Awards":"Won 1 Oscar. Another 9 wins & 13 nominations.","Metascore":"","Released":"29 March 1959 (USA) ","Location":"Coronado Beach, Coronado, California, USA ","Actors":"Marilyn Monroe, Tony Curtis, Jack Lemmon ","Writer":"Billy Wilder (screenplay), I.A.L. Diamond (screenplay) | 2 more credits »","Running_time":"PT120M / 2h","Description":"Directed by Billy Wilder.  With Marilyn Monroe, Tony Curtis, Jack Lemmon, George Raft. When two musicians witness a mob hit, they flee the state in an all-female band disguised as women, but further complications set in.","Rated":"N/A"}