{"imdbID":"tt0063522","Title":"Rosemary's Baby","Year":"1968","Director":"Roman Polanski","Taglines":"Pray for Rosemary's Baby","Certificate":"R | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"El bebé de Rosemary ","Budget":"$2,300,000 (estimated)","Production_Co":"William Castle Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"136 min","Sound_Mix":"Mono","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"The movie's poster was as #21 of \"The 25 Best Movie Posters Ever\" by Premiere. See more »","Goofs":"Obvious wig on Rosemary during the rape. See more »","Cast":"Mia Farrow, John Cassavetes, Ruth Gordon, Sidney Blackmer, Maurice Evans, Ralph Bellamy, Victoria Vetri, Patsy Kelly, Elisha Cook Jr., Emmaline Henry, Charles Grodin, Hanna Hertelendy, Phil Leeds, D'Urville Martin, Hope Summers","Plot":"A young couple move into an apartment, only to be surrounded by peculiar neighbors and occurrences. When the wife becomes mysteriously pregnant, paranoia over the safety of her unborn child begins to control her life. Rosemary and Guy Woodhouse move into an apartment in an opulent but gothic building in Manhattan. Their landlord Edward \"Hutch\" Hutchins attempts to dissuade them from doing so: the building has an unsavory history. They discover that their neighbors are a very friendly elderly couple named Roman and Minnie Castevet, and Guy begins to spend a great deal of time with them. Strange things begin to happen: a young woman Rosemary meets in the laundry commits suicide, Rosemary has strange dreams and hears strange noises and Guy becomes remote and distant. Then Rosemary falls pregnant and begins to suspect that her neighbors have special plans for her child. Written by Goth <brooks@odie.ee.wits.ac.za>","Genre":"Drama, Horror","Keywords":"satanism, paranoia, raped by a demon, incubus, devil worship","imdbRating":"8.0","imdbVotes":"136,131","Awards":"Won 1 Oscar. Another 9 wins & 12 nominations.","Metascore":"","Released":"12 June 1968 (USA) ","Location":"Dakota Hotel - 1 West 72nd St. at Central Park West, Manhattan, New York City, New York, USA ","Actors":"Mia Farrow, John Cassavetes, Ruth Gordon ","Writer":"Ira Levin (novel), Roman Polanski (screenplay)","Running_time":"PT136M / 2h 16min","Description":"Directed by Roman Polanski.  With Mia Farrow, John Cassavetes, Ruth Gordon, Sidney Blackmer. A young couple move into an apartment, only to be surrounded by peculiar neighbors and occurrences. When the wife becomes mysteriously pregnant, paranoia over the safety of her unborn child begins to control her life.","Rated":"R"}