{"imdbID":"tt0099487","Title":"Edward Scissorhands","Year":"1990","Director":"Tim Burton","Taglines":"The story of an uncommonly gentle man. ","Certificate":"PG-13 | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"El joven manos de tijera ","Budget":"$20,000,000 (estimated)","Gross":"$56,362,352 (USA)","Production_Co":"Twentieth Century Fox Film Corporation ","Runtime":"105 min","Sound_Mix":"70 mm 6-Track (analog 70 mm prints)| CDS (digital 70 mm prints)| Dolby SR (35 mm prints)| CDS (digital 35 mm prints)","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Crispin Glover auditioned for the role of Jim. He later played an antagonist to Johnny Depp in Tim Burton's Alice in Wonderland (2010). See more »","Goofs":"Peggy's glasses while she puts cream on Edward's face to fix his scars. See more »","Crazy_Credits":"The title \"EDWARD SCISSORHANDS\" closes together, like a pair of scissors. See more »","Cast":"Johnny Depp, Winona Ryder, Dianne Wiest, Anthony Michael Hall, Kathy Baker, Robert Oliveri, Conchata Ferrell, Caroline Aaron, Dick Anthony Williams, O-Lan Jones, Vincent Price, Alan Arkin, Susan Blommaert, Linda Perri, John Davidson","Plot":"A gentle man, with scissors for hands, is brought into a new community after living in isolation. In a castle high on top of a hill lives an inventor's greatest creation - Edward, a near-complete person. The creator died before he could finish Edward's hands; instead, he is left with metal scissors for hands. Since then, he has lived alone, until a kind lady called Peg discovers him and welcomes him into her home. At first, everyone welcomes him into the community, but soon things begin to take a change for the worse. Written by FilmFanUK","Genre":"Drama, Fantasy, Romance","Keywords":"scissors, magical realism, frame up, lock pick, scissor hands","imdbRating":"7.9","imdbVotes":"346,799","Awards":"Nominated for 1 Oscar. Another 6 wins & 14 nominations.","Metascore":"74","Released":"14 December 1990 (USA) ","Location":"Dade City, Florida, USA ","Actors":"Johnny Depp, Winona Ryder, Dianne Wiest ","Writer":"Tim Burton (story), Caroline Thompson (story) | 1 more credit »","Running_time":"PT105M / 1h 45min","Description":"Directed by Tim Burton.  With Johnny Depp, Winona Ryder, Dianne Wiest, Anthony Michael Hall. A gentle man, with scissors for hands, is brought into a new community after living in isolation.","Rated":"PG-13"}