{"imdbID":"tt0086979","Title":"Blood Simple.","Year":"1984","Taglines":"Breaking up is hard ","Certificate":"R | See all certifications »","Country":"USA","Language":"English, Spanish","Also_Known_As":"Simplemente sangre ","Budget":"$1,500,000 (estimated)","Opening_Weekend":"$42,971 (USA) (7 July 2000)","Gross":"$2,150,000 (USA)","Production_Co":"River Road Productions, Foxton Entertainment ","Runtime":"99 min | 96 min (director's cut)","Sound_Mix":"Ultra Stereo (original version)| Dolby Digital (director's cut)","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Jim Piddock provided the voice of fictional film historian \"Kenneth Loring\" on the DVD audio commentary track, which was scripted by Joel Coen and Ethan Coen. See more »","Goofs":"When the detective is leaving Ray's house at night, you can see someone standing in the shot. See more »","Cast":"John Getz, Frances McDormand, Dan Hedaya, M. Emmet Walsh, Samm-Art Williams, Deborah Neumann, Raquel Gavia, Van Brooks, Señor Marco, William Creamer, Loren Bivens, Bob McAdams, Shannon Sedwick, Nancy Finger, William Preston Robertson","Plot":"A rich but jealous man hires a private investigator to kill his cheating wife and her new man. But, when blood is involved, nothing is simple. Texas bar owner Julian Marty, who is generally regarded as not a nice person, hires shady private detective Loren Visser, who is able to obtain what Marty requests: evidence - in this instance, photographic - that his wife, Abby, and one of his bartenders, Ray, are having an affair. As Ray and Abby realize that Marty has found out about them, it allows them to plan for their future away from Marty, while be up front with Marty about the situation. Marty, in turn, decides to hire Visser once again, this time to kill Abby and Ray, and dispose of their bodies so that they won't be found. The out in the open affair and the contract hit lead to some actions based on self interest, and a standoff of sorts between the four players, which is compounded in complexity by some wrong assumptions of what has happened, with an innocent bystander, another of the Marty's bartenders, Meurice, potentially and unwittingly adding to the scenario. Written by Huggo","Genre":"Crime, Thriller","Keywords":"double cross, texas, private detective, deception, crime gone awry","imdbRating":"7.7","imdbVotes":"65,399","Awards":"4 wins & 6 nominations.","Metascore":"81","Released":"18 January 1985 (USA) ","Location":"Pflugerville, Texas, USA ","Actors":"John Getz, Frances McDormand, Dan Hedaya ","Director":"Joel Coen, Ethan Coen (uncredited)","Writer":"Joel Coen, Ethan Coen","Running_time":"PT99M / 1h 39min","Description":"Directed by Joel Coen, Ethan Coen.  With John Getz, Frances McDormand, Dan Hedaya, M. Emmet Walsh. A rich but jealous man hires a private investigator to kill his cheating wife and her new man. But, when blood is involved, nothing is simple.","Rated":"R"}