{"imdbID":"tt0089643","Title":"Murphy's Romance","Year":"1985","Director":"Martin Ritt","Country":"USA","Language":"English","Budget":"$13,000,000 (estimated)","Gross":"$30,762,621 (USA)","Production_Co":"Columbia Pictures Corporation, Delphi IV Productions, Fogwood Films ","Runtime":"107 min","Cast":"Sally Field, James Garner, Brian Kerwin, Corey Haim, Dennis Burkley, Georgann Johnson, Dortha Duckworth, Michael Prokopuk, Billy Ray Sharkey, Michael Crabtree, Anna Levine, Charles Lane, Bruce French, John C. Becher, Henry Slate","Plot":"Emma is a divorced woman with a teen aged boy who moves into a small town and tries to make a go of a horse ranch. Murphy is the town druggist who steers business her way. Things are going ... See full summary » Emma is a divorced woman with a teen aged boy who moves into a small town and tries to make a go of a horse ranch. Murphy is the town druggist who steers business her way. Things are going along predictably until her ex husband shows up, needing a place to stay. The three of them form an intricate circle, Emma's son liking Murphy, but desperately wanting his father back. Written by John Vogel <jlvogel@comcast.net>","Genre":"Comedy, Drama, Romance","Keywords":"horse, small town, love, widower, pharmacist","imdbRating":"7.0","imdbVotes":"4,036","Awards":"Nominated for 2 Oscars. Another 2 nominations.","Metascore":"","Released":"31 January 1986 (USA) ","Location":"Florence, Arizona, USA ","Actors":"Sally Field, James Garner, Brian Kerwin ","Writer":"Max Schott (based on the novella by), Harriet Frank Jr. (screenplay) | 1 more credit »","Running_time":"PT107M / 1h 47min","Description":"Directed by Martin Ritt.  With Sally Field, James Garner, Brian Kerwin, Corey Haim. Emma is a divorced woman with a teen aged boy who moves into a small town and tries to make a go of a horse ranch. Murphy is the town druggist who steers business her way. Things are going along predictably until her ex husband shows up, needing a place to stay. The three of them form an intricate circle, Emma's son liking Murphy, but desperately wanting his father back.","Rated":"PG-13"}