{"imdbID":"tt0061395","Title":"Belle de Jour","Year":"1967","Director":"Luis Buñuel (as Luis Bunuel)","Taglines":"Luis Bunuel's Masterpiece of Erotica!","Certificate":"Approved | See all certifications »","Country":"France, Italy","Language":"French, Spanish, Mongolian","Also_Known_As":"Belle de Jour ","Production_Co":"Robert et Raymond Hakim, Paris Film Productions, Five Film ","Runtime":"101 min","Sound_Mix":"Mono","Color":"Color (Eastmancolor)","Aspect_Ratio":"1.66 : 1","Trivia":"Luis Buñuel: Sitting in the outdoor café when the Duke gets off his carriage. See more »","Goofs":"Marcel breaks the glass and oval frame to vent his anger. The same frame and picture are unbroken later. See more »","Cast":"Catherine Deneuve, Jean Sorel, Michel Piccoli, Geneviève Page, Pierre Clémenti, Françoise Fabian, Macha Méril, Muni, Maria Latour, Claude Cerval, Michel Charrel, Iska Khan, Bernard Musson, Marcel Charvey, François Maistre","Plot":"A frigid young housewife decides to spend her midweek afternoons as a prostitute. Severine is a beautiful young woman married to a doctor. She loves her husband dearly, but cannot bring herself to be physically intimate with him. She indulges instead in vivid, kinky, erotic fantasies to entertain her sexual desires. Eventually she becomes a prostitute, working in a brothel in the afternoons while remaining chaste in her marriage. Written by James Meek <james@oz.net>","Genre":"Drama","Keywords":"brothel, prostitute, marriage, sex, dream","imdbRating":"7.8","imdbVotes":"28,194","Awards":"Nominated for 1 BAFTA Film Award. Another 5 wins & 2 nominations.","Metascore":"","Released":"10 April 1968 (USA) ","Location":"Valberg, Guillaumes, Alpes-Maritimes, France ","Actors":"Catherine Deneuve, Jean Sorel, Michel Piccoli ","Writer":"Joseph Kessel (novel) (as Joseph Kessel de l'Académie Française), Luis Buñuel (adaptation) (as Luis Bunuel) | 1 more credit »","Running_time":"PT101M / 1h 41min","Description":"Directed by Luis Buñuel.  With Catherine Deneuve, Jean Sorel, Michel Piccoli, Geneviève Page. A frigid young housewife decides to spend her midweek afternoons as a prostitute.","Rated":"APPROVED"}