{"imdbID":"tt0039628","Title":"Miracle on 34th Street","Year":"1947","Director":"George Seaton","Country":"USA","Language":"English, Dutch","Production_Co":"Twentieth Century Fox Film Corporation ","Runtime":"96 min | 101 min (DVD)","Cast":"Maureen O'Hara, John Payne, Edmund Gwenn, Gene Lockhart, Natalie Wood, Porter Hall, William Frawley, Jerome Cowan, Philip Tonge","Plot":"When a nice old man who claims to be Santa Claus is institutionalized as insane, a young lawyer decides to defend him by arguing in court that he is the real thing. At the Macy's Department Store Thanksgiving Day parade, the actor playing Santa is discovered to be drunk by a whiskered old man. Doris Walker, the no nonsense special events director, persuades the old man to take his place. The old man proves to be a sensation and is quickly recruited to be the store Santa at the main Macy's outlet. While he is successful, Ms. Walker learns that he calls himself Kris Kringle and he claims to be the actual Santa Claus. Despite reassurances by Kringle's doctor that he is harmless, Doris still has misgivings, especially when she has cynically trained herself, and especially her daughter, Susan, to reject all notions of belief and fantasy. And yet, people, especially Susan, begin to notice there is something special about Kris and his determination to advance the true spirit of Christmas amidst the rampant commercialism around him and succeeding in improbable ways. When a raucous conflict with the store's cruelly incompetent psychologist erupts, Kris ... Written by Kenneth Chisholm <kchishol@rogers.com>","Genre":"Comedy, Crime, Drama","Keywords":"santa claus, christmas, parade, lawyer, drunken santa","imdbRating":"7.9","imdbVotes":"29,663","Awards":"Won 3 Oscars. Another 5 wins & 1 nomination.","Metascore":"","Released":"2 May 1947 (USA) ","Location":"Manhattan, New York City, New York, USA ","Actors":"Edmund Gwenn, Maureen O'Hara, John Payne ","Writer":"George Seaton (written for the screen by), Valentine Davies (story)","Running_time":"PT96M / 1h 36min","Description":"Directed by George Seaton.  With Edmund Gwenn, Maureen O'Hara, John Payne, Gene Lockhart. When a nice old man who claims to be Santa Claus is institutionalized as insane, a young lawyer decides to defend him by arguing in court that he is the real thing.","Rated":"APPROVED"}