{"imdbID":"tt0027300","Title":"Anthony Adverse","Year":"1936","Country":"USA","Language":"English, Italian","Budget":"$1,050,500 (estimated)","Production_Co":"Warner Bros. ","Runtime":"141 min","Cast":"Fredric March, Olivia de Havilland, Donald Woods, Anita Louise, Edmund Gwenn, Claude Rains, Louis Hayward, Gale Sondergaard, Steffi Duna, Akim Tamiroff, Ralph Morgan, Fritz Leiber, Luis Alberni, Billy Mauch, Henry O'Neill","Plot":"In 18th-century Italy, an orphan's debt to the man who raised him threatens to separate him forever from the woman he loves. In late 18th century Italy, a beautiful young woman finds herself married to a rich but cruel older man. However, she is in love with another, younger man. When the husband finds out, he kills the lover in a swordfight, and takes his wife on a long trip throughout Europe. Months later, she dies giving birth to a son. The husband leaves the child at a convent, where he is raised until the age of 10; then he is apprenticed to a local merchant, who gives him the name \"Anthony Adverse\" because of the adversity in his life. But his adversity has only begun, as fate takes him to Cuba, Africa, and Paris. Written by John Oswalt <jao@jao.com>","Genre":"Adventure, Drama, Romance","Keywords":"love, debt, convent, merchant, orphan","imdbRating":"6.6","imdbVotes":"1,099","Awards":"Won 4 Oscars. Another 3 nominations.","Metascore":"","Released":"29 August 1936 (USA) ","Location":"Stage 14, Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA ","Actors":"Fredric March, Olivia de Havilland, Donald Woods ","Director":"Mervyn LeRoy, Michael Curtiz (uncredited)","Writer":"Hervey Allen (by), Sheridan Gibney (screen play)","Running_time":"PT141M / 2h 21min","Description":"Directed by Mervyn LeRoy, Michael Curtiz.  With Fredric March, Olivia de Havilland, Donald Woods, Anita Louise. In 18th-century Italy, an orphan's debt to the man who raised him threatens to separate him forever from the woman he loves.","Rated":"NOT RATED"}