{"imdbID":"tt0059527","Title":"The Shop on Main Street","Year":"1965","Country":"Czechoslovakia","Language":"Slovak, Yiddish","Production_Co":"Filmové studio Barrandov ","Runtime":"128 min | 125 min (2001 Criterion release)","Cast":"Ida Kaminska, Jozef Kroner, Hana Slivková, Martin Hollý, Adam Matejka, Frantisek Zvarík, Mikulás Ladizinský, Martin Gregor, Alojz Kramar, Gita Misurová, Frantisek Papp, Helena Zvaríková, Tibor Vadas, Eugen Senaj, Luise Grossová","Plot":"Slovakia during WW2. Tono lives a poor life, but the authorities offer him to take over the Jewish widow Lautman's little shop for sewing material. She is old and confused and thinks that ... See full summary » Slovakia during WW2. Tono lives a poor life, but the authorities offer him to take over the Jewish widow Lautman's little shop for sewing material. She is old and confused and thinks that he is only looking for employment and hires him. The odd couple begin to like each other. But some time later the authorities decide that the Jews must leave the city. What should he do with the old lady? Written by Mattias Thuresson","Genre":"Drama","Keywords":"jewish, fascist, slovakia, brother in law, garment button","imdbRating":"8.1","imdbVotes":"6,096","Awards":"Won 1 Oscar. Another 5 wins & 4 nominations.","Metascore":"","Released":"24 January 1966 (USA) ","Location":"Sabinov, Slovakia","Actors":"Ida Kaminska, Jozef Kroner, Hana Slivková ","Director":"Ján Kadár, Elmar Klos","Writer":"Ladislav Grosman (screenplay), Ladislav Grosman (story) | 2 more credits »","Running_time":"PT128M / 2h 8min","Description":"Directed by Ján Kadár, Elmar Klos.  With Ida Kaminska, Jozef Kroner, Hana Slivková, Martin Hollý. Slovakia during WW2. Tono lives a poor life, but the authorities offer him to take over the Jewish widow Lautman's little shop for sewing material. She is old and confused and thinks that he is only looking for employment and hires him. The odd couple begin to like each other. But some time later the authorities decide that the Jews must leave the city. What should he do with the old lady?","Rated":"NOT RATED"}