{"imdbID":"tt0040491","Title":"Joan of Arc","Year":"1948","Director":"Victor Fleming","Country":"USA","Language":"English","Budget":"$4,600,000 (estimated)","Production_Co":"Walter Wanger Productions ","Runtime":"145 min | 100 min (cut) | 145 min (DVD)","Cast":"Ingrid Bergman, Francis L. Sullivan, J. Carrol Naish, Ward Bond, Shepperd Strudwick, Gene Lockhart, John Emery, Leif Erickson, Cecil Kellaway, José Ferrer, Selena Royle, Robert Barrat, Jimmy Lydon, Rand Brooks, Roman Bohnen","Plot":"In the Fifteenth Century, France is a defeated and ruined nation after the One Hundred Years War against England. The fourteen years old farm girl Joan of Arc claims to hear voices from ... See full summary » In the Fifteenth Century, France is a defeated and ruined nation after the One Hundred Years War against England. The fourteen years old farm girl Joan of Arc claims to hear voices from Heaven asking her to lead God's Army against Orleans and crowning the weak Dauphin Charles VII as King of France. Joan gathers the people with her faith, forms an army and conquerors Orleans. When her army is ready to attack Paris, the corrupt Charles sells his country to England and dismiss the army. Joan is arrested, sold to the Burgundians England and submitted to a shameful political trial in Rouen castle. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Biography, Drama, History","Keywords":"france, faith, joan of arc, trial, life of a saint","imdbRating":"6.5","imdbVotes":"1,890","Awards":"Won 2 Oscars. Another 2 wins & 6 nominations.","Metascore":"","Released":"15 April 1949 (Ireland) ","Location":"Balboa, Newport Beach, California, USA ","Actors":"Ingrid Bergman, José Ferrer, Francis L. Sullivan ","Writer":"Maxwell Anderson (play), Maxwell Anderson (screenplay) | 1 more credit »","Running_time":"PT145M / 2h 25min","Description":"Directed by Victor Fleming.  With Ingrid Bergman, José Ferrer, Francis L. Sullivan, J. Carrol Naish. In the Fifteenth Century, France is a defeated and ruined nation after the One Hundred Years War against England. The fourteen years old farm girl Joan of Arc claims to hear voices from Heaven asking her to lead God's Army against Orleans and crowning the weak Dauphin Charles VII as King of France. Joan gathers the people with her faith, forms an army and conquerors Orleans. When her army is ...","Rated":"UNRATED"}