{"imdbID":"tt0063483","Title":"Rachel, Rachel","Year":"1968","Director":"Paul Newman","Country":"USA","Language":"English","Budget":"$700,000 (estimated)","Production_Co":"Kayos Productions ","Runtime":"101 min","Cast":"Joanne Woodward, James Olson, Kate Harrington, Estelle Parsons, Donald Moffat, Terry Kiser, Frank Corsaro, Bernard Barrow, Geraldine Fitzgerald, Nell Potts, Shawn Campbell, Violet Dunn, Beatrice Pons, Dortha Duckworth, Simm Landres","Plot":"Rachel is a 35 year old school teacher who has no man in her life and lives with her mother. When a man from the big city returns and asks her out, she begins to have to make decisions about her life and where she wants it to go. Thirty-five year old spinster and virgin Rachel Cameron is a sad, lonely woman. She lives in the small town of Japonica, Connecticut where she grew up. She teaches second grade at Japonica Elementary School and lives with her highly demanding widowed mother (her funeral director father passed away fourteen years ago) in the same apartment above a funeral home where she grew up, despite the home now not owned by them. Rachel often uses her mother as an excuse not to do things. Rachel represses her emotions, and is prone to daydreaming to envision alternate paths for herself in certain situations if she only had the nerve to do those things. Even when Nick Kazlik, a childhood acquaintance who has returned to Japonica for a summer visit with his family, makes it clear that he wants to have fun with her while he's in town, she can't act on his request out of fear of the unknown. But after a couple of incidents with her only real friend Calla Mackie, who is a fellow teacher at the school, ... Written by Huggo","Genre":"Drama, Romance","Keywords":"school, teacher, funeral home, summer, elementary school","imdbRating":"7.5","imdbVotes":"2,162","Awards":"Nominated for 4 Oscars. Another 7 wins & 5 nominations.","Metascore":"","Released":"26 August 1968 (USA) ","Location":"Bethel, Connecticut, USA ","Actors":"Joanne Woodward, James Olson, Kate Harrington ","Writer":"Stewart Stern (screenplay), Margaret Laurence (novel)","Running_time":"PT101M / 1h 41min","Description":"Directed by Paul Newman.  With Joanne Woodward, James Olson, Kate Harrington, Estelle Parsons. Rachel is a 35 year old school teacher who has no man in her life and lives with her mother. When a man from the big city returns and asks her out, she begins to have to make decisions about her life and where she wants it to go.","Rated":"R"}