{"imdbID":"tt0098635","Title":"When Harry Met Sally...","Year":"1989","Director":"Rob Reiner","Writer":"Nora Ephron","Taglines":"Can men and women be friends or does sex always get in the way? ","Certificate":"R | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Harry, This Is Sally ","Budget":"$16,000,000 (estimated)","Gross":"$92,823,600 (USA)","Production_Co":"Castle Rock Entertainment, Nelson Entertainment ","Runtime":"96 min | 89 min (TV)","Sound_Mix":"Dolby","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"According to screenwriter Nora Ephron the infamous \"I'll have what she's having\" line was actually suggested by Billy Crystal. See more »","Goofs":"When Harry is dropped off in New York's Washington Square in 1977 the street signs are green and white. In 1977 the street signs in New York were still gold and black. See more »","Cast":"Billy Crystal, Meg Ryan, Carrie Fisher, Bruno Kirby, Steven Ford, Lisa Jane Persky, Michelle Nicastro, Gretchen Palmer, Robert Alan Beuth, David Burdick, Joe Viviani, Harley Jane Kozak, Joseph Hunt, Kevin Rooney, Franc Luz","Plot":"Harry and Sally have known each other for years, and are very good friends, but they fear sex would ruin the friendship. Harry and Sally meet when she gives him a ride to New York after they both graduate from the University of Chicago. The film jumps through their lives as they both search for love, but fail, bumping into each other time and time again. Finally a close friendship blooms between them, and they both like having a friend of the opposite sex. But then they are confronted with the problem: \"Can a man and a woman be friends, without sex getting in the way?\" Written by Greg Bole <bole@life.bio.sunysb.edu>","Genre":"Comedy, Drama, Romance","Keywords":"sex, new york, love, friendship, male female friendship","imdbRating":"7.6","imdbVotes":"144,111","Awards":"Nominated for 1 Oscar. Another 4 wins & 15 nominations.","Metascore":"76","Released":"21 July 1989 (USA) ","Location":"New York, USA ","Actors":"Billy Crystal, Meg Ryan, Carrie Fisher ","Running_time":"PT96M / 1h 36min","Description":"Directed by Rob Reiner.  With Billy Crystal, Meg Ryan, Carrie Fisher, Bruno Kirby. Harry and Sally have known each other for years, and are very good friends, but they fear sex would ruin the friendship.","Rated":"R"}