{"imdbID":"tt0095765","Title":"Nuovo Cinema Paradiso","Year":"1988","Director":"Giuseppe Tornatore","Taglines":"A celebration of youth, friendship, and the everlasting magic of the movies.","Country":"Italy, France","Language":"Italian","Also_Known_As":"Cinema Paradiso ","Budget":"$5,000,000 (estimated)","Opening_Weekend":"$25,899 (USA) (14 June 2002)","Gross":"$11,990,401 (USA)","Production_Co":"Cristaldifilm, Les Films Ariane, Rai 3 ","":"Show detailed company contact information on IMDbPro »","Runtime":"155 min | 173 min (Europa Cinema Festival) | 124 min (cut theatrical)","Sound_Mix":"Dolby","Color":"Color","Aspect_Ratio":"1.66 : 1","Trivia":"The new film projector installed after the fire accident in the projector room is a model Victoria IV manufactured by Cinemeccanica S.p.a, Milano, Italy. See more »","Goofs":"The heights of Toto and his mother change dramatically during the course of their adult lives. Jacques Perrin is much taller than Marco Leonardi and Pupella Maggio is much shorter than Antonella Attili. As a child and teenager, Toto is clearly below average height. In middle age, he is the tallest man at Alfredo's funeral by a clear head. See more »","Cast":"Antonella Attili, Enzo Cannavale, Isa Danieli, Leo Gullotta, Marco Leonardi, Pupella Maggio, Agnese Nano, Leopoldo Trieste, Salvatore Cascio, Tano Cimarosa, Nicola Di Pinto, Roberta Lena, Nino Terzo, Jacques Perrin, Brigitte Fossey","Plot":"A filmmaker recalls his childhood, when he fell in love with the movies at his village's theater and formed a deep friendship with the theater's projectionist. A famous film director remembers his childhood at the Cinema Paradiso where Alfredo, the projectionist, first brought about his love of films. He returns home to his Sicilian village for the first time after almost 30 years and is reminded of his first love, Elena, who disappeared from his life before he left for Rome. Written by Graeme Roy <gsr@cbmamiga.demon.co.uk>","Genre":"Drama","Keywords":"film projectionist, cinema, flashback, haunted by the past, mother son relationship","imdbRating":"8.5","imdbVotes":"145,234","Awards":"Won 1 Oscar. Another 20 wins & 23 nominations.","Metascore":"80","Released":"17 November 1988 (Italy) ","Location":"Bagheria, Palermo, Sicily, Italy ","Actors":"Philippe Noiret, Enzo Cannavale, Antonella Attili ","Writer":"Giuseppe Tornatore (story), Giuseppe Tornatore (screenplay) | 2 more credits »","Running_time":"PT155M / 2h 35min","Description":"Directed by Giuseppe Tornatore.  With Philippe Noiret, Enzo Cannavale, Antonella Attili, Isa Danieli. A filmmaker recalls his childhood, when he fell in love with the movies at his village's theater and formed a deep friendship with the theater's projectionist.","Rated":"R"}