{"imdbID":"tt0082846","Title":"On Golden Pond","Year":"1981","Director":"Mark Rydell","Country":"UK, USA","Language":"English","Gross":"$119,285,432 (USA)","Production_Co":"IPC Films, Incorporated Television Company (ITC) ","Runtime":"109 min","Cast":"Katharine Hepburn, Henry Fonda, Jane Fonda, Doug McKeon, Dabney Coleman, William Lanteau, Christopher Rydell","Plot":"Norman is a curmudgeon with an estranged relationship with his daughter Chelsea. At Golden Pond, he and his wife nevertheless agree to care for Billy, the son of Chelsea's new boyfriend, and a most unexpected relationship blooms. The loons are back again on Golden Pond and so are Norman Thayer, a retired professor, and Ethel who have had a summer cottage there since early in their marriage. This summer their daughter Chelsea -- whom they haven't seen for years -- feels she must be there for Norman's birthday. She and her fiance are on their way to Europe the next day but will be back in a couple of weeks to pick up the fiance's son. When she returns Chelsea is married and her stepson has the relationship with her father that she always wanted. Will father and daughter be able to communicate at last? Written by Dale O'Connor <daleoc@interaccess.com>","Genre":"Drama","Keywords":"summer, cottage, marriage, box office hit, real life father and daughter playing father and daughter","imdbRating":"7.7","imdbVotes":"20,788","Awards":"Won 3 Oscars. Another 11 wins & 23 nominations.","Metascore":"","Released":"12 February 1982 (USA) ","Location":"Lake Winnipausakee, New Hampshire, USA ","Actors":"Katharine Hepburn, Henry Fonda, Jane Fonda ","Writer":"Ernest Thompson (screenplay), Ernest Thompson (based on his play)","Running_time":"PT109M / 1h 49min","Description":"Directed by Mark Rydell.  With Katharine Hepburn, Henry Fonda, Jane Fonda, Doug McKeon. Norman is a curmudgeon with an estranged relationship with his daughter Chelsea. At Golden Pond, he and his wife nevertheless agree to care for Billy, the son of Chelsea's new boyfriend, and a most unexpected relationship blooms.","Rated":"PG"}