{"imdbID":"tt0067328","Title":"The Last Picture Show","Year":"1971","Director":"Peter Bogdanovich","Country":"USA","Language":"English","Budget":"$1,300,000 (estimated)","Production_Co":"Columbia Pictures Corporation, BBS Productions ","Runtime":"118 min | 127 min (director's cut)","Cast":"Timothy Bottoms, Jeff Bridges, Cybill Shepherd, Ben Johnson, Cloris Leachman, Ellen Burstyn, Eileen Brennan, Clu Gulager, Sam Bottoms, Sharon Ullrick, Randy Quaid, Joe Heathcock, Bill Thurman, Barc Doyle, Jessie Lee Fulton","Plot":"A group of 1950s high schoolers come of age in a bleak, isolated, atrophied West Texas town that is slowly dying, both economically and culturally. In tiny Anarene, Texas, in the lull between World War Two and the Korean Conflict, Sonny and Duane are best friends. Enduring that awkward period of life between boyhood and manhood, the two pass their time the best way they know how -- with the movie house, football, and girls. Jacey is Duane's steady, wanted by every boy in school, and she knows it. Her daddy is rich and her mom is good looking and loose. It's the general consensus that whoever wins Jacey's heart will be set for life. But Anarene is dying a quiet death as folks head for the big cities to make their livings and raise their kids. The boys are torn between a future somewhere out there beyond the borders of town or making do with their inheritance of a run-down pool hall and a decrepit movie house -- the legacy of their friend and mentor, Sam the Lion. As high school graduation approaches, they learn some difficult lessons about love, loneliness, and jealousy. Then folks stop attending the second-run features at the ... Written by Mark Fleetwood <mfleetwo@mail.coin.missouri.edu>","Genre":"Drama","Keywords":"child molester, high school, friend, texas, high school football","imdbRating":"8.1","imdbVotes":"30,436","Awards":"Won 2 Oscars. Another 16 wins & 22 nominations.","Metascore":"","Released":"22 October 1971 (USA) ","Location":"115 East Main Street, Archer City, Texas, USA ","Actors":"Timothy Bottoms, Jeff Bridges, Cybill Shepherd ","Writer":"Larry McMurtry (screenplay), Peter Bogdanovich (screenplay) | 1 more credit »","Running_time":"PT118M / 1h 58min","Description":"Directed by Peter Bogdanovich.  With Timothy Bottoms, Jeff Bridges, Cybill Shepherd, Ben Johnson. A group of 1950s high schoolers come of age in a bleak, isolated, atrophied West Texas town that is slowly dying, both economically and culturally.","Rated":"R"}