{"imdbID":"tt0061184","Title":"Who's Afraid of Virginia Woolf?","Year":"1966","Director":"Mike Nichols","Writer":"Ernest Lehman (screenplay)","Taglines":"Drop in for Drinks and Brace yourself. ","Certificate":"TV-MA | See all certifications »","Country":"USA","Language":"English, Latin, Spanish","Also_Known_As":"Edward Albee's Who's Afraid of Virginia Woolf? ","Budget":"$7,500,000 (estimated)","Production_Co":"Warner Bros., Chenault Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"131 min","Sound_Mix":"Mono","Color":"Black and White","Aspect_Ratio":"1.85 : 1","Trivia":"A map of Martha's Vineyard can be seen above George and Martha's fireplace. Director Mike Nichols has summered on the Vineyard for many years. See more »","Goofs":"The four characters stop at a bar after the first soiree at George's house. It is clearly after 2:00 a.m., since the time was stated during the first segment. No bars, however, would have been open after 1 or 2 a.m. in the New England states, where the film is set. See more »","Cast":"Elizabeth Taylor, Richard Burton, George Segal, Sandy Dennis","Plot":"A bitter, aging couple, with the help of alcohol, use a young couple to fuel anguish and emotional pain towards each other. George and Martha are a middle aged married couple, whose charged relationship is defined by vitriolic verbal battles, which underlies what seems like an emotional dependence upon each other. This verbal abuse is fueled by an excessive consumption of alcohol. George being an associate History professor in a New Carthage university where Martha's father is the President adds an extra dimension to their relationship. Late one Saturday evening after a faculty mixer, Martha invites Nick and Honey, an ambitious young Biology professor new to the university and his mousy wife, over for a nightcap. As the evening progresses, Nick and Honey, plied with more alcohol, get caught up in George and Martha's games of needing to hurt each other and everyone around them. The ultimate abuse comes in the form of talk of George and Martha's unseen sixteen year old son, whose birthday is the following day. Written by Huggo","Genre":"Drama","Keywords":"professor, alcohol, guest, late night, drink","imdbRating":"8.1","imdbVotes":"54,345","Awards":"Won 5 Oscars. Another 17 wins & 23 nominations.","Metascore":"","Released":"22 June 1966 (USA) ","Location":"Cambridge, Massachusetts, USA ","Actors":"Elizabeth Taylor, Richard Burton, George Segal ","Running_time":"PT131M / 2h 11min","Description":"Directed by Mike Nichols.  With Elizabeth Taylor, Richard Burton, George Segal, Sandy Dennis. A bitter, aging couple, with the help of alcohol, use a young couple to fuel anguish and emotional pain towards each other.","Rated":"TV-MA"}