{"imdbID":"tt0021873","Title":"Five Star Final","Year":"1931","Director":"Mervyn LeRoy","Country":"USA","Language":"English","Production_Co":"First National Pictures ","Runtime":"89 min","Cast":"Edward G. Robinson, Marian Marsh, H.B. Warner, Anthony Bushell, George E. Stone, Frances Starr, Ona Munson, Boris Karloff, Aline MacMahon, Oscar Apfel, Purnell Pratt, Robert Elliott","Plot":"The City Editor of a sleazy tabloid goes against his own journalistic ethics to resurrect a twenty year old murder case... with tragic results. Hinchcliffe, the ruthless publisher of a sleazy New York tabloid, is concerned that the ethical journalistic policies of City Editor Randall have caused a drop in circulation. He pressures the newsman to run more sensational stories including resurrecting the twenty year old Vorhees Murder Case. Although the perpetrator's actions were ultimately judged justifiable, and she has been subsequently living an exemplary life in anonymity, Hunchcliffe insists Randall revisit the story. Randall assigns Isopod, an alcoholic degenerate, to dig up anything lurid that he find. The unprincipled reporter fraudulently insinuates himself into the Vorhees' home masquerading as a minister and gets the expose he sought. Yellow journalism triumphs, and a decent woman's name gets dragged through the mud again... with tragic consequences. Written by duke1029@aol.com","Genre":"Crime, Drama, Film-Noir","Keywords":"editor, city editor, murder, tabloid, reporter","imdbRating":"7.4","imdbVotes":"1,090","Awards":"Nominated for 1 Oscar.","Metascore":"","Released":"26 September 1931 (USA) ","Location":"Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA","Actors":"Edward G. Robinson, Marian Marsh, H.B. Warner ","Writer":"Louis Weitzenkorn (based on the play by), Byron Morgan (screen play) | 1 more credit »","Running_time":"PT89M / 1h 29min","Description":"Directed by Mervyn LeRoy.  With Edward G. Robinson, Marian Marsh, H.B. Warner, Anthony Bushell. The City Editor of a sleazy tabloid goes against his own journalistic ethics to resurrect a twenty year old murder case... with tragic results.","Rated":"N/A"}