{"imdbID":"tt0020641","Title":"Anna Christie","Year":"1930","Director":"Clarence Brown","Country":"USA","Language":"English","Budget":"$376,000 (estimated)","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"89 min","Cast":"Greta Garbo, Charles Bickford, George F. Marion, Marie Dressler, James T. Mack, Lee Phelps","Plot":"A young woman reunites with her estranged father and falls in love with a sailor, but struggles to tell them about her dark past. In New York, the alcoholic skipper of a coal barge Chris Christofferson receives a letter from his estranged twenty year old daughter Anna \"Christie\" Christofferson telling that she will leave Minnesota to stay with him. Chris left Anna fifteen years ago to the countryside to be raised by relatives in a farm in St. Paul and he has never visited his daughter. Anna Christie arrives and she is a wounded woman with a hidden dishonorable past since she had worked for two years in a brothel to survive. She moves to the barge to live with her father and one night, Chris rescues the sailor Matt and two other fainted sailors from the sea. Soon Anna and Matt fall in love with each other and Anna has the best days of her life. But when Matt proposes to marry her, she is reluctant and also haunted by her past. Matt insists and Anna opens her heart to Matt and to her father disclosing the darks secrets of her past. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Drama, Romance","Keywords":"sailor, love, barge, rescue, coal","imdbRating":"6.9","imdbVotes":"1,942","Awards":"Nominated for 3 Oscars. Another 1 win.","Metascore":"","Released":"21 February 1930 (USA) ","Location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA","Actors":"Greta Garbo, Charles Bickford, George F. Marion ","Writer":"Frances Marion (adapted by), Eugene O'Neill (from play \"Anna Christie\")","Running_time":"PT89M / 1h 29min","Description":"Directed by Clarence Brown.  With Greta Garbo, Charles Bickford, George F. Marion, Marie Dressler. A young woman reunites with her estranged father and falls in love with a sailor, but struggles to tell them about her dark past.","Rated":"PASSED"}