{"imdbID":"tt0028944","Title":"The Good Earth","Year":"1937","Country":"USA","Language":"English","Budget":"$2,800,000 (estimated)","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"138 min","Cast":"Paul Muni, Luise Rainer, Walter Connolly, Tilly Losch, Charley Grapewin, Jessie Ralph, Soo Yong, Keye Luke, Roland Lui, Suzanna Kim, Ching Wah Lee, Harold Huber, Olaf Hytten, William Law, Mary Wong","Plot":"The story of a farmer in China: a story of humility and bravery. His father gives Wang Lung a freed slave as wife. By diligence and frugality the two manage to enlarge their property. But ... See full summary » The story of a farmer in China: a story of humility and bravery. His father gives Wang Lung a freed slave as wife. By diligence and frugality the two manage to enlarge their property. But then a famine forces them to leave their land and live in the town. However it turns out to be a blessing in disguise for them... Written by Tom Zoerner <Tom.Zoerner@informatik.uni-erlangen.de>","Genre":"Drama, Romance","Keywords":"farmer, famine, slave, money, city","imdbRating":"7.8","imdbVotes":"3,419","Awards":"Won 2 Oscars. Another 1 win & 3 nominations.","Metascore":"","Released":"6 August 1937 (USA) ","Location":"Porter Ranch, Northridge, Los Angeles, California, USA ","Actors":"Paul Muni, Luise Rainer, Walter Connolly ","Director":"Sidney Franklin, Victor Fleming (uncredited) | 2 more credits »","Writer":"Talbot Jennings (screen play), Tess Slesinger (screen play) | 2 more credits »","Running_time":"PT138M / 2h 18min","Description":"Directed by Sidney Franklin, Victor Fleming, Gustav Machatý.  With Paul Muni, Luise Rainer, Walter Connolly, Tilly Losch. The story of a farmer in China: a story of humility and bravery. His father gives Wang Lung a freed slave as wife. By diligence and frugality the two manage to enlarge their property. But then a famine forces them to leave their land and live in the town. However it turns out to be a blessing in disguise for them...","Rated":"PASSED"}