{"imdbID":"tt0067800","Title":"Straw Dogs","Year":"1971","Director":"Sam Peckinpah","Taglines":"Sometimes a man is forced to defend his honor. ","Certificate":"Unrated | See all certifications »","Country":"USA, UK","Language":"English","Also_Known_As":"Strawdogs ","Budget":"$3,251,794 (estimated)","Gross":"SEK 794,608 (Sweden)","Production_Co":"ABC Pictures, Talent Associates, Amerbroco ","Runtime":"113 min | 118 min (uncut)","Sound_Mix":"Mono","Color":"Color (Eastmancolor) (uncredited)| Black and White (opening credits)","Aspect_Ratio":"1.85 : 1","Trivia":"According to the Peckinpah biography, \"If They Move ... Kill 'Em!,\" about one-third of the viewers walked out of the movie's first preview, presumably put off by its violence. See more »","Goofs":"The men open the mantrap for display then ask where to put it. They are asked to hang it above the fireplace. The guns which were hanging there while they opened the trap have meantime disappeared. See more »","Cast":"Dustin Hoffman, Susan George, Peter Vaughan, T.P. McKenna, Del Henney, Jim Norton, Donald Webster, Ken Hutchison, Len Jones, Sally Thomsett, Robert Keegan, Peter Arne, Cherina Schaer, Colin Welland","Plot":"A young American and his English wife come to rural England and face increasingly vicious local harassment. Upon moving to Britain to get away from American violence, astrophysicist David Sumner and his wife Amy are bullied and taken advantage of by the locals hired to do construction. When David finally takes a stand it escalates quickly into a bloody battle as the locals assault his house. Written by Andrew Hyatt <dres@uiuc.edu>","Genre":"Crime, Drama, Thriller","Keywords":"violence, nubile woman, retarded man, rape, outsider","imdbRating":"7.5","imdbVotes":"44,289","Awards":"Nominated for 1 Oscar. Another 1 win.","Metascore":"","Released":"22 December 1971 (USA) ","Location":"The West of England, England, UK ","Actors":"Dustin Hoffman, Susan George, Peter Vaughan ","Writer":"David Zelag Goodman (screenplay), Sam Peckinpah (screenplay) | 1 more credit »","Running_time":"PT113M / 1h 53min","Description":"Directed by Sam Peckinpah.  With Dustin Hoffman, Susan George, Peter Vaughan, T.P. McKenna. A young American and his English wife come to rural England and face increasingly vicious local harassment.","Rated":"UNRATED"}