{"imdbID":"tt0056218","Title":"The Manchurian Candidate","Year":"1962","Director":"John Frankenheimer","Taglines":"Once unbelievable. Now unthinkable. The chilling classic returns [rerelease] ","Certificate":"Approved | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Botschafter der Angst ","Budget":"$2,200,000 (estimated)","Production_Co":"M.C. Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"126 min","Sound_Mix":"Mono (Westrex Recording System)| Dolby SR | Dolby Digital","Color":"Black and White","Aspect_Ratio":"1.85 : 1","Trivia":"The November 1988 issue of \"Films in Review\" ran a nine page retrospective on the film by Michael Scheinfeld. See more »","Goofs":"Long shots of the convention floor use stock footage from different conventions, with delegates' placards sometimes white, sometimes black. See more »","Cast":"Frank Sinatra, Laurence Harvey, Janet Leigh, Angela Lansbury, Henry Silva, James Gregory, Leslie Parrish, John McGiver, Khigh Dhiegh, James Edwards, Douglas Henderson, Albert Paulsen, Barry Kelley, Lloyd Corrigan, Madame Spivy","Plot":"A former Korean War POW is brainwashed by Communists into becoming a political assassin. But another former prisoner may know how to save him. Major Ben Marco is an intelligence officer in the U.S. Army. He served valiantly as a captain in the Korean war and his Sergeant, Raymond Shaw, even won the Medal of Honor. Marco has a major problem however: he has a recurring nightmare, one where two members of his squad are killed by Shaw. He's put on indefinite sick leave and visits Shaw in New York. Shaw for his part has established himself well, despite the misgivings of his domineering mother, Mrs. Eleanor Shaw Iselin. She is a red-baiter, accusing anyone who disagrees with her right-wing reactionary views of being a Communist. Raymond hates her, not only for how she's treated him but equally because of his step-father, the ineffectual U.S. Senator John Iselin, who is intent on seeking higher office. When Marco learns that others in his Korean War unit have nightmares similar to his own, he realizes that something happened to all of them in Korea and that Raymond Shaw is the focal point. Written by garykmcd","Genre":"Drama, Thriller","Keywords":"nightmare, korea, korean war, army, medal of honor","imdbRating":"8.0","imdbVotes":"60,154","Awards":"Nominated for 2 Oscars. Another 5 wins & 6 nominations.","Metascore":"94","Released":"24 October 1962 (USA) ","Location":"67 Riverside Drive, Manhattan, New York City, New York, USA ","Actors":"Frank Sinatra, Laurence Harvey, Janet Leigh ","Writer":"Richard Condon (based upon a novel by), George Axelrod (screenplay)","Running_time":"PT126M / 2h 6min","Description":"Directed by John Frankenheimer.  With Frank Sinatra, Laurence Harvey, Janet Leigh, Angela Lansbury. A former Korean War POW is brainwashed by Communists into becoming a political assassin. But another former prisoner may know how to save him.","Rated":"APPROVED"}