{"imdbID":"tt0038787","Title":"Notorious","Year":"1946","Director":"Alfred Hitchcock","Writer":"Ben Hecht","Taglines":"Notorious woman of affairs... Adventurous man of the world! ","Certificate":"Approved | See all certifications »","Country":"USA","Language":"English, French, Portuguese","Also_Known_As":"Alfred Hitchcock's Notorious ","Budget":"$2,000,000 (estimated)","Production_Co":"RKO Radio Pictures, Vanguard Films ","":"Show detailed company contact information on IMDbPro »","Runtime":"101 min","Sound_Mix":"Mono (RCA Sound System)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"The legendary on-again, off-again kiss between Cary Grant and Ingrid Bergman was designed to skirt the Hayes Code that restricted kisses to no more than three seconds each. See more »","Goofs":"In the scene when Alicia and Sebastian were having coffee (1:20), there is a hair at the bottom of the screen - the gate wasn't checked. See more »","Crazy_Credits":"Opening credits prologue: Miami, Florida, Three-Twenty P.M., April the Twenty-Fourth, Nineteen Hundred and Forty-Six.... See more »","Cast":"Cary Grant, Ingrid Bergman, Claude Rains, Louis Calhern, Leopoldine Konstantin, Reinhold Schünzel, Moroni Olsen, Ivan Triesault, Alexis Minotis, Wally Brown, Charles Mendl, Ricardo Costa, E.A. Krumschmidt, Fay Baker","Plot":"A woman is asked to spy on a group of Nazi friends in South America. How far will she have to go to ingratiate herself with them? Following the conviction of her German father for treason against the U.S., Alicia Huberman takes to drink and men. She is approached by a government agent (T.R. Devlin) who asks her to spy on a group of her father's Nazi friends operating out of Rio de Janeiro. A romance develops between Alicia and Devlin, but she starts to get too involved in her work. Written by Col Needham <col@imdb.com>","Genre":"Drama, Film-Noir, Romance","Keywords":"uranium, spy, wine, german, wine cellar","imdbRating":"8.1","imdbVotes":"71,505","Awards":"Nominated for 2 Oscars. Another 3 wins & 1 nomination.","Metascore":"","Released":"6 September 1946 (USA) ","Location":"California, USA ","Actors":"Cary Grant, Ingrid Bergman, Claude Rains ","Running_time":"PT101M / 1h 41min","Description":"Directed by Alfred Hitchcock.  With Cary Grant, Ingrid Bergman, Claude Rains, Louis Calhern. A woman is asked to spy on a group of Nazi friends in South America. How far will she have to go to ingratiate herself with them?","Rated":"APPROVED"}