{"imdbID":"tt0074147","Title":"Face to Face","Year":"1976","Director":"Ingmar Bergman","Writer":"Ingmar Bergman","Country":"Sweden, Italy","Language":"Swedish","Production_Co":"Cinematograph AB, Dino de Laurentiis Cinematografica, Sveriges Radio ","Runtime":"114 min | 176 min (4 parts) (TV)","Cast":"Liv Ullmann, Erland Josephson, Aino Taube, Gunnar Björnstrand, Kristina Adolphson, Marianne Aminoff, Gösta Ekman, Helene Friberg, Ulf Johansson, Sven Lindberg, Jan-Erik Lindqvist, Birger Malmsten, Sif Ruud, Göran Stangertz, Mona Andersson","Plot":"A sensitive exploration of the tragic irony of the psychiatrist suffering with mental illness. Dr. Jenny Isaksson is a psychiatrist married to another psychiatrist; both are successful in ... See full summary » A sensitive exploration of the tragic irony of the psychiatrist suffering with mental illness. Dr. Jenny Isaksson is a psychiatrist married to another psychiatrist; both are successful in their jobs but slowly, agonizingly, she succumbs to a breakdown. Jenny is haunted by images and emotions from her past and eventually cannot function, either as a wife, a doctor or as an individual. Written by Sujit R. Varma","Genre":"Drama, Fantasy","Keywords":"psychiatrist, suicide attempt, hallucination, dream, rape","imdbRating":"7.7","imdbVotes":"3,277","Awards":"Nominated for 2 Oscars. Another 7 wins & 3 nominations.","Metascore":"","Released":"5 April 1976 (USA) ","Location":"Filmhusateljéerna, Filmhuset, Svenska Filminstitutet, Gärdet, Stockholm, Stockholms län, Sweden","Actors":"Liv Ullmann, Erland Josephson, Aino Taube ","Running_time":"PT114M / 1h 54min","Description":"Directed by Ingmar Bergman.  With Liv Ullmann, Erland Josephson, Aino Taube, Gunnar Björnstrand. A sensitive exploration of the tragic irony of the psychiatrist suffering with mental illness. Dr. Jenny Isaksson is a psychiatrist married to another psychiatrist; both are successful in their jobs but slowly, agonizingly, she succumbs to a breakdown. Jenny is haunted by images and emotions from her past and eventually cannot function, either as a wife, a doctor or as an individual.","Rated":"R"}