{"imdbID":"tt0067185","Title":"Harold and Maude","Year":"1971","Director":"Hal Ashby","Writer":"Colin Higgins","Taglines":"His Hangups Are Hilarious ","Certificate":"PG | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Ensina-me a Viver ","Budget":"$1,200,000 (estimated)","Production_Co":"Mildred Lewis and Colin Higgins Productions, Paramount Pictures ","Runtime":"91 min","Sound_Mix":"Mono","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Included among the \"1001 Movies You Must See Before You Die\", edited by Steven Schneider. See more »","Goofs":"When Maude pulls the banjo out of a cabinet, you see the reflection of crew and lights. See more »","Cast":"Ruth Gordon, Bud Cort, Vivian Pickles, Cyril Cusack, Charles Tyner, Ellen Geer, Eric Christmas, G. Wood, Judy Engles, Shari Summers, Tom Skerritt, Susan Madigan, Ray K. Goman, Gordon De Vol, Harvey Brumfield","Plot":"Young, rich, and obsessed with death, Harold finds himself changed forever when he meets lively septuagenarian Maude at a funeral. Self-destructive and needy but wealthy teenager Harold is obsessed with death and spends his leisure time attending funerals, watching the demolition of buildings, visiting junkyards, simulating suicides trying to get the attention of his indifferent, snobbish and egocentric mother, and having sessions with his psychologist. When Harold meets the anarchic seventy-nine-year-old Maude at a funeral, they become friends and the old lady discloses other perspectives of the cycle of life for him. Meanwhile, his mother enlists him in a dating service and tries to force him to join the army. On the day of Maude's eightieth birthday, Harold proposes to her but he finds the truth about life at the end of hers. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Comedy, Drama, Romance","Keywords":"death, existentialism, eccentric, misfit, depression","imdbRating":"8.0","imdbVotes":"55,085","Awards":"Nominated for 2 Golden Globes. Another 2 wins & 1 nomination.","Metascore":"","Released":"20 December 1971 (USA) ","Location":"San Francisco Trains State Belt #4 Restoration Site, Bayshore Blvd, Brisbane, California, USA ","Actors":"Ruth Gordon, Bud Cort, Vivian Pickles ","Running_time":"PT91M / 1h 31min","Description":"Directed by Hal Ashby.  With Ruth Gordon, Bud Cort, Vivian Pickles, Cyril Cusack. Young, rich, and obsessed with death, Harold finds himself changed forever when he meets lively septuagenarian Maude at a funeral.","Rated":"PG"}