{"imdbID":"tt0061512","Title":"Cool Hand Luke","Year":"1967","Director":"Stuart Rosenberg","Taglines":"The man...and the motion picture that simply do not conform. ","Certificate":"PG | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"La leyenda del indomable ","Budget":"$3,000,000 (estimated)","Production_Co":"Jalem Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"126 min","Sound_Mix":"Mono","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"The first of 4 collaborations between director Stuart Rosenberg and Paul Newman. See more »","Goofs":"The Korean War took place from June 5, 1950 to July 27, 1953. The time period of the movie \"Cool Hand Luke\" therefore could not have been in the late 1940's, approximately c1949 as indicated in IMDb Anachronisms. See more »","Cast":"Paul Newman, George Kennedy, J.D. Cannon, Lou Antonio, Robert Drivas, Strother Martin, Jo Van Fleet, Clifton James, Morgan Woodward, Luke Askew, Marc Cavell, Richard Davalos, Robert Donner, Warren Finnerty, Dennis Hopper","Plot":"A man refuses to conform to life in a rural prison. Luke Jackson is a cool, gutsy prisoner in a Southern chain gang, who, while refusing to buckle under to authority, keeps escaping and being recaptured. The prisoners admire Luke because, as Dragline explains it, \"You're an original, that's what you are!\" Nevertheless, the camp staff actively works to crush Luke until he finally breaks. Written by alfiehitchie","Genre":"Crime, Drama","Keywords":"prison, death, loss of mother, prisoner, escape","imdbRating":"8.2","imdbVotes":"115,904","Awards":"Won 1 Oscar. Another 2 wins & 9 nominations.","Metascore":"","Released":"1 November 1967 (USA) ","Location":"Jacksonville, Florida, USA ","Actors":"Paul Newman, George Kennedy, Strother Martin ","Writer":"Donn Pearce (screenplay), Frank Pierson (screenplay) (as Frank R. Pierson) | 1 more credit »","Running_time":"PT126M / 2h 6min","Description":"Directed by Stuart Rosenberg.  With Paul Newman, George Kennedy, Strother Martin, J.D. Cannon. A man refuses to conform to life in a rural prison.","Rated":"PG"}