{"imdbID":"tt0054326","Title":"Sons and Lovers","Year":"1960","Director":"Jack Cardiff","Country":"UK","Language":"English","Budget":"$500,000 (estimated)","Production_Co":"Twentieth Century-Fox Productions, Company of Artists, The ","Runtime":"103 min","Cast":"Trevor Howard, Dean Stockwell, Wendy Hiller, Mary Ure, Heather Sears, William Lucas, Conrad Phillips, Ernest Thesiger, Donald Pleasence, Rosalie Crutchley, Sean Barrett, Elizabeth Begley, Edna Morris, Ruth Kettlewell, Anne Sheppard","Plot":"Jack Cardiff received a 1960 Oscar Nomination as Best Director for this lush, engaging film starring Trevor Howard, Dean Stockwell and Donald Pleasence, which was adapted from D.H. ... See full summary » Jack Cardiff received a 1960 Oscar Nomination as Best Director for this lush, engaging film starring Trevor Howard, Dean Stockwell and Donald Pleasence, which was adapted from D.H. Lawrence's classic novel. A young man with artistic talent who lives in a close-knit, English coal-mining town during the early 20th Century finds himself inhibited by his emotionally manipulative, domineering mother. Written by Anonymous","Genre":"Drama","Keywords":"drunkenness, heart attack, family relationships, coal miner, death of mother","imdbRating":"7.3","imdbVotes":"917","Awards":"Won 1 Oscar. Another 7 wins & 16 nominations.","Metascore":"","Released":"22 July 1960 (West Germany) ","Location":"Pinewood Studios, Iver Heath, Buckinghamshire, England, UK ","Actors":"Trevor Howard, Dean Stockwell, Wendy Hiller ","Writer":"Gavin Lambert (screenplay), T.E.B. Clarke (screenplay) | 1 more credit »","Running_time":"PT103M / 1h 43min","Description":"Directed by Jack Cardiff.  With Trevor Howard, Dean Stockwell, Wendy Hiller, Mary Ure. Jack Cardiff received a 1960 Oscar Nomination as Best Director for this lush, engaging film starring Trevor Howard, Dean Stockwell and Donald Pleasence, which was adapted from D.H. Lawrence's classic novel. A young man with artistic talent who lives in a close-knit, English coal-mining town during the early 20th Century finds himself inhibited by his emotionally manipulative, domineering mother.","Rated":"N/A"}