{"imdbID":"tt0033729","Title":"How Green Was My Valley","Year":"1941","Director":"John Ford","Country":"USA","Language":"English, Welsh","Budget":"$1,250,000 (estimated)","Production_Co":"Twentieth Century Fox Film Corporation ","Runtime":"118 min","Cast":"Walter Pidgeon, Maureen O'Hara, Anna Lee, Donald Crisp, Roddy McDowall, John Loder, Sara Allgood, Barry Fitzgerald, Patric Knowles, Welsh Singers, Morton Lowry, Arthur Shields, Ann E. Todd, Frederick Worlock, Richard Fraser","Plot":"At the turn of the century in a Welsh mining village, the Morgans, he stern, she gentle, raise coal-mining sons and hope their youngest will find a better life. Life is hard in a Welsh mining town and no less so for the Morgan family. Seen through the eyes of the family's youngest, Huw, we learn of the family's trials and tribulations. Family patriarch Gwilym and his older sons work in the mines, dangerous and unhealthy as it is. Gwilym has greater hopes for his youngest son, but Huw has his own ideas on how to honor his father. Daughter Angharad is the most beautiful girl in the valley and is very much in love with Mr. Gruffydd, who isn't sure he can provide her the life she deserves. Times are hard and good men find themselves out of work and exploited by unseen mine owners. Written by garykmcd","Genre":"Drama, Family","Keywords":"village, wales, girl, coal mine, school","imdbRating":"7.8","imdbVotes":"15,383","Awards":"Won 5 Oscars. Another 5 wins & 6 nominations.","Metascore":"","Released":"9 April 1942 (Australia) ","Location":"20th Century Fox Ranch, Malibu Creek State Park - 1925 Las Virgenes Road, Calabasas, California, USA ","Actors":"Walter Pidgeon, Maureen O'Hara, Anna Lee ","Writer":"Philip Dunne (screen play), Richard Llewellyn (based on the novel by)","Running_time":"PT118M / 1h 58min","Description":"Directed by John Ford.  With Walter Pidgeon, Maureen O'Hara, Anna Lee, Donald Crisp. At the turn of the century in a Welsh mining village, the Morgans, he stern, she gentle, raise coal-mining sons and hope their youngest will find a better life.","Rated":"APPROVED"}