{"imdbID":"tt0040897","Title":"The Treasure of the Sierra Madre","Year":"1948","Director":"John Huston","Taglines":"The more he yearns for a woman's arms . . . the fiercer he lusts for the treasure that cursed them all! ","Certificate":"See all certifications »","Country":"USA","Language":"English, Spanish","Also_Known_As":"Der Schatz der Sierra Madre ","Budget":"$3,000,000 (estimated)","Production_Co":"Warner Bros. ","":"Show detailed company contact information on IMDbPro »","Runtime":"126 min","Sound_Mix":"Mono (RCA Sound System)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Paul Thomas Anderson's favourite film. See more »","Goofs":"During the gunfight with the bandidos at the gold mine, Dobbs runs out of bullets while firing his rifle. He is shown reloading it just as the shooting stops. With absolutely no sound coming from the film, Dobbs fires the rifle(trigger pulled and hammer falls) but no noise or muzzle blast is shown. Some may call it a misfire, but there is no sound as the hammer falls and Dobbs would have reacted to a misfire. Just another case of bad editing. See more »","Cast":"Humphrey Bogart, Walter Huston, Tim Holt, Bruce Bennett, Barton MacLane, Alfonso Bedoya, Arturo Soto Rangel, Manuel Dondé, José Torvay, Margarito Luna","Plot":"Fred Dobbs and Bob Curtin, two Americans searching for work in Mexico, convince an old prospector to help them mine for gold in the Sierra Madre Mountains. Fred C. Dobbs and Bob Curtin, both down on their luck in Tampico, Mexico in 1925, meet up with a grizzled prospector named Howard and decide to join with him in search of gold in the wilds of central Mexico. Through enormous difficulties, they eventually succeed in finding gold, but bandits, the elements, and most especially greed threaten to turn their success into disaster. Written by Jim Beaver <jumblejim@prodigy.net>","Genre":"Action, Adventure, Drama","Keywords":"mexico, gold, prospector, friend, american","imdbRating":"8.3","imdbVotes":"76,220","Awards":"Won 3 Oscars. Another 12 wins & 5 nominations.","Metascore":"","Released":"24 January 1948 (USA) ","Location":"Tucson, Arizona, USA ","Actors":"Humphrey Bogart, Walter Huston, Tim Holt ","Writer":"John Huston (screenplay), B. Traven (based on the novel by)","Running_time":"PT126M / 2h 6min","Description":"Directed by John Huston.  With Humphrey Bogart, Walter Huston, Tim Holt, Bruce Bennett. Fred Dobbs and Bob Curtin, two Americans searching for work in Mexico, convince an old prospector to help them mine for gold in the Sierra Madre Mountains.","Rated":"N/A"}