{"imdbID":"tt0046094","Title":"The Moon Is Blue","Year":"1953","Director":"Otto Preminger","Country":"USA","Language":"English","Production_Co":"Otto Preminger Films ","Runtime":"99 min","Cast":"William Holden, David Niven, Maggie McNamara, Tom Tully, Dawn Addams, Fortunio Bonanova, Gregory Ratoff","Plot":"Two aging playboys are both after the same attractive young woman, but she fends them off by claiming that she plans to remain a virgin until her wedding night. Both men determine to find a way around her objections. Successful architect Don Gresham (William Holden) engages a young actress, Patty O'Neill (Maggie McNamara), in conversation on top of the Empire State Building, and she accepts his invitation to dinner. Dropping in at his apartment on the way, they decide to dine there as Patty announces herself an excellent cook. Don slips out to buy food, and Patty is briefly visited by his ex-fiancée, Cynthia Slater (Dawn Addams), and not too briefly, by Cynthia's father David (David Niven), a middle-aged, practiced charmer who, on her invitation, stays to dinner. A slight accident at the table occasions Patty to change her dress for Don's bathrobe. While Don is away placating the jealous Cynthia, David loses no time in offering Patty a proposal of marriage and a six hundred dollar gift. She accepts the latter and is surprised by Don in a grateful kiss to David. Don is still enraged with Patty when her father arrives, and, outraged to discover his daughter in a bachelor's apartment, knocks him ... Written by alfiehitchie","Genre":"Comedy, Romance","Keywords":"apartment, dinner, actress, architect, virgin","imdbRating":"6.7","imdbVotes":"1,471","Awards":"Nominated for 3 Oscars. Another 1 win & 3 nominations.","Metascore":"","Released":"8 July 1953 (USA) ","Location":"Motion Picture Center Studios, Hollywood, Los Angeles, California, USA","Actors":"William Holden, David Niven, Maggie McNamara ","Writer":"F. Hugh Herbert (written for the screen by), F. Hugh Herbert (stage play \"The Moon Is Blue\")","Running_time":"PT99M / 1h 39min","Description":"Directed by Otto Preminger.  With William Holden, David Niven, Maggie McNamara, Tom Tully. Two aging playboys are both after the same attractive young woman, but she fends them off by claiming that she plans to remain a virgin until her wedding night. Both men determine to find a way around her objections.","Rated":"M"}