{"imdbID":"tt0068611","Title":"Frenzy","Year":"1972","Director":"Alfred Hitchcock","Taglines":"Just an ordinary necktie used with a deadly new twist. [Australia Theatrical] ","Certificate":"R | See all certifications »","Country":"UK","Language":"English","Also_Known_As":"Frenesí ","Budget":"$2,000,000 (estimated)","Gross":"SEK 2,348,248 (Sweden)","Production_Co":"Universal Pictures, Universal Pictures ","Runtime":"116 min","Sound_Mix":"Mono (Westrex Recording System)","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"David Hemmings was originally considered for the role of Blaney. See more »","Goofs":"After the camera goes back down the staircase and out of the front door into the market, a man walks past carrying a big sack of potatoes on his shoulder, covering the transition from the studio shot to the exterior shot. Before he passes (the studio shot), the door frame on the right is clean, but afterwards (the exterior), a greasy black stain can be seen on the right of the door frame above the doorbell. The design of the left-hand side of the door frame differs between the two shots and the brass \"Duckworth & Co\" sign on the frame catches the light in the interior shot but is dull and tarnished in the outside shot. There is sudden jump in the positions of the potatoes in the bag between the two shots. Also in the exterior shot, a lampshade and the shadow of the archway over the interior door can be seen reflected in the window over the stairs when no such reflection was seen in the studio shot. See more »","Crazy_Credits":"The Universal Pictures logo does not appear on this film. See more »","Cast":"Jon Finch, Alec McCowen, Barry Foster, Billie Whitelaw, Anna Massey, Barbara Leigh-Hunt, Bernard Cribbins, Vivien Merchant, Michael Bates, Jean Marsh, Clive Swift, Madge Ryan, Elsie Randolph, Gerald Sim, John Boxer","Plot":"A serial murderer is strangling women with a necktie. The London police have a suspect, but he is the wrong man. London is terrorised by a vicious sex killer known as the neck tie murderer. Following the brutal slaying of his ex-wife, down-on-his-luck Richard Blaney is suspected by the police of being the killer. He goes on the run, determined to prove his innocence. Written by Col Needham <col@imdb.com>","Genre":"Thriller","Keywords":"rape, serial killer, police, penknife, united kingdom","imdbRating":"7.5","imdbVotes":"30,042","Awards":"Nominated for 4 Golden Globes. Another 2 wins & 3 nominations.","Metascore":"","Released":"21 June 1972 (USA) ","Location":"Coburg Hotel, 129 Bayswater Road, London, England. UK ","Actors":"Jon Finch, Barry Foster, Alec McCowen ","Writer":"Arthur La Bern (novel), Anthony Shaffer (screenplay)","Running_time":"PT116M / 1h 56min","Description":"Directed by Alfred Hitchcock.  With Jon Finch, Barry Foster, Alec McCowen, Billie Whitelaw. A serial murderer is strangling women with a necktie. The London police have a suspect, but he is the wrong man.","Rated":"R"}