{"imdbID":"tt0081974","Title":"Absence of Malice","Year":"1981","Director":"Sydney Pollack","Writer":"Kurt Luedtke","Country":"USA","Language":"English, Spanish","Budget":"$12,000,000 (estimated)","Gross":"$40,700,000 (USA)","Production_Co":"Columbia Pictures Corporation, Mirage Enterprises ","Runtime":"116 min","Cast":"Paul Newman, Sally Field, Bob Balaban, Melinda Dillon, Luther Adler, Barry Primus, Josef Sommer, John Harkins, Don Hood, Wilford Brimley, Arnie Ross, Phanie Napoli, Shelley Spurlock, Shawn McAllister, Joe Petrullo","Plot":"When a prosecutor leaks a false story that a liquor warehouse owner is involved in the murder of an union head, the man's life begins to unravel. Mike Gallagher is a Miami liquor wholesaler whose deceased father was a local mobster. The FBI organized crime task force has no evidence that he's involved with the mob but decide to pressure him perhaps revealing something - anything - about a murder they're sure was a mob hit. The let Megan Carter, a naive but well-meaning journalist, know he is being investigated and Gallagher's name is soon all over the newspaper. Gallagher has an iron-clad alibi for when the murder occurred but won't reveal it to protect his fragile friend Teresa. When Carter publishes her story, tragedy ensues. Needing to make amends, Carter tells Gallagher the source of the first story about him and he sets out to teach the FBI and the Federal Attorney a lesson. Written by garykmcd","Genre":"Drama, Romance, Thriller","Keywords":"murder, newspaper, mafia, reporter, slander","imdbRating":"6.9","imdbVotes":"9,087","Awards":"Nominated for 3 Oscars. Another 3 wins & 5 nominations.","Metascore":"","Released":"18 December 1981 (USA) ","Location":"Coral Gables, Florida, USA ","Actors":"Paul Newman, Sally Field, Bob Balaban ","Running_time":"PT116M / 1h 56min","Description":"Directed by Sydney Pollack.  With Paul Newman, Sally Field, Bob Balaban, Melinda Dillon. When a prosecutor leaks a false story that a liquor warehouse owner is involved in the murder of an union head, the man's life begins to unravel.","Rated":"PG"}