{"imdbID":"tt0046268","Title":"The Wages of Fear","Year":"1953","Director":"Henri-Georges Clouzot","Taglines":"The complete restored version of the 1953 French classic [reissue] ","Certificate":"Not Rated | See all certifications »","Country":"France, Italy","Language":"French, English, Spanish, German, Italian, Russian","Also_Known_As":"The Wages of Fear ","Production_Co":"Compagnie Industrielle et Commerciale Cinématographique (CICC), Filmsonor, Vera Films ","Runtime":"131 min | 148 min (director's cut)","Sound_Mix":"Mono (Western Electric)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Yves Montand and Charles Vanel both contracted conjunctivitis after filming in a pool of crude oil and being exposed to gas fumes. See more »","Goofs":"In the bar M. Jo puts down a bottle of champagne on the table. It's almost completely full. Luigi then picks it up, while it's still full. However, when he stands up and threatens M. Jo with it, it's empty. See more »","Cast":"Yves Montand, Charles Vanel, Folco Lulli, Peter van Eyck, Véra Clouzot, William Tubbs, Darío Moreno, Jo Dest, Antonio Centa, Luis De Lima, Grégoire Gromoff, Joseph Palau-Fabre, Faustini, Seguna, Darling Légitimus","Plot":"In a decrepit South American village, men are hired to transport an urgent nitroglycerine shipment without the equipment that would make it safe. In the South American jungle supplies of nitroglycerin are needed at a remote oil field. The oil company pays four men to deliver the supplies in two trucks. A tense rivalry develops between the two sets of drivers and on the rough remote roads the slightest jolt can result in death. Written by Col Needham <col@imdb.com>","Genre":"Adventure, Drama, Thriller","Keywords":"oil, driver, truck, nitroglycerine, danger","imdbRating":"8.2","imdbVotes":"33,908","Awards":"Won 1 BAFTA Film Award. Another 5 wins.","Metascore":"","Released":"16 February 1955 (USA) ","Location":"Poulx, Gard, France ","Actors":"Yves Montand, Charles Vanel, Peter van Eyck ","Writer":"Georges Arnaud (novel), Henri-Georges Clouzot (adaptation) (as H.G. Clouzot) | 1 more credit »","Running_time":"PT131M / 2h 11min","Description":"Directed by Henri-Georges Clouzot.  With Yves Montand, Charles Vanel, Peter van Eyck, Folco Lulli. In a decrepit South American village, men are hired to transport an urgent nitroglycerine shipment without the equipment that would make it safe.","Rated":"NOT RATED"}