{"imdbID":"tt0053318","Title":"Suddenly, Last Summer","Year":"1959","Director":"Joseph L. Mankiewicz","Country":"USA","Language":"English","Budget":"$3,000,000 (estimated)","Production_Co":"Columbia Pictures Corporation, Horizon Pictures (II), Academy Pictures Corporation ","Runtime":"114 min","Cast":"Elizabeth Taylor, Katharine Hepburn, Montgomery Clift, Albert Dekker, Mercedes McCambridge, Gary Raymond, Mavis Villiers, Patricia Marmont, Joan Young, Maria Britneva, Sheila Robbins, David Cameron","Plot":"The only son of wealthy widow Violet Venable dies while on vacation with his cousin Catherine. What the girl saw was so horrible that she went insane; now Mrs. Venable wants Catherine lobotomized to cover up the truth. A wealthy harridan, Violet Venable, attempts to bribe Dr. Cukrowicz, a young psycho-surgeon from a New Orleans mental hospital that is desperately in need of funds, into lobotomizing her niece, Catherine Holly. Violet wants the operation performed in order to prevent Catherine from defiling the memory of her son, the poet Sebastian. Catherine has been babbling obscenely about Sebastian's mysterious death that she witnessed while on holiday together in Spain the previous summer. Written by alfiehitchie","Genre":"Drama, Mystery, Thriller","Keywords":"mental institution, lobotomy, garden, cannibalism, attempted suicide","imdbRating":"7.7","imdbVotes":"9,876","Awards":"Nominated for 3 Oscars. Another 4 wins & 4 nominations.","Metascore":"","Released":"22 December 1959 (USA) ","Location":"Bagur, Girona, Catalonia, Spain ","Actors":"Elizabeth Taylor, Katharine Hepburn, Montgomery Clift ","Writer":"Tennessee Williams (play), Gore Vidal (screenplay) | 1 more credit »","Running_time":"PT114M / 1h 54min","Description":"Directed by Joseph L. Mankiewicz.  With Elizabeth Taylor, Katharine Hepburn, Montgomery Clift, Albert Dekker. The only son of wealthy widow Violet Venable dies while on vacation with his cousin Catherine. What the girl saw was so horrible that she went insane; now Mrs. Venable wants Catherine lobotomized to cover up the truth.","Rated":"UNRATED"}