{"imdbID":"tt0061180","Title":"The Whisperers","Year":"1967","Director":"Bryan Forbes","Country":"UK","Language":"English","Production_Co":"Seven Pines ","Runtime":"105 min","Cast":"Edith Evans, Nanette Newman, Harry Baird, Jack Austin, Gerald Sim, Lionel Gamlin, Glen Farmer, Oliver MacGreevy, Ronald Fraser, Kenneth Griffith, Avis Bunnage, John Orchard, Peter Thompson, Sarah Forbes, Penny Spencer","Plot":"The title refers to the creatures a very poor addled old lady (Dame Edith Evans) imagines in her paranoid fantasies. They lurk behind every drip, drip, drip of a leaky faucet. They listen ... See full summary » The title refers to the creatures a very poor addled old lady (Dame Edith Evans) imagines in her paranoid fantasies. They lurk behind every drip, drip, drip of a leaky faucet. They listen all coiled up in a silent radio. The old lady is on to all their tricks, and she tells them so repeatedly. She reports them regularly to the police who scoff at her behind her back. The whisperers, however, are only part of her fantasy life. She imagines also that she is a daughter of aristocracy, an heiress waiting for her money to arrive so that she can pay back the nice gentleman at the Welfare Board. Her routine is shattered irrevocably by the return of her thieving son and vagrant husband, a brief fling with stolen money ending dismally in the gutter where the poor prey on the poor. Written by alfiehitchie","Genre":"Drama, Thriller","Keywords":"radio, old lady, post war reconstruction, post world war two, bechdel test passed","imdbRating":"7.3","imdbVotes":"668","Awards":"Nominated for 1 Oscar. Another 9 wins & 3 nominations.","Metascore":"","Released":"18 July 1967 (West Germany) ","Location":"Manchester, Greater Manchester, England, UK ","Actors":"Edith Evans, Nanette Newman, Harry Baird ","Writer":"Robert Nicolson (novel), Bryan Forbes (written for the screen by)","Running_time":"PT105M / 1h 45min","Description":"Directed by Bryan Forbes.  With Edith Evans, Nanette Newman, Harry Baird, Jack Austin. The title refers to the creatures a very poor addled old lady (Dame Edith Evans) imagines in her paranoid fantasies. They lurk behind every drip, drip, drip of a leaky faucet. They listen all coiled up in a silent radio. The old lady is on to all their tricks, and she tells them so repeatedly. She reports them regularly to the police who scoff at her behind her back. The whisperers, however, are ...","Rated":"N/A"}