{"imdbID":"tt0030287","Title":"Jezebel","Year":"1938","Director":"William Wyler","Country":"USA","Language":"English, French","Budget":"$1,250,000 (estimated)","Production_Co":"Warner Bros. ","Runtime":"104 min (TCM print)","Cast":"Bette Davis, Henry Fonda, George Brent, Margaret Lindsay, Donald Crisp, Fay Bainter, Richard Cromwell, Henry O'Neill, Spring Byington, John Litel, Gordon Oliver, Janet Shaw, Theresa Harris, Margaret Early, Irving Pichel","Plot":"A haughty headstrong Southern Belle in Antebellum Louisiana loses her fiance due to her stubborn vanity and pride and vows to get him back. Set in antebellum New Orleans during the early 1850's, this film follows Julie Marsden through her quest for social redemption on her own terms. Julie is a beautiful and free spirited, rapacious Southern belle who is sure of herself and controlling of her fiancé Preston Dillard, a successful young banker. Julie's sensitive but domineering personality--she does not want so much to hurt as to assert her independence--forces a wedge between Preston and herself. To win him back, she plays North against South amid a deadly epidemic of yellow fever which claims a surprising victim. Written by Adam Brodsky <adam_brodsky@hotmail.com>","Genre":"Drama, Romance","Keywords":"southern belle, yellow fever, vanity, pride, louisiana","imdbRating":"7.6","imdbVotes":"8,597","Awards":"Won 2 Oscars. Another 3 wins & 4 nominations.","Metascore":"","Released":"26 March 1938 (USA) ","Location":"Iverson Ranch - 1 Iverson Lane, Chatsworth, Los Angeles, California, USA ","Actors":"Bette Davis, Henry Fonda, George Brent ","Writer":"Clements Ripley (screen play), Abem Finkel (screen play) | 2 more credits »","Running_time":"PT104M / 1h 44min","Description":"Directed by William Wyler.  With Bette Davis, Henry Fonda, George Brent, Margaret Lindsay. A haughty headstrong Southern Belle in Antebellum Louisiana loses her fiance due to her stubborn vanity and pride and vows to get him back.","Rated":"APPROVED"}