{"imdbID":"tt0019959","Title":"Hallelujah","Year":"1929","Director":"King Vidor","Country":"USA","Language":"English","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"109 min | 100 min (Turner library print) (re-release) (re-edited)","Cast":"Daniel L. Haynes, Nina Mae McKinney, William Fountaine, Harry Gray, Fanny Belle DeKnight, Everett McGarrity, Victoria Spivey, Milton Dickerson, Robert Couch, Walter Tait, Dixie Jubilee Singers","Plot":"In a juke joint, sharecropper Zeke falls for a beautiful dancer, Chick, but she's only setting him up for a rigged craps game. He loses $100, the money he got for the sale of his family's ... See full summary » In a juke joint, sharecropper Zeke falls for a beautiful dancer, Chick, but she's only setting him up for a rigged craps game. He loses $100, the money he got for the sale of his family's entire cotton crop. His brother Spunk is mortally wounded in the shoot-out which follows. Zeke goes away but returns as Brother Zekiel the preacher. His forceful preaching draws the faithful in large numbers. Even Chick wants to be saved. Zekiel has asked the pretty Missy Rose to marry him, but Chick can still cast a spell over the preacher... Written by David Steele","Genre":"Drama, Musical","Keywords":"brother, preacher, cotton, mule, melodrama","imdbRating":"7.0","imdbVotes":"1,089","Awards":"Nominated for 1 Oscar. Another 2 wins.","Metascore":"","Released":"20 August 1929 (USA) ","Location":"Arkansas, USA ","Actors":"Daniel L. Haynes, Nina Mae McKinney, William Fountaine ","Writer":"Wanda Tuchock (scenario), Richard Schayer (treatment) | 2 more credits »","Running_time":"PT109M / 1h 49min","Description":"Directed by King Vidor.  With Daniel L. Haynes, Nina Mae McKinney, William Fountaine, Harry Gray. In a juke joint, sharecropper Zeke falls for a beautiful dancer, Chick, but she's only setting him up for a rigged craps game. He loses $100, the money he got for the sale of his family's entire cotton crop. His brother Spunk is mortally wounded in the shoot-out which follows. Zeke goes away but returns as Brother Zekiel the preacher. His forceful preaching draws the faithful in large numbers. ...","Rated":"PASSED"}