{"imdbID":"tt0093058","Title":"Full Metal Jacket","Year":"1987","Director":"Stanley Kubrick","Taglines":"One rifle, one gun. One for killing, one for fun. ","Certificate":"See all certifications »","Country":"UK, USA","Language":"English, Vietnamese","Also_Known_As":"Nacido para matar ","Budget":"$30,000,000 (estimated)","Gross":"$46,357,676 (USA)","Production_Co":"Natant, Stanley Kubrick Productions, Warner Bros. ","":"Show detailed company contact information on IMDbPro »","Runtime":"116 min","Sound_Mix":"Mono","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Shooting is a critical skill for Marines to develop, therefore the discipline is usually relaxed somewhat during rifle training. This is apparent in Hartman's demeanor when he tolerates jokes and treats the recruits less harshly during this time. See more »","Goofs":"Rafterman carries spare 35mm film canisters on his helmet. The canisters he is carrying are made of plastic. In the 1960s film canisters were made of aluminum. See more »","Cast":"Matthew Modine, Adam Baldwin, Vincent D'Onofrio, R. Lee Ermey, Dorian Harewood, Kevyn Major Howard, Arliss Howard, Ed O'Ross, John Terry, Kieron Jecchinis, Kirk Taylor, Tim Colceri, Jon Stafford, Bruce Boa, Ian Tyler","Plot":"A pragmatic U.S. Marine observes the dehumanizing effects the Vietnam War has on his fellow recruits from their brutal boot camp training to the bloody street fighting in Hue. A two-segment look at the effect of the military mindset and war itself on Vietnam era Marines. The first half follows a group of recruits in boot camp under the command of the punishing Gunnery Sergeant Hartman. The second half shows one of those recruits, Joker, covering the war as a correspondent for Stars and Stripes, focusing on the Tet offensive. Written by Scott Renshaw <as.idc@forsythe.stanford.edu>","Genre":"Drama, War","Keywords":"military, vietnam war, drill instructor, u.s. marine, violence","imdbRating":"8.3","imdbVotes":"464,297","Awards":"Nominated for 1 Oscar. Another 7 wins & 9 nominations.","Metascore":"78","Released":"10 July 1987 (USA) ","Location":"Norfolk Broads, Norfolk, England, UK ","Actors":"Matthew Modine, R. Lee Ermey, Vincent D'Onofrio ","Writer":"Gustav Hasford (novel), Stanley Kubrick (screenplay) | 2 more credits »","Running_time":"PT116M / 1h 56min","Description":"Directed by Stanley Kubrick.  With Matthew Modine, R. Lee Ermey, Vincent D'Onofrio, Adam Baldwin. A pragmatic U.S. Marine observes the dehumanizing effects the Vietnam War has on his fellow recruits from their brutal boot camp training to the bloody street fighting in Hue.","Rated":"N/A"}