{"imdbID":"tt0081414","Title":"Resurrection","Year":"1980","Director":"Daniel Petrie","Writer":"Lewis John Carlino","Country":"USA","Language":"English","Production_Co":"Universal Pictures ","Runtime":"103 min","Cast":"Ellen Burstyn, Sam Shepard, Richard Farnsworth, Roberts Blossom, Clifford David, Pamela Payton-Wright, Jeffrey DeMunn, Eva Le Gallienne, Lois Smith, Madeleine Sherwood, Richard Hamilton, Carlin Glynn, Lane Smith, Penelope Allen, Ebbe Roe Smith","Plot":"Edna Mae Macaulay experiences the afterlife for a brief time after a car accident that kills her husband. As she begins her long process of physical healing, she discovers that she has the ... See full summary » Edna Mae Macaulay experiences the afterlife for a brief time after a car accident that kills her husband. As she begins her long process of physical healing, she discovers that she has the ability to heal physical infirmities. While most people simply accept her gift, her lover (Sam Shepard) becomes mentally unbalanced and dangerous because she does not place the healings within a religious context. Written by Michael Cieslak <mcieslak@ix.netcom.com>","Genre":"Drama, Fantasy","Keywords":"spiritual healing, nosebleed, paraplegic, kansas, gift","imdbRating":"7.4","imdbVotes":"2,098","Awards":"Nominated for 2 Oscars. Another 3 wins & 6 nominations.","Metascore":"","Released":"26 September 1980 (USA) ","Location":"Fabens, Texas, USA ","Actors":"Ellen Burstyn, Sam Shepard, Richard Farnsworth ","Running_time":"PT103M / 1h 43min","Description":"Directed by Daniel Petrie.  With Ellen Burstyn, Sam Shepard, Richard Farnsworth, Roberts Blossom. Edna Mae Macaulay experiences the afterlife for a brief time after a car accident that kills her husband. As she begins her long process of physical healing, she discovers that she has the ability to heal physical infirmities. While most people simply accept her gift, her lover (Sam Shepard) becomes mentally unbalanced and dangerous because she does not place the healings within a religious ...","Rated":"PG"}