{"imdbID":"tt0028691","Title":"Captains Courageous","Year":"1937","Director":"Victor Fleming","Country":"USA","Language":"English, Portuguese","Budget":"$1,645,000 (estimated)","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"117 min","Cast":"Freddie Bartholomew, Spencer Tracy, Lionel Barrymore, Melvyn Douglas, Charley Grapewin, Mickey Rooney, John Carradine, Oscar O'Shea, Jack La Rue, Walter Kingsford, Donald Briggs, Sam McDaniel, Bill Burrud","Plot":"Harvey Cheyne is a spoiled brat used to having his own way. When a prank goes wrong onboard an ocean liner Harvey ends up overboard and nearly drowns. Fortunately he's picked up by a ... See full summary » Harvey Cheyne is a spoiled brat used to having his own way. When a prank goes wrong onboard an ocean liner Harvey ends up overboard and nearly drowns. Fortunately he's picked up by a fishing boat just heading out for the season. He tries to bribe the crew into returning early to collect a reward but none of them believe him. Stranded on the boat he must adapt to the ways of the fishermen and learn more about the real world. Written by Col Needham <col@imdb.com>","Genre":"Adventure, Drama, Family","Keywords":"fishing boat, fishing, fisherman, spoiled brat, overboard","imdbRating":"8.0","imdbVotes":"6,478","Awards":"Won 1 Oscar. Another 2 wins & 6 nominations.","Metascore":"","Released":"25 June 1937 (USA) ","Location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA ","Actors":"Spencer Tracy, Freddie Bartholomew, Lionel Barrymore ","Writer":"Rudyard Kipling (novel), John Lee Mahin (screen play) | 2 more credits »","Running_time":"PT117M / 1h 57min","Description":"Directed by Victor Fleming.  With Spencer Tracy, Freddie Bartholomew, Lionel Barrymore, Melvyn Douglas. Harvey Cheyne is a spoiled brat used to having his own way. When a prank goes wrong onboard an ocean liner Harvey ends up overboard and nearly drowns. Fortunately he's picked up by a fishing boat just heading out for the season. He tries to bribe the crew into returning early to collect a reward but none of them believe him. Stranded on the boat he must adapt to the ways of the fishermen and ...","Rated":"PASSED"}