{"imdbID":"tt0095953","Title":"Rain Man","Year":"1988","Director":"Barry Levinson","Taglines":"A journey through understanding and fellowship.","Certificate":"R | See all certifications »","Country":"USA","Language":"English, Italian","Also_Known_As":"Человек дождя ","Budget":"$25,000,000 (estimated)","Gross":"$172,825,435 (USA)","Production_Co":"United Artists, Guber-Peters Company, The, Star Partners II Ltd. ","":"Show detailed company contact information on IMDbPro »","Runtime":"133 min","Sound_Mix":"Dolby SR | Dolby Stereo","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"In the movie when Charlie removes Raymond from Walbrook, we see them walking down a long oak tree lined driveway. In 2007 many of these oak trees had become diseased, forcing their removal (replacements were to be planted). Before the trees were cut down, several people came to the grounds of the convent and recreated the scene where Raymond and Charlie walk down the drive See more »","Goofs":"In the blackjack scene when the dealer pays a $4000 winning bet, he is one chip off, thus stealing $100 from Charlie. See more »","Crazy_Credits":"Throughout the movie, Raymond is taking pictures. The pictures that he takes are shown as the background for the credits. See more »","Cast":"Dustin Hoffman, Tom Cruise, Valeria Golino, Gerald R. Molen, Jack Murdock, Michael D. Roberts, Ralph Seymour, Lucinda Jenney, Bonnie Hunt, Kim Robillard, Beth Grant, Dolan Dougherty, Marshall Dougherty, Patrick Dougherty, John-Michael Dougherty","Plot":"Selfish yuppie Charlie Babbitt's father left a fortune to his savant brother Raymond and a pittance to Charlie; they travel cross-country. Charles Sanford \"Charlie\" Babbit is a self-centered Los Angeles-based automobile dealer/hustler/bookie who is at war with his own life. Charlie, as a young teenager, used his father's 1948 Buick convertible without permission and as a result, he went to jail for two days on account that his father reported it stolen. It is then that Charlie learns that his estranged father died and left him from his last will and testament a huge bed of roses and the car while the remainder will of $3 Million goes into a trust fund to be distributed to someone. Charlie seemed pretty angry by this and decides to look into this matter. It seems as if that \"someone\" is Raymond, Charlie's unknown brother, an autistic savant who lives in a world of his own, resides at the Walbrook Institute. Charlie then kidnaps Raymond and decides to take him on a lust for life trip to the west coast as a threat to get the $3 Million inheritance. Raymond's acts and nagging, including repeated talks of \"Abbott & Costello\",... Written by Christopher Howell (Ckhowell75360@aol.com)","Genre":"Drama","Keywords":"savant, convertible, last will and testament, travel, buick","imdbRating":"8.0","imdbVotes":"375,015","Awards":"Won 4 Oscars. Another 21 wins & 21 nominations.","Metascore":"65","Released":"16 December 1988 (USA) ","Location":"The Dixie Terminal, Fourth and Walnut Streets, Cincinnati, Ohio, USA ","Actors":"Dustin Hoffman, Tom Cruise, Valeria Golino ","Writer":"Barry Morrow (story), Ronald Bass (screenplay) | 1 more credit »","Running_time":"PT133M / 2h 13min","Description":"Directed by Barry Levinson.  With Dustin Hoffman, Tom Cruise, Valeria Golino, Gerald R. Molen. Selfish yuppie Charlie Babbitt's father left a fortune to his savant brother Raymond and a pittance to Charlie; they travel cross-country.","Rated":"R"}