{"imdbID":"tt0088247","Title":"The Terminator","Year":"1984","Director":"James Cameron","Taglines":"Your future is in his hands. ","Certificate":"R | See all certifications »","Country":"UK, USA","Language":"English, Spanish","Also_Known_As":"Terminator ","Budget":"$6,400,000 (estimated)","Gross":"$38,400,000 (USA)","Production_Co":"Hemdale Film, Pacific Western, Euro Film Funding ","":"Show detailed company contact information on IMDbPro »","Runtime":"107 min","Sound_Mix":"Mono (original release)| Dolby (DVD Re-Release)| DTS (DTS HD Master Audio)","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The classic \"clank\" was made by Brad Fiedel by hitting a microphone with a cast iron skillet. See more »","Goofs":"The black pickup truck that Sarah rolls onto its roof appears soon after undamaged. See more »","Crazy_Credits":"The opening credits run while large outlines of the two halves of THE TERMINATOR cross each other. After the last directorial credit is shown, the title THE TERMINATOR zooms backward, is filled by metallic blue, and reveals itself. See more »","Cast":"Arnold Schwarzenegger, Michael Biehn, Linda Hamilton, Paul Winfield, Lance Henriksen, Rick Rossovich, Bess Motta, Earl Boen, Dick Miller, Shawn Schepps, Bruce M. Kerner, Franco Columbu, Bill Paxton, Brad Rearden, Brian Thompson","Plot":"A human-looking indestructible cyborg is sent from 2029 to 1984 to assassinate a waitress, whose unborn son will lead humanity in a war against the machines, while a soldier from that war is sent to protect her at all costs. A cyborg is sent from the future on a deadly mission. He has to kill Sarah Connor, a young woman whose life will have a great significance in years to come. Sarah has only one protector - Kyle Reese - also sent from the future. The Terminator uses his exceptional intelligence and strength to find Sarah, but is there any way to stop the seemingly indestructible cyborg ? Written by Colin Tinto <cst@imdb.com>","Genre":"Action, Sci-Fi","Keywords":"cyborg, future war, robot, shootout in a police station, urban setting","imdbRating":"8.1","imdbVotes":"575,681","Awards":"5 wins & 6 nominations.","Metascore":"83","Released":"26 October 1984 (USA) ","Location":"Tunnel at Lower Grand & West Gen Thad Kosciuszko Way, Los Angeles, California, USA ","Actors":"Arnold Schwarzenegger, Linda Hamilton, Michael Biehn ","Writer":"James Cameron, Gale Anne Hurd | 1 more credit »","Running_time":"PT107M / 1h 47min","Description":"Directed by James Cameron.  With Arnold Schwarzenegger, Linda Hamilton, Michael Biehn, Paul Winfield. A human-looking indestructible cyborg is sent from 2029 to 1984 to assassinate a waitress, whose unborn son will lead humanity in a war against the machines, while a soldier from that war is sent to protect her at all costs.","Rated":"R"}