{"imdbID":"tt0021890","Title":"The Front Page","Year":"1931","Director":"Lewis Milestone","Country":"USA","Language":"English","Production_Co":"The Caddo Company ","Runtime":"101 min","Cast":"Adolphe Menjou, Pat O'Brien, Mary Brian, Edward Everett Horton, Walter Catlett, George E. Stone, Mae Clarke, Slim Summerville, Matt Moore, Frank McHugh, Clarence Wilson, Fred Howard, Phil Tead, Eugene Strong, Spencer Charters","Plot":"Hildy Johnson, newspaper reporter, is engaged to Peggy Grant and planning to move to New York for a higher paying advertising job. The court press room is full of lame reporters who invent ... See full summary » Hildy Johnson, newspaper reporter, is engaged to Peggy Grant and planning to move to New York for a higher paying advertising job. The court press room is full of lame reporters who invent stories as much as write them. All are waiting to cover the hanging of Earl Williams. When Williams escapes from the inept Sheriff, Hildy seizes the opportunity by using his $260 honeymoon money to payoff an insider and get the scoop on the escape. However, Walter Burns, the Post's editor, is slow to repay Hildy back, hoping that he will stay on the story. Getting a major scoop looks possible when Hildy stumbles onto the bewildered escapee and hides him in a roll-top desk in the press room. Burns shows up to help. Can they keep Williams' whereabouts secret long enough to get the scoop, especially with the Sheriff and other reporters hovering around? Written by Gary Jackson <garyjack5@cogeco.ca>","Genre":"Comedy","Keywords":"escape, press room, newspaper, editor, satire","imdbRating":"6.9","imdbVotes":"1,342","Awards":"Nominated for 3 Oscars. Another 2 wins.","Metascore":"","Released":"4 April 1931 (USA) ","Location":"Metropolitan Studios - 1040 N. Las Palmas Boulevard, Hollywood, Los Angeles, California, USA","Actors":"Adolphe Menjou, Pat O'Brien, Mary Brian ","Writer":"Ben Hecht (by), Charles MacArthur (by) | 2 more credits »","Running_time":"PT101M / 1h 41min","Description":"Directed by Lewis Milestone.  With Adolphe Menjou, Pat O'Brien, Mary Brian, Edward Everett Horton. Hildy Johnson, newspaper reporter, is engaged to Peggy Grant and planning to move to New York for a higher paying advertising job. The court press room is full of lame reporters who invent stories as much as write them. All are waiting to cover the hanging of Earl Williams. When Williams escapes from the inept Sheriff, Hildy seizes the opportunity by using his $260 honeymoon money to payoff an ...","Rated":"TV-PG"}