{"imdbID":"tt0013442","Title":"Nosferatu","Year":"1922","Director":"F.W. Murnau","Certificate":"Unrated | See all certifications »","Country":"Germany","Language":"German","Also_Known_As":"Nosferatu ","Production_Co":"Jofa-Atelier Berlin-Johannisthal, Prana-Film GmbH ","":"Show detailed company contact information on IMDbPro »","Runtime":"94 min | 65 min (VHS) | 92 min (DVD edition) | 84 min | 88 min (1997 restored) | 84 min (DVD)","Sound_Mix":"Silent","Color":"Black and White","Aspect_Ratio":"1.33 : 1","Trivia":"There have been different first names for the main characters in different English versions. In a few, Hutter is called \"Thomas\", in others is \"Jonathon\". Although Hutter's wife is credited as \"Ellen\", in some versions she is called \"Mina\". See more »","Goofs":"When Orlok has loaded the crates onto the cart, he climbs into the last one and the lid \"levitates\" into place. This magic trick is achieved by stop-motion animation, but the cart horses do not hold their position and shatter the illusion (their heads jerk about completely unnaturally while the lid is in motion). See more »","Cast":"Max Schreck, Gustav von Wangenheim, Greta Schröder, Georg H. Schnell, Ruth Landshoff, Gustav Botz, Alexander Granach, John Gottowt, Max Nemetz, Wolfgang Heinz, Albert Venohr, Eric van Viele, Josef Sareny","Plot":"Vampire Count Orlok expresses interest in a new residence and real estate agent Hutter's wife. Wisbourg, Germany based estate agent Knock dispatches his associate, Hutter, to Count Orlok's castle in Transylvania as the Count wants to purchase an isolated house in Wisbourg. They plan on selling him the one across the way from Hutter's own home. Hutter leaves his innocent wife, Ellen, with some friends while he is away. Hutter's trek is an unusual one, with many locals not wanting to take him near the castle where strange events have been occurring. Once at the castle, Hutter does manage to sell the Count the house, but he also notices and feels unusual occurrences, primarily feeling like there is a dark shadow hanging over him, even in the daytime when the Count is unusually asleep. Hutter eventually sees the Count's sleeping chamber in a crypt, and based on a book he has recently read, believes the Count is really a vampire or Nosferatu. While Hutter is trapped in the castle, the Count, hiding in a shipment of coffins, makes his way to Wisbourg, causing death along his way, ... Written by Huggo","Genre":"Fantasy, Horror","Keywords":"vampire, dracula, gothic, castle, death","imdbRating":"8.0","imdbVotes":"66,323","Awards":"1 win & 1 nomination.","Metascore":"","Released":"3 June 1929 (USA) ","Location":"Baltic Sea ","Actors":"Max Schreck, Greta Schröder, Ruth Landshoff ","Writer":"Henrik Galeen (screen play), Bram Stoker (based on the novel: \"Dracula\")","Running_time":"PT81M / 1h 21min","Description":"Directed by F.W. Murnau.  With Max Schreck, Greta Schröder, Ruth Landshoff, Gustav von Wangenheim. Vampire Count Orlok expresses interest in a new residence and real estate agent Hutter's wife.","Rated":"UNRATED"}