{"imdbID":"tt0010323","Title":"The Cabinet of Dr. Caligari","Year":"1920","Director":"Robert Wiene","Taglines":"Du mußt Caligari werden ","Certificate":"Unrated | See all certifications »","Country":"Germany","Language":"German","Also_Known_As":"The Cabinet of Dr. Caligari ","Budget":"$18,000 (estimated)","Production_Co":"Decla-Bioscop AG ","Runtime":"51 min (video) | 73 min (DVD)","Sound_Mix":"Silent","Color":"Black and White (tinted)","Aspect_Ratio":"1.33 : 1","Trivia":"Original German censorship certificate 'Jugendverbot' delivered in March 1920. See more »","Goofs":"When Alan and Francis part company, they are initially right next to each other, but then at arm's reach. See more »","Cast":"Werner Krauss, Conrad Veidt, Friedrich Feher, Lil Dagover, Hans Heinrich von Twardowski, Rudolf Lettinger","Plot":"Dr. Caligari's somnambulist, Cesare, and his deadly predictions. Francis, a young man, recalls in his memory the horrible experiences he and his fiancée Jane recently went through. It is the annual fair in Holstenwall. Francis and his friend Alan visit The Cabinet of Dr. Caligari, an exhibit where the mysterious doctor shows the somnambulist Cesare, and awakens him for some moments from his death-like sleep. When Alan asks Cesare about his future, Cesare answers that he will die before dawn. The next morning Alan is found dead. Francis suspects Cesare of being the murderer, and starts spying on him and Dr. Caligari. The following night Cesare is going to stab Jane in her bed, but softens when he sees the beautiful woman, and instead of committing another murder, he abducts her. Jane's father awakens because of the noise, and he and some servants follow the fleeing Cesare. When Cesare cannot outrun his pursuers anymore, he gently places Jane down on the ground, and runs away. Francis and the police investigate the caravan of Dr. Caligari, but the ... Written by Maths Jesperson {maths.jesperson1@comhem.se}","Genre":"Fantasy, Horror, Mystery","Keywords":"somnambulist, avant garde, expressionism, fair, asylum","imdbRating":"8.1","imdbVotes":"37,405","Awards":"","Metascore":"","Released":"19 March 1921 (USA) ","Location":"Lixie-Atelier, Weißensee, Berlin, Germany","Actors":"Werner Krauss, Conrad Veidt, Friedrich Feher ","Writer":"Carl Mayer (story), Hans Janowitz (story)","Running_time":"PT67M / 1h 7min","Description":"Directed by Robert Wiene.  With Werner Krauss, Conrad Veidt, Friedrich Feher, Lil Dagover. Dr. Caligari's somnambulist, Cesare, and his deadly predictions.","Rated":"UNRATED"}