{"imdbID":"tt0051201","Title":"Witness for the Prosecution","Year":"1957","Director":"Billy Wilder","Taglines":"Unmatched ...in a half century of motion picture suspense! ","Certificate":"See all certifications »","Country":"USA","Language":"English, German","Also_Known_As":"Testigo de cargo ","Budget":"$3,000,000 (estimated)","Production_Co":"Edward Small Productions, Metro-Goldwyn-Mayer (MGM) ","":"Show detailed company contact information on IMDbPro »","Runtime":"116 min","Sound_Mix":"Mono (Westrex Recording System)","Color":"Black and White","Aspect_Ratio":"1.66 : 1","Trivia":"Unsure if he could play a man with a heart condition, Charles Laughton (Sir Wilfrid) staged a heart attack in the pool one day at home. His wife, Elsa Lanchester (Miss Plimsoll), and a houseguest panicked and pulled him from the water, at which point he explained his trick. Elsa's reaction has not been recorded. See more »","Goofs":"Both Sir Wilfred and Mr. Myers introduce evidence directly to the court themselves, which is against courtroom procedure. Sir Wilfred, for example, trumps Inspector Hearne's testimony by directly revealing Leonard Vole's blood type, instead of properly calling a witness with personal or professional knowledge of it. See more »","Crazy_Credits":"As the end credits appear on screen, an announcer's voice is heard: \"The management of this theater suggests that for the greater entertainment of your friends who have not yet seen the picture you will not divulge to anyone the secret of the ending of Witness for the Prosecution.\" See more »","Cast":"Tyrone Power, Marlene Dietrich, Charles Laughton, Elsa Lanchester, John Williams, Henry Daniell, Ian Wolfe, Torin Thatcher, Norma Varden, Una O'Connor, Francis Compton, Philip Tonge, Ruta Lee","Plot":"A veteran British barrister must defend his client in a murder trial that has surprise after surprise. It's Britain, 1953. Upon his return to work following a heart attack, irrepressible barrister Sir Wilfrid Robarts, known as a barrister for the hopeless, takes on a murder case, much to the exasperation of his medical team, led by his overly regulated private nurse, Miss Plimsoll, who tries her hardest to ensure that he not return to his hard living ways - including excessive cigar smoking and drinking - while he takes his medication and gets his much needed rest. That case is defending American war veteran Leonard Vole, a poor, out of work, struggling inventor who is accused of murdering his fifty-six year old lonely and wealthy widowed acquaintance, Emily French. The initial evidence is circumstantial but points to Leonard as the murderer. Despite being happily married to East German former beer hall performer Christine Vole, he fostered that friendship with Mrs. French in the hopes that she would finance one of his many inventions to the tune of a few hundred pounds. It thus does ... Written by Huggo","Genre":"Drama, Mystery","Keywords":"alibi, murder, widow, german, trial","imdbRating":"8.4","imdbVotes":"59,525","Awards":"Nominated for 6 Oscars. Another 3 wins & 9 nominations.","Metascore":"","Released":"6 February 1958 (USA) ","Location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA","Actors":"Tyrone Power, Marlene Dietrich, Charles Laughton ","Writer":"Agatha Christie (in Agatha Christie's international stage success), Billy Wilder (screen play) | 2 more credits »","Running_time":"PT116M / 1h 56min","Description":"Directed by Billy Wilder.  With Tyrone Power, Marlene Dietrich, Charles Laughton, Elsa Lanchester. A veteran British barrister must defend his client in a murder trial that has surprise after surprise.","Rated":"N/A"}