{"imdbID":"tt0040746","Title":"Rope","Year":"1948","Director":"Alfred Hitchcock","Taglines":"Nothing ever held you like Alfred Hitchcock's Rope ","Certificate":"Approved | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Alfred Hitchcock's Rope ","Budget":"$1,500,000 (estimated)","Production_Co":"Warner Bros., Transatlantic Pictures, Metro-Goldwyn-Mayer (MGM) ","":"Show detailed company contact information on IMDbPro »","Runtime":"80 min","Sound_Mix":"Mono (RCA Sound System)","Color":"Color (Technicolor)","Aspect_Ratio":"1.37 : 1","Trivia":"Cary Grant was the first choice to play the role of the teacher, Rupert Cadell. See more »","Goofs":"During the opening credits - and judging by the windows on the opposite side of the street - the camera appears to be positioned roughly at the third, possibly fourth floor height at the most. However, the window view throughout the film suggests a flat on a much higher floor. See more »","Crazy_Credits":"Most of the characters in the movie are listed in their relation to David, a character who is only seen for a couple of seconds, and has no lines in movie. The only person who isn't listed in reference to David is James Stewart's character. See more »","Cast":"John Dall, Farley Granger, Edith Evanson, Douglas Dick, Joan Chandler, Cedric Hardwicke, Constance Collier, Dick Hogan, James Stewart","Plot":"Two young men strangle their \"inferior\" classmate, hide his body in their apartment, and invite his friends and family to a dinner party as a means to challenge the \"perfection\" of their crime. Brandon and Philip are two young men who share a New York apartment. They consider themselves intellectually superior to their friend David Kentley and as a consequence decide to murder him. Together they strangle David with a rope and placing the body in an old chest, they proceed to hold a small party. The guests include David's father, his fiancée Janet and their old schoolteacher Rupert from whom they mistakenly took their ideas. As Brandon becomes increasingly more daring, Rupert begins to suspect. Written by Col Needham <col@imdb.com>","Genre":"Crime, Drama, Thriller","Keywords":"rope, unedited cinematic style, long take, gay subtext, party","imdbRating":"8.0","imdbVotes":"92,741","Awards":"3 nominations.","Metascore":"","Released":"28 August 1948 (USA) ","Location":"Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA","Actors":"James Stewart, John Dall, Farley Granger ","Writer":"Hume Cronyn (adapted by), Patrick Hamilton (from the play by) | 1 more credit »","Running_time":"PT80M / 1h 20min","Description":"Directed by Alfred Hitchcock.  With James Stewart, John Dall, Farley Granger, Edith Evanson. Two young men strangle their \"inferior\" classmate, hide his body in their apartment, and invite his friends and family to a dinner party as a means to challenge the \"perfection\" of their crime.","Rated":"APPROVED"}