{"imdbID":"tt0046911","Title":"Diabolique","Year":"1955","Director":"Henri-Georges Clouzot (as H.G. Clouzot)","Taglines":"The Great Suspense Film That Shocked the World... And Became A Classic. ","Certificate":"Unrated | See all certifications »","Country":"France","Language":"French, English","Also_Known_As":"Diabolique ","Production_Co":"Filmsonor, Vera Films ","Runtime":"116 min","Sound_Mix":"Mono (A.R.T.E.C.)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"French visa # 14131 delivered on 26-1-1955. See more »","Crazy_Credits":"The movie ends with a text screen commenting on what the viewer has witnessed, and a request not to spoil the ending for those who are planning to see the movie. See more »","Cast":"Simone Signoret, Véra Clouzot, Paul Meurisse, Charles Vanel, Jean Brochard, Thérèse Dorny, Michel Serrault, Georges Chamarat, Robert Dalban, Camille Guérini, Jacques Hilling, Jean Lefebvre, Aminda Montserrat, Jean Témerson, Jacques Varennes","Plot":"The wife of a cruel headmaster and his mistress conspire to kill him, but after the murder is committed, his body disappears, and strange events begin to plague the two women. The wife and mistress of a sadistic boarding school headmaster plot to kill him. They drown him in the bathtub and dump the body in the school's filthy swimming pool... but when the pool is drained, the body has disappeared - and subsequent reported sightings of the headmaster slowly drive his 'killers' (and the audience) up the wall with almost unbearable suspense... Written by Michael Brooke <michael@everyman.demon.co.uk>","Genre":"Drama, Horror, Mystery","Keywords":"headmaster, swimming pool, mistress, teacher, suspense","imdbRating":"8.1","imdbVotes":"40,298","Awards":"4 wins.","Metascore":"","Released":"21 November 1955 (USA) ","Location":"Rue Jean Mermoz, L'Étang-la-Ville, Yvelines, France ","Actors":"Simone Signoret, Véra Clouzot, Paul Meurisse ","Writer":"Pierre Boileau (novel) (as Boileau), Thomas Narcejac (novel) (as Narcejac) | 4 more credits »","Running_time":"PT116M / 1h 56min","Description":"Directed by Henri-Georges Clouzot.  With Simone Signoret, Véra Clouzot, Paul Meurisse, Charles Vanel. The wife of a cruel headmaster and his mistress conspire to kill him, but after the murder is committed, his body disappears, and strange events begin to plague the two women.","Rated":"UNRATED"}