{"imdbID":"tt0097576","Title":"Indiana Jones and the Last Crusade","Year":"1989","Director":"Steven Spielberg","Taglines":"He's back in an all new adventure. Memorial Day 1989. ","Certificate":"U | See all certifications »","Country":"USA","Language":"English, German, Greek","Also_Known_As":"Indiana Jones y la última cruzada ","Budget":"$55,364,887 (estimated)","Gross":"$197,171,806 (USA)","Production_Co":"Paramount Pictures, Lucasfilm ","":"Show detailed company contact information on IMDbPro »","Runtime":"127 min","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby (35 mm prints)","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The Nazi costumes were genuine and were found in Eastern Europe by Anthony Powell's co-designer Joanna Johnston, to whom he gave research pictures and drawings for reference. See more »","Goofs":"While talking to Indiana in the boat, Kazim's shirt is open, then closed again so he can re-open it to show his tattoo. This is because the scene was originally longer. Indiana accidentally ripped open Kazim's shirt, revealing the tattoo while questioning him. The complete scene still appears in the Marvel comic adaptation. See more »","Crazy_Credits":"The Paramount mountain dissolves into a mountain in the American West. See more »","Cast":"Harrison Ford, Sean Connery, Denholm Elliott, Alison Doody, John Rhys-Davies, Julian Glover, River Phoenix, Michael Byrne, Kevork Malikyan, Robert Eddison, Richard Young, Alexei Sayle, Alex Hyde-White, Paul Maxwell, Isla Blair","Plot":"When Dr. Henry Jones Sr. suddenly goes missing while pursuing the Holy Grail, eminent archaeologist Indiana Jones must follow in his father's footsteps and stop the Nazis. Indiana Jones, famed adventurer and archaeologist acquires a diary that holds clues and a map with no names to find the mysterious Holy Grail- which was sent from his father, Dr. Henry Jones, in Italy. Upon hearing from a private collector, Walter Donavan, that the mission for the Holy Grail went astray with the disappearance of his father, Indiana Jones and museum curator Marcus Brody venture to Italy in search of Indy's father. However, upon retrieving Dr. Henry Jones in Nazi territory, the rescue mission turns into a race to find the Holy Grail before the Nazis do- who plan to use it for complete world domination for their super-race. With the diary as a vital key and the map with no names as a guide, Indiana Jones once again finds himself in another death defying adventure of pure excitement. Written by commanderblue","Genre":"Action, Adventure, Fantasy","Keywords":"nazi, holy grail, castle, diary, map","imdbRating":"8.3","imdbVotes":"494,598","Awards":"Won 1 Oscar. Another 5 wins & 20 nominations.","Metascore":"65","Released":"24 May 1989 (USA) ","Location":"Palazzi Barbaro, Grand Canal, Venice, Veneto, Italy ","Actors":"Harrison Ford, Sean Connery, Alison Doody ","Writer":"Jeffrey Boam (screenplay), George Lucas (story) | 3 more credits »","Running_time":"PT127M / 2h 7min","Description":"Directed by Steven Spielberg.  With Harrison Ford, Sean Connery, Alison Doody, Denholm Elliott. When Dr. Henry Jones Sr. suddenly goes missing while pursuing the Holy Grail, eminent archaeologist Indiana Jones must follow in his father's footsteps and stop the Nazis.","Rated":"U"}