{"imdbID":"tt0055630","Title":"Yojimbo","Year":"1961","Director":"Akira Kurosawa","Certificate":"Unrated | See all certifications »","Country":"Japan","Language":"Japanese","Also_Known_As":"Yojimbo ","Production_Co":"Kurosawa Production Co., Toho Company ","":"Show detailed company contact information on IMDbPro »","Runtime":"110 min","Sound_Mix":"Perspecta Stereo (Westrex Recording System)","Color":"Black and White","Aspect_Ratio":"2.35 : 1","Trivia":"\"Yojimbo\" means \"bodyguard\" in Japanese. See more »","Goofs":"When Sanjuro practices throwing the knife at a leaf, the wire on the knife is clearly visible (the scene was filmed backwards; the knife was actually pulled off the leaf by the wire). See more »","Cast":"Toshirô Mifune, Tatsuya Nakadai, Yôko Tsukasa, Isuzu Yamada, Daisuke Katô, Seizaburô Kawazu, Takashi Shimura, Hiroshi Tachikawa, Yôsuke Natsuki, Eijirô Tôno, Kamatari Fujiwara, Ikio Sawamura, Atsushi Watanabe, Susumu Fujita, Kyû Sazanka","Plot":"A crafty ronin comes to a town divided by two criminal gangs and decides to play them against each other to free the town. Sanjuro, a wandering samurai enters a rural town in nineteenth century Japan. After learning from the innkeeper that the town is divided between two gangsters, he plays one side off against the other. His efforts are complicated by the arrival of the wily Unosuke, the son of one of the gangsters, who owns a revolver. Unosuke has Sanjuro beaten after he reunites an abducted woman with her husband and son, then massacres his father's opponents. During the slaughter, the samurai escapes with the help of the innkeeper; but while recuperating at a nearby temple, he learns of innkeeper's abduction by Unosuke, and returns to the town to confront him. Written by Bernard Keane <BKeane2@email.dot.gov.au>","Genre":"Comedy, Drama","Keywords":"samurai, fighting, revolver, ronin, bodyguard","imdbRating":"8.3","imdbVotes":"70,920","Awards":"Nominated for 1 Oscar. Another 4 wins & 1 nomination.","Metascore":"","Released":"13 September 1961 (USA) ","Location":"Japan ","Actors":"Toshirô Mifune, Eijirô Tôno, Tatsuya Nakadai ","Writer":"Akira Kurosawa (story), Akira Kurosawa (screenplay) | 1 more credit »","Running_time":"PT110M / 1h 50min","Description":"Directed by Akira Kurosawa.  With Toshirô Mifune, Eijirô Tôno, Tatsuya Nakadai, Yôko Tsukasa. A crafty ronin comes to a town divided by two criminal gangs and decides to play them against each other to free the town.","Rated":"UNRATED"}