{"imdbID":"tt0026104","Title":"Becky Sharp","Year":"1935","Country":"USA","Language":"English, French","Budget":"$950,000 (estimated)","Production_Co":"Pioneer Pictures Corporation ","Runtime":"84 min | 67 min (re-issue)","Cast":"Miriam Hopkins, Frances Dee, Cedric Hardwicke, Billie Burke, Alison Skipworth, Nigel Bruce, Alan Mowbray, G.P. Huntley, William Stack, George Hassell, William Faversham, Charles Richman, Doris Lloyd, Colin Tapley, Leonard Mudie","Plot":"Set against the background of the Battle of Waterloo, Becky Sharp is the story of Vanity Fair by Thackeray. Becky and Amelia are girls at school together, but Becky is from a \"show biz\" ... See full summary » Set against the background of the Battle of Waterloo, Becky Sharp is the story of Vanity Fair by Thackeray. Becky and Amelia are girls at school together, but Becky is from a \"show biz\" family, or in other words, very low class. Becky manages to insinuate herself in Amelia's family and gets to know all their friends. From this possibly auspicious- beginning, she manages to ruin her own life, becoming sick, broke, and lonely, and also ruins the lives of many other \"loved ones\". In the movie we get to see the class distinctions in England at the time, and get a sense of what it was like for the English military at the time of the Napoleonic wars. Written by Lisa Grable","Genre":"Drama, Romance, War","Keywords":"vanity, battle of waterloo, two word title, historical event, cynicism","imdbRating":"6.0","imdbVotes":"583","Awards":"Nominated for 1 Oscar. Another 1 win & 1 nomination.","Metascore":"","Released":"28 June 1935 (USA) ","Actors":"Miriam Hopkins, Frances Dee, Cedric Hardwicke ","Director":"Rouben Mamoulian, Lowell Sherman (uncredited)","Writer":"William Makepeace Thackeray (novel) (as Thackeray), Langdon Mitchell (play) | 1 more credit »","Running_time":"PT84M / 1h 24min","Description":"Directed by Rouben Mamoulian, Lowell Sherman.  With Miriam Hopkins, Frances Dee, Cedric Hardwicke, Billie Burke. Set against the background of the Battle of Waterloo, Becky Sharp is the story of Vanity Fair by Thackeray. Becky and Amelia are girls at school together, but Becky is from a \"show biz\" family, or in other words, very low class. Becky manages to insinuate herself in Amelia's family and gets to know all their friends. From this possibly auspicious- beginning, she manages to ruin her own life, ...","Rated":"UNRATED"}