{"imdbID":"tt0052357","Title":"Vertigo","Year":"1958","Director":"Alfred Hitchcock","Taglines":"The most intense SUSPENSE.....EXCITEMENT....EMOTION ever generated by a motion picture! ","Certificate":"PG | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Vértigo ","Budget":"$2,479,000 (estimated)","Opening_Weekend":"$1,486,818 (USA) (22 November 1996)","Gross":"$3,200,000 (USA)","Production_Co":"Alfred J. Hitchcock Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"128 min | 129 min (1996 restored)","Sound_Mix":"Mono (Westrex Recording System)","Color":"Color (Technicolor)","Aspect_Ratio":"1.50 : 1","Trivia":"The original source material for the film was the French novel \"D'entre Les Morts\" and the action was set in Paris. Alfred Hitchcock changed the setting to San Francisco, a city well known for its unique topography and hilly landscape, in order to add a further torment to Scottie's life and emphasize the debilitating nature of his vertigo. See more »","Goofs":"The amount of sunlight/shadows in the alley behind the flower shop as first Madeleine and then Scottie walk towards the door. See more »","Crazy_Credits":"There is no end title on this film. See more »","Cast":"James Stewart, Kim Novak, Barbara Bel Geddes, Tom Helmore, Henry Jones, Raymond Bailey, Ellen Corby, Konstantin Shayne, Lee Patrick","Plot":"A San Francisco detective suffering from acrophobia investigates the strange activities of an old friend's wife, all the while becoming dangerously obsessed with her. Former Police detective John \"Scottie\" Ferguson was asked by a friend to investigate his wife named Madeleine since he was afraid that she might attempt to kill herself due to probable insanity as she thinks that she might be possessed by a dead woman. Scottie agrees and ended up falling in love with her. Unfortunately for him, Madeleine died and he was left alone until a woman named Judy came along and things start to unfold.","Genre":"Mystery, Romance, Thriller","Keywords":"deception, romantic obsession, 1950s, death, vertigo","imdbRating":"8.4","imdbVotes":"237,757","Awards":"Nominated for 2 Oscars. Another 8 wins & 3 nominations.","Metascore":"","Released":"1958 (UK) ","Location":"Union St & Montgomery St, San Francisco, California, USA ","Actors":"James Stewart, Kim Novak, Barbara Bel Geddes ","Writer":"Alec Coppel (screenplay), Samuel A. Taylor (screenplay) (as Samuel Taylor) | 2 more credits »","Running_time":"PT128M / 2h 8min","Description":"Directed by Alfred Hitchcock.  With James Stewart, Kim Novak, Barbara Bel Geddes, Tom Helmore. A San Francisco detective suffering from acrophobia investigates the strange activities of an old friend's wife, all the while becoming dangerously obsessed with her.","Rated":"PG"}