{"imdbID":"tt0057076","Title":"From Russia with Love","Year":"1963","Director":"Terence Young","Taglines":"Blast him! Seduce him! Bomb him! Strangle him! Target: The Unkillable James Bond 007. ","Certificate":"Approved | See all certifications »","Country":"UK","Language":"English, Russian, Turkish, Romany","Also_Known_As":"Bons baisers de Russie ","Budget":"$2,000,000 (estimated)","Gross":"$24,800,000 (USA)","Production_Co":"Eon Productions ","Runtime":"115 min","Sound_Mix":"Mono (Westrex Recording System)","Color":"Color","Aspect_Ratio":"1.37 : 1","Trivia":"By the time the film opened in the US in April 1964, production was already underway on Goldfinger (1964). See more »","Goofs":"Rosa Klebb's uniform in her scene with Romanova in the Istanbul apartment has numerous inaccuracies. Her light blue shoulder boards and collar tabs would indicate membership in either the Air Force or Airborne troops, not military intelligence. As a woman she could not be a soviet paratrooper and her uniform also lacks the additional insignia required for air force officers. Additionally, her collar tabs lack the metallic branch insignia present on all Soviet uniforms of the era. See more »","Crazy_Credits":"Martine Beswick is mis-credited as \"Martin Beswick\" in opening credits. See more »","Cast":"Sean Connery, Daniela Bianchi, Pedro Armendáriz, Lotte Lenya, Robert Shaw, Bernard Lee, Eunice Gayson, Walter Gotell, Francis De Wolff, George Pastell, Nadja Regin, Lois Maxwell, Aliza Gur, Martine Beswick, Vladek Sheybal","Plot":"James Bond willingly falls into an assassination ploy involving a naive Russian beauty in order to retrieve a Soviet encryption device that was stolen by SPECTRE. James Bond 007 is on the search for a Russian decoding machine, known as Lektor. Bond needs to find this machine, before the evil SPECTRE organization discovers it first. Whilst being romantically linked with Russian girl, Tatiana Romanova, Bond sneaks his way around Istanbul, whilst each SPECTRE agent tries to pick him off, including the over powering Donald 'Red' Grant and ex-KGB agent Rosa Klebb who knows all the tricks in the books and even possesses an incredible poison tipped shoe! Written by simon_hrdng","Genre":"Action, Adventure, Thriller","Keywords":"russian, decoder, british agent, british secret service, assassin","imdbRating":"7.5","imdbVotes":"86,557","Awards":"Nominated for 1 Golden Globe. Another 2 wins & 5 nominations.","Metascore":"","Released":"27 May 1964 (USA) ","Location":"\"The Canals\", Venice, Veneto, Italy ","Actors":"Sean Connery, Robert Shaw, Lotte Lenya ","Writer":"Richard Maibaum (screenplay), Johanna Harwood (adaptation)","Running_time":"PT115M / 1h 55min","Description":"Directed by Terence Young.  With Sean Connery, Robert Shaw, Lotte Lenya, Daniela Bianchi. James Bond willingly falls into an assassination ploy involving a naive Russian beauty in order to retrieve a Soviet encryption device that was stolen by SPECTRE.","Rated":"APPROVED"}