{"imdbID":"tt0058150","Title":"Goldfinger","Year":"1964","Director":"Guy Hamilton","Taglines":"007 is paid to take risks. YOU ARE NOT (1964 British Safety Council poster) ","Certificate":"Approved | See all certifications »","Country":"UK","Language":"English, Chinese, Spanish","Also_Known_As":"007 contra Goldfinger ","Budget":"$3,000,000 (estimated)","Gross":"$51,100,000 (USA)","Production_Co":"Eon Productions ","Runtime":"110 min","Sound_Mix":"Mono (Westrex Recording System)","Color":"Color (Technicolor)","Aspect_Ratio":"1.37 : 1","Trivia":"The butler cuts the tip of Colonel Smithers' cigar with a v-cutter, which creates an elegant v-shaped notch in the tip. See more »","Goofs":"The Falcon Ranchero that Oddjob uses to remove the remains of the Lincoln initially has blackwall tires and in the final scene where it passes the agent's T-Bird it has whitewalls. When it arrives back at Goldfinger's compound it has blackwalls again. See more »","Crazy_Credits":"THE END OF \"GOLDFINGER\" BUT JAMES BOND WILL BE BACK IN \"THUNDERBALL\" See more »","Cast":"Sean Connery, Honor Blackman, Gert Fröbe, Shirley Eaton, Tania Mallet, Harold Sakata, Bernard Lee, Martin Benson, Cec Linder, Austin Willis, Lois Maxwell, Bill Nagy, Michael Mellinger, Peter Cranwell, Nadja Regin","Plot":"Investigating a gold magnate's smuggling, James Bond uncovers a plot to contaminate the Fort Knox gold reserve. Bond is back and his next mission takes him to Fort Knox, where Auric Goldfinger and his henchman are planning to raid Fort Knox and obliterate the world economy. To save the world once again, Bond will need to become friends with Goldfinger, dodge killer hats and avoid Goldfinger's personal pilot, the sexy Pussy Galore. She might not have feelings for Bond, but will 007 help her change her mind? Written by simon_hrdng","Genre":"Action, Adventure, Thriller","Keywords":"bikini, gold, fort knox, pilot, hat","imdbRating":"7.8","imdbVotes":"136,201","Awards":"Won 1 Oscar. Another 3 wins & 6 nominations.","Metascore":"","Released":"9 January 1965 (USA) ","Location":"Realp, Uri, Switzerland ","Actors":"Sean Connery, Gert Fröbe, Honor Blackman ","Writer":"Richard Maibaum (screenplay), Paul Dehn (screenplay)","Running_time":"PT110M / 1h 50min","Description":"Directed by Guy Hamilton.  With Sean Connery, Gert Fröbe, Honor Blackman, Shirley Eaton. Investigating a gold magnate's smuggling, James Bond uncovers a plot to contaminate the Fort Knox gold reserve.","Rated":"APPROVED"}