{"imdbID":"tt0099810","Title":"The Hunt for Red October","Year":"1990","Director":"John McTiernan","Taglines":"Invisible. Silent. Stolen. ","Certificate":"PG | See all certifications »","Country":"USA","Language":"English, Russian","Also_Known_As":"Jagd auf 'Roter Oktober' ","Budget":"$30,000,000 (estimated)","Gross":"$122,012,643 (USA)","Production_Co":"Paramount Pictures, Mace Neufeld Productions, Nina Saxon Film Design ","Runtime":"135 min","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby SR (35 mm prints)","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Kevin Costner was originally cast as Jack Ryan. 24 years later, he played Thomas Harper in the reboot Jack Ryan: Shadow Recruit (2014). See more »","Goofs":"There is a scene in which a Russian official mentions the \"Barents Sea\" and points to the proper place on a map (the Barents sea is north of Finland and Russia). However the closed caption incorrectly reads \"Bering Sea.\" The Bering sea is between Russia and Alaska. None of the ships in the movie are anywhere near the Bering sea. See more »","Crazy_Credits":"Stanley (Sally Ryan's stuffed bear) is credited as \"Himself\" See more »","Cast":"Sean Connery, Alec Baldwin, Scott Glenn, Sam Neill, James Earl Jones, Joss Ackland, Richard Jordan, Peter Firth, Tim Curry, Courtney B. Vance, Stellan Skarsgård, Jeffrey Jones, Timothy Carhart, Larry Ferguson, Fred Dalton Thompson","Plot":"In November 1984, the Soviet Union's best submarine captain in their newest sub violates orders and heads for the USA. Is he trying to defect or to start a war? Soviets create a new nuclear submarine that runs silent due to a revolutionary propulsion system. Russian sub captain defects, goal of taking it to the U.S.A. to prevent the Russians from using the sub to wreak nuclear (missile) war against the U.S. Lots of plot turns and twists in this high-tech thriller. Written by Anonymous","Genre":"Action, Adventure, Thriller","Keywords":"submarine, navy, soviet submarine, submarine crew, u.s. soviet relations","imdbRating":"7.6","imdbVotes":"139,283","Awards":"Won 1 Oscar. Another 2 wins & 6 nominations.","Metascore":"58","Released":"2 March 1990 (USA) ","Location":"USA ","Actors":"Sean Connery, Alec Baldwin, Scott Glenn ","Writer":"Tom Clancy (novel), Larry Ferguson (screenplay) | 1 more credit »","Running_time":"PT135M / 2h 15min","Description":"Directed by John McTiernan.  With Sean Connery, Alec Baldwin, Scott Glenn, Sam Neill. In November 1984, the Soviet Union's best submarine captain in their newest sub violates orders and heads for the USA. Is he trying to defect or to start a war?","Rated":"PG"}