{"imdbID":"tt0036983","Title":"The Keys of the Kingdom","Year":"1944","Director":"John M. Stahl","Country":"USA","Language":"English, Mandarin, Cantonese","Budget":"$3,000,000 (estimated)","Production_Co":"Twentieth Century Fox Film Corporation ","Runtime":"137 min","Cast":"Gregory Peck, Thomas Mitchell, Vincent Price, Rose Stradner, Roddy McDowall, Edmund Gwenn, Cedric Hardwicke, Peggy Ann Garner, Jane Ball, James Gleason, Anne Revere, Ruth Nelson, Benson Fong, Leonard Strong, Philip Ahn","Plot":"A young priest, Father Chisholm is sent to China to establish a Catholic parish among the non-Christian Chinese. While his boyhood friend, also a priest, flourishes in his calling as a ... See full summary » A young priest, Father Chisholm is sent to China to establish a Catholic parish among the non-Christian Chinese. While his boyhood friend, also a priest, flourishes in his calling as a priest in a more Christian area of the world, Father Chisholm struggles. He encounters hostility, isolation, disease, poverty and a variety of set backs which humble him, but make him more determined than ever to succeed. Over the span of many years he gains acceptance and a growing congregation among the Chinese, through his quiet determination, understanding and patience. Written by E.W. DesMarais <Jlongst@aol.com>","Genre":"Drama","Keywords":"priest, church, mandarin, china, bishop","imdbRating":"7.5","imdbVotes":"1,622","Awards":"Nominated for 4 Oscars.","Metascore":"","Released":"15 December 1944 (USA) ","Location":"Laguna, California, USA ","Actors":"Gregory Peck, Thomas Mitchell, Vincent Price ","Writer":"Joseph L. Mankiewicz (screenplay), Nunnally Johnson (screenplay) | 1 more credit »","Running_time":"PT137M / 2h 17min","Description":"Directed by John M. Stahl.  With Gregory Peck, Thomas Mitchell, Vincent Price, Rose Stradner. A young priest, Father Chisholm is sent to China to establish a Catholic parish among the non-Christian Chinese. While his boyhood friend, also a priest, flourishes in his calling as a priest in a more Christian area of the world, Father Chisholm struggles. He encounters hostility, isolation, disease, poverty and a variety of set backs which humble him, but make him more determined than ever to ...","Rated":"APPROVED"}