{"imdbID":"tt0035417","Title":"The Talk of the Town","Year":"1942","Director":"George Stevens","Country":"USA","Language":"English","Production_Co":"Columbia Pictures Corporation ","Runtime":"118 min","Cast":"Cary Grant, Jean Arthur, Ronald Colman, Edgar Buchanan, Glenda Farrell, Charles Dingle, Emma Dunn, Rex Ingram, Leonid Kinskey, Tom Tyler, Don Beddoe","Plot":"An escaped prisoner and a stuffy law professor vie for the hand of a spirited schoolteacher. In suburban Lochester, New England, three people end up living together in high school teacher Nora Shelley's rental house. The first is her new tenant, renowned Harvard law professor Michael Lightcap, who has rented the house for the summer while he writes his new book. The second is Nora herself. Despite having an auspicious first meeting, Lightcap hires Nora to be his live-in cook and secretary for a week until his manservant Tilney arrives. The third is Joseph, the property's gardener, who is currently laid up with a sprained ankle. In reality, Joseph is Nora's childhood friend Leopold Dilg, who has just escaped from prison. Leopold was being tried for the arson of the factory where he worked, and for murder for the death of the factory foreman Clyde Bracken, whose body was never recovered but who is assumed to have died in the fire. Despite the danger to herself, Nora hides Leopold since she believes his story that although he, as an activist, did speak out about the dangerous ... Written by Huggo","Genre":"Comedy, Drama, Romance","Keywords":"law, factory, gardener, trial, supreme court","imdbRating":"7.6","imdbVotes":"5,174","Awards":"Nominated for 7 Oscars.","Metascore":"","Released":"20 August 1942 (USA) ","Actors":"Cary Grant, Jean Arthur, Ronald Colman ","Writer":"Irwin Shaw (screen play), Sidney Buchman (screen play) | 2 more credits »","Running_time":"PT118M / 1h 58min","Description":"Directed by George Stevens.  With Cary Grant, Jean Arthur, Ronald Colman, Edgar Buchanan. An escaped prisoner and a stuffy law professor vie for the hand of a spirited schoolteacher.","Rated":"NOT RATED"}