{"imdbID":"tt0029995","Title":"The Citadel","Year":"1938","Director":"King Vidor","Country":"UK","Language":"English","Production_Co":"Metro-Goldwyn-Mayer British Studios ","Runtime":"110 min","Cast":"Robert Donat, Rosalind Russell, Ralph Richardson, Rex Harrison, Emlyn Williams, Penelope Dudley-Ward, Francis L. Sullivan, Mary Clare, Cecil Parker, Nora Swinburne, Edward Chapman, Athene Seyler, Felix Aylmer, Joyce Bland, Percy Parsons","Plot":"Andrew Manson, a young, enthusiastic doctor takes his first job in a Welsh mining town, and begins to wonder at the persistent cough many of the miners have. When his attempts to prove its ... See full summary » Andrew Manson, a young, enthusiastic doctor takes his first job in a Welsh mining town, and begins to wonder at the persistent cough many of the miners have. When his attempts to prove its cause are thwarted, he moves to London. His new practice does badly. But when a friend shows him how to make a lucrative practice from rich hypochondriacs, it will take a great shock to show him what the truth of being a doctor really is. Written by Kathy Li","Genre":"Drama","Keywords":"miner, cough, medical, wealthy, wales","imdbRating":"7.3","imdbVotes":"1,387","Awards":"Nominated for 4 Oscars. Another 3 wins.","Metascore":"","Released":"29 October 1938 (USA) ","Location":"Abertillery, Blaenau Gwent, Wales, UK ","Actors":"Robert Donat, Rosalind Russell, Ralph Richardson ","Writer":"Ian Dalrymple (screen play), Frank Wead (screen play) | 3 more credits »","Running_time":"PT110M / 1h 50min","Description":"Directed by King Vidor.  With Robert Donat, Rosalind Russell, Ralph Richardson, Rex Harrison. Andrew Manson, a young, enthusiastic doctor takes his first job in a Welsh mining town, and begins to wonder at the persistent cough many of the miners have. When his attempts to prove its cause are thwarted, he moves to London. His new practice does badly. But when a friend shows him how to make a lucrative practice from rich hypochondriacs, it will take a great shock to show him what the truth ...","Rated":"PASSED"}