{"imdbID":"tt0056907","Title":"The Cardinal","Year":"1963","Director":"Otto Preminger","Country":"USA","Language":"English, German, Latin","Production_Co":"Otto Preminger Films ","Runtime":"175 min","Cast":"Tom Tryon, Carol Lynley, Dorothy Gish, Maggie McNamara, Bill Hayes, Cameron Prud'Homme, Cecil Kellaway, Loring Smith, John Saxon, James Hickman, Berenice Gahm, John Huston, Jose Duvall, Peter MacLean, Robert Morse","Plot":"A young Catholic priest from Boston confronts bigotry, Naziism, and his own personal conflicts as he rises to the office of cardinal. Stephen Fermoyle has grown up in Boston at the turn of the twentieth century knowing that his destiny lies with the Catholic priesthood. Finally finishing his studies in Rome, he returns to America full of certitude and ambition to one day join the College of Cardinals. But his road to that office is a long one, paved with crises. In Boston, he must decide whether to save the life of his sister or her unborn child, conceived out of wedlock. In Austria, he confronts the question of whether to remain with the priesthood or abandon his oath so that he can be with the woman he loves. In Georgia, he contends with Rome's indifference in the face of racial bigotry. And in Austria, he finds himself personally involved in the church's dealings with the Third Reich. Written by Shannon Patrick Sullivan <shannon@mun.ca>","Genre":"Drama, History, War","Keywords":"bigotry, catholic, priesthood, georgia, catholic priest","imdbRating":"6.8","imdbVotes":"1,718","Awards":"Nominated for 6 Oscars. Another 3 wins & 7 nominations.","Metascore":"","Released":"12 December 1963 (USA) ","Location":"Boston, Massachusetts, USA ","Actors":"Tom Tryon, John Huston, Romy Schneider ","Writer":"Robert Dozier (screenplay), Henry Morton Robinson (novel)","Running_time":"PT175M / 2h 55min","Description":"Directed by Otto Preminger.  With Tom Tryon, John Huston, Romy Schneider, Carol Lynley. A young Catholic priest from Boston confronts bigotry, Naziism, and his own personal conflicts as he rises to the office of cardinal.","Rated":"APPROVED"}