{"imdbID":"tt0059113","Title":"Doctor Zhivago","Year":"1965","Director":"David Lean","Country":"USA, Italy, UK","Language":"English, Russian, French","Budget":"$11,000,000 (estimated)","Gross":"$111,722,000 (USA)","Production_Co":"Metro-Goldwyn-Mayer (MGM), Carlo Ponti Production, Sostar S.A. ","Runtime":"197 min | 192 min (1999 re-release) | 200 min (1992 re-release)","Cast":"Omar Sharif, Julie Christie, Geraldine Chaplin, Rod Steiger, Alec Guinness, Tom Courtenay, Siobhan McKenna, Ralph Richardson, Rita Tushingham, Jeffrey Rockland, Tarek Sharif, Bernard Kay, Klaus Kinski, Gérard Tichy, Noel Willman","Plot":"The life of a Russian physician and poet who, although married to another, falls in love with a political activist's wife and experiences hardship during the First World War and then the October Revolution. Lara inspires lechery in Komarovsky (her mother's lover who is a master at surviving whoever runs Russia) and can't compete with passion for the revolution of the man she marries, Pasha. Her true love is Zhivago who also loves his wife. Lara is the one who inspires poetry. The story is narrated by Zhivago's half brother Yevgraf, who has made his career in the Soviet Army. At the beginning of the film he is about to meet a young woman he believes may be the long lost daughter of Lara and Zhivago. Written by Dale O'Connor <daleoc@interaccess.com>","Genre":"Drama, Romance, War","Keywords":"love, epic, russia, physician, brother","imdbRating":"8.0","imdbVotes":"54,492","Awards":"Won 5 Oscars. Another 16 wins & 13 nominations.","Metascore":"","Released":"31 December 1965 (USA) ","Location":"Alberta, Canada ","Actors":"Omar Sharif, Julie Christie, Geraldine Chaplin ","Writer":"Boris Pasternak (novel) (as Boris Leonidovic Pasternak), Robert Bolt (screenplay)","Running_time":"PT197M / 3h 17min","Description":"Directed by David Lean.  With Omar Sharif, Julie Christie, Geraldine Chaplin, Rod Steiger. The life of a Russian physician and poet who, although married to another, falls in love with a political activist's wife and experiences hardship during the First World War and then the October Revolution.","Rated":"PG-13"}