{"imdbID":"tt0077663","Title":"Heaven Can Wait","Year":"1978","Country":"USA","Language":"English","Gross":"SEK 3,864,734 (Sweden)","Production_Co":"Paramount Pictures ","Runtime":"101 min","Cast":"Warren Beatty, Julie Christie, James Mason, Jack Warden, Charles Grodin, Dyan Cannon, Buck Henry, Vincent Gardenia, Joseph Maher, Hamilton Camp, Arthur Malet, Stephanie Faracy, Jeannie Linero, Harry D.K. Wong, George J. Manos","Plot":"A Los Angeles Rams quarterback, accidentally taken away from his body by an overanxious angel before he was meant to die, returns to life in the body of a recently murdered millionaire. Joe Pendleton is a football quarterback preparing to lead his team to the Superbowl when he is almost killed in an accident. An overanxious angel plucks him to heaven only to discover that he was not ready to die, and that his body has been cremated. Another body must be found without his death being discovered, and that of a recently murdered millionaire is chosen. His wife and accountant, the murderers, are confused by this development, as he buys the Los Angeles Rams in order to once again quarterback them into the Superbowl. At the same time, he falls in love with an English environmental activist who disapproves of his policies and actions. Written by John Vogel <jlvogel@comcast.net>","Genre":"Comedy, Fantasy, Romance","Keywords":"quarterback, millionaire, heaven, angel, coach","imdbRating":"6.9","imdbVotes":"13,835","Awards":"Won 1 Oscar. Another 8 wins & 13 nominations.","Metascore":"","Released":"28 June 1978 (USA) ","Location":"Exposition Park, Los Angeles, California, USA ","Actors":"Warren Beatty, James Mason, Julie Christie ","Director":"Warren Beatty, Buck Henry","Writer":"Elaine May (screenplay), Warren Beatty (screenplay) | 1 more credit »","Running_time":"PT101M / 1h 41min","Description":"Directed by Warren Beatty, Buck Henry.  With Warren Beatty, James Mason, Julie Christie, Jack Warden. A Los Angeles Rams quarterback, accidentally taken away from his body by an overanxious angel before he was meant to die, returns to life in the body of a recently murdered millionaire.","Rated":"PG"}