{"imdbID":"tt0064418","Title":"Hello, Dolly!","Year":"1969","Director":"Gene Kelly","Country":"USA","Language":"English","Budget":"$25,000,000 (estimated)","Gross":"$9,000,000 (USA)","Production_Co":"Chenault Productions, Twentieth Century Fox Film Corporation ","Runtime":"146 min","Cast":"Barbra Streisand, Walter Matthau, Michael Crawford, Marianne McAndrew, Danny Lockin, E.J. Peaker, Joyce Ames, Tommy Tune, Judy Knaiz, David Hurst, Fritz Feld, Richard Collier, J. Pat O'Malley, Louis Armstrong","Plot":"A matchmaker named Dolly Levi takes a trip to Yonkers, New York to see the \"well-known unmarried half-a-millionaire,\" Horace Vandergelder. While there, she convinces him, his two stock ... See full summary » A matchmaker named Dolly Levi takes a trip to Yonkers, New York to see the \"well-known unmarried half-a-millionaire,\" Horace Vandergelder. While there, she convinces him, his two stock clerks and his niece and her beau to go to New York City. In New York, she fixes Vandergelder's clerks up with the woman Vandergelder had been courting, and her shop assistant (Dolly has designs of her own on Mr. Vandergelder, you see). Written by Randy Goldberg <goldberg@nymc.edu>","Genre":"Comedy, Musical, Romance","Keywords":"matchmaker, new york city, niece, merchant, yonkers new york","imdbRating":"7.2","imdbVotes":"9,543","Awards":"Won 3 Oscars. Another 1 win & 13 nominations.","Metascore":"","Released":"16 December 1969 (USA) ","Location":"Metro-North Station, Poughkeepsie, New York, USA ","Actors":"Barbra Streisand, Walter Matthau, Michael Crawford ","Writer":"Michael Stewart (book), Thornton Wilder (based on \"The Matchmaker\" by) | 1 more credit »","Running_time":"PT146M / 2h 26min","Description":"Directed by Gene Kelly.  With Barbra Streisand, Walter Matthau, Michael Crawford, Marianne McAndrew. A matchmaker named Dolly Levi takes a trip to Yonkers, New York to see the \"well-known unmarried half-a-millionaire,\" Horace Vandergelder. While there, she convinces him, his two stock clerks and his niece and her beau to go to New York City. In New York, she fixes Vandergelder's clerks up with the woman Vandergelder had been courting, and her shop assistant (Dolly has designs of her own on Mr. ...","Rated":"G"}