{"imdbID":"tt0050986","Title":"Wild Strawberries","Year":"1957","Director":"Ingmar Bergman","Writer":"Ingmar Bergman","Certificate":"Unrated | See all certifications »","Country":"Sweden","Language":"Swedish, Latin","Also_Known_As":"Wild Strawberries ","Production_Co":"Svensk Filmindustri (SF) ","":"Show detailed company contact information on IMDbPro »","Runtime":"91 min","Sound_Mix":"Mono","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Included among the \"1001 Movies You Must See Before You Die\", edited by Steven Schneider. See more »","Goofs":"The front license plate on the VW disappears when untying the rope. See more »","Cast":"Victor Sjöström, Bibi Andersson, Ingrid Thulin, Gunnar Björnstrand, Jullan Kindahl, Folke Sundquist, Björn Bjelfvenstam, Naima Wifstrand, Gunnel Broström, Gertrud Fridh, Sif Ruud, Gunnar Sjöberg, Max von Sydow, Åke Fridell, Yngve Nordwall","Plot":"After living a life marked by coldness, an aging professor is forced to confront the emptiness of his existence. With the exception of his elderly housekeeper Miss Agda who he treats almost like a surrogate platonic wife, widowed seventy-eight year old Dr. Isak Borg, a former medical doctor and professor, has retreated from any human contact, partly his own want but partly the decision of others who do not want to spend time with him because of his cold demeanor. He is traveling from his home in Stockholm to Lund to accept an honorary degree. Instead of flying as was the original plan, he decides to take the day long drive instead. Along for the ride is his daughter-in-law Marianne, who had been staying with him for the month but has now decided to go home. The many stops and encounters along the way make him reminisce about various parts of his life. Those stops which make him reminisce directly are at his childhood summer home, at the home of his equally emotionally cold mother, and at a gas station where the attendants praise him as a man for his work. But the lives of other people they ... Written by Huggo","Genre":"Drama, Romance","Keywords":"professor, elderly, marriage, housekeeper, hitchhiker","imdbRating":"8.3","imdbVotes":"60,569","Awards":"Nominated for 1 Oscar. Another 12 wins & 2 nominations.","Metascore":"","Released":"22 June 1959 (USA) ","Location":"Dalarö, Stockholms län, Sweden ","Actors":"Victor Sjöström, Bibi Andersson, Ingrid Thulin ","Running_time":"PT91M / 1h 31min","Description":"Directed by Ingmar Bergman.  With Victor Sjöström, Bibi Andersson, Ingrid Thulin, Gunnar Björnstrand. After living a life marked by coldness, an aging professor is forced to confront the emptiness of his existence.","Rated":"UNRATED"}