{"imdbID":"tt0029947","Title":"Bringing Up Baby","Year":"1938","Director":"Howard Hawks","Taglines":"And so begins the hilarious adventure of Professor David Huxley and Miss Susan Vance, a flutter-brained vixen with love in her heart! [Theatrical trailer.]","Certificate":"Approved | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Leoparden küßt man nicht ","Budget":"$1,073,000 (estimated)","Production_Co":"RKO Radio Pictures ","Runtime":"102 min","Sound_Mix":"Mono (RCA Victor System)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Included among the \"1001 Movies You Must See Before You Die\", edited by Steven Schneider. See more »","Goofs":"Gogarty and Major Horace Applegate come across the leopard, and Applegate says, \"Personally, Gogarty, I think you're a liar!\" They start to run away from the leopard, when suddenly part of the leopard's head is transparent. You can see right through to the wall. See more »","Cast":"Katharine Hepburn, Cary Grant, Charles Ruggles, Walter Catlett, Barry Fitzgerald, May Robson, Fritz Feld, Leona Roberts, George Irving, Tala Birell, Virginia Walker, John Kelly","Plot":"While trying to secure a $1 million donation for his museum, a befuddled paleontologist is pursued by a flighty and often irritating heiress and her pet leopard \"Baby.\" Mild mannered zoology professor Dr. David Huxley is excited by the news that an intercostal clavicle bone has been found to complete his brontosaurus skeleton, a project four years in the construction. He is equally excited about his imminent marriage to his assistant, the officious Alice Swallow, who is interested in him more for his work than for him as a person. David needs the $1 million endowment of wealthy dowager Mrs. Carleton Random to complete the project. Her lawyer, Alexander Peabody, will make the decision on her behalf, so David needs to get in his favor. However, whenever David tries to make a good impression on Peabody, the same young woman always seems to do something to make him look bad. She is the flighty heiress Susan Vance. The more David wants Susan to go away, the more Susan seems not to want or be able to. But David eventually learns that Alexander Peabody is her good friend, who she calls Boopy, and Susan's Aunt Elizabeth, with whom David has also made a bad ... Written by Huggo","Genre":"Comedy, Romance","Keywords":"leopard, bone, museum, love, lawyer","imdbRating":"8.0","imdbVotes":"43,685","Awards":"2 wins.","Metascore":"","Released":"18 February 1938 (USA) ","Location":"Arthur Ranch, Malibu, California, USA ","Actors":"Katharine Hepburn, Cary Grant, Charles Ruggles ","Writer":"Dudley Nichols (screen play), Hagar Wilde (screen play) | 1 more credit »","Running_time":"PT102M / 1h 42min","Description":"Directed by Howard Hawks.  With Katharine Hepburn, Cary Grant, Charles Ruggles, Walter Catlett. While trying to secure a $1 million donation for his museum, a befuddled paleontologist is pursued by a flighty and often irritating heiress and her pet leopard \"Baby.\"","Rated":"APPROVED"}