{"imdbID":"tt0056217","Title":"The Man Who Shot Liberty Valance","Year":"1962","Director":"John Ford","Taglines":"Together For The First Time - James Stewart - John Wayne - in the masterpiece of four-time Academy Award winner John Ford","Certificate":"Approved | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Un tiro en la noche ","Budget":"$3,200,000 (estimated)","Production_Co":"Paramount Pictures, John Ford Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"123 min | 113 min (cut)","Sound_Mix":"Mono (Westrex Recording System)","Color":"Black and White","Aspect_Ratio":"1.85 : 1","Trivia":"While filming the stagecoach hold-up, James Stewart couldn't get a handle on it and kept flubbing his lines until John Ford walked over and repeated quietly in his ear, \"You are not a coward, you are not a coward.\" That gave Stewart just the cue he needed to nail the take. See more »","Goofs":"When teaching his students, Ransom asks what the supreme law of the land is. When a pupil (Pompey) gives the correct answer of the Constitution, he incorrectly tells him the right answer is the Declaration of Independence. The Declaration is a statement of principles and a justification for the colonies' rebellion, but certainly not law in any way. See more »","Cast":"John Wayne, James Stewart, Vera Miles, Lee Marvin, Edmond O'Brien, Andy Devine, Ken Murray, John Carradine, Jeanette Nolan, John Qualen, Willis Bouchey, Carleton Young, Woody Strode, Denver Pyle, Strother Martin","Plot":"A senator, who became famous for killing a notorious outlaw, returns for the funeral of an old friend and tells the truth about his deed. When Senator Ransom Stoddard returns home to Shinbone for the funeral of Tom Doniphon, he recounts to a local newspaper editor the story behind it all. He had come to town many years before, a lawyer by profession. The stage was robbed on its way in by the local ruffian, Liberty Valance, and Stoddard has nothing to his name left save a few law books. He gets a job in the kitchen at the Ericson's restaurant and there meets his future wife, Hallie. The territory is vying for Statehood and Stoddard is selected as a representative over Valance, who continues terrorizing the town. When he destroys the local newspaper office and attacks the editor, Stoddard calls him out, though the conclusion is not quite as straightforward as legend would have it. Written by garykmcd","Genre":"Western","Keywords":"friend, funeral, outlaw, rancher, stagecoach","imdbRating":"8.1","imdbVotes":"52,103","Awards":"Nominated for 1 Oscar. Another 4 wins & 2 nominations.","Metascore":"","Released":"22 April 1962 (USA) ","Location":"California, USA ","Actors":"James Stewart, John Wayne, Vera Miles ","Writer":"James Warner Bellah (screenplay), Willis Goldbeck (screenplay) | 1 more credit »","Running_time":"PT123M / 2h 3min","Description":"Directed by John Ford.  With James Stewart, John Wayne, Vera Miles, Lee Marvin. A senator, who became famous for killing a notorious outlaw, returns for the funeral of an old friend and tells the truth about his deed.","Rated":"APPROVED"}