{"imdbID":"tt0039636","Title":"Mourning Becomes Electra","Year":"1947","Director":"Dudley Nichols","Country":"USA","Language":"English","Production_Co":"RKO Radio Pictures ","Runtime":"173 min | 105 min (edited)","Cast":"Rosalind Russell, Michael Redgrave, Raymond Massey, Katina Paxinou, Leo Genn, Kirk Douglas, Nancy Coleman, Henry Hull, Sara Allgood, Thurston Hall, Walter Baldwin, Elisabeth Risdon, Erskine Sanford, Jimmy Conlin, Lee Baker","Plot":"Eugene O'Neill's updated version of the Orestaia. In New England, after the American Civil War, a war-weary Agamem--er, Ezra Mannon comes home to his unhappy wife (Christine) and loving ... See full summary » Eugene O'Neill's updated version of the Orestaia. In New England, after the American Civil War, a war-weary Agamem--er, Ezra Mannon comes home to his unhappy wife (Christine) and loving daughter (Lavinia). But Lavinia's ex-suitor, Adam Brant, has become Christine's lover, and together Adam and Christine plot to poison Ezra. When they succeed, Lavinia turns to her brother Orin to help bring the lovers to justice, but when they succeed, Orin goes mad and his suicide note may come between Lavinia and her new suitor, Peter Niles. Written by Kathy Li","Genre":"Drama","Keywords":"love, new england, lover, ship, poison","imdbRating":"6.5","imdbVotes":"634","Awards":"Nominated for 2 Oscars. Another 2 wins.","Metascore":"","Released":"19 November 1947 (USA) ","Actors":"Rosalind Russell, Michael Redgrave, Raymond Massey ","Writer":"Dudley Nichols, Eugene O'Neill (play)","Running_time":"PT121M / 2h 1min","Description":"Directed by Dudley Nichols.  With Rosalind Russell, Michael Redgrave, Raymond Massey, Katina Paxinou. Eugene O'Neill's updated version of the Orestaia. In New England, after the American Civil War, a war-weary Agamem--er, Ezra Mannon comes home to his unhappy wife (Christine) and loving daughter (Lavinia). But Lavinia's ex-suitor, Adam Brant, has become Christine's lover, and together Adam and Christine plot to poison Ezra. When they succeed, Lavinia turns to her brother Orin to help bring the ...","Rated":"APPROVED"}