{"imdbID":"tt0099077","Title":"Awakenings","Year":"1990","Director":"Penny Marshall","Country":"USA","Language":"English","Gross":"$52,096,475 (USA)","Production_Co":"Columbia Pictures Corporation, Parkes/Lasker productions ","Runtime":"121 min","Cast":"Robert De Niro, Robin Williams, Julie Kavner, Ruth Nelson, John Heard, Penelope Ann Miller, Alice Drummond, Judith Malina, Barton Heyman, George Martin, Anne Meara, Richard Libertini, Laura Esterman, Dexter Gordon, Jayne Haynes","Plot":"The victims of an encephalitis epidemic many years ago have been catatonic ever since, but now a new drug offers the prospect of reviving them. 1969. Dr. Malcolm Sayer is hired as a clinical physician at a psychiatric hospital in the Bronx, despite he only having a research background. The job is not ideal on his side as he has difficulties relating to people which is the reason he has focused on research projects not involving human subjects, while the hospital hires him somewhat out of desperation in not finding anyone else with the qualifications who wants the job. Most of his patients are in a semi-catatonic state and are housed in what some of the orderlies coin the \"garden\" ward, where all they can do for the patients is water and feed them. He notices that some of the patients, despite their generally catatonic state, respond in unusual ways to certain stimuli. In doing some research, he also finds that some common bonds between these patients are that they suffered from encephalitis in the 1920s or 1930s, and that their physical states are like they have Parkinson's disease frozen in time. As such, he is able to ... Written by Huggo","Genre":"Biography, Drama","Keywords":"psychiatric hospital, drug testing, catatonia, encephalitis lethargica, patient","imdbRating":"7.8","imdbVotes":"89,698","Awards":"Nominated for 3 Oscars. Another 5 wins & 7 nominations.","Metascore":"74","Released":"11 January 1991 (USA) ","Location":"Williamsbridge Oval, Bronx, New York, USA ","Actors":"Robert De Niro, Robin Williams, Julie Kavner ","Writer":"Oliver Sacks (book) (as Oliver Sacks M.D.), Steven Zaillian (screenplay)","Running_time":"PT121M / 2h 1min","Description":"Directed by Penny Marshall.  With Robert De Niro, Robin Williams, Julie Kavner, Ruth Nelson. The victims of an encephalitis epidemic many years ago have been catatonic ever since, but now a new drug offers the prospect of reviving them.","Rated":"PG-13"}