{"imdbID":"tt0018806","Title":"The Crowd","Year":"1928","Director":"King Vidor","Country":"USA","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"98 min","Cast":"Eleanor Boardman, James Murray, Bert Roach, Estelle Clark, Daniel G. Tomlinson, Dell Henderson, Lucy Beaumont, Freddie Burke Frederick, Alice Mildred Puter","Plot":"The life of a man and woman together in a large, impersonal metropolis through their hopes, struggles and downfalls. Born on the fourth of July, 1900, the future holds unlimited potential for newborn John Sims. But dreams soon fade with the death of his father when John is but a lad. Like many before him, John sets out to make his mark in New York City, but ends up a faceless worker (#137) in a large office of a large business. Still he is happy with his fate and soon meets a young woman named Mary on a blind double date. Things take their course and they soon marry and live in a small apartment. Soon John is bickering with Mary and finds that he has no love for the in-laws. When the marriage looks like a bust, he finds that Mary is with child and he stays. After 5 years, he has a son and a daughter and the same dead end job. When tragedy strikes, John must find the conviction to continue or lose what little he has left. Written by Tony Fontana <tony.fontana@spacebbs.com>","Genre":"Drama, Romance","Keywords":"new york city, 1900s, fourth of july, date, marriage","imdbRating":"8.0","imdbVotes":"5,448","Awards":"Nominated for 2 Oscars. Another 1 win.","Metascore":"","Released":"3 March 1928 (USA) ","Location":"Coney Island, Brooklyn, New York City, New York, USA ","Actors":"Eleanor Boardman, James Murray, Bert Roach ","Writer":"King Vidor (screen play), John V.A. Weaver (screen play) | 1 more credit »","Running_time":"PT98M / 1h 38min","Description":"Directed by King Vidor.  With Eleanor Boardman, James Murray, Bert Roach, Estelle Clark. The life of a man and woman together in a large, impersonal metropolis through their hopes, struggles and downfalls.","Rated":"NOT RATED"}