{"imdbID":"tt0062994","Title":"Funny Girl","Year":"1968","Director":"William Wyler","Country":"USA","Language":"English","Budget":"$14,100,000 (estimated)","Gross":"$223,306 (USA) (5 October 2001)","Production_Co":"Columbia Pictures Corporation, Rastar Productions ","Runtime":"151 min | 155 min (roadshow)","Cast":"Barbra Streisand, Omar Sharif, Kay Medford, Anne Francis, Walter Pidgeon, Lee Allen, Mae Questel, Gerald Mohr, Frank Faylen, Mittie Lawrence, Gertrude Flynn, Penny Santon, John Harmon, Thordis Brandt, Bettina Brenna","Plot":"The life of Fanny Brice, famed comedienne and entertainer of the early-1900s. We see her rise to fame as a Ziegfield girl, subsequent career and her personal life, particularly her relationship with Nick Arnstein. Early twentieth century New York. Fanny Brice knows that she is a talented comedienne and singer. She also knows that she is not the beauty typical of the stage performers of the day, she with skinny legs and a crooked nose among other physical issues. So she knows she has to use whatever other means to get her break in show business, that break so that she can at least display her talents. With the help of Eddie Ryan who would become her friend, Fanny is able to get a part in a novelty act in a vaudeville show, the renown from which eventually comes to the attention of famed impresario Florenz Ziegfeld Jr.. Fanny does become one of the Ziegfeld Follies most popular acts, despite she almost getting fired after her first performance by defying Flo's artistic vision for her closing number. Beyond stage success, Fanny also wants a happy personal life, most specifically with the suave Nicky Arnstein, a gambler in every respect of the word. Fanny loves him and loves that he loves her ... Written by Huggo","Genre":"Biography, Comedy, Drama","Keywords":"love, vaudeville, gambler, stardom, singer","imdbRating":"7.5","imdbVotes":"12,635","Awards":"Won 1 Oscar. Another 6 wins & 16 nominations.","Metascore":"89","Released":"19 September 1968 (USA) ","Location":"Stage 4, Columbia/Sunset Gower Studios - 1438 N. Gower Street, Hollywood, Los Angeles, California, USA ","Actors":"Barbra Streisand, Omar Sharif, Kay Medford ","Writer":"Isobel Lennart (book), Isobel Lennart (from the original story by: based on the play with) (as Miss Lennart) | 1 more credit »","Running_time":"PT151M / 2h 31min","Description":"Directed by William Wyler.  With Barbra Streisand, Omar Sharif, Kay Medford, Anne Francis. The life of Fanny Brice, famed comedienne and entertainer of the early-1900s. We see her rise to fame as a Ziegfield girl, subsequent career and her personal life, particularly her relationship with Nick Arnstein.","Rated":"G"}