{"imdbID":"tt0046359","Title":"Stalag 17","Year":"1953","Director":"Billy Wilder","Taglines":"Hilarious, heart-tugging! You'll laugh...you'll cry...you'll cheer William Holden in his great Academy Award role! (from reissue print ad)","Certificate":"Not Rated | See all certifications »","Country":"USA","Language":"English, German, Russian","Also_Known_As":"Infierno en la tierra ","Budget":"$1,661,530 (estimated)","Production_Co":"Paramount Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"120 min","Sound_Mix":"Mono (Western Electric Recording)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Billy Wilder filmed the movie at a studio-owned ranch in Agoura Hills, California. He wore his best shoes and made sure cast and crew saw him with those shoes on in the mud. Wilder felt he could not ask his co-workers to work in the mud unless they saw him do the same. See more »","Goofs":"As the last seconds the film begins to fade out, you see Cookie whistling \"When Johnny Comes Marching Home Again\", but the audio is not in sync. See more »","Cast":"William Holden, Don Taylor, Otto Preminger, Robert Strauss, Harvey Lembeck, Richard Erdman, Peter Graves, Neville Brand, Sig Ruman, Michael Moore, Peter Baldwin, Robinson Stone, Robert Shawley, William Pierson, Gil Stratton","Plot":"When two escaping American World War II prisoners are killed, the German POW camp barracks black marketeer, J.J. Sefton, is suspected of being an informer. It's a dreary Christmas 1944 for the American POWs in Stalag 17. For the men in Barracks 4, all sergeants, have to deal with a grave problem - there seems to be a security leak. The Germans always seem to be forewarned about escapes and in the most recent attempt the two men, Manfredi and Johnson, walked straight into a trap and were killed. For some in Barracks 4, especially the loud-mouthed Duke, the leaker is obvious: J.J. Sefton, a wheeler-dealer who doesn't hesitate to trade with the guards and who has acquired goods and privileges that no other prisoner seems to have. Sefton denies giving the Germans any information and makes it quite clear that he has no intention of ever trying to escape. He plans to ride out the war in what little comfort he can arrange, but it doesn't extend to spying for the Germans. As tensions mount and a mob mentality takes root, it becomes obvious that Sefton will have to find the real snitch if he is to have any peace and avoid the beatings Duke and ... Written by garykmcd","Genre":"Drama, War","Keywords":"german, barracks, escape, spy, guard","imdbRating":"8.1","imdbVotes":"42,421","Awards":"Won 1 Oscar. Another 1 win & 5 nominations.","Metascore":"","Released":"10 August 1953 (Brazil) ","Location":"John Show Ranch, Woodland Hills, Los Angeles, California, USA","Actors":"William Holden, Don Taylor, Otto Preminger ","Writer":"Billy Wilder (written for the screen by), Edwin Blum (written for the screen by) | 2 more credits »","Running_time":"PT120M / 2h","Description":"Directed by Billy Wilder.  With William Holden, Don Taylor, Otto Preminger, Robert Strauss. When two escaping American World War II prisoners are killed, the German POW camp barracks black marketeer, J.J. Sefton, is suspected of being an informer.","Rated":"NOT RATED"}