{"imdbID":"tt0070903","Title":"The Way We Were","Year":"1973","Director":"Sydney Pollack","Writer":"Arthur Laurents","Country":"USA","Language":"English, French","Production_Co":"Columbia Pictures Corporation, Rastar Productions, Tom Ward Enterprises ","Runtime":"118 min","Cast":"Barbra Streisand, Robert Redford, Bradford Dillman, Lois Chiles, Patrick O'Neal, Viveca Lindfors, Allyn Ann McLerie, Murray Hamilton, Herb Edelman, Diana Ewing, Sally Kirkland, Marcia Mae Jones, Don Keefer, George Gaynes, Eric Boles","Plot":"Two desperate people have a wonderful romance, but their political views and convictions drive them apart. The often unlikely joint lives of Katie Morosky and Hubbell Gardiner from the late 1930s to the late 1950s is presented, over which time, they are, in no particular order, strangers, acquaintances, friends, best friends, lovers and adversaries. The unlikely nature of their relationship is due to their fundamental differences, where she is Jewish and passionate about her political activism both in political freedoms and Marxism to an extreme where she takes life a little too seriously, while he is the golden boy WASP, being afforded the privileges in life because of his background but who on the most part is able to capitalize on those privileges. Their lives are shown in four general time periods, in chronological order when they attend the same college, their time in New York City during WWII, his life as a Hollywood screenwriter post-war, and his life as a writer for a New York based live television show. It is during college that Hubbell finds his voice in life as a writer, and ... Written by Huggo","Genre":"Drama, Romance","Keywords":"college, friend, writer, writing, activist","imdbRating":"7.1","imdbVotes":"15,791","Awards":"Won 2 Oscars. Another 5 wins & 7 nominations.","Metascore":"","Released":"19 October 1973 (USA) ","Location":"Ballston Spa, New York, USA ","Actors":"Barbra Streisand, Robert Redford, Bradford Dillman ","Running_time":"PT118M / 1h 58min","Description":"Directed by Sydney Pollack.  With Barbra Streisand, Robert Redford, Bradford Dillman, Lois Chiles. Two desperate people have a wonderful romance, but their political views and convictions drive them apart.","Rated":"PG"}