{"imdbID":"tt0018455","Title":"Sunrise","Year":"1927","Director":"F.W. Murnau","Certificate":"Not Rated | See all certifications »","Country":"USA","Also_Known_As":"Sunrise ","Production_Co":"Fox Film Corporation ","Runtime":"94 min","Sound_Mix":"Mono (Movietone) (musical score and sound effects)| Silent (alternate version)","Color":"Black and White","Aspect_Ratio":"1.33 : 1","Trivia":"Janet Gaynor wore a blonde wig throughout the film. It attracted a lot of criticism at the time of release as audiences were used to seeing her with long dark hair instead. See more »","Goofs":"The number of bottles left on the table after the piglet bumps it changes between shots. There are five bottles when the piglet bumps it, but when the Man comes in and grabs the piglet there are seven bottles on it. See more »","Cast":"George O'Brien, Janet Gaynor, Margaret Livingston, Bodil Rosing, J. Farrell MacDonald, Ralph Sipperly, Jane Winton, Arthur Housman, Eddie Boland, Vondell Darr","Plot":"A married farmer falls under the spell of a slatternly woman from the city, who tries to convince him to drown his wife. In this fable-morality subtitled \"A Song of Two Humans\", the \"evil\" temptress is a city woman who bewitches farmer Anses and tries to convince him to murder his neglected wife, Indre. Written by alfiehitchie","Genre":"Drama, Romance","Keywords":"city, farmer, love, murder, dancing","imdbRating":"8.3","imdbVotes":"27,458","Awards":"Won 3 Oscars. Another 2 wins & 1 nomination.","Metascore":"","Released":"4 November 1927 (USA) ","Location":"Big Bear Lake, Big Bear Valley, San Bernardino National Forest, California, USA ","Actors":"George O'Brien, Janet Gaynor, Margaret Livingston ","Writer":"Carl Mayer (scenario), Hermann Sudermann (from an original theme by) | 2 more credits »","Running_time":"PT94M / 1h 34min","Description":"Directed by F.W. Murnau.  With George O'Brien, Janet Gaynor, Margaret Livingston, Bodil Rosing. A married farmer falls under the spell of a slatternly woman from the city, who tries to convince him to drown his wife.","Rated":"NOT RATED"}