{"imdbID":"tt0057263","Title":"Love with the Proper Stranger","Year":"1963","Director":"Robert Mulligan","Writer":"Arnold Schulman","Country":"USA","Language":"English","Production_Co":"Pakula-Mulligan, Boardwalk Productions, Rona ","Runtime":"102 min","Cast":"Natalie Wood, Steve McQueen, Edie Adams, Herschel Bernardi, Anne Hegira, Harvey Lembeck, Mario Badolati, Penny Santon, Elena Karam, Virginia Vincent, Nina Varela, E. Nick Alexander, Marilyn Chris, Augusta Ciolli, Wolfe Barzell","Plot":"Angie Rossini is an innocent (Italian Catholic) Macy's salesgirl, who discovers she's pregnant from a fling with Rocky, a musician. Angie finds Rocky (who doesn't remember her at first) to ... See full summary » Angie Rossini is an innocent (Italian Catholic) Macy's salesgirl, who discovers she's pregnant from a fling with Rocky, a musician. Angie finds Rocky (who doesn't remember her at first) to tell him she's pregnant and needs a doctor for an abortion. He finds her a doctor and they work together to raise the money. Can these two strangers find love with one another before it's too late? Written by Kelly","Genre":"Comedy, Drama, Romance","Keywords":"abortion, italian, italian american, musician, department store","imdbRating":"7.6","imdbVotes":"2,787","Awards":"Nominated for 5 Oscars. Another 1 win & 5 nominations.","Metascore":"","Released":"25 December 1963 (USA) ","Location":"New York City, New York, USA","Actors":"Natalie Wood, Steve McQueen, Edie Adams ","Running_time":"PT102M / 1h 42min","Description":"Directed by Robert Mulligan.  With Natalie Wood, Steve McQueen, Edie Adams, Herschel Bernardi. Angie Rossini is an innocent (Italian Catholic) Macy's salesgirl, who discovers she's pregnant from a fling with Rocky, a musician. Angie finds Rocky (who doesn't remember her at first) to tell him she's pregnant and needs a doctor for an abortion. He finds her a doctor and they work together to raise the money. Can these two strangers find love with one another before it's too late?","Rated":"UNRATED"}