{"imdbID":"tt0048191","Title":"I'll Cry Tomorrow","Year":"1955","Director":"Daniel Mann","Country":"USA","Language":"English","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"117 min","Cast":"Susan Hayward, Richard Conte, Eddie Albert, Jo Van Fleet, Don Taylor, Ray Danton, Margo, Virginia Gregg, Don 'Red' Barry, David Kasday, Carole Ann Campbell, Peter Leeds, Tol Avery","Plot":"Deprived of a normal childhood by her ambitious mother, Katie, Lillian Roth becomes a star of Broadway and Hollywood before she is twenty. Shortly before her marriage to her childhood ... See full summary » Deprived of a normal childhood by her ambitious mother, Katie, Lillian Roth becomes a star of Broadway and Hollywood before she is twenty. Shortly before her marriage to her childhood sweetheart, David Tredman, he dies and Lillian takes her first drink of many down the road of becoming an alcoholic. She enters into a short-lived marriage to an immature aviation cadet, Wallie, followed by a divorce and then marriage to a sadistic brute and abuser Tony Bardeman. After a failed suicide attempt, Burt McGuire comes to her aid and helps her find the road back to happiness after sixteen years in a nightmare world, not counting the first twenty with her mother. Written by Les Adams <longhorn1939@suddenlink.net>","Genre":"Biography, Drama, Music","Keywords":"marriage, divorce, alcoholic, drink, bare chested boy","imdbRating":"7.5","imdbVotes":"1,318","Awards":"Won 1 Oscar. Another 2 wins & 5 nominations.","Metascore":"","Released":"25 December 1955 (USA) ","Location":"Deluxe Hotel, Los Angeles, California, USA ","Actors":"Susan Hayward, Richard Conte, Eddie Albert ","Writer":"Helen Deutsch (screenplay), Jay Richard Kennedy (screenplay) | 3 more credits »","Running_time":"PT117M / 1h 57min","Description":"Directed by Daniel Mann.  With Susan Hayward, Richard Conte, Eddie Albert, Jo Van Fleet. Deprived of a normal childhood by her ambitious mother, Katie, Lillian Roth becomes a star of Broadway and Hollywood before she is twenty. Shortly before her marriage to her childhood sweetheart, David Tredman, he dies and Lillian takes her first drink of many down the road of becoming an alcoholic. She enters into a short-lived marriage to an immature aviation cadet, Wallie, followed by a ...","Rated":"PASSED"}