{"imdbID":"tt0057239","Title":"The L-Shaped Room","Year":"1962","Director":"Bryan Forbes","Country":"UK","Language":"English","Production_Co":"British Lion Film Corporation, Romulus Films ","Runtime":"126 min","Cast":"Leslie Caron, Anthony Booth, Avis Bunnage, Patricia Phoenix, Verity Edmett, Tom Bell, Cicely Courtneidge, Harry Locke, Ellen Dryden, Emlyn Williams, Jennifer White, Brock Peters, Gerry Duggan, Joan Ingram, Mark Eden","Plot":"Jane, a young French woman, pregnant and unmarried, takes a room in a seedy London boarding house, which is inhabited by an assortment of misfits. She considers getting an abortion, but is ... See full summary » Jane, a young French woman, pregnant and unmarried, takes a room in a seedy London boarding house, which is inhabited by an assortment of misfits. She considers getting an abortion, but is unhappy with this solution. She falls into a relationship with Toby, a struggling young writer who lives on the first floor. Eventually she comes to like her odd room, and makes friends with all the strange people in the house. But she still faces two problems: what to do with her baby, and what to do with Toby. Written by John Oswalt <jao@jao.com>","Genre":"Drama","Keywords":"baby, misfit, writer, french, pregnant","imdbRating":"7.5","imdbVotes":"1,011","Awards":"Nominated for 1 Oscar. Another 3 wins & 5 nominations.","Metascore":"","Released":"20 November 1962 (UK) ","Location":"4 St Luke's Road, Notting Hill, London, England, UK ","Actors":"Leslie Caron, Anthony Booth, Avis Bunnage ","Writer":"Lynne Reid Banks (novel), Bryan Forbes (written for the screen by)","Running_time":"PT126M / 2h 6min","Description":"Directed by Bryan Forbes.  With Leslie Caron, Anthony Booth, Avis Bunnage, Patricia Phoenix. Jane, a young French woman, pregnant and unmarried, takes a room in a seedy London boarding house, which is inhabited by an assortment of misfits. She considers getting an abortion, but is unhappy with this solution. She falls into a relationship with Toby, a struggling young writer who lives on the first floor. Eventually she comes to like her odd room, and makes friends with all the strange ...","Rated":"N/A"}