{"imdbID":"tt0090756","Title":"Blue Velvet","Year":"1986","Director":"David Lynch","Writer":"David Lynch (screenplay)","Country":"USA","Language":"English","Budget":"$6,000,000 (estimated)","Gross":"$8,551,228 (USA)","Production_Co":"De Laurentiis Entertainment Group (DEG) ","Runtime":"120 min","Cast":"Isabella Rossellini, Kyle MacLachlan, Dennis Hopper, Laura Dern, Hope Lange, Dean Stockwell, George Dickerson, Priscilla Pointer, Frances Bay, Jack Harvey, Ken Stovitz, Brad Dourif, Jack Nance, J. Michael Hunter, Dick Green","Plot":"The discovery of a severed human ear found in a field leads a young man on an investigation related to a beautiful, mysterious nightclub singer and a group of psychopathic criminals who have kidnapped her child. College student Jeffrey Beaumont returns to his idyllic hometown of Lumberton to manage his father's hardware store while his father is hospitalized. Walking though a grassy meadow near the family home, Jeffrey finds a severed human ear. After an initial investigation, lead police Detective John Williams advises Jeffrey not to speak to anyone about the case as they investigate further. Detective Williams also tells Jeffrey that he cannot divulge any information about what the police know. Detective Williams' high school aged daughter, Sandy Williams, tells Jeffrey what she knows about the case from overhearing her father's private conversations on the matter: that it has to do with a nightclub singer named Dorothy Vallens, who lives in an older apartment building near the Beaumont home. His curiosity getting the better of him, Jeffrey, with Sandy's help, decides to find out more about the woman at the center of the case by breaking into Dorothy's apartment while he knows she's at work... Written by Huggo","Genre":"Mystery, Thriller","Keywords":"voyeurism, cult film, forced to strip, heineken beer, femme fatale","imdbRating":"7.8","imdbVotes":"127,658","Awards":"Nominated for 1 Oscar. Another 18 wins & 16 nominations.","Metascore":"75","Released":"23 October 1986 (Italy) ","Location":"128 Northern Boulevard, Wilmington, North Carolina, USA ","Actors":"Isabella Rossellini, Kyle MacLachlan, Dennis Hopper ","Running_time":"PT120M / 2h","Description":"Directed by David Lynch.  With Isabella Rossellini, Kyle MacLachlan, Dennis Hopper, Laura Dern. The discovery of a severed human ear found in a field leads a young man on an investigation related to a beautiful, mysterious nightclub singer and a group of psychopathic criminals who have kidnapped her child.","Rated":"R"}