{"imdbID":"tt0022100","Title":"M","Year":"1931","Director":"Fritz Lang","Certificate":"See all certifications »","Country":"Germany","Language":"German","Also_Known_As":"Murderers Among Us ","Opening_Weekend":"$6,123 (USA) (15 March 2013)","Gross":"$28,877 (USA) (31 May 2013)","Production_Co":"Nero-Film AG ","":"Show detailed company contact information on IMDbPro »","Runtime":"117 min | 110 min (2004 Criterion DVD edition) | 105 min (2000 restored) | 108 min (re-release)","Sound_Mix":"Mono","Color":"Black and White","Aspect_Ratio":"1.19 : 1","Trivia":"Fritz Lang asserts that he cast real criminals for the court scene in the end. According to biographer Paul Jensen, 24 cast members were arrested during filming. See more »","Crazy_Credits":"All of the original credits appear only in the beginning with no music. See more »","Cast":"Peter Lorre, Ellen Widmann, Inge Landgut, Otto Wernicke, Theodor Loos, Gustaf Gründgens, Friedrich Gnaß, Fritz Odemar, Paul Kemp, Theo Lingen, Rudolf Blümner, Georg John, Franz Stein, Ernst Stahl-Nachbaur, Gerhard Bienert","Plot":"When the police in a German city are unable to catch a child-murderer, other criminals join in the manhunt. In Germany, Hans Beckert is an unknown killer of girls. He whistles Edvard Grieg's 'In The Hall of the Mountain King', from the 'Peer Gynt' Suite I Op. 46 while attracting the little girls for death. The police force pressed by the Minister give its best effort trying unsuccessfully to arrest the serial killer. The organized crime has great losses due to the intense search and siege of the police and decides to chase the murderer, with the support of the beggars association. They catch Hans and briefly judge him. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Crime, Drama, Mystery","Keywords":"criminal, killer, beggar, murder, psychopath","imdbRating":"8.4","imdbVotes":"95,338","Awards":"2 wins.","Metascore":"","Released":"31 August 1931 (Sweden) ","Location":"Staaken, Spandau, Berlin, Germany","Actors":"Peter Lorre, Ellen Widmann, Inge Landgut ","Writer":"Thea von Harbou (script), Fritz Lang (script)","Running_time":"PT117M / 1h 57min","Description":"Directed by Fritz Lang.  With Peter Lorre, Ellen Widmann, Inge Landgut, Otto Wernicke. When the police in a German city are unable to catch a child-murderer, other criminals join in the manhunt.","Rated":"N/A"}