{"imdbID":"tt0040725","Title":"The Red Shoes","Year":"1948","Country":"UK","Language":"English, French, Russian","Budget":"£500,000 (estimated)","Production_Co":"Archers, The, Independent Producers ","Runtime":"133 min","Cast":"Marius Goring, Jean Short, Gordon Littmann, Julia Lang, Bill Shine, Léonide Massine, Anton Walbrook, Austin Trevor, Esmond Knight, Eric Berry, Irene Browne, Moira Shearer, Ludmilla Tchérina, Jerry Verno, Robert Helpmann","Plot":"A young ballet dancer is torn between the man she loves and her pursuit to become a prima ballerina. Under the authoritarian rule of charismatic ballet impressario Boris Lermontov, his proteges realize the full promise of their talents, but at a price: utter devotion to their art and complete loyalty to Lermontov himself. Under his near-obsessive guidance, young ballerina Victoria Page is poised for superstardom, but earns Lermontov's scorn when she falls in love with Julian Craster, composer of \"The Red Shoes,\" the ballet Lermontov is staging to showcase her talents. Vicky leaves the company and marries Craster, but still finds herself torn between Lermontov's demands and those of her heart. Written by Paul Penna <tterrace@wco.com>","Genre":"Drama, Music, Romance","Keywords":"ballet, ballerina, dance, composer, dancer","imdbRating":"8.3","imdbVotes":"19,491","Awards":"Won 2 Oscars. Another 2 wins & 5 nominations.","Metascore":"","Released":"6 September 1948 (UK) ","Location":"Royal Opera House, Bow Street, Covent Garden, London, England, UK ","Actors":"Anton Walbrook, Marius Goring, Moira Shearer ","Director":"Michael Powell, Emeric Pressburger","Writer":"Hans Christian Andersen (fairy tale), Emeric Pressburger (original screenplay) | 3 more credits »","Running_time":"PT133M / 2h 13min","Description":"Directed by Michael Powell, Emeric Pressburger.  With Anton Walbrook, Marius Goring, Moira Shearer, Jean Short. A young ballet dancer is torn between the man she loves and her pursuit to become a prima ballerina.","Rated":"NOT RATED"}