{"imdbID":"tt0061809","Title":"In Cold Blood","Year":"1967","Director":"Richard Brooks","Country":"USA","Language":"English","Budget":"$3,500,000 (estimated)","Production_Co":"Columbia Pictures Corporation, Pax Enterprises ","Runtime":"134 min","Cast":"Robert Blake, Scott Wilson, John Forsythe, Paul Stewart, Gerald S. O'Loughlin, Jeff Corey, John Gallaudet, James Flavin, Charles McGraw, Will Geer, John McLiam, Ruth Storey, Brenda Currin, Paul Hough, Vaughn Taylor","Plot":"After a botched robbery results in the brutal murder of a rural family, two drifters elude police, in the end coming to terms with their own mortality and the repercussions of their vile atrocity. In meeting in Kansas, ex-cons Perry Smith and Dick Hickock are breaking several conditions of their respective paroles. The meeting, initiated by Dick, is to plan and eventually carry out a robbery based on information he had received from a fellow inmate about $10,000 cash being locked in a hidden safe in the home of the farming Clutter family of Holcomb, Kansas. After the robbery, they plan on going to Mexico permanently to elude capture by the police. Each brings a necessary personality to the partnership to carry out the plan, Dick who is the brash manipulator, Perry the outwardly more sensitive but unrealistic dreamer with a violent streak under the surface. Perry literally carries all his dreams in a large box he takes with him wherever he goes. The robbery does not go according to plan in any respect, the pair who ultimately hogtie and execute all four members of the Clutter family, only coming away from the home with $43 in cash. As Perry and Dick go on the run, a murder ... Written by Huggo","Genre":"Crime, Drama, History","Keywords":"homoeroticism, robbery, murder, police, kansas","imdbRating":"8.0","imdbVotes":"18,490","Awards":"Nominated for 4 Oscars. Another 4 wins & 5 nominations.","Metascore":"89","Released":"7 March 1968 (Argentina) ","Location":"Colorado Territorial Correctional Facility, Canon City, Colorado, USA ","Actors":"Robert Blake, Scott Wilson, John Forsythe ","Writer":"Truman Capote (based on the book by), Richard Brooks (written for the screen by)","Running_time":"PT134M / 2h 14min","Description":"Directed by Richard Brooks.  With Robert Blake, Scott Wilson, John Forsythe, Paul Stewart. After a botched robbery results in the brutal murder of a rural family, two drifters elude police, in the end coming to terms with their own mortality and the repercussions of their vile atrocity.","Rated":"APPROVED"}