{"imdbID":"tt0069293","Title":"Solaris","Year":"1972","Director":"Andrei Tarkovsky (as Andrey Tarkovskiy)","Certificate":"PG | See all certifications »","Country":"Soviet Union","Language":"Russian, German","Also_Known_As":"Solaris ","Budget":"RUR 1,000,000 (estimated)","Production_Co":"Creative Unit of Writers & Cinema Workers, Kinostudiya ''Mosfilm'', Unit Four ","Runtime":"167 min | 115 min (unapproved cut)","Sound_Mix":"Mono","Color":"Black and White (Eastman Double-X Negative Film)| Color (Eastman Color)","Aspect_Ratio":"2.35 : 1","Trivia":"There are a number of references to Cervantes' \"Don Quixote\" in the film. In the library, Snaut quotes from the novel (\"Never before, Sancho, have I heard you speak so elegantly as now.\") At one point, Dr Snaut also refers to tilting at windmills, and during the weightless scene, an open copy of Don Quixote flies past, showing the knight errant on his steed Rosinante. See more »","Goofs":"When Kris is standing in the rain near the beginning of the film the camera tilts down to the table to show a coffee cup and various other items. The cut to the next shot of Kris shows him to have moved (which seems reasonable as a small amount of time has elapsed) but all the items on the table are now in a different configuration. See more »","Cast":"Natalya Bondarchuk, Donatas Banionis, Jüri Järvet, Vladislav Dvorzhetskiy, Nikolay Grinko, Anatoliy Solonitsyn, Olga Barnet, Vitalik Kerdimun, Olga Kizilova, Tatyana Malykh, Aleksandr Misharin, Bagrat Oganesyan, Tamara Ogorodnikova, Sos Sargsyan, Yulian Semyonov","Plot":"A psychologist is sent to a station orbiting a distant planet in order to discover what has caused the crew to go insane. The Solaris mission has established a base on a planet that appears to host some kind of intelligence, but the details are hazy and very secret. After the mysterious demise of one of the three scientists on the base, the main character is sent out to replace him. He finds the station run-down and the two remaining scientists cold and secretive. When he also encounters his wife who has been dead for ten years, he begins to appreciate the baffling nature of the alien intelligence. Written by Dan Ellis","Genre":"Drama, Mystery, Sci-Fi","Keywords":"scientist, psychologist, space station, ocean, hallucination","imdbRating":"8.1","imdbVotes":"51,762","Awards":"2 wins & 4 nominations.","Metascore":"90","Released":"20 March 1972 (Soviet Union) ","Location":"Yalta, Crimea, Ukraine ","Actors":"Natalya Bondarchuk, Donatas Banionis, Jüri Järvet ","Writer":"Stanislaw Lem (novel) (as Stanislav Lem), Fridrikh Gorenshteyn (screenplay) (as F. Gorenshteyn) | 1 more credit »","Running_time":"PT167M / 2h 47min","Description":"Directed by Andrei Tarkovsky.  With Natalya Bondarchuk, Donatas Banionis, Jüri Järvet, Vladislav Dvorzhetskiy. A psychologist is sent to a station orbiting a distant planet in order to discover what has caused the crew to go insane.","Rated":"PG"}