{"imdbID":"tt0076759","Title":"Star Wars","Year":"1977","Director":"George Lucas","Writer":"George Lucas","Taglines":"The force will be with you (re-release) ","Certificate":"U | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"La guerra de las galaxias ","Budget":"$11,000,000 (estimated)","Opening_Weekend":"$35,906,661 (USA) (31 January 1997)","Gross":"ESP 1,366,116,825 (Spain) (13 July 2001)","Production_Co":"Lucasfilm, Twentieth Century Fox Film Corporation ","":"Show detailed company contact information on IMDbPro »","Runtime":"121 min | 125 min (special edition)","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby (35 mm prints)| DTS-Stereo (as DTS Stereo® in selected theatres)| Dolby Digital (as Dolby® Digital in selected theatres)| SDDS (as Sony Dynamic Digital SoundTM in selected theatres)| Mono (some 35 mm prints) (other 16 mm prints)","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"The accounts on how Alec Guinness regarded the movie and his work on it vary greatly. He frequently recalled the experience of making the movie as a bad one, and consistently claimed that it was his idea to have his character killed off in the first film, so as to limit his involvement and make sure he \"wouldn't have to carry on saying these rubbish lines.\" He later mentioned to \"shrivel up\" each time someone mentioned the movie, and claimed to throw away all Star Wars related fan mail without even opening it (a logical paradox, making it likely that this is not true, as his journals report what some of this mail said in detail), because he hated the fact that he would be most remembered as Obi-Wan Kenobi, despite other roles which he held in much higher regard. Contrary to all this, George Lucas has said he made the decision to kill off Kenobi, since the character had no part to play in the movie's finale, and deserved a memorable exit. According to Lucas, Guinness was \"less than happy\" that his character was dying earlier than expected, and even appeared to enjoy his time on set. Lucas, Mark Hamill, Harrison Ford and Carrie Fisher have always stated how patient and helpful Guinness was on the set, and praised his professionalism and respectfulness to all cast and crew members. While Guinness made no secret that he disliked the dialogue in George Lucas' script, he claimed that he accepted the role for two reasons: 1) He was an admirer of Lucas' previous film, American Graffiti (1973) and 2) The narrative compelled him to read the whole script through to the end, in spite of not liking the dialogue and not being a fan of science-fiction. Of the final film, he remarked that he found it \"staggering as spectacle and technically brilliant, exciting, very noisy and warmhearted. The battle scenes at the end go on for five minutes too long, and some of the dialogue is excruciating and much of it is lost in noise, but it remains a vivid experience.\" See more »","Goofs":"Considering what we now know from Star Wars 1-3, why doesn't Obi-Wan remember R2D2 and C3PO? We know C3PO's memory was wiped, so he wouldn't remember Obi-Wan, but Obi-Wan should remember R2D2, and vice-versa. However, there's no indication that he doesn't remember R2D2, he only says that he doesn't remember \"owning a droid\", which is actually true to some extent. (See also the FAQ entry about this issue.) See more »","Crazy_Credits":"When first released theatrically, prior to the film, a generic screen reading in green letters \"A Lucasfilm Limited Production\" appeared. In all versions from the Special Edition onward, this is replaced with a more elaborate Lucasfilm logo that shines and glows. See more »","Cast":"Mark Hamill, Harrison Ford, Carrie Fisher, Peter Cushing, Alec Guinness, Anthony Daniels, Kenny Baker, Peter Mayhew, David Prowse, Phil Brown, Shelagh Fraser, Jack Purvis, Alex McCrindle, Eddie Byrne, Drewe Henley","Plot":"Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a wookiee and two droids to save the galaxy from the Empire's world-destroying battle-station, while also attempting to rescue Princess Leia from the evil Darth Vader. A young boy from Tatooine sets out on an adventure with an old Jedi named Obi-Wan Kenobi as his mentor to save Princess Leia from the ruthless Darth Vader and Destroy the Death Star built by the Empire which has the power to destroy the entire galaxy. Written by Aravind R.","Genre":"Action, Adventure, Fantasy","Keywords":"rebellion, death star, science fantasy, galactic war, empire","imdbRating":"8.7","imdbVotes":"871,468","Awards":"Won 6 Oscars. Another 38 wins & 28 nominations.","Metascore":"92","Released":"1 July 1978 (India) ","Location":"Tikal National Park, Guatemala ","Actors":"Mark Hamill, Harrison Ford, Carrie Fisher ","Running_time":"PT121M / 2h 1min","Description":"Directed by George Lucas.  With Mark Hamill, Harrison Ford, Carrie Fisher, Alec Guinness. Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a wookiee and two droids to save the galaxy from the Empire's world-destroying battle-station, while also attempting to rescue Princess Leia from the evil Darth Vader.","Rated":"U"}