{"imdbID":"tt0040506","Title":"Key Largo","Year":"1948","Director":"John Huston","Taglines":"Gun Fury in the TROPICS! ","Certificate":"Unrated | See all certifications »","Country":"USA","Language":"English, Italian","Also_Known_As":"Huracán de pasiones ","Production_Co":"Warner Bros. ","Runtime":"100 min","Sound_Mix":"Mono (RCA Sound System)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Actor Harry Lewis went on to open the popular Hamburger Hamlet chain, which he sold in 1987 for $29 million. He passed away at age 93 in 2013. See more »","Goofs":"The hurricane passes by unrealistically quickly. See more »","Cast":"Humphrey Bogart, Edward G. Robinson, Lauren Bacall, Lionel Barrymore, Claire Trevor, Thomas Gomez, Harry Lewis, John Rodney, Marc Lawrence, Dan Seymour, Monte Blue, William Haade","Plot":"A man visits his old friend's hotel and finds a gangster running things. As a hurricane approaches, the two end up confronting each other. Frank McCloud travels to a run-down hotel on Key Largo to honor the memory of a friend who died bravely in his unit during WW II. His friend's widow, Nora Temple, and wheelchair bound father, James Temple manage the hotel and receive him warmly, but the three of them soon find themselves virtual prisoners when the hotel is taken over by a mob of gangsters led by Johnny Rocco who hole up there to await the passing of a hurricane. Mr. Temple strongly reviles Rocco but due to his infirmities can only confront him verbally. Having become disillusioned by the violence of war, Frank is reluctant to act, but Rocco's demeaning treatment of his alcoholic moll, Gaye Dawn, and his complicity in the deaths of some innocent Seminole Indians and a deputy sheriff start to motivate McCloud to overcome his Hamlet-like inaction. Written by Brian Greenhalgh","Genre":"Crime, Drama, Film-Noir","Keywords":"hotel, key largo, hurricane, gangster, death","imdbRating":"7.9","imdbVotes":"27,711","Awards":"Won 1 Oscar. Another 1 nomination.","Metascore":"","Released":"31 July 1948 (USA) ","Location":"Key West, Florida Keys, Florida, USA ","Actors":"Humphrey Bogart, Edward G. Robinson, Lauren Bacall ","Writer":"Richard Brooks (screenplay), John Huston (screenplay) | 1 more credit »","Running_time":"PT100M / 1h 40min","Description":"Directed by John Huston.  With Humphrey Bogart, Edward G. Robinson, Lauren Bacall, Lionel Barrymore. A man visits his old friend's hotel and finds a gangster running things. As a hurricane approaches, the two end up confronting each other.","Rated":"UNRATED"}