{"imdbID":"tt0026714","Title":"A Midsummer Night's Dream","Year":"1935","Country":"USA","Language":"English","Production_Co":"Warner Bros. ","Runtime":"133 min | 117 min (edited) | 142 min (with overture and exit music)","Cast":"Ian Hunter, Verree Teasdale, Hobart Cavanaugh, Dick Powell, Ross Alexander, Olivia de Havilland, Jean Muir, Grant Mitchell, Frank McHugh, Dewey Robinson, James Cagney, Joe E. Brown, Hugh Herbert, Otis Harlan, Arthur Treacher","Plot":"Theseus, Duke of Athens, is going to marry Hyppolyta, Queen of the Amazons. Demetrius is engaged with Hermia, but Hermia loves Lysander. Helena loves Demetrius. Oberon and Titania, of the ... See full summary » Theseus, Duke of Athens, is going to marry Hyppolyta, Queen of the Amazons. Demetrius is engaged with Hermia, but Hermia loves Lysander. Helena loves Demetrius. Oberon and Titania, of the kingdom of fairies have a slight quarrel about whether or not the boy Titania is raising will join Titania's band or Oberon's, so Oberon tries to get him from her by using some magic. But they're not alone in that forest.Lysander and Hermina have there a rendezvous, Helena and Demetrius are there, too as well as some actors, who are practicing a play for the ongoing wedding of Theseus and Hippolyta. Due to some misunderstandings by Puck, the whole thing becomes a little bit confused... Written by Stephan Eichenberg <eichenbe@fak-cbg.tu-muenchen.de>","Genre":"Comedy, Fantasy, Romance","Keywords":"love, queen, play, magic, wedding","imdbRating":"7.1","imdbVotes":"2,206","Awards":"Won 2 Oscars. Another 2 nominations.","Metascore":"","Released":"30 October 1935 (USA) ","Location":"Stage 11, Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA ","Actors":"James Cagney, Dick Powell, Ian Hunter ","Director":"William Dieterle, Max Reinhardt","Writer":"William Shakespeare (by), Charles Kenyon (arranged for the screen by) | 1 more credit »","Running_time":"PT133M / 2h 13min","Description":"Directed by William Dieterle, Max Reinhardt.  With James Cagney, Dick Powell, Ian Hunter, Verree Teasdale. Theseus, Duke of Athens, is going to marry Hyppolyta, Queen of the Amazons. Demetrius is engaged with Hermia, but Hermia loves Lysander. Helena loves Demetrius. Oberon and Titania, of the kingdom of fairies have a slight quarrel about whether or not the boy Titania is raising will join Titania's band or Oberon's, so Oberon tries to get him from her by using some magic. But they're not alone in ...","Rated":"APPROVED"}