{"imdbID":"tt0067093","Title":"Fiddler on the Roof","Year":"1971","Director":"Norman Jewison","Country":"USA","Language":"English, Hebrew, Russian","Budget":"$9,000,000 (estimated)","Gross":"$50,000,000 (USA)","Production_Co":"Mirisch Production Company, The, Cartier Productions ","Runtime":"181 min","Cast":"Topol, Norma Crane, Leonard Frey, Molly Picon, Paul Mann, Rosalind Harris, Michele Marsh, Neva Small, Paul Michael Glaser, Ray Lovelock, Elaine Edwards, Candy Bonstein, Shimen Ruskin, Zvee Scooler, Louis Zorich","Plot":"In prerevolutionary Russia, a Jewish peasant contends with marrying off three of his daughters while growing antisemitic sentiment threatens his village. At the beginning of the twentieth century, Jews and Orthodox Christians live in the little village of Anatevka in the pre-revolutionary Russia of the Czars. Among the traditions of the Jewish community, the matchmaker arranges the match and the father approves it. The milkman Reb Tevye is a poor man that has been married for twenty-five years with Golde and they have five daughters. When the local matchmaker Yente arranges the match between his older daughter Tzeitel and the old widow butcher Lazar Wolf, Tevye agrees with the wedding. However Tzeitel is in love with the poor tailor Motel Kamzoil and they ask permission to Tevye to get married that he accepts to please his daughter. Then his second daughter Hodel (Michele Marsh) and the revolutionary student Perchik decide to marry each other and Tevye is forced to accept. When Perchik is arrested by the Czar troops and sent to Siberia, Hodel decides to leave her family and homeland and travel to Siberia to be with her beloved Perchik.... Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Drama, Family, Musical","Keywords":"tradition versus modernity, jewish, tradition, immigration, pogrom","imdbRating":"8.0","imdbVotes":"28,983","Awards":"Won 3 Oscars. Another 6 wins & 13 nominations.","Metascore":"","Released":"3 November 1971 (USA) ","Location":"Gorica, Croatia ","Actors":"Topol, Norma Crane, Leonard Frey ","Writer":"Sholom Aleichem (adapted from stories) (as Sholem Aleichem), Arnold Perl (adapted from Sholem Aleichem stories by special arrangement with) | 2 more credits »","Running_time":"PT181M / 3h 1min","Description":"Directed by Norman Jewison.  With Topol, Norma Crane, Leonard Frey, Molly Picon. In prerevolutionary Russia, a Jewish peasant contends with marrying off three of his daughters while growing antisemitic sentiment threatens his village.","Rated":"G"}