{"imdbID":"tt0084805","Title":"Tootsie","Year":"1982","Director":"Sydney Pollack","Country":"USA","Language":"English","Budget":"$22,000,000 (estimated)","Gross":"$177,200,000 (USA)","Production_Co":"Columbia Pictures Corporation, Mirage Enterprises, Punch Productions ","Runtime":"116 min","Cast":"Dustin Hoffman, Jessica Lange, Teri Garr, Dabney Coleman, Charles Durning, Bill Murray, Sydney Pollack, George Gaynes, Geena Davis, Doris Belack, Ellen Foley, Peter Gatto, Lynne Thigpen, Ronald L. Schwary, Debra Mooney","Plot":"Michael Dorsey, an unsuccessful actor, disguises himself as a woman in order to get a role on a trashy hospital soap. Michael Dorsey is an unemployed actor with an impossible reputation. In order to find work and fund his friend's play he dresses as a woman, Dorothy Michaels, and lands the part in a daytime drama. Dorsey loses himself in this woman role and essentially becomes Dorothy Michaels, captivating women all around the city and inspiring them to break free from the control of men and become more like Dorsey's initial identity. This newfound role, however, lands Dorsey in a hot spot between a female friend/'lover,' a female co-star he falls in love with, that co-star's father who falls in love with him, and a male co-star who yearns for his affection. Written by Bryan Kuniyoshi","Genre":"Comedy, Drama, Romance","Keywords":"actor, love, friend, reputation, actress","imdbRating":"7.4","imdbVotes":"75,495","Awards":"Won 1 Oscar. Another 24 wins & 29 nominations.","Metascore":"87","Released":"17 December 1982 (USA) ","Location":"Hurley Mountain Inn, Hurley, New York, USA ","Actors":"Dustin Hoffman, Jessica Lange, Teri Garr ","Writer":"Larry Gelbart (screenplay), Murray Schisgal (screenplay) | 2 more credits »","Running_time":"PT116M / 1h 56min","Description":"Directed by Sydney Pollack.  With Dustin Hoffman, Jessica Lange, Teri Garr, Dabney Coleman. Michael Dorsey, an unsuccessful actor, disguises himself as a woman in order to get a role on a trashy hospital soap.","Rated":"PG"}