{"imdbID":"tt0053796","Title":"The Entertainer","Year":"1960","Director":"Tony Richardson","Country":"UK","Language":"English","Production_Co":"Woodfall Film Productions ","Runtime":"96 min | 105 min (TCM print)","Cast":"Laurence Olivier, Brenda de Banzie, Roger Livesey, Joan Plowright, Alan Bates, Daniel Massey, Albert Finney, Shirley Anne Field, Thora Hird, Miriam Karlin, Geoffrey Toone, MacDonald Hobley, Anthony Oliver, Max Bacon, George Doonan","Plot":"Archie Rice, an old-time British music hall performer sinking into final defeat, schemes to stay in show business. On the far side of middle age, Archie Rice lives in a British seaside resort with his father, retired successful vaudevillian Billy Rice, second wife Phoebe Rice, and doting son Frank Rice. Following in retired Billy's footsteps, Archie is a song-and-dance music hall headliner, with Frank supporting his dad as his shows' stage manager. The waning popularity of Archie's type of shows, a dying form of entertainment, is not helped by Archie's stale second rate material, which brings in small unappreciative crowds. Archie clings to his long held lifestyle, including heavy drinking and chronic infidelity, of which Phoebe is aware. What Archie has not told his offspring is that Phoebe was his mistress while he was still married to their now deceased mother. His want to be a music hall headliner is despite his financial problems, he an undischarged bankrupt who now signs Phoebe's name to everything. Phoebe wants them to escape this life to something more stable, such as the offer from her ... Written by Huggo","Genre":"Drama","Keywords":"british new wave, family relationships, dysfunctional family, washed up star, self destruction","imdbRating":"7.2","imdbVotes":"1,984","Awards":"Nominated for 1 Oscar. Another 1 win & 4 nominations.","Metascore":"","Released":"2 December 1960 (Denmark) ","Location":"Alhambra Theatre, Morecambe, Lancashire, England, UK ","Actors":"Laurence Olivier, Brenda de Banzie, Roger Livesey ","Writer":"John Osborne (play), John Osborne (screenplay) | 1 more credit »","Running_time":"PT96M / 1h 36min","Description":"Directed by Tony Richardson.  With Laurence Olivier, Brenda de Banzie, Roger Livesey, Joan Plowright. Archie Rice, an old-time British music hall performer sinking into final defeat, schemes to stay in show business.","Rated":"N/A"}