{"imdbID":"tt0080120","Title":"The Warriors","Year":"1979","Director":"Walter Hill","Taglines":"These are the Armies of The Night. They are 60,000 strong. They outnumber the cops three to one. They could run New York City. Tonight they're all out to get the Warriors. ","Country":"USA","Language":"English","Also_Known_As":"Les guerriers de la nuit ","Gross":"SEK 6,309,835 (Sweden)","Production_Co":"Paramount Pictures ","Runtime":"92 min","Sound_Mix":"Mono","Color":"Color","Aspect_Ratio":"1.78 : 1","Trivia":"Debut American film of American actress Mercedes Ruehl who plays a policewoman. The movie was though actually the second feature film for Ruehl whose one previous picture had been the Brazilian movie Dona Flor and Her Two Husbands (1976). See more »","Goofs":"In the Warriors showdown with the subway gang, the \"Punks,\" the fight takes place in a station bathroom containing a long row of wooden enclosing stalls. At several points during the fight scene, members of the Punks are thrown into the stall walls or through doors. Looking at the destruction of the structures, you can see that the wood was all pre-cut to breakaway easily and completely. See more »","Crazy_Credits":"In the original version, the end credits are followed by 3 minutes of black screen as the Joe Walsh song \"In the City\" plays. See more »","Cast":"Michael Beck, James Remar, Dorsey Wright, Brian Tyler, David Harris, Tom McKitterick, Marcelino Sánchez, Terry Michos, Deborah Van Valkenburgh, Roger Hill, David Patrick Kelly, Lynne Thigpen, Ginny Ortiz, Mercedes Ruehl, John Snyder","Plot":"In 1979 a charismatic leader summons the street gangs of New York City in a bid to take it over. When he is killed, The Warriors are falsely blamed and now must fight their way home while every other gang is hunting them down to kill them. Cyrus, the leader of the most powerful gang in New York City, the Gramercy Riffs, calls a midnight summit for all the area gangs, with all asked to send nine unarmed representatives for the conclave. A gang called The Warriors are blamed for killing Cyrus as he gives his speech. They now have to cross the territory of rivals in order to get to their own 'hood. The Warriors slowly cross the dangerous Bronx and Manhattan territories, narrowly escaping police and other gangs every step of the way. Written by Anthony Pereyra {hypersonic91@yahoo.com}","Genre":"Action, Thriller","Keywords":"warrior, night, fight, new york city, police","imdbRating":"7.7","imdbVotes":"69,644","Awards":"","Metascore":"","Released":"9 February 1979 (USA) ","Location":"Breezy Point, Queens, New York City, New York, USA ","Actors":"Michael Beck, James Remar, Dorsey Wright ","Writer":"Sol Yurick (novel), David Shaber (screenplay) | 1 more credit »","Running_time":"PT92M / 1h 32min","Description":"Directed by Walter Hill.  With Michael Beck, James Remar, Dorsey Wright, Brian Tyler. In 1979 a charismatic leader summons the street gangs of New York City in a bid to take it over. When he is killed, The Warriors are falsely blamed and now must fight their way home while every other gang is hunting them down to kill them.","Rated":"R"}