{"imdbID":"tt0032181","Title":"Abe Lincoln in Illinois","Year":"1940","Director":"John Cromwell","Country":"USA","Language":"English","Production_Co":"Max Gordon Plays & Pictures Corporation, RKO Pictures ","Runtime":"110 min","Cast":"Raymond Massey, Gene Lockhart, Ruth Gordon, Mary Howard, Minor Watson, Alan Baxter, Harvey Stephens, Howard Da Silva, Dorothy Tree, Aldrich Bowker, Maurice Murphy, Louis Jean Heydt, Clem Bevans, Harlan Briggs, Herbert Rudley","Plot":"Humble Abraham Lincoln gains the respect of his Illinois neighbors, growing in stature and respect until he is elected President in 1860 and departs for Washington. Biopic of Abe Lincoln, 16th President of he United States, from his early days in backwoods Kentucky to his election as President. After a time running livestock to New Orleans, he settles in New Salem where he meets and falls in love with Ann Rutledge who is already engaged to someone. Abe makes a home for himself in New Salem, eventually running a store and becoming the postmaster. He's popular with the locals and is eventually elected to the State legislature but afterward established himself in the practice of law. He eventually meets Mary Todd who would become his wife and and is sent to Washington as a Congressman before he is elected president. Written by garykmcd","Genre":"Biography, Drama, History","Keywords":"president, kentucky, election, 1860s, illinois","imdbRating":"7.5","imdbVotes":"1,257","Awards":"Nominated for 2 Oscars.","Metascore":"","Released":"19 April 1940 (USA) ","Location":"Eugene, Oregon, USA ","Actors":"Raymond Massey, Gene Lockhart, Ruth Gordon ","Writer":"Robert E. Sherwood (by), Robert E. Sherwood (screen play) | 1 more credit »","Running_time":"PT110M / 1h 50min","Description":"Directed by John Cromwell.  With Raymond Massey, Gene Lockhart, Ruth Gordon, Mary Howard. Humble Abraham Lincoln gains the respect of his Illinois neighbors, growing in stature and respect until he is elected President in 1860 and departs for Washington.","Rated":"APPROVED"}