{"imdbID":"tt0070735","Title":"The Sting","Year":"1973","Director":"George Roy Hill","Writer":"David S. Ward","Taglines":"Recapture \"the STING Experience\". REMEMBER HOW GOOD THE FEEL WAS THE FIRST TIME (re-release) ","Certificate":"See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Der Clou ","Budget":"$5,500,000 (estimated)","Gross":"$159,600,000 (USA)","Production_Co":"Zanuck/Brown Productions, Universal Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"129 min","Sound_Mix":"Mono (Westrex Recording System)","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Sterling Hayden turned down the role of Doyle Lonnegan because he didn't want to shave his beard off. See more »","Goofs":"Radically changing shadows throughout the scene where Hooker and Coleman fools the courier. See more »","Crazy_Credits":"The opening animated logo for Universal Pictures is in 1930s style, matching the movie's setting, instead of the 1970s version. See more »","Cast":"Paul Newman, Robert Redford, Robert Shaw, Charles Durning, Ray Walston, Eileen Brennan, Harold Gould, John Heffernan, Dana Elcar, Jack Kehoe, Dimitra Arliss, Robert Earl Jones, James Sloyan, Charles Dierkop, Lee Paul","Plot":"In Chicago in September 1936, a young con man seeking revenge for his murdered partner teams up with a master of the big con to win a fortune from a criminal banker. When a mutual friend is killed by a mob boss, two con men, one experienced and one young try to get even by pulling off the big con on the mob boss. The story unfolds with several twists and last minute alterations. Written by John Vogel <jlvogel@comcast.net>","Genre":"Comedy, Crime, Drama","Keywords":"con, con man, long con, murder, courier","imdbRating":"8.3","imdbVotes":"168,649","Awards":"Won 7 Oscars. Another 10 wins & 6 nominations.","Metascore":"","Released":"26 December 1973 (UK) ","Location":"Hugus Alley, Pasadena, California, USA ","Actors":"Paul Newman, Robert Redford, Robert Shaw ","Running_time":"PT129M / 2h 9min","Description":"Directed by George Roy Hill.  With Paul Newman, Robert Redford, Robert Shaw, Charles Durning. In Chicago in September 1936, a young con man seeking revenge for his murdered partner teams up with a master of the big con to win a fortune from a criminal banker.","Rated":"N/A"}