{"imdbID":"tt0051658","Title":"Gigi","Year":"1958","Director":"Vincente Minnelli","Country":"USA","Language":"English, French","Budget":"$3,319,355 (estimated)","Production_Co":"Metro-Goldwyn-Mayer (MGM), Arthur Freed Production ","Runtime":"115 min (Turner library print) (copyright length)","Cast":"Leslie Caron, Maurice Chevalier, Louis Jourdan, Hermione Gingold, Eva Gabor, Jacques Bergerac, Isabel Jeans, John Abbott","Plot":"Weary of the conventions of Parisian society, a rich playboy and a youthful courtesan-in-training enjoy a platonic friendship, but it may not stay platonic for long. Weary of the conventions of Parisian society, a rich playboy and a youthful courtesan-in-training enjoy a platonic friendship, but it may not stay platonic for long. Gaston, the scion of a wealthy Parisian family finds emotional refuge from the superficial lifestyle of upper class Parisian 1900s society with the former mistress of his uncle and her outgoing, tomboy granddaughter, Gigi. When Gaston becomes aware that Gigi has matured into a woman, her grandmother and aunt, who have educated Gigi to be a wealthy man's mistress, urge the pair to act out their roles but love adds a surprise twist to this delightful turn-of-the 20th century Cinderella story. Written by Anonymous","Genre":"Comedy, Musical, Romance","Keywords":"parisian, playboy, 1900s, ingenue, cooking","imdbRating":"6.9","imdbVotes":"14,134","Awards":"Won 9 Oscars. Another 12 wins & 9 nominations.","Metascore":"","Released":"4 August 1958 (Brazil) ","Location":"Auberge de la Moutière - 14 Rue Moutière, Montfort-l'Amaury, Yvelines, France ","Actors":"Leslie Caron, Maurice Chevalier, Louis Jourdan ","Writer":"Alan Jay Lerner (screen play), Colette (based on the novella by)","Running_time":"PT115M / 1h 55min","Description":"Directed by Vincente Minnelli.  With Leslie Caron, Maurice Chevalier, Louis Jourdan, Hermione Gingold. Weary of the conventions of Parisian society, a rich playboy and a youthful courtesan-in-training enjoy a platonic friendship, but it may not stay platonic for long.","Rated":"APPROVED"}