{"imdbID":"tt0055146","Title":"The Mark","Year":"1961","Director":"Guy Green","Country":"UK","Language":"English, French","Production_Co":"Buckman, Raymond Stross Productions, Twentieth Century Fox Film Corporation ","Runtime":"127 min","Cast":"Stuart Whitman, Brenda de Banzie, Maurice Denham, Bandana Das Gupta, Donald Wolfit, Maria Schell, Paul Rogers, Rod Steiger, Eddie Byrne, Harry Baird, Al Mulock, Anne Monaghan, Bill Foley, Marie Devereux, Josephine Frayne","Plot":"A man who served prison time for intent to molest a child tries to build a new life with the help of a sympathetic psychiatrist. This is the story of a 33 year old man, Jim Fuller, released from prison after serving a three year term for intent to commit child molestation. Fuller is assisted by the prison psychiatrist in obtaining a position. He does well in this position and falls in love with the secretary of the owner of the company. A child is molested and beaten in the town where he now lives and the police pick him up for questioning. He has an alibi and is released, but a reporter who covered his former trial recognizes him. The reporter begins to follow him and reports that Fuller spent time alone with the daughter of his girl friend. Written by Dennis Beaman <dbeaman@cwnet.com>","Genre":"Drama","Keywords":"prison, secretary, reporter, psychiatrist, flashback","imdbRating":"7.5","imdbVotes":"507","Awards":"Nominated for 1 Oscar. Another 1 win & 1 nomination.","Metascore":"","Released":"8 June 1961 (West Germany) ","Location":"Ardmore Studios, Herbert Road, Bray, County Wicklow, Ireland","Actors":"Maria Schell, Stuart Whitman, Rod Steiger ","Writer":"Charles E. Israel (novel) (as Charles Israel), Sidney Buchman (screenplay) | 1 more credit »","Running_time":"PT127M / 2h 7min","Description":"Directed by Guy Green.  With Maria Schell, Stuart Whitman, Rod Steiger, Brenda de Banzie. A man who served prison time for intent to molest a child tries to build a new life with the help of a sympathetic psychiatrist.","Rated":"APPROVED"}