{"imdbID":"tt0068327","Title":"Cabaret","Year":"1972","Director":"Bob Fosse","Country":"USA","Language":"English, German, Hebrew, French","Budget":"$6,000,000 (estimated)","Gross":"$42,765,000 (USA)","Production_Co":"Allied Artists Pictures, ABC Pictures, Feuer and Martin Production, A ","Runtime":"124 min","Cast":"Liza Minnelli, Michael York, Helmut Griem, Joel Grey, Fritz Wepper, Marisa Berenson, Elisabeth Neumann-Viertel, Helen Vita, Sigrid von Richthofen, Gerd Vespermann, Ralf Wolter, Georg Hartmann, Ricky Renée, Estrongo Nachama, Kathryn Doby","Plot":"A female girlie club entertainer in Weimar Republic era Berlin romances two men while the Nazi Party rises to power around them. Cambridge University student Brian Roberts arrives in Berlin in 1931 to complete his German studies. Without much money, he plans on making a living teaching English while living in an inexpensive rooming house, where he befriends another of the tenants, American Sally Bowles. She is outwardly a flamboyant, perpetually happy person who works as a singer at the decadent Kit Kat Klub, a cabaret styled venue. Sally's outward façade is matched by that of the Klub, overseen by the omnipresent Master of Ceremonies. Sally draws Brian into her world, and initially wants him to be one of her many lovers, until she learns that he is a homosexual, albeit a celibate one. Among their other friends are his students, the poor Fritz Wendel, who wants to be a gigolo to live a comfortable life, and the straight-laced and beautiful Natalia Landauer, a Jewish heiress. Fritz initially sees Natalia as his money ticket, but eventually falls for her. However Natalia is suspect of his motives and cannot ... Written by Huggo","Genre":"Drama, Musical","Keywords":"cabaret, 1930s, nazi, master of ceremonies, jewish","imdbRating":"7.9","imdbVotes":"35,427","Awards":"Won 8 Oscars. Another 27 wins & 15 nominations.","Metascore":"80","Released":"13 February 1972 (USA) ","Location":"Beigarten, Bavaria, Germany ","Actors":"Liza Minnelli, Michael York, Helmut Griem ","Writer":"Joe Masteroff (based on the musical play \"Cabaret\" book by), John Van Druten (based on the play by) | 2 more credits »","Running_time":"PT124M / 2h 4min","Description":"Directed by Bob Fosse.  With Liza Minnelli, Michael York, Helmut Griem, Joel Grey. A female girlie club entertainer in Weimar Republic era Berlin romances two men while the Nazi Party rises to power around them.","Rated":"PG"}