{"imdbID":"tt0080684","Title":"Star Wars: Episode V - The Empire Strikes Back","Year":"1980","Director":"Irvin Kershner","Taglines":"The Adventure Continues... ","Country":"USA","Language":"English","Also_Known_As":"El imperio contraataca ","Budget":"$18,000,000 (estimated)","Opening_Weekend":"ITL 609,584,000 (Italy) (11 April 1997)","Gross":"$290,158,751 (USA) (9 May 1997)","Production_Co":"Lucasfilm ","":"Show detailed company contact information on IMDbPro »","Runtime":"124 min | 127 min (special edition)","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby (35 mm prints)","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Harold Weed, an ILM staffer who assisted in designing the Wampa costume for the Special Edition, was cast as the Wampa for the film after he was used as the model for the costume. As he is 6 feet tall, the ice cave set for the re shoots was built with a height of 4 1/2 to 5 feet to create the illusion of the Wampa being closer to 8 or 9 feet in height. See more »","Goofs":"After Luke cuts off the Wampa's arm he begins to stagger out of the cave into the snow, deactivating his lightsaber as he goes. The sound of the saber deactivating occurs but the saber is still completely active. See more »","Crazy_Credits":"In the alternate DVD version, the Emperor is still credited as being voiced by Clive Revill, despite his performance being replaced by Ian McDiarmid. See more »","Cast":"Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, Anthony Daniels, David Prowse, Peter Mayhew, Kenny Baker, Frank Oz, Alec Guinness, Jeremy Bulloch, John Hollis, Jack Purvis, Des Webb, Clive Revill","Plot":"After the rebels have been brutally overpowered by the Empire on their newly established base, Luke Skywalker takes advanced Jedi training with Master Yoda, while his friends are pursued by Darth Vader as part of his plan to capture Luke. After the Rebel base on the icy planet Hoth is taken over by the Empire, Han, Leia, Chewbacca, and C-3PO flee across the galaxy from the Empire. Luke travels to the forgotten planet of Dagobah to receive training from the Jedi master Yoda, while Vader endlessly pursues him.","Genre":"Action, Adventure, Fantasy","Keywords":"rescue, famous twist, rebel, duel, snowy landscape","imdbRating":"8.8","imdbVotes":"797,706","Awards":"Won 1 Oscar. Another 15 wins & 18 nominations.","Metascore":"79","Released":"20 June 1980 (USA) ","Location":"Banks, Oregon, USA ","Actors":"Mark Hamill, Harrison Ford, Carrie Fisher ","Writer":"Leigh Brackett (screenplay), Lawrence Kasdan (screenplay) | 1 more credit »","Running_time":"PT124M / 2h 4min","Description":"Directed by Irvin Kershner.  With Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams. After the rebels have been brutally overpowered by the Empire on their newly established base, Luke Skywalker takes advanced Jedi training with Master Yoda, while his friends are pursued by Darth Vader as part of his plan to capture Luke.","Rated":"PG"}