{"imdbID":"tt0032976","Title":"Rebecca","Year":"1940","Director":"Alfred Hitchcock","Taglines":"The MOST GLAMOROUS WOMAN of All Time! ","Certificate":"Not Rated | See all certifications »","Country":"USA","Language":"English, French","Also_Known_As":"Rebeka ","Budget":"$1,288,000 (estimated)","Production_Co":"Selznick International Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"130 min","Sound_Mix":"Mono (Western Electric Noiseless Recording)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Alfred Hitchcock wanted to make this film several years before but was unable to afford the rights to the novel. See more »","Goofs":"Twice during the movie, Maxim leaves Manderley to travel to London, once by train and another by car. On each occasion, he manages to get back before dark. Manderley is in Cornwall, as far from London as you can get, and even with 21st century roads, cars and trains, that feat would be impossible. This error is copied from the novel. See more »","Crazy_Credits":"The original 1940 credits read \"Selznick International presents its picturization of Daphne Du Maurier's 'Rebecca'\". The credits on the re-issue version read \"The Selznick Studio presents its production of Daphne Du Maurier's 'Rebecca'\". See more »","Cast":"Laurence Olivier, Joan Fontaine, George Sanders, Judith Anderson, Nigel Bruce, Reginald Denny, C. Aubrey Smith, Gladys Cooper, Florence Bates, Melville Cooper, Leo G. Carroll, Leonard Carey, Lumsden Hare, Edward Fielding, Philip Winter","Plot":"A self-conscious bride is tormented by the memory of her husband's dead first wife. A shy ladies' companion, staying in Monte Carlo with her stuffy employer, meets the wealthy Maxim de Winter. She and Max fall in love, marry and return to Manderley, his large country estate in Cornwall. Max is still troubled by the death of his first wife, Rebecca, in a boating accident the year before. The second Mrs. de Winter clashes with the housekeeper, Mrs. Danvers, and discovers that Rebecca still has a strange hold on everyone at Manderley. Written by Col Needham <col@imdb.com>","Genre":"Drama, Film-Noir, Mystery","Keywords":"love, housekeeper, estate, death, monte carlo","imdbRating":"8.2","imdbVotes":"84,130","Awards":"Won 2 Oscars. Another 2 wins & 10 nominations.","Metascore":"","Released":"12 April 1940 (USA) ","Location":"Big Sur, California, USA ","Actors":"Laurence Olivier, Joan Fontaine, George Sanders ","Writer":"Daphne Du Maurier (celebrated novel), Robert E. Sherwood (screen play) | 3 more credits »","Running_time":"PT130M / 2h 10min","Description":"Directed by Alfred Hitchcock.  With Laurence Olivier, Joan Fontaine, George Sanders, Judith Anderson. A self-conscious bride is tormented by the memory of her husband's dead first wife.","Rated":"NOT RATED"}