{"imdbID":"tt0023488","Title":"Smilin' Through","Year":"1932","Director":"Sidney Franklin","Country":"USA","Language":"English","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"98 min","Cast":"Norma Shearer, Fredric March, Leslie Howard, O.P. Heggie, Ralph Forbes, Beryl Mercer, Margaret Seddon, Forrester Harvey","Plot":"John has led a solitary life for thirty years since the death of Moonyeen Clare. But now Owens, a close friend, insists that he care for his niece, Kathleen, orphaned when her parents were ... See full summary » John has led a solitary life for thirty years since the death of Moonyeen Clare. But now Owens, a close friend, insists that he care for his niece, Kathleen, orphaned when her parents were lost at sea. Kathleen is five, but the years pass and now she is a young woman who is the image of Moonyeen. Willy wants Kathleen for his wife, but Sparks fly when she meets Kenneth Wayne one dark and stormy night. John is horrified for it was Wayne's father who shot Moonyeen dead on her wedding day and John has never found him or forgiven the family. When Ken goes off to war, John forbids any marriage and Ken agrees, while Kathleen does not. When Ken returns four years later when the war is over, he is crippled. He conceals his condition and makes plans to leave for America. Written by Tony Fontana <tony.fontana@spacebbs.com>","Genre":"Drama, Romance","Keywords":"unrequited love, ghost, world war one, injury, england","imdbRating":"7.0","imdbVotes":"649","Awards":"Nominated for 1 Oscar. Another 1 win.","Metascore":"","Released":"24 September 1932 (USA) ","Location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA","Actors":"Norma Shearer, Fredric March, Leslie Howard ","Writer":"Jane Cowl (play), James B. Fagan (dialogue) (as James Bernard Fagan) | 4 more credits »","Running_time":"PT98M / 1h 38min","Description":"Directed by Sidney Franklin.  With Norma Shearer, Fredric March, Leslie Howard, O.P. Heggie. John has led a solitary life for thirty years since the death of Moonyeen Clare. But now Owens, a close friend, insists that he care for his niece, Kathleen, orphaned when her parents were lost at sea. Kathleen is five, but the years pass and now she is a young woman who is the image of Moonyeen. Willy wants Kathleen for his wife, but Sparks fly when she meets Kenneth Wayne one dark and stormy ...","Rated":"APPROVED"}