{"imdbID":"tt0079417","Title":"Kramer vs. Kramer","Year":"1979","Director":"Robert Benton","Country":"USA","Language":"English","Budget":"$8,000,000 (estimated)","Gross":"$106,300,000 (USA)","Production_Co":"Columbia Pictures ","Runtime":"105 min","Cast":"Dustin Hoffman, Meryl Streep, Jane Alexander, Justin Henry, Howard Duff, George Coe, JoBeth Williams, Bill Moor, Howland Chamberlain, Jack Ramage, Jess Osuna, Nicholas Hormann, Ellen Parker, Shelby Brammer, Carol Nadell","Plot":"Ted Kramer's wife leaves her husband, allowing for a lost bond to be rediscovered between Ted and his son, Billy. But a heated custody battle ensues over the divorced couple's son, deepening the wounds left by the separation. Ted Kramer is a career man for whom his work comes before his family. His wife Joanna cannot take this anymore, so she decides to leave him. Ted is now faced with the tasks of housekeeping and taking care of himself and their young son Billy. When he has learned to adjust his life to these new responsibilities, Joanna resurfaces and wants Billy back. Ted, however, refuses to give him up, so they go to court to fight for the custody of their son. Written by Leon Wolters <wolters@strw.LeidenUniv.nl>","Genre":"Drama","Keywords":"divorce, child custody, custody, marriage, couple","imdbRating":"7.8","imdbVotes":"94,503","Awards":"Won 5 Oscars. Another 32 wins & 23 nominations.","Metascore":"77","Released":"19 December 1979 (USA) ","Location":"Central Park, Manhattan, New York City, New York, USA ","Actors":"Dustin Hoffman, Meryl Streep, Jane Alexander ","Writer":"Avery Corman (from the novel by), Robert Benton (written for the screen by)","Running_time":"PT105M / 1h 45min","Description":"Directed by Robert Benton.  With Dustin Hoffman, Meryl Streep, Jane Alexander, Justin Henry. Ted Kramer's wife leaves her husband, allowing for a lost bond to be rediscovered between Ted and his son, Billy. But a heated custody battle ensues over the divorced couple's son, deepening the wounds left by the separation.","Rated":"PG"}