{"imdbID":"tt0057115","Title":"The Great Escape","Year":"1963","Director":"John Sturges","Taglines":"put a fence in front of these men...and they'll climb it... ","Certificate":"Approved | See all certifications »","Country":"USA","Language":"English, German, French, Russian","Also_Known_As":"El gran escape ","Budget":"$4,000,000 (estimated)","Production_Co":"Mirisch Company, The, Alpha ","":"Show detailed company contact information on IMDbPro »","Runtime":"172 min","Sound_Mix":"4-Track Stereo (Westrex Recording System)| Mono","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The real-life escape was on the night of 24 March 1944, and the ground was snow-covered. The German town near the prison camp, called Neustadt in the film, was really Sagan (now Zagan, Poland). Steve McQueen was born on March 24th. See more »","Goofs":"At the start of the escape sequence Capt. Hilts, the \"cooler king\", is wearing a dark top and white trousers and can easily be seen against the background. It seems implausible to attempt to escape through tunnel dirt in the middle of the night dressed in white. See more »","Cast":"Steve McQueen, James Garner, Richard Attenborough, James Donald, Charles Bronson, Donald Pleasence, James Coburn, Hannes Messemer, David McCallum, Gordon Jackson, John Leyton, Angus Lennie, Nigel Stock, Robert Graf, Jud Taylor","Plot":"Allied P.O.W.s plan for several hundred of their number to escape from a German camp during World War II. Based on a true story, a group of allied escape artist-type prisoners-of-war (POW's) are all put in an 'escape proof' camp. Their leader decides to try to take out several hundred all at once. The first half of the film is played for comedy as the prisoners mostly outwit their jailers to dig the escape tunnel. The second half is high adventure as they use boats and trains and planes to get out of occupied Europe. Written by John Vogel <jlvogel@comcast.net>","Genre":"Adventure, Drama, History","Keywords":"escape, escape attempt, tunnel, digging, prisoner of war","imdbRating":"8.3","imdbVotes":"159,285","Awards":"Nominated for 1 Oscar. Another 2 wins & 7 nominations.","Metascore":"","Released":"4 July 1963 (USA) ","Location":"Bavaria Studios, Bavariafilmplatz 7, Geiselgasteig, Grünwald, Bavaria, Germany ","Actors":"Steve McQueen, James Garner, Richard Attenborough ","Writer":"Paul Brickhill (book), James Clavell (screenplay) | 1 more credit »","Running_time":"PT172M / 2h 52min","Description":"Directed by John Sturges.  With Steve McQueen, James Garner, Richard Attenborough, Charles Bronson. Allied P.O.W.s plan for several hundred of their number to escape from a German camp during World War II.","Rated":"APPROVED"}