{"imdbID":"tt0056541","Title":"Sweet Bird of Youth","Year":"1962","Director":"Richard Brooks","Country":"USA","Language":"English","Production_Co":"Roxbury Productions Inc., Metro-Goldwyn-Mayer (MGM) ","Runtime":"120 min","Cast":"Paul Newman, Geraldine Page, Shirley Knight, Ed Begley, Rip Torn, Mildred Dunnock, Madeleine Sherwood, Philip Abbott, Corey Allen, Barry Cahill, Dub Taylor, James Douglas, Barry Atwater, Charles Arnt, Dorothy Konrad","Plot":"Drifter Chance Wayne returns to his hometown after many years of trying to make it in the movies. Arriving with him is a faded film star he picked up along the way, Alexandra Del Lago. ... See full summary » Drifter Chance Wayne returns to his hometown after many years of trying to make it in the movies. Arriving with him is a faded film star he picked up along the way, Alexandra Del Lago. While trying to get her help to make a screen test, he also finds the time to meet his former girlfriend Heavenly, the daughter of the local politician Tom 'Boss' Finley, who more or less forced him to leave the town many years ago. Written by Mattias Thuresson","Genre":"Drama","Keywords":"politician, party, actor, screen, florida","imdbRating":"7.5","imdbVotes":"5,120","Awards":"Won 1 Oscar. Another 2 wins & 7 nominations.","Metascore":"","Released":"29 May 1962 (Portugal) ","Location":"Malibu, California, USA ","Actors":"Paul Newman, Geraldine Page, Shirley Knight ","Writer":"Tennessee Williams (play), Richard Brooks (written for the screen by)","Running_time":"PT120M / 2h","Description":"Directed by Richard Brooks.  With Paul Newman, Geraldine Page, Shirley Knight, Ed Begley. Drifter Chance Wayne returns to his hometown after many years of trying to make it in the movies. Arriving with him is a faded film star he picked up along the way, Alexandra Del Lago. While trying to get her help to make a screen test, he also finds the time to meet his former girlfriend Heavenly, the daughter of the local politician Tom 'Boss' Finley, who more or less forced him to leave the ...","Rated":"APPROVED"}