{"imdbID":"tt0047478","Title":"Shichinin no samurai","Year":"1954","Director":"Akira Kurosawa","Taglines":"Will Take Its Place With the Seven Greatest Films of All Time! ","Certificate":"See all certifications »","Country":"Japan","Language":"Japanese","Also_Known_As":"Seven Samurai ","Budget":"$2,000,000 (estimated)","Opening_Weekend":"$21,830 (USA) (30 August 2002)","Gross":"$269,061 (USA) (29 August 2003)","Production_Co":"Toho Company ","":"Show detailed company contact information on IMDbPro »","Runtime":"207 min | 160 min (international) | 202 min (2002 re-release) | 150 min (original) | 190 min (1991 re-release) | 158 min (cut) (original) | 203 min (re-release) | 207 min (restored) | 202 min (DVD edition)","Sound_Mix":"Mono | Stereo (re-release prints)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"The simultaneous production of Shichinin no samurai (1954) and Gojira (1954) nearly forced Tôhô Kabushiki Kaisha into bankruptcy. See more »","Goofs":"In the closing moments of the final battle, the bandits fire two musket shots only seconds apart. It is clear from the plot that at that point they possess only one musket. The black powder muskets of the age required much more time to reload. This error was pointed out in the commentary of the deluxe DVD edition. See more »","Cast":"Toshirô Mifune, Takashi Shimura, Keiko Tsushima, Yukiko Shimazaki, Kamatari Fujiwara, Daisuke Katô, Isao Kimura, Minoru Chiaki, Seiji Miyaguchi, Yoshio Kosugi, Bokuzen Hidari, Yoshio Inaba, Yoshio Tsuchiya, Kokuten Kôdô, Eijirô Tôno","Plot":"A poor village under attack by bandits recruits seven unemployed samurai to help them defend themselves. A veteran samurai, who has fallen on hard times, answers a village's request for protection from bandits. He gathers 6 other samurai to help him, and they teach the townspeople how to defend themselves, and they supply the samurai with three small meals a day. The film culminates in a giant battle when 40 bandits attack the village. Written by Colin Tinto <cst@imdb.com>","Genre":"Drama","Keywords":"samurai, battle, japan, 16th century, practice","imdbRating":"8.7","imdbVotes":"220,777","Awards":"Nominated for 2 Oscars. Another 5 wins & 6 nominations.","Metascore":"99","Released":"26 April 1954 (Japan) ","Location":"Japan ","Actors":"Toshirô Mifune, Takashi Shimura, Keiko Tsushima ","Writer":"Akira Kurosawa (screenplay), Shinobu Hashimoto (screenplay) | 1 more credit »","Running_time":"PT207M / 3h 27min","Description":"Directed by Akira Kurosawa.  With Toshirô Mifune, Takashi Shimura, Keiko Tsushima, Yukiko Shimazaki. A poor village under attack by bandits recruits seven unemployed samurai to help them defend themselves.","Rated":"N/A"}