{"imdbID":"tt0065377","Title":"Airport","Year":"1970","Country":"USA","Language":"English, Italian","Budget":"$10,000,000 (estimated)","Gross":"$100,489,150 (USA)","Production_Co":"Universal Pictures, Ross Hunter Productions ","Runtime":"137 min","Cast":"Burt Lancaster, Dean Martin, Jean Seberg, Jacqueline Bisset, George Kennedy, Helen Hayes, Van Heflin, Maureen Stapleton, Barry Nelson, Dana Wynter, Lloyd Nolan, Barbara Hale, Gary Collins, John Findlater, Jessie Royce Landis","Plot":"A bomber on board an airplane, an airport almost closed by snow, and various personal problems of the people involved. This precursor to later \"epic\" 70's disaster films illustrates 12 hours in the lives of the personnel and passengers at the \"Lincoln Airport.\" Endless problems, professional and personal, are thrown at the various personnel responsible for the safe and proper administration of air traffic, airline management and aviation at a major US airport. Take one severe snowstorm, add multiple schedules gone awry, one elderly Trans Global Airlines stowaway, shortages, an aging, meretricious pilot, unreasonable, peevish spouses, manpower issues, fuel problems, frozen runways and equipment malfunctions and you get just a sample of the obstacles faced by weary, disgruntled personnel and passengers at the Lincoln Airport. Toss in one long-suffering pilot's wife, several stubborn men, office politics and romance and one passenger with a bomb and you have the film \"Airport\" from 1970. Written by LA-Lawyer","Genre":"Action, Drama, Thriller","Keywords":"airport, bomb, aviation, airplane, boeing 707","imdbRating":"6.6","imdbVotes":"12,773","Awards":"Won 1 Oscar. Another 3 wins & 19 nominations.","Metascore":"","Released":"5 March 1970 (USA) ","Location":"Minneapolis-Saint Paul International Airport, Minneapolis, Minnesota, USA ","Actors":"Burt Lancaster, Dean Martin, George Kennedy ","Director":"George Seaton, Henry Hathaway (uncredited)","Writer":"Arthur Hailey (from the novel by), George Seaton (written for the screen by)","Running_time":"PT137M / 2h 17min","Description":"Directed by George Seaton, Henry Hathaway.  With Burt Lancaster, Dean Martin, George Kennedy, Jean Seberg. A bomber on board an airplane, an airport almost closed by snow, and various personal problems of the people involved.","Rated":"G"}