{"imdbID":"tt0040795","Title":"Sitting Pretty","Year":"1948","Director":"Walter Lang","Country":"USA","Language":"English","Production_Co":"Twentieth Century Fox Film Corporation ","Runtime":"83 min","Cast":"Robert Young, Maureen O'Hara, Clifton Webb, Richard Haydn, Louise Allbritton, Randy Stuart, Ed Begley, Larry Olsen, John Russell, Betty Lynn, Willard Robertson, Dorothy Adams","Plot":"Tacey and Harry King are a suburban couple with three sons and a serious need of a babysitter. Tacey puts an ad in the paper for a live-in babysitter, and the ad is answered by Lynn ... See full summary » Tacey and Harry King are a suburban couple with three sons and a serious need of a babysitter. Tacey puts an ad in the paper for a live-in babysitter, and the ad is answered by Lynn Belvedere. But when she arrives, she turns out to be a man. And not just any man, but a most eccentric, outrageously forthright genius with seemingly a million careers and experiences behind him. Mr. Belvedere works miracles with the children and the house but the Kings have no idea just what he's doing with his evenings off. And when Harry has to go out of town on a business trip, a nosy parker starts a few ugly rumors. But everything comes out all right in the end thanks to Mr. Belvedere. Written by Kathy Li","Genre":"Comedy","Keywords":"babysitter, mr belvedere, town, house, genius","imdbRating":"7.7","imdbVotes":"1,409","Awards":"Nominated for 1 Oscar. Another 2 wins.","Metascore":"","Released":"April 1948 (USA) ","Location":"Stage 3, 20th Century Fox Studios - 10201 Pico Blvd., Century City, Los Angeles, California, USA","Actors":"Robert Young, Maureen O'Hara, Clifton Webb ","Writer":"F. Hugh Herbert (screen play), Gwen Davenport (novel)","Running_time":"PT83M / 1h 23min","Description":"Directed by Walter Lang.  With Robert Young, Maureen O'Hara, Clifton Webb, Richard Haydn. Tacey and Harry King are a suburban couple with three sons and a serious need of a babysitter. Tacey puts an ad in the paper for a live-in babysitter, and the ad is answered by Lynn Belvedere. But when she arrives, she turns out to be a man. And not just any man, but a most eccentric, outrageously forthright genius with seemingly a million careers and experiences behind him. Mr. Belvedere works ...","Rated":"N/A"}