{"imdbID":"tt0026138","Title":"Bride of Frankenstein","Year":"1935","Director":"James Whale","Taglines":"Coming! Universal's Shiveriest Sensation! ","Certificate":"Not Rated | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Frankenstein Lives Again! ","Budget":"$397,024 (estimated)","Production_Co":"Universal Pictures ","Runtime":"75 min","Sound_Mix":"Mono (Noiseless Western Electric Recording)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"In the scene near the beginning of the film where Dr. Henry Frankenstein is carried into the hall of his castle, you can see a shadow shaped like the Monster looming over him on the back wall. See more »","Goofs":"The bride has far too much hair to fit under the bandages shown before her unveiling. See more »","Crazy_Credits":"In the opening and closing credits, \"The Monster's Mate\" is listed as being played by \" ? \" . Elsa Lanchester is only billed as playing Mary Shelley. See more »","Cast":"Boris Karloff, Colin Clive, Valerie Hobson, Ernest Thesiger, Elsa Lanchester, Gavin Gordon, Douglas Walton, Una O'Connor, E.E. Clive, Lucien Prival, O.P. Heggie, Dwight Frye, Reginald Barlow, Mary Gordon, Anne Darling","Plot":"Mary Shelley reveals the main characters of her novel survived: Dr. Frankenstein, goaded by an even madder scientist, builds his monster a mate. Dr. Frankenstein and his monster both turn out to be alive, not killed as previously believed. Dr. Frankenstein wants to get out of the evil experiment business, but when a mad scientist, Dr. Pretorius, kidnaps his wife, Dr. Frankenstein agrees to help him create a new creature, a woman, to be the companion of the monster. Written by John Oswalt <jao@jao.com>","Genre":"Comedy, Drama, Horror","Keywords":"frankenstein, monster, drowning, violin, experiment","imdbRating":"7.9","imdbVotes":"30,966","Awards":"Nominated for 1 Oscar. Another 2 wins.","Metascore":"","Released":"19 April 1935 (USA) ","Location":"Court of Miracles, Backlot, Universal Studios - 100 Universal City Plaza, Universal City, California, USA ","Actors":"Boris Karloff, Elsa Lanchester, Colin Clive ","Writer":"Mary Shelley (suggested by: the original story written in 1816 by) (as Mary Wollstonecraft Shelley), William Hurlbut (adapted by) | 2 more credits »","Running_time":"PT75M / 1h 15min","Description":"Directed by James Whale.  With Boris Karloff, Elsa Lanchester, Colin Clive, Valerie Hobson. Mary Shelley reveals the main characters of her novel survived: Dr. Frankenstein, goaded by an even madder scientist, builds his monster a mate.","Rated":"NOT RATED"}