{"imdbID":"tt0057012","Title":"Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb","Year":"1964","Director":"Stanley Kubrick","Taglines":"the hot-line suspense comedy","Country":"USA, UK","Language":"English, Russian","Also_Known_As":"Dr. Strangelove ","Budget":"$1,800,000 (estimated)","Production_Co":"Columbia Pictures Corporation, Hawk Films ","":"Show detailed company contact information on IMDbPro »","Runtime":"95 min","Sound_Mix":"Mono (Westrex Recording System)","Color":"Black and White","Aspect_Ratio":"1.66 : 1","Trivia":"Stanley Kubrick: [bathroom] General Turgidson's first scene and General Ripper's final scene take place in bathrooms. See more »","Goofs":"The Air Police Airmen shown are wearing their armbands on the right arm, these should be worn on the left. See more »","Crazy_Credits":"The screenplay title is incorrectly spelled. It reads: 'Base' on the book \"Red Alert\" by Peter George. This is pointed out on the DVD supplement about the making of the film. See more »","Cast":"Peter Sellers, George C. Scott, Sterling Hayden, Keenan Wynn, Slim Pickens, Peter Bull, James Earl Jones, Tracy Reed, Jack Creley, Frank Berry, Robert O'Neil, Glenn Beck, Roy Stephens, Shane Rimmer, Hal Galili","Plot":"An insane general triggers a path to nuclear holocaust that a war room full of politicians and generals frantically try to stop. Paranoid Brigadier General Jack D. Ripper of Burpelson Air Force Base, he believing that fluoridation of the American water supply is a Soviet plot to poison the U.S. populace, is able to deploy through a back door mechanism a nuclear attack on the Soviet Union without the knowledge of his superiors, including the Chair of the Joint Chiefs of Staff, General Buck Turgidson, and President Merkin Muffley. Only Ripper knows the code to recall the B-52 bombers and he has shut down communication in and out of Burpelson as a measure to protect this attack. Ripper's executive officer, RAF Group Captain Lionel Mandrake (on exchange from Britain), who is being held at Burpelson by Ripper, believes he knows the recall codes if he can only get a message to the outside world. Meanwhile at the Pentagon War Room, key persons including Muffley, Turgidson and nuclear scientist and adviser, a former Nazi named Dr. Strangelove, are discussing measures to stop the attack or mitigate its blow-up into an ... Written by Huggo","Genre":"Comedy","Keywords":"general, war room, bomber, u.s. president, doomsday","imdbRating":"8.5","imdbVotes":"330,400","Awards":"Nominated for 4 Oscars. Another 13 wins & 6 nominations.","Metascore":"96","Released":"29 January 1964 (USA) ","Location":"Okaloosa County, Florida, USA ","Actors":"Peter Sellers, George C. Scott, Sterling Hayden ","Writer":"Stanley Kubrick (screenplay), Terry Southern (screenplay) | 2 more credits »","Running_time":"PT95M / 1h 35min","Description":"Directed by Stanley Kubrick.  With Peter Sellers, George C. Scott, Sterling Hayden, Keenan Wynn. An insane general triggers a path to nuclear holocaust that a war room full of politicians and generals frantically try to stop.","Rated":"PG"}