{"imdbID":"tt0074860","Title":"Marathon Man","Year":"1976","Director":"John Schlesinger","Taglines":"A thriller. ","Certificate":"R | See all certifications »","Country":"USA","Language":"English, French, German, Spanish, Yiddish","Also_Known_As":"Der Marathon-Mann ","Gross":"SEK 1,766,051 (Sweden)","Production_Co":"Paramount Pictures ","Runtime":"125 min","Sound_Mix":"Mono | Stereo","Color":"Color (Metrocolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Laurence Olivier plays the character Dr. Christian Szell, based on Dr. Josef Mengele. Two years later, Laurence Olivier acted in The Boys from Brazil (1978), a story about Dr. Mengele (played by Gregory Peck). See more »","Goofs":"In the flashback scene of their father's suicide, the Colt .45 Commander used had its hammer closed after he shot himself. The hammer would have been in the fully cocked position after firing and can only be closed manually. See more »","Crazy_Credits":"The ending credits scroll with Babe's jogging route as a backdrop. See more »","Cast":"Dustin Hoffman, Laurence Olivier, Roy Scheider, William Devane, Marthe Keller, Fritz Weaver, Richard Bright, Marc Lawrence, Allen Joseph, Tito Goya, Ben Dova, Lou Gilbert, Jacques Marin, James Wing Woo, Nicole Deslauriers","Plot":"A graduate history student is unwittingly caught in the middle of an international conspiracy involving stolen diamonds, an exiled Nazi war criminal, and a rogue government agent. In New York, the brother of an infamous Nazi war criminal is killed in a head-on collision with an oil truck. Shortly thereafter, members of a covert U.S. government group called the Division begin being murdered one by one. Meanwhile, graduate student and marathon runner Thomas \"Babe\" Levy researches history as his father, who committed suicide after the Communist witch hunts of the McCarthy era ruined his reputation. When he sees his brother, one Division member, stabbed to death, it is revealed that Christian Szell, the White Angel of Auschwitz, is wrapping up loose ends to smuggle priceless diamonds from the United States. Written by Anthony Hughes <husnock31@hotmail.com>","Genre":"Crime, Thriller","Keywords":"new york, war criminal, nazi, suicide, diamond","imdbRating":"7.5","imdbVotes":"43,299","Awards":"Nominated for 1 Oscar. Another 4 wins & 9 nominations.","Metascore":"","Released":"8 October 1976 (USA) ","Location":"Champs Elysées, Paris 8, Paris, France ","Actors":"Dustin Hoffman, Laurence Olivier, Roy Scheider ","Writer":"William Goldman (screenplay), William Goldman (from: his novel)","Running_time":"PT125M / 2h 5min","Description":"Directed by John Schlesinger.  With Dustin Hoffman, Laurence Olivier, Roy Scheider, William Devane. A graduate history student is unwittingly caught in the middle of an international conspiracy involving stolen diamonds, an exiled Nazi war criminal, and a rogue government agent.","Rated":"R"}