{"imdbID":"tt0032138","Title":"The Wizard of Oz","Year":"1939","Taglines":"9200 living actors in the notable star-studded cast! 68 incredibly magnificent sets! Augmented orchestra of 130 pieces! Chorus of 300 rousing voices! 100 minutes of unforgettable entertainment! (Newspaper ad, 1939). ","Certificate":"Passed | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"El mago de Oz ","Budget":"$2,777,000 (estimated)","Opening_Weekend":"$5,354,311 (USA) (6 November 1998)","Gross":"$22,202,612 (USA) (11 October 2013)","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","":"Show detailed company contact information on IMDbPro »","Runtime":"102 min","Sound_Mix":"Mono (Western Electric Sound System: The Voice of Action)| Dolby Digital (2005 re-issue)","Color":"Black and White (Kansas sequences) (1949 re-release)| Black and White (Kansas sequences) (1955 re-release)| Black and White (Sepiatone)| Color (Technicolor)","Aspect_Ratio":"1.37 : 1","Trivia":"Voted #10 in channel 4's (UK) \"Greatest Family Films.\" See more »","Goofs":"When the house finally lands, the furniture and floors are level, indicating that it landed flat and intact. Yet when we see the exterior after Dorothy has entered Munchkinland, the right end of the house's foundation has nearly broken in half over The Wicked Witch of the East, and the siding has sustained major damage. See more »","Crazy_Credits":"Toto is listed in the end credits as being played by Toto, when he was actually played by a dog named Terry. See more »","Cast":"Judy Garland, Frank Morgan, Ray Bolger, Bert Lahr, Jack Haley, Billie Burke, Margaret Hamilton, Charley Grapewin, Pat Walshe, Clara Blandick, Terry, The Singer Midgets","Plot":"Dorothy Gale is swept away to a magical land in a tornado and embarks on a quest to see the Wizard who can help her return home. In this charming film based on the popular L. Frank Baum stories, Dorothy and her dog Toto are caught in a tornado's path and somehow end up in the land of Oz. Here she meets some memorable friends and foes in her journey to meet the Wizard of Oz who everyone says can help her return home and possibly grant her new friends their goals of a brain, heart and courage. Written by Dale Roloff","Genre":"Adventure, Family, Fantasy","Keywords":"wizard of oz, evil witch, witch, wizard, tornado","imdbRating":"8.1","imdbVotes":"280,749","Awards":"Won 2 Oscars. Another 7 wins & 13 nominations.","Metascore":"100","Released":"25 August 1939 (USA) ","Location":"Culver City, California, USA ","Actors":"Judy Garland, Frank Morgan, Ray Bolger ","Director":"Victor Fleming, George Cukor (uncredited) | 3 more credits »","Writer":"Noel Langley (screenplay), Florence Ryerson (screenplay) | 3 more credits »","Running_time":"PT102M / 1h 42min","Description":"Directed by Victor Fleming, George Cukor, Mervyn LeRoy.  With Judy Garland, Frank Morgan, Ray Bolger, Bert Lahr. Dorothy Gale is swept away to a magical land in a tornado and embarks on a quest to see the Wizard who can help her return home.","Rated":"PASSED"}