{"imdbID":"tt0088846","Title":"Brazil","Year":"1985","Director":"Terry Gilliam","Taglines":"We're all in it together. ","Country":"UK","Language":"English","Also_Known_As":"Бразилия ","Budget":"$15,000,000 (estimated)","Gross":"$9,929,000 (USA)","Production_Co":"Embassy International Pictures ","Runtime":"132 min | 94 min (edited) | 142 min (director's cut)","Sound_Mix":"Dolby","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Working titles for the film included The Ministry, The Ministry of Torture, How I Learned to Live with the System - So Far and So That's Why the Bourgeoisie Sucks See more »","Goofs":"When Sam Lowery first gets into Jill's cab, he says that he is number is D Zed stroke 105 (DZ/105) when in actuality his number is D Zed Stroke 015 (DZ/015) See more »","Crazy_Credits":"The closing shot of Lowry incarcerated humming to himself provides the backdrop for the end credits. See more »","Cast":"Jonathan Pryce, Robert De Niro, Katherine Helmond, Ian Holm, Bob Hoskins, Michael Palin, Ian Richardson, Peter Vaughan, Kim Greist, Jim Broadbent, Barbara Hicks, Charles McKeown, Derrick O'Connor, Kathryn Pogson, Bryan Pringle","Plot":"A bureaucrat in a retro-future world tries to correct an administrative error and himself becomes an enemy of the state. Sam Lowry is a harried technocrat in a futuristic society that is needlessly convoluted and inefficient. He dreams of a life where he can fly away from technology and overpowering bureaucracy, and spend eternity with the woman of his dreams. While trying to rectify the wrongful arrest of one Harry Buttle, Lowry meets the woman he is always chasing in his dreams, Jill Layton. Meanwhile, the bureaucracy has fingered him responsible for a rash of terrorist bombings, and both Sam and Jill's lives are put in danger. Written by Philip Brubaker <coda@nando.net>","Genre":"Drama, Sci-Fi","Keywords":"black comedy, terrorist, bureaucracy, dream, paperwork","imdbRating":"8.0","imdbVotes":"148,055","Awards":"Nominated for 2 Oscars. Another 8 wins & 3 nominations.","Metascore":"88","Released":"18 December 1985 (USA) ","Location":"Croydon, London, England, UK ","Actors":"Jonathan Pryce, Kim Greist, Robert De Niro ","Writer":"Terry Gilliam (screenplay), Tom Stoppard (screenplay) | 1 more credit »","Running_time":"PT132M / 2h 12min","Description":"Directed by Terry Gilliam.  With Jonathan Pryce, Kim Greist, Robert De Niro, Katherine Helmond. A bureaucrat in a retro-future world tries to correct an administrative error and himself becomes an enemy of the state.","Rated":"R"}