{"imdbID":"tt0065088","Title":"They Shoot Horses, Don't They?","Year":"1969","Director":"Sydney Pollack","Country":"USA","Language":"English","Production_Co":"American Broadcasting Company (ABC), Palomar Pictures (I) ","Runtime":"129 min (original) | 120 min (current)","Cast":"Jane Fonda, Michael Sarrazin, Susannah York, Gig Young, Red Buttons, Bonnie Bedelia, Michael Conrad, Bruce Dern, Al Lewis, Robert Fields, Severn Darden, Allyn Ann McLerie, Madge Kennedy, Jacquelyn Hyde, Felice Orlandi","Plot":"The lives of a disparate group of contestants intertwine in an inhumanely grueling dance marathon. Gloria is a young woman of the Depression. She has aged beyond her years and feels her life is hopeless, having been cheated and betrayed many times in her past. While recovering from a suicide attempt, she gets the idea from a movie magazine to head for Hollywood to make it as an actress. Robert is a desperate Hollywood citizen trying to become a director, never doubting he'll make it. Robert and Gloria meet and decide to enter a dance marathon, one of the crazes of the 1930's. The grueling dancing takes its toll on Gloria's already weakened spirit, and she tells Robert that she'd be better off dead, that her life is hopeless - all the while acting cruelly and bitterly, alienating those around her, trying to convince him to shoot her and put her out of her misery. After all, they shoot horses, don't they? Written by alfiehitchie","Genre":"Drama","Keywords":"dance, marathon, contest, dance marathon, hollywood","imdbRating":"7.9","imdbVotes":"11,878","Awards":"Won 1 Oscar. Another 9 wins & 23 nominations.","Metascore":"","Released":"13 August 1970 (Argentina) ","Location":"Santa Monica Pier, Santa Monica, California, USA ","Actors":"Jane Fonda, Michael Sarrazin, Susannah York ","Writer":"Horace McCoy (novel), James Poe (screenplay) | 1 more credit »","Running_time":"PT129M / 2h 9min","Description":"Directed by Sydney Pollack.  With Jane Fonda, Michael Sarrazin, Susannah York, Gig Young. The lives of a disparate group of contestants intertwine in an inhumanely grueling dance marathon.","Rated":"M"}