{"imdbID":"tt0073812","Title":"Tommy","Year":"1975","Director":"Ken Russell","Country":"UK","Language":"English","Budget":"$5,000,000 (estimated)","Gross":"SEK 1,152,866 (Sweden)","Production_Co":"Robert Stigwood Organisation Ltd., Hemdale Film ","Runtime":"111 min","Cast":"Oliver Reed, Ann-Margret, Roger Daltrey, Elton John, Eric Clapton, John Entwistle, Keith Moon, Paul Nicholas, Jack Nicholson, Robert Powell, Pete Townshend, Tina Turner, Arthur Brown, Victoria Russell, Ben Aris","Plot":"A psychosomatically deaf, dumb and blind boy becomes a master pinball player and, subsequently, the object of a religious cult. Nora Walker is told that her British fighter pilot husband is missing in action and presumed killed in World War II. On V.E. Day, Nora gives birth to their son, who she names Tommy. While Tommy is an adolescent, Nora marries Frank, a shifty camp counselor. Shortly thereafter, Tommy suffers an emotionally traumatic experience associated with his father and step-father, which, based on things told to him at that time, results in him becoming deaf, dumb and blind, a situation which several people exploit for their own pleasure. As Nora tries several things to bring Tommy out of his psychosomatic disabilities, Tommy, now a young man, happens upon pinball as a stimulus. Playing by intuition, Tommy becomes a pinball master, which in turn makes him, and by association Nora and Frank, rich and famous. Nora literally shatters Tommy to his awakening, which ultimately leads to both the family's rise and downfall as people initially try to emulate Tommy's path then rebel against it. Written by Huggo","Genre":"Drama, Musical","Keywords":"holiday camp, pinball, murder, cult film, one word title","imdbRating":"6.6","imdbVotes":"14,934","Awards":"Nominated for 2 Oscars. Another 2 wins & 2 nominations.","Metascore":"","Released":"26 March 1975 (UK) ","Location":"Lee International Studios, Kensal Road, Kensal Town, London, England, UK ","Actors":"Roger Daltrey, Ann-Margret, Oliver Reed ","Writer":"The Who (by) (as 'The Who'), Ken Russell (screenplay) | 3 more credits »","Running_time":"PT111M / 1h 51min","Description":"Directed by Ken Russell.  With Roger Daltrey, Ann-Margret, Oliver Reed, Elton John. A psychosomatically deaf, dumb and blind boy becomes a master pinball player and, subsequently, the object of a religious cult.","Rated":"PG"}