{"imdbID":"tt0026174","Title":"Captain Blood","Year":"1935","Director":"Michael Curtiz","Country":"USA","Language":"English, French","Budget":"$1,200,000 (estimated)","Production_Co":"Warner Bros., Cosmopolitan Productions ","Runtime":"119 min | 99 min (re-release)","Cast":"Errol Flynn, Olivia de Havilland, Lionel Atwill, Basil Rathbone, Ross Alexander, Guy Kibbee, Henry Stephenson, Robert Barrat, Hobart Cavanaugh, Donald Meek, Jessie Ralph, Forrester Harvey, Frank McGlynn Sr., Holmes Herbert, David Torrence","Plot":"An enslaved doctor and his comrades in chains escape and become pirates of the Caribbean. Arrested during the Monmouth Rebellion and falsely convicted of treason, Dr. Peter Blood is banished to the West Indies and sold into slavery. In Port Royal, Jamaica the Governor's daughter Arabella Bishop buys him for £10 to spite her uncle, Col. Bishop who owns a major plantation. Life is hard for the men and for Blood as well. By chance he treats the Governor's gout and is soon part of the medical service. He dreams of freedom and when the opportunity strikes, he and his friends rebel taking over a Spanish ship that has attacked the city. Soon, they are the most feared pirates on the seas, men without a country attacking all ships. When Arabella is prisoner, Blood decides to return her to Port Royal only to find that it is under the control of England's new enemy, France. All of them must decide if they are to fight for their new King. Written by garykmcd","Genre":"Action, Adventure","Keywords":"governor, slavery, pirate, escape, friend","imdbRating":"7.8","imdbVotes":"9,580","Awards":"Nominated for 5 Oscars.","Metascore":"","Released":"28 December 1935 (USA) ","Location":"Corona, California, USA ","Actors":"Errol Flynn, Olivia de Havilland, Lionel Atwill ","Writer":"Rafael Sabatini (by), Casey Robinson (screen play)","Running_time":"PT119M / 1h 59min","Description":"Directed by Michael Curtiz.  With Errol Flynn, Olivia de Havilland, Lionel Atwill, Basil Rathbone. An enslaved doctor and his comrades in chains escape and become pirates of the Caribbean.","Rated":"NOT RATED"}