{"imdbID":"tt0061735","Title":"Guess Who's Coming to Dinner","Year":"1967","Director":"Stanley Kramer","Writer":"William Rose","Country":"USA","Language":"English","Budget":"$4,000,000 (estimated)","Gross":"$56,700,000 (USA)","Production_Co":"Columbia Pictures Corporation ","Runtime":"108 min","Cast":"Spencer Tracy, Sidney Poitier, Katharine Hepburn, Katharine Houghton, Cecil Kellaway, Beah Richards, Roy Glenn, Isabel Sanford, Virginia Christine, Alexandra Hay, Barbara Randolph, D'Urville Martin, Tom Heaton, Grace Gaynor, Skip Martin","Plot":"A couple's attitudes are challenged when their daughter introduces them to her African-American fiancé. After a period of vacation in Hawaii, Joanna \"Joey\" Drayton returns to her parents' home in San Francisco bringing her fiancé, the high-qualified Dr. John Prentice, to introduce him to her mother Christina Drayton that owns an art gallery and her father Matt Drayton that is the publisher editor of the newspaper The Guardian. Joey was raised with a liberal education and intends to get married with Dr. John Prentice that is a black widower and needs to fly on that night to Geneva to work with the World Health Organization. Joey invites John's parents Mr. Prentice and Mrs. Prentice to have dinner with her family and the couple flies from Los Angeles to San Francisco without knowing that Joey is white. Christina invites also the liberal Monsignor Ryan, who is friend of her family. Along the day and night, the families discuss the problems of their son and daughter. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Comedy, Drama, Romance","Keywords":"miscegenation, doctor, dinner, world health organization, vacation","imdbRating":"7.8","imdbVotes":"27,700","Awards":"Won 2 Oscars. Another 7 wins & 22 nominations.","Metascore":"","Released":"12 December 1967 (USA) ","Location":"Columbia/Sunset Gower Studios - 1438 N. Gower Street, Hollywood, Los Angeles, California, USA ","Actors":"Spencer Tracy, Sidney Poitier, Katharine Hepburn ","Running_time":"PT108M / 1h 48min","Description":"Directed by Stanley Kramer.  With Spencer Tracy, Sidney Poitier, Katharine Hepburn, Katharine Houghton. A couple's attitudes are challenged when their daughter introduces them to her African-American fiancé.","Rated":"UNRATED"}