{"imdbID":"tt0043014","Title":"Sunset Blvd.","Year":"1950","Director":"Billy Wilder","Taglines":"A HOLLYWOOD STORY: Sensational...Daring...Unforgettable...Sunset Blvd. ","Certificate":"See all certifications »","Country":"USA","Language":"English","Also_Known_As":"El ocaso de una vida ","Budget":"$1,752,000 (estimated)","Production_Co":"Paramount Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"110 min | 104 min (cut)","Sound_Mix":"Mono (Western Electric Recording)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"In 1998, the American Film Institute selected this as the 12th greatest film of the 100 Greatest American Movies of All Time. See more »","Goofs":"The shadow of a camera as it moves in on Norma's bed is visible on Joe's back. See more »","Crazy_Credits":"The Paramount logo appears as a transparency over the opening shot. The words \"Sunset Blvd.\" are shown stenciled on the curb of that street. See more »","Cast":"William Holden, Gloria Swanson, Erich von Stroheim, Nancy Olson, Fred Clark, Lloyd Gough, Jack Webb, Franklyn Farnum, Larry J. Blake, Charles Dayton, Cecil B. DeMille, Hedda Hopper, Buster Keaton, Anna Q. Nilsson, H.B. Warner","Plot":"A hack screenwriter writes a screenplay for a former silent-film star who has faded into Hollywood obscurity. The story, set in '50s Hollywood, focuses on Norma Desmond, a silent-screen goddess whose pathetic belief in her own indestructibility has turned her into a demented recluse. The crumbling Sunset Boulevard mansion where she lives with only her butler, Max who was once her director and husband has become her self-contained world. Norma dreams of a comeback to pictures and she begins a relationship with Joe Gillis, a small-time writer who becomes her lover, that will soon end with murder and total madness. Written by alfiehitchie","Genre":"Drama, Film-Noir","Keywords":"silent film star, butler, silent movie, madness, comeback","imdbRating":"8.5","imdbVotes":"134,055","Awards":"Won 3 Oscars. Another 15 wins & 18 nominations.","Metascore":"","Released":"25 August 1950 (Australia) ","Location":"Bel-Air Country Club - 10768 Bellagio Road, Los Angeles, California, USA ","Actors":"William Holden, Gloria Swanson, Erich von Stroheim ","Writer":"Charles Brackett, Billy Wilder | 1 more credit »","Running_time":"PT110M / 1h 50min","Description":"Directed by Billy Wilder.  With William Holden, Gloria Swanson, Erich von Stroheim, Nancy Olson. A hack screenwriter writes a screenplay for a former silent-film star who has faded into Hollywood obscurity.","Rated":"N/A"}