{"imdbID":"tt0044896","Title":"The Member of the Wedding","Year":"1952","Director":"Fred Zinnemann","Country":"USA","Language":"English","Production_Co":"Stanley Kramer Productions ","Runtime":"93 min","Cast":"Ethel Waters, Julie Harris, Brandon De Wilde, Arthur Franz, Nancy Gates, William Hansen, James Edwards, Harry Bolden, Dickie Moore","Plot":"A young tomboy named Frankie is forced to face her own immaturity as a result her older brother's wedding. In a small Georgia town, twelve year old tomboy Frankie Addams feels unconnected to the world, a fact troubling to her. Her unconventional views for a twelve year old girl make her an outcast among her peers, which she in turn blames for her situation rather than anything of her own doing. Her only real friend is John Henry, her younger next door neighbor, although she doesn't see him as a friend since she doesn't consider him a peer. As her widowed father is all consumed with running his small business, Frankie is largely left to the care of their housekeeper, Berenice. Berenice tries to provide as much true guidance to Frankie and what Frankie considers her problems, although Berenice has her own troubles looking after her wild foster brother, Honey Camden, her only surviving family. In addition, Frankie largely sees Berenice's advice as the rantings of a large, crazy black woman. Frankie believes that she has finally found her place in life upon the return to town and announcement ... Written by Huggo","Genre":"Drama","Keywords":"wedding, friend, tomboy, georgia, housekeeper","imdbRating":"7.1","imdbVotes":"932","Awards":"Nominated for 1 Oscar. Another 1 win.","Metascore":"","Released":"1954 (West Germany) ","Location":"Colusa, California, USA","Actors":"Ethel Waters, Julie Harris, Brandon De Wilde ","Writer":"Edna Anhalt (screenplay), Edward Anhalt (screenplay) | 2 more credits »","Running_time":"PT93M / 1h 33min","Description":"Directed by Fred Zinnemann.  With Ethel Waters, Julie Harris, Brandon De Wilde, Arthur Franz. A young tomboy named Frankie is forced to face her own immaturity as a result her older brother's wedding.","Rated":"TV-G"}