{"imdbID":"tt0093713","Title":"Pelle the Conqueror","Year":"1987","Director":"Bille August","Country":"Denmark, Sweden","Language":"Scanian, Danish, Swedish","Gross":"$2,053,931 (USA)","Production_Co":"Per Holst Filmproduktion, Svensk Filmindustri (SF), Odyssey Entertainment ","Runtime":"157 min","Cast":"Pelle Hvenegaard, Max von Sydow, Erik Paaske, Björn Granath, Astrid Villaume, Axel Strøbye, Troels Asmussen, Kristina Törnqvist, Karen Wegener, Sofie Gråbøl, Lars Simonsen, Buster Larsen, John Wittig, Troels Munk, Nis Bank-Mikkelsen","Plot":"The end of the 19th century. A boat filled with Swedish emigrants comes to the Danish island of Bornholm. Among them are Lasse and his son Pelle who move to Denmark to find work. They find ... See full summary » The end of the 19th century. A boat filled with Swedish emigrants comes to the Danish island of Bornholm. Among them are Lasse and his son Pelle who move to Denmark to find work. They find employment at a large farm, but are treated as the lowest form of life. Pelle starts to speak Danish but is still harassed as a foreigner. But none of them wants to give up their dream of finding a better life than the life they left in Sweden. Written by Mattias Thuresson","Genre":"Drama","Keywords":"19th century, farm, denmark, bornholm, cannes winner","imdbRating":"7.9","imdbVotes":"7,521","Awards":"Won 1 Oscar. Another 21 wins & 7 nominations.","Metascore":"","Released":"21 December 1988 (USA) ","Location":"Bornholm, Denmark ","Actors":"Pelle Hvenegaard, Max von Sydow, Erik Paaske ","Writer":"Martin Andersen Nexø (novel), Bille August (screenplay) | 2 more credits »","Running_time":"PT157M / 2h 37min","Description":"Directed by Bille August.  With Pelle Hvenegaard, Max von Sydow, Erik Paaske, Björn Granath. The end of the 19th century. A boat filled with Swedish emigrants comes to the Danish island of Bornholm. Among them are Lasse and his son Pelle who move to Denmark to find work. They find employment at a large farm, but are treated as the lowest form of life. Pelle starts to speak Danish but is still harassed as a foreigner. But none of them wants to give up their dream of finding a better life ...","Rated":"N/A"}