{"imdbID":"tt0038873","Title":"The Razor's Edge","Year":"1946","Director":"Edmund Goulding","Country":"USA","Language":"English, French","Budget":"$1,200,000 (estimated)","Production_Co":"Twentieth Century Fox Film Corporation ","Runtime":"145 min","Cast":"Tyrone Power, Gene Tierney, John Payne, Anne Baxter, Clifton Webb, Herbert Marshall, Lucile Watson, Frank Latimore, Elsa Lanchester, Fritz Kortner, John Wengraf, Cecil Humphreys, Harry Pilcer, Cobina Wright Sr.","Plot":"An adventuresome young man goes off to find himself and loses his socialite fiancée in the process. But when he returns 10 years later, she will stop at nothing to get him back, even though she is already married. Well-to-do Chicagoan, Larry Darrell, breaks off his engagement to Isabel and travels the world seeking enlightenment, eventually finding his guru India. Isabel marries Gray, and following the crash of 1929, is invited to live in Paris with her rich, social climbing, Uncle Elliot. During a sojurn there, Larry, having attained his goal, is reunited with Isabel. While slumming one night Larry, Isabel and company are shocked to discover Sophie, a friend from Chicago. Having lost her husband and child in a tragic accident, Sophie is living the low-life with the help of drugs and an abusive brute. Larry tries to rehabilitate her, but his efforts are sabotaged by Isabel who tries in vain to reignite Larry's interest in herself. Written by Richard Blinkal <phelam@netcom.com>","Genre":"Drama, Film-Noir","Keywords":"will, uncle, india, engagement, wealthy parent","imdbRating":"7.5","imdbVotes":"3,746","Awards":"Won 1 Oscar. Another 2 wins & 3 nominations.","Metascore":"","Released":"December 1946 (USA) ","Location":"Denver, Colorado, USA ","Actors":"Tyrone Power, Gene Tierney, John Payne ","Writer":"Lamar Trotti (screen play), W. Somerset Maugham (from the novel by)","Running_time":"PT145M / 2h 25min","Description":"Directed by Edmund Goulding.  With Tyrone Power, Gene Tierney, John Payne, Anne Baxter. An adventuresome young man goes off to find himself and loses his socialite fiancée in the process. But when he returns 10 years later, she will stop at nothing to get him back, even though she is already married.","Rated":"APPROVED"}