{"imdbID":"tt0097123","Title":"Crimes and Misdemeanors","Year":"1989","Director":"Woody Allen","Writer":"Woody Allen","Country":"USA","Language":"English, Hebrew","Budget":"$19,000,000 (estimated)","Gross":"$18,254,702 (USA)","Production_Co":"Jack Rollins & Charles H. Joffe Productions ","Runtime":"104 min","Cast":"Bill Bernstein, Martin Landau, Claire Bloom, Stephanie Roth Haberle, Gregg Edelman, George J. Manos, Anjelica Huston, Woody Allen, Jenny Nichols, Joanna Gleason, Alan Alda, Sam Waterston, Zina Jasper, Dolores Sutton, Joel Fogel","Plot":"An ophthalmologist's mistress threatens to reveal their affair to his wife, while a married documentary filmmaker is infatuated by another woman. Judah Rosenthal is an ophthalmologist and a pillar of the community who has a big problem: his mistress Dolores Paley has told him that he is to leave his wife and marry her - as he had promised to do - or she will tell everyone of their affair. When he intercepts a letter Dolores has written to his wife Miriam, he is frantic. He confesses all to his shady brother Jack who assures him that he has friends who can take care of her. Meanwhile, filmmaker Cliff Stern is having his own problems. He's been working on a documentary film for some time but has yet to complete it. He and his wife Wendy have long ago stopped loving one another and are clearly on their way to divorce. He falls in love with Halley Reed who works with a producer, Lester. Cliff soon finds himself making a documentary about Lester and hates every minute of it. Written by garykmcd","Genre":"Comedy, Drama","Keywords":"documentary filmmaker, professor, brother in law, mistress, doctor","imdbRating":"8.0","imdbVotes":"41,645","Awards":"Nominated for 3 Oscars. Another 13 wins & 19 nominations.","Metascore":"77","Released":"3 November 1989 (USA) ","Location":"5th Avenue, Manhattan, New York City, New York, USA ","Actors":"Martin Landau, Woody Allen, Bill Bernstein ","Running_time":"PT104M / 1h 44min","Description":"Directed by Woody Allen.  With Martin Landau, Woody Allen, Bill Bernstein, Claire Bloom. An ophthalmologist's mistress threatens to reveal their affair to his wife, while a married documentary filmmaker is infatuated by another woman.","Rated":"PG-13"}