{"imdbID":"tt0053221","Title":"Rio Bravo","Year":"1959","Director":"Howard Hawks","Taglines":"and Dean and Ricky sing, too! \"Rio Bravo\" \"My Rifle, My Pony and Me\" \"Cindy\" ","Certificate":"Not Rated | See all certifications »","Country":"USA","Language":"English, Spanish","Also_Known_As":"Howard Hawks' Rio Bravo ","Gross":"$5,750,000 (USA)","Production_Co":"Warner Bros., Armada Productions ","Runtime":"141 min","Sound_Mix":"Mono (RCA Sound Recording)","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Montgomery Clift, who was gay and a liberal Democrat, turned down the role of Dude, because he didn't want to work again with John Wayne and Walter Brennan who were both strongly conservative Republicans. They had previously worked together in Red River (1948). Clift suggested his The Young Lions (1958) co-star Dean Martin for the role of Dude, and so Martin's agent immediately approached Howard Hawks with the idea. See more »","Goofs":"During a poker-playing scene, one of the players asks the bartender for a new deck of cards. However, the bartender starts reaching for the new deck before the player asks. See more »","Cast":"John Wayne, Dean Martin, Ricky Nelson, Angie Dickinson, Walter Brennan, Ward Bond, John Russell, Pedro Gonzalez Gonzalez, Estelita Rodriguez, Claude Akins, Malcolm Atterbury, Harry Carey Jr., Sheb Wooley","Plot":"A small-town sheriff in the American West enlists the help of a cripple, a drunk, and a young gunfighter in his efforts to hold in jail the brother of the local bad guy. Sheriff John T. Chance has his hands full after arresting Joe Burdette for murder. He knows that Burdette's brother Nathan, a powerful rancher, will go to any lengths to get him out of jail. Chance's good friend Pat Wheeler offers to help but within 20 minutes of making the offer is gunned down in the street, shot in the back. That leaves his elderly deputy Stumpy, the town drunk Dude - once a deputy and a pretty good shot when he was sober - and a young hand, Colorado, who used to work for Wheeler. Nathan Burdette meanwhile has a couple of dozen men at his disposal. Chance does his best to prepare all the while romancing a pretty gamblers who goes by the name of Feathers. Written by garykmcd","Genre":"Action, Comedy, Drama","Keywords":"deputy, sheriff, cripple, jail, small town","imdbRating":"8.1","imdbVotes":"41,480","Awards":"Won 1 Golden Globe. Another 1 win & 4 nominations.","Metascore":"","Released":"4 April 1959 (USA) ","Location":"Tucson, Arizona, USA ","Actors":"John Wayne, Dean Martin, Ricky Nelson ","Writer":"Jules Furthman (screenplay), Leigh Brackett (screenplay) | 1 more credit »","Running_time":"PT141M / 2h 21min","Description":"Directed by Howard Hawks.  With John Wayne, Dean Martin, Ricky Nelson, Angie Dickinson. A small-town sheriff in the American West enlists the help of a cripple, a drunk, and a young gunfighter in his efforts to hold in jail the brother of the local bad guy.","Rated":"NOT RATED"}