{"imdbID":"tt0057163","Title":"Hud","Year":"1963","Director":"Martin Ritt","Country":"USA","Language":"English","Budget":"$2,500,000 (estimated)","Production_Co":"Paramount Pictures, Salem-Dover Productions ","Runtime":"112 min","Cast":"Paul Newman, Melvyn Douglas, Patricia Neal, Brandon De Wilde, Whit Bissell, Crahan Denton, John Ashley, Val Avery, George Petrie, Curt Conway, Sheldon Allman, Pitt Herbert, Carl Low, Robert Hinkle, Don Kennedy","Plot":"Honest and hard-working Texas rancher Homer Bannon has a conflict with his unscrupulous, selfish, arrogant and egotistical son Hud who sank into alcoholism after accidentally killing his brother in a car crash. Hud Bannon is a ruthless young man who tarnishes everything and everyone he touches. Hud represents the perfect embodiment of alienated youth, out for kicks with no regard for the consequences. There is bitter conflict between the callous Hud and his stern and highly principled father, Homer. Hud's nephew Lon admires Hud's cheating ways, though he soon becomes aware of Hud's reckless amorality to bear him anymore. In the world of the takers and the taken, Hud is a winner. He's a cheat, but, he explains \"I always say the law was meant to be interpreted in a lenient manner.\" Written by alfiehitchie","Genre":"Drama","Keywords":"forename as title, rodeo cowboy, neo western, subjective camera, character's point of view camera shot","imdbRating":"7.9","imdbVotes":"14,978","Awards":"Won 3 Oscars. Another 12 wins & 17 nominations.","Metascore":"","Released":"29 May 1963 (USA) ","Location":"Camp Waldemar - 1005 Ranch Road 1340, Hunt, Texas, USA ","Actors":"Paul Newman, Melvyn Douglas, Patricia Neal ","Writer":"Irving Ravetch (screenplay), Harriet Frank Jr. (screenplay) | 1 more credit »","Running_time":"PT112M / 1h 52min","Description":"Directed by Martin Ritt.  With Paul Newman, Melvyn Douglas, Patricia Neal, Brandon De Wilde. Honest and hard-working Texas rancher Homer Bannon has a conflict with his unscrupulous, selfish, arrogant and egotistical son Hud who sank into alcoholism after accidentally killing his brother in a car crash.","Rated":"APPROVED"}