{"imdbID":"tt0095016","Title":"Die Hard","Year":"1988","Director":"John McTiernan","Taglines":"Suspense, Excitement, Adventure, On every level! ","Certificate":"R | See all certifications »","Country":"USA","Language":"English, German, Italian","Also_Known_As":"Duro de matar ","Budget":"$28,000,000 (estimated)","Gross":"$81,350,242 (USA)","Production_Co":"Twentieth Century Fox Film Corporation, Gordon Company, Silver Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"131 min","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby Stereo (35 mm prints) (4 channels)","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"This was based on a book by Roderick Thorp entitled \"Nothing Lasts Forever\" - a sequel to another book entitled \"The Detective\", which in 1968 was made into a film starring Frank Sinatra. Because of a clause in Sinatra's contract for The Detective (1968) which gave him the right to reprise his role in a sequel, he was actually the first person offered the McClane role, even though he was 73 years old at the time. Also, Coincidentally, Bruce Willis made his movie debut in The First Deadly Sin (1980) walking out of a bar as Sinatra walks into it. See more »","Goofs":"When the SWAT team is trying to break into the front door of the tower they first try picking the lock to no avail. Then we see a SWAT team member carrying a metal cutting torch attempting to cut through the lock. The SWAT team would have just broken the glass to get in and not waste time using a metal cutting torch to cut the door lock. The glass is obviously breakable as shown in the same scene when the terrorists fire upon the SWAT team. See more »","Cast":"Bruce Willis, Bonnie Bedelia, Reginald VelJohnson, Paul Gleason, William Atherton, Hart Bochner, James Shigeta, Alan Rickman, Alexander Godunov, Bruno Doyon, De'voreaux White, Andreas Wisniewski, Clarence Gilyard Jr., Joey Plewa, Lorenzo Caccialanza","Plot":"John McClane, officer of the NYPD, tries to save his wife Holly Gennaro and several others that were taken hostage by German terrorist Hans Gruber during a Christmas party at the Nakatomi Plaza in Los Angeles. NYPD cop John McClane goes on a Christmas vacation to visit his wife Holly in Los Angeles where she works for the Nakatomi Corporation. While they are at the Nakatomi headquarters for a Christmas party, a group of bank robbers led by Hans Gruber take control of the building and hold everyone hostage, with the exception of John, while they plan to perform a lucrative heist. Unable to escape and with no immediate police response, John is forced to take matters into his own hands. Written by Sam","Genre":"Action, Thriller","Keywords":"christmas eve, terrorist, hostage, party, christmas","imdbRating":"8.2","imdbVotes":"571,481","Awards":"Nominated for 4 Oscars. Another 6 wins & 2 nominations.","Metascore":"70","Released":"20 July 1988 (USA) ","Location":"Los Angeles International Airport - 1 World Way, Los Angeles, California, USA ","Actors":"Bruce Willis, Alan Rickman, Bonnie Bedelia ","Writer":"Roderick Thorp (novel), Jeb Stuart (screenplay) | 1 more credit »","Running_time":"PT131M / 2h 11min","Description":"Directed by John McTiernan.  With Bruce Willis, Alan Rickman, Bonnie Bedelia, Reginald VelJohnson. John McClane, officer of the NYPD, tries to save his wife Holly Gennaro and several others that were taken hostage by German terrorist Hans Gruber during a Christmas party at the Nakatomi Plaza in Los Angeles.","Rated":"R"}