{"imdbID":"tt0066921","Title":"A Clockwork Orange","Year":"1971","Director":"Stanley Kubrick","Taglines":"Being the adventures of a young man ... who couldn't resist pretty girls ... or a bit of the old ultra-violence ... went to jail, was re-conditioned ... and came out a different young man ... or was he ? ","Certificate":"See all certifications »","Country":"UK, USA","Language":"English","Also_Known_As":"La naranja mecánica ","Budget":"$2,200,000 (estimated)","Opening_Weekend":"£618,615 (UK) (17 March 2000)","Gross":"£1,675,124 (UK) (31 March 2000)","Production_Co":"Warner Bros., Hawk Films ","":"Show detailed company contact information on IMDbPro »","Runtime":"136 min","Sound_Mix":"Dolby Digital (re-issue)| Mono","Color":"Black and White | Color (Warnercolor) (uncredited)","Aspect_Ratio":"1.66 : 1","Trivia":"One of the highest grossing films of 1971. See more »","Goofs":"When riding in the sports car at very high speed, Georgie is not holding his hat, so it should fly off. See more »","Crazy_Credits":"There are no opening credits after the title, which is followed by the opening shot of Alex the Droog. Although it is now commonplace for major films to not have opening credits, in 1971 it was considered rather unusual and was considered a trademark of director Stanley Kubrick. See more »","Cast":"Malcolm McDowell, Patrick Magee, Michael Bates, Warren Clarke, John Clive, Adrienne Corri, Carl Duering, Paul Farrell, Clive Francis, Michael Gover, Miriam Karlin, James Marcus, Aubrey Morris, Godfrey Quigley, Sheila Raynor","Plot":"In future Britain, charismatic delinquent Alex DeLarge is jailed and volunteers for an experimental aversion therapy developed by the government in an effort to solve society's crime problem - but not all goes according to plan. Protagonist Alex DeLarge is an \"ultraviolent\" youth in futuristic Britain. As with all luck, his eventually runs out and he's arrested and convicted of murder and rape. While in prison, Alex learns of an experimental program in which convicts are programmed to detest violence. If he goes through the program, his sentence will be reduced and he will be back on the streets sooner than expected. But Alex's ordeals are far from over once he hits the mean streets of Britain that he had a hand in creating. Written by Nikki Carlyle","Genre":"Crime, Drama, Sci-Fi","Keywords":"gang, rape, dystopia, forced to strip, female full frontal nudity","imdbRating":"8.4","imdbVotes":"534,963","Awards":"Nominated for 4 Oscars. Another 8 wins & 17 nominations.","Metascore":"78","Released":"13 January 1972 (UK) ","Location":"Pinewood Studios, Iver Heath, Buckinghamshire, England, UK ","Actors":"Malcolm McDowell, Patrick Magee, Michael Bates ","Writer":"Stanley Kubrick (screenplay), Anthony Burgess (novel)","Running_time":"PT136M / 2h 16min","Description":"Directed by Stanley Kubrick.  With Malcolm McDowell, Patrick Magee, Michael Bates, Warren Clarke. In future Britain, charismatic delinquent Alex DeLarge is jailed and volunteers for an experimental aversion therapy developed by the government in an effort to solve society's crime problem - but not all goes according to plan.","Rated":"N/A"}