{"imdbID":"tt0099871","Title":"Jacob's Ladder","Year":"1990","Director":"Adrian Lyne","Writer":"Bruce Joel Rubin","Taglines":"The most frightening thing about Jacob Singer's nightmare is that he isn't dreaming.","Certificate":"R | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Dante's Inferno ","Budget":"$25,000,000 (estimated)","Gross":"$26,118,851 (USA)","Production_Co":"Carolco Pictures ","Runtime":"113 min","Sound_Mix":"Dolby Stereo","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"The Bergen Street station in the film was actually an abandoned, lower level portion of the station, which had to be re-tiled and fixed to look as if it was still in working condition. See more »","Goofs":"Even through Jacob doesn't finish shaving (he towels-off the remaining shaving cream off his face), he appears to be clean and evenly shaven. See more »","Crazy_Credits":"The credits roll over a grainy black and white photo of Gabe and Jacob crossing the street together. See more »","Cast":"Tim Robbins, Elizabeth Peña, Danny Aiello, Matt Craven, Pruitt Taylor Vince, Jason Alexander, Patricia Kalember, Eriq La Salle, Ving Rhames, Brian Tarantina, Anthony Alessandro, Brent Hinkley, S. Epatha Merkerson, Suzanne Shepherd, Doug Barron","Plot":"Mourning his dead child, a haunted Vietnam war veteran attempts to discover his past while suffering from a severe case of dissociation. To do so, he must decipher reality and life from his own dreams, delusion, and perception of death. New York postal worker Jacob Singer is trying to keep his frayed life from unraveling. His days are increasingly being invaded by flashbacks to his first marriage, his now-dead son, and his tour of duty in Vietnam. Athough his new wife tries to help Jacob keep his grip on sanity, the line between reality and delusion is steadily growing more and more uncertain. Written by Jean-Marc Rocher <rocher@fiberbit.net>","Genre":"Drama, Horror, Mystery","Keywords":"death, delusion, soldier, memory, strait jacket","imdbRating":"7.5","imdbVotes":"73,629","Awards":"2 wins.","Metascore":"62","Released":"2 November 1990 (USA) ","Location":"New York, USA ","Actors":"Tim Robbins, Elizabeth Peña, Danny Aiello ","Running_time":"PT113M / 1h 53min","Description":"Directed by Adrian Lyne.  With Tim Robbins, Elizabeth Peña, Danny Aiello, Matt Craven. Mourning his dead child, a haunted Vietnam war veteran attempts to discover his past while suffering from a severe case of dissociation. To do so, he must decipher reality and life from his own dreams, delusion, and perception of death.","Rated":"R"}