{"imdbID":"tt0040416","Title":"Hamlet","Year":"1948","Director":"Laurence Olivier","Writer":"William Shakespeare (by)","Country":"UK","Language":"English","Budget":"£500,000 (estimated)","Production_Co":"Two Cities Films ","Runtime":"155 min","Cast":"John Laurie, Esmond Knight, Anthony Quayle, Niall MacGinnis, Harcourt Williams, Patrick Troughton, Tony Tarver, Peter Cushing, Stanley Holloway, Russell Thorndike, Basil Sydney, Eileen Herlie, Laurence Olivier, Norman Wooland, Felix Aylmer","Plot":"Prince Hamlet struggles over whether or not he should kill his uncle, whom he suspects has murdered his father, the former king. William Shakespeare's tale of tragedy of murder and revenge in the royal halls of medieval Denmark. Claudius, brother to the King, conniving with the Queen, poisons the monarch and seizes the throne, taking the widowed Gertrude for his bride. Hamlet, son of the murdered King, mournful of his father's death and mother's hasty marriage, is confronted by the ghost of the late King who reveals the manner of his murder. Seeking revenge, Hamlet recreates the monstrous deed in a play with the help of some traveling actors to torment the conscience of the evil Claudius. In a visit with his mother, Hamlet expresses his anger and disappointment concerning her swiftly untimed marriage. Thinking a concealed spy in his mother's chamber to be the lurking Claudius, he mistakenly kills the meddling counselor, Polonius, father of Ophelia and Laertes. Claudius, on the pretext that Hamlet will be endangered by his subjects for the murder of Polonius, sends the prince to England. Written by alfiehitchie","Genre":"Drama","Keywords":"murder, revenge, prince, death, denmark","imdbRating":"7.8","imdbVotes":"11,360","Awards":"Won 4 Oscars. Another 11 wins & 6 nominations.","Metascore":"","Released":"12 August 1948 (Australia) ","Location":"Pinewood Studios, Iver Heath, Buckinghamshire, England, UK ","Actors":"Laurence Olivier, Jean Simmons, John Laurie ","Running_time":"PT155M / 2h 35min","Description":"Directed by Laurence Olivier.  With Laurence Olivier, Jean Simmons, John Laurie, Esmond Knight. Prince Hamlet struggles over whether or not he should kill his uncle, whom he suspects has murdered his father, the former king.","Rated":"UNRATED"}