{"imdbID":"tt0082432","Title":"Gallipoli","Year":"1981","Director":"Peter Weir","Taglines":"Peter Weir's film of...Gallipoli ","Certificate":"PG | See all certifications »","Country":"Australia","Language":"English","Also_Known_As":"Galipolje ","Budget":"AUD 2,600,000 (estimated)","Production_Co":"Australian Film Commission, The, R & R Films ","Runtime":"110 min","Sound_Mix":"Mono","Color":"Color (Eastmancolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Producers advertised for 400 skilled male horse riders for the movie, yet only 200 turned up for shooting. The remaining 200 horse riders in the movie were women, dressed to look as men. See more »","Goofs":"When the ANZAC artillery begins firing on the Turkish trenches just before the climatic battle scene, the guns do not kick back and some have bits of rust around the muzzle edges which indicate that the artillery pieces are not operational weapons at all for they are just popping white smoke out of the muzzles with the camera violently shaking to simulate the guns being fired. See more »","Cast":"Mark Lee, Bill Kerr, Harold Hopkins, Charles Lathalu Yunipingu, Heath Harris, Ron Graham, Gerda Nicolson, Mel Gibson, Robert Grubb, Tim McKenzie, David Argue, Brian Anderson, Reg Evans, Jack Giddy, Dane Peterson","Plot":"Two Australian sprinters face the brutal realities of war when they are sent to fight in the Gallipoli campaign in Turkey during World War I. The story of a group of young Australian men who leave their various backgrounds behind and sign up to join the ANZACs in World War I. They are sent to Gallipoli, where they encounter the resolute Turkish army. Written by Murray Chapman <muzzle@cs.uq.oz.au>","Genre":"Adventure, Drama, History","Keywords":"gallipoli, year 1915, british empire, runner, horse","imdbRating":"7.5","imdbVotes":"29,194","Awards":"Nominated for 1 Golden Globe. Another 11 wins & 5 nominations.","Metascore":"65","Released":"28 August 1981 (USA) ","Location":"Adelaide Railway Station, Adelaide, South Australia, Australia ","Actors":"Mel Gibson, Mark Lee, Bill Kerr ","Writer":"Peter Weir (story), David Williamson (screenplay)","Running_time":"PT110M / 1h 50min","Description":"Directed by Peter Weir.  With Mel Gibson, Mark Lee, Bill Kerr, Harold Hopkins. Two Australian sprinters face the brutal realities of war when they are sent to fight in the Gallipoli campaign in Turkey during World War I.","Rated":"PG"}