{"imdbID":"tt0026264","Title":"The Dark Angel","Year":"1935","Director":"Sidney Franklin (as Sidney A. Franklin)","Country":"USA","Language":"English","Production_Co":"Samuel Goldwyn Company, The ","Runtime":"106 min (TCM print)","Cast":"Fredric March, Merle Oberon, Herbert Marshall, Janet Beecher, John Halliday, Henrietta Crosman, Frieda Inescort, Claud Allister, Cora Sue Collins, Fay Chaldecott, George P. Breakston","Plot":"Kitty Vane, Alan Trent, and Gerald Shannon have been inseparable friends since childhood. Kitty has always known she would marry one of them, but has waited until the beginning of World War... See full summary » Kitty Vane, Alan Trent, and Gerald Shannon have been inseparable friends since childhood. Kitty has always known she would marry one of them, but has waited until the beginning of World War I before finally choosing Alan. Gerald graciously gives them his blessing. Then, Gerald and Alan go to war. Angered over a misunderstanding involving Alan and Kitty, Gerald sends Alan on a dangerous mission that will change all their lives forever. Written by George S. Davis <mgeorges@prodigy.net>","Genre":"Drama, Romance","Keywords":"presumed dead, world war one, train, soldier, ship","imdbRating":"6.8","imdbVotes":"475","Awards":"Won 1 Oscar. Another 2 nominations.","Metascore":"","Released":"8 September 1935 (USA) ","Location":"Samuel Goldwyn Studios - 7200 Santa Monica Boulevard, West Hollywood, California, USA","Actors":"Fredric March, Merle Oberon, Herbert Marshall ","Writer":"Lillian Hellman (screen play), Mordaunt Shairp (screen play) | 2 more credits »","Running_time":"PT106M / 1h 46min","Description":"Directed by Sidney Franklin.  With Fredric March, Merle Oberon, Herbert Marshall, Janet Beecher. Kitty Vane, Alan Trent, and Gerald Shannon have been inseparable friends since childhood. Kitty has always known she would marry one of them, but has waited until the beginning of World War I before finally choosing Alan. Gerald graciously gives them his blessing. Then, Gerald and Alan go to war. Angered over a misunderstanding involving Alan and Kitty, Gerald sends Alan on a dangerous mission ...","Rated":"PASSED"}