{"imdbID":"tt0078788","Title":"Apocalypse Now","Year":"1979","Director":"Francis Ford Coppola (as Francis Coppola)","Taglines":"The Horror. . . The Horror. . .","Country":"USA","Language":"English, French, Vietnamese","Also_Known_As":"Apokalipsa danas ","Budget":"$31,500,000 (estimated)","Opening_Weekend":"$96,992 (USA) (3 August 2001)","Gross":"£338,493 (UK) (21 December 2001)","Production_Co":"Zoetrope Studios, Zoetrope Studios ","":"Show detailed company contact information on IMDbPro »","Runtime":"153 min | 202 min (Redux) | 289 min (workprint)","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby Digital (Redux version)| Dolby (35 mm prints)| DTS (Redux version)","Color":"Color (Technicolor)| Color","Aspect_Ratio":"2.35 : 1","Trivia":"After being fired from this film, Harvey Keitel went on to appear in The Duellists (1977), also based on a Joseph Conrad novel. See more »","Goofs":"Capt Willard's audio narration says this about Lt Col Kilgore's unit: \"The First of the Ninth was an old Cavalry division.\" But in military shorthand, 'First' would indicate the 1st Squadron (Battalion), and 'Ninth' would indicate the 9th Regiment. Neither of these is a division, which is a higher echelon organization. See more »","Crazy_Credits":"There are four different treatments of the end credits, all four are available in different VHS, laserdisc, DVD and TV prints of the film...... When the film premiered in a limited 70mm format, it had no beginning or end credits, nothing but a one-line Omni Zoetrope copyright notice at the end. Programs were passed out to theater goers in lieu of any credits. When the film went into its wide release its format was 35mm. This version included end credits rolling over surrealistic explosions and burning jungle, showing the Kurtz compound being destroyed. When Coppola heard that people were assuming that the explosions during the end credits of the 35mm version meant that an air strike had been called in on the Kurtz compound (which is not what he wanted audiences to think) he quickly re-edited the 35mm version to have the end credits rolling over a simple black background and a slightly altered musical score. The \"Redux\" version also has the end credits over a black background but in different screen fonts and including additional \"Redux\" inserted cast members. See more »","Cast":"Marlon Brando, Martin Sheen, Robert Duvall, Frederic Forrest, Sam Bottoms, Laurence Fishburne, Albert Hall, Harrison Ford, Dennis Hopper, G.D. Spradlin, Jerry Ziesmer, Scott Glenn, Bo Byers, James Keane, Kerry Rossall","Plot":"During the Vietnam War, Captain Willard is sent on a dangerous mission into Cambodia to assassinate a renegade colonel who has set himself up as a god among a local tribe. It is the height of the war in Vietnam, and U.S. Army Captain Willard is sent by Colonel Lucas and a General to carry out a mission that, officially, 'does not exist - nor will it ever exist'. The mission: To seek out a mysterious Green Beret Colonel, Walter Kurtz, whose army has crossed the border into Cambodia and is conducting hit-and-run missions against the Viet Cong and NVA. The army believes Kurtz has gone completely insane and Willard's job is to eliminate him! Willard, sent up the Nung River on a U.S. Navy patrol boat, discovers that his target is one of the most decorated officers in the U.S. Army. His crew meets up with surfer-type Lt-Colonel Kilgore, head of a U.S Army helicopter cavalry group which eliminates a Viet Cong outpost to provide an entry point into the Nung River. After some hair-raising encounters, in which some of his crew are killed, Willard, Lance and Chef reach Colonel Kurtz's outpost, beyond the Do Lung Bridge. Now, after becoming prisoners of Kurtz, will... Written by Derek O'Cain","Genre":"Drama, War","Keywords":"jungle, vietnam, army, green beret, insanity","imdbRating":"8.5","imdbVotes":"434,915","Awards":"Won 2 Oscars. Another 18 wins & 32 nominations.","Metascore":"90","Released":"15 August 1979 (USA) ","Location":"Philippines ","Actors":"Martin Sheen, Marlon Brando, Robert Duvall ","Writer":"John Milius, Francis Ford Coppola (as Francis Coppola) | 1 more credit »","Running_time":"PT153M / 2h 33min","Description":"Directed by Francis Ford Coppola.  With Martin Sheen, Marlon Brando, Robert Duvall, Frederic Forrest. During the Vietnam War, Captain Willard is sent on a dangerous mission into Cambodia to assassinate a renegade colonel who has set himself up as a god among a local tribe.","Rated":"R"}