{"imdbID":"tt0070849","Title":"Last Tango in Paris","Year":"1972","Director":"Bernardo Bertolucci","Country":"France, Italy","Language":"English, French","Budget":"$1,250,000 (estimated)","Gross":"SEK 2,704,423 (Sweden)","Production_Co":"United Artists, Les Productions Artistes Associés, Produzioni Europee Associati (PEA) ","Runtime":"129 min | 127 min (R-rated) | 250 min (rough cut)","Cast":"Marlon Brando, Maria Schneider, Maria Michi, Giovanna Galletti, Gitt Magrini, Catherine Allégret, Luce Marquand, Marie-Hélène Breillat, Catherine Breillat, Dan Diament, Catherine Sola, Mauro Marchetti, Jean-Pierre Léaud, Massimo Girotti, Peter Schommer","Plot":"A young Parisian woman meets a middle-aged American businessman who demands their clandestine relationship be based only on sex. While looking for an apartment, Jeanne, a beautiful young Parisienne, encounters Paul, a mysterious American expatriate mourning his wife's recent suicide. Instantly drawn to each other, they have a stormy, passionate affair, in which they do not reveal their names to each other. Their relationship deeply affects their lives, as Paul struggles with his wife's death and Jeanne prepares to marry her fiance, Tom, a film director making a cinema-verite documentary about her. Written by Erich Schneider <erich@bush.cs.tamu.edu>","Genre":"Drama, Romance","Keywords":"sex in bed, apartment, love, grief, sex standing up","imdbRating":"7.2","imdbVotes":"34,966","Awards":"Nominated for 2 Oscars. Another 6 wins & 7 nominations.","Metascore":"77","Released":"7 February 1973 (USA) ","Location":"26 rue vavin, Paris, France ","Actors":"Marlon Brando, Maria Schneider, Maria Michi ","Writer":"Bernardo Bertolucci (story), Bernardo Bertolucci (screenplay) | 3 more credits »","Running_time":"PT129M / 2h 9min","Description":"Directed by Bernardo Bertolucci.  With Marlon Brando, Maria Schneider, Maria Michi, Giovanna Galletti. A young Parisian woman meets a middle-aged American businessman who demands their clandestine relationship be based only on sex.","Rated":"NC-17"}