{"imdbID":"tt0020126","Title":"Madame X","Year":"1929","Director":"Lionel Barrymore","Country":"USA","Language":"English","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"95 min","Cast":"Lewis Stone, Ruth Chatterton, Raymond Hackett, Holmes Herbert, Eugenie Besserer, John P. Edington, Mitchell Lewis, Ullrich Haupt, Sidney Toler, Richard Carle, Carroll Nye, Claude King, Chappell Dossett","Plot":"A young lawyer unknowingly defends his mother who abandoned him when he was three. Young Raymond Floriot, following in his father Louis Floriot's professional footsteps, he now France's attorney general, has just passed the bar exam. Raymond's first case, appointed to him by the courts, is a murder case. His pitiful and poor Jane Doe client, who refers to herself only as Madame X, admits to killing the scoundrel of a man named Laroque, but won't disclose why or in turn defend herself in court. Raymond knows nothing of her past, which includes once being a woman of class, married to man of prestige. But that marriage ended because he treated her without love, which resulted in her leaving him for another man, who in turn passed away shortly thereafter. Her first marriage produced a son, who her husband refused to let her see. Her son never knew she was alive, he being told by his father that she died. The consequence of his action left Madame X on a downward path where she never found love. Now, in turn, she hopes her silence will protect the one that she really ... Written by Huggo","Genre":"Drama","Keywords":"murder, france, paris france, trial, blackmail","imdbRating":"5.8","imdbVotes":"239","Awards":"Nominated for 2 Oscars.","Metascore":"","Released":"17 August 1929 (USA) ","Location":"Metro-Goldwyn-Mayer Studios - 10202 W. Washington Blvd., Culver City, California, USA","Actors":"Lewis Stone, Ruth Chatterton, Raymond Hackett ","Writer":"Alexandre Bisson (from the play by), Willard Mack (dialogue)","Running_time":"PT95M / 1h 35min","Description":"Directed by Lionel Barrymore.  With Lewis Stone, Ruth Chatterton, Raymond Hackett, Holmes Herbert. A young lawyer unknowingly defends his mother who abandoned him when he was three.","Rated":"PASSED"}