{"imdbID":"tt0087544","Title":"Nausicaä of the Valley of the Wind","Year":"1984","Director":"Hayao Miyazaki","Taglines":"Miyazaki's epic masterpiece (2005 Disney release) ","Country":"Japan","Language":"Japanese","Also_Known_As":"Nausicaä of the Valley of the Wind ","Budget":"$1,000,000 (estimated)","Production_Co":"Nibariki, Tokuma Shoten, Hakuhodo ","":"Show detailed company contact information on IMDbPro »","Runtime":"117 min | 95 min (1985) (edited)","Sound_Mix":"Mono","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Because it was an original story with no promotional tie in to anything, Hayao Miyazaki wrote a comic to get it produced. See more »","Goofs":"When Nausicaa is underneath the toxic jungle, and she goes under a hole through which the sand passes, Teto disappear from her shoulder, and then in the next shot, he reappears on her. See more »","Crazy_Credits":"As the credits roll we see life returning to normal in the valley: Kushana, Kurotowa and the Tolmekian fleet leave peacefully, after Nausicaä has unheard words for Kushana. The denizens of the Valley of the Wind replant trees in the burned-down forest. Lord Yupa and Asbel ride Yupa's beasts to the Toxic Jungle and explore it. When the text \"The End\" appears on screen we see Nausicaa's discarded helmet in the forest, alongside a green, non-Toxic Jungle sapling. See more »","Cast":"Sumi Shimamoto, Mahito Tsujimura, Hisako Kyôda, Gorô Naya, Ichirô Nagai, Kôhei Miyauchi, Jôji Yanami, Minoru Yada, Rihoko Yoshida, Masako Sugaya, Takako Sasuga, Chika Sakamoto, Tarako, Yôji Matsuda, Mîna Tominaga","Plot":"Warrior/pacifist Princess Nausicaä desperately struggles to prevent two warring nations from destroying themselves and their dying planet. An animated fantasy-adventure. Set 1,000 years from now, the earth is ravaged by pollution and war. In the Valley of the Wind lives Nausicaa, princess of her people. Their land borders on a toxic jungle, filled with dangerous over-sized insects. Meanwhile two nearby nations are bitterly engaged in a war and the Valley of the Wind is stuck in the middle... Written by grantss","Genre":"Animation, Adventure, Fantasy","Keywords":"post apocalypse, wind, princess, ecological footprint, innocence","imdbRating":"8.1","imdbVotes":"91,183","Awards":"3 wins.","Metascore":"","Released":"11 March 1984 (Japan) ","Actors":"Sumi Shimamoto, Mahito Tsujimura, Hisako Kyôda ","Writer":"Hayao Miyazaki (comic), Hayao Miyazaki (screenplay) | 1 more credit »","Running_time":"PT117M / 1h 57min","Description":"Directed by Hayao Miyazaki.  With Sumi Shimamoto, Mahito Tsujimura, Hisako Kyôda, Gorô Naya. Warrior/pacifist Princess Nausicaä desperately struggles to prevent two warring nations from destroying themselves and their dying planet.","Rated":"PG"}