{"imdbID":"tt0066579","Title":"Women in Love","Year":"1969","Director":"Ken Russell","Country":"UK","Language":"English","Budget":"$1,250,000 (estimated)","Production_Co":"Brandywine Productions ","Runtime":"131 min","Cast":"Alan Bates, Oliver Reed, Glenda Jackson, Jennie Linden, Eleanor Bron, Alan Webb, Vladek Sheybal, Catherine Willmer, Phoebe Nicholls, Sharon Gurney, Christopher Gable, Michael Gough, Norma Shebbeare, Nike Arrighi, James Laurenson","Plot":"The battle of the sexes and relationships among the elite of Britian's industrial Midlands in the 1920s. Gerald Crich and Rupert Berkin are best friends who fall in love with a pair of ... See full summary » The battle of the sexes and relationships among the elite of Britian's industrial Midlands in the 1920s. Gerald Crich and Rupert Berkin are best friends who fall in love with a pair of sisters Gudrun, a sculptress and Ursula Brangwen, a schoolteacher. Rupert marries Ursula, Gerald begins a love affair with Gudrun, and the foursome embarks upon a Swiss honeymoon. But the relationships take markedly different directions, as Russell explores the nature of commitment and love. Rupert and Ursula learn to give themselves to each other; the more withdrawn Gerald cannot, finally, connect with the demanding and challenging Gudrun. Written by alfiehitchie","Genre":"Drama, Romance","Keywords":"love, love marriage, 1920s, sex, sculptress","imdbRating":"7.6","imdbVotes":"4,946","Awards":"Won 1 Oscar. Another 5 wins & 18 nominations.","Metascore":"","Released":"25 March 1970 (USA) ","Location":"Gateshead, Tyne & Wear, England, UK ","Actors":"Alan Bates, Oliver Reed, Glenda Jackson ","Writer":"D.H. Lawrence (novel), Larry Kramer (written for the screen by)","Running_time":"PT131M / 2h 11min","Description":"Directed by Ken Russell.  With Alan Bates, Oliver Reed, Glenda Jackson, Jennie Linden. The battle of the sexes and relationships among the elite of Britian's industrial Midlands in the 1920s. Gerald Crich and Rupert Berkin are best friends who fall in love with a pair of sisters Gudrun, a sculptress and Ursula Brangwen, a schoolteacher. Rupert marries Ursula, Gerald begins a love affair with Gudrun, and the foursome embarks upon a Swiss honeymoon. But the relationships take ...","Rated":"R"}