{"imdbID":"tt0081505","Title":"The Shining","Year":"1980","Director":"Stanley Kubrick","Taglines":"The tide of terror that swept America IS HERE [UK Poster] ","Certificate":"A | See all certifications »","Country":"USA, UK","Language":"English","Also_Known_As":"Stanley Kubrick's 'The Shining' ","Budget":"$19,000,000 (estimated)","Gross":"SEK 6,140,088 (Sweden)","Production_Co":"Warner Bros., Hawk Films, Peregrine ","":"Show detailed company contact information on IMDbPro »","Runtime":"144 min (cut) | 119 min (cut) (European) | 146 min (original)","Sound_Mix":"Mono","Color":"Color","Aspect_Ratio":"1.37 : 1","Trivia":"The scrapbook that Jack finds in the novel makes a brief appearance next to his typewriter when Jack tells Wendy never to bother him while he's working. See more »","Goofs":"When Jack is walking towards the Gold Room, his image is not reflected in the last mirror. See more »","Crazy_Credits":"The party music plays over the closing credits. After it ends, we hear the Overlook Hotel ghosts applaud. They then talk amongst themselves until their voices fade away. See more »","Cast":"Jack Nicholson, Shelley Duvall, Danny Lloyd, Scatman Crothers, Barry Nelson, Philip Stone, Joe Turkel, Anne Jackson, Tony Burton, Lia Beldam, Billie Gibson, Barry Dennen, David Baxt, Manning Redwood, Lisa Burns","Plot":"A family heads to an isolated hotel for the winter where an evil and spiritual presence influences the father into violence, while his psychic son sees horrific forebodings from the past and of the future. Signing a contract, Jack Torrance, a normal writer and former teacher agrees to take care of a hotel which has a long, violent past that puts everyone in the hotel in a nervous situation. While Jack slowly gets more violent and angry of his life, his son, Danny, tries to use a special talent, the \"Shining\", to inform the people outside about whatever that is going on in the hotel. Written by J. S. Golden","Genre":"Drama, Horror","Keywords":"haunted hotel, identical twins, breaking down a door, imaginary friend, labyrinth","imdbRating":"8.4","imdbVotes":"582,866","Awards":"3 wins & 5 nominations.","Metascore":"61","Released":"23 May 1980 (USA) ","Location":"Epcot Center, Walt Disney World, Lake Buena Vista, Florida, USA ","Actors":"Jack Nicholson, Shelley Duvall, Danny Lloyd ","Writer":"Stephen King (novel), Stanley Kubrick (screenplay) | 1 more credit »","Running_time":"PT146M / 2h 26min","Description":"Directed by Stanley Kubrick.  With Jack Nicholson, Shelley Duvall, Danny Lloyd, Scatman Crothers. A family heads to an isolated hotel for the winter where an evil and spiritual presence influences the father into violence, while his psychic son sees horrific forebodings from the past and of the future.","Rated":"A"}