{"imdbID":"tt0027977","Title":"Modern Times","Year":"1936","Director":"Charles Chaplin (as Charlie Chaplin)","Writer":"Charles Chaplin (as Charlie Chaplin)","Taglines":"He stands alone as the greatest entertainer of modern times! No one on earth can make you laugh as heartily or touch your heart as deeply...the whole world laughs, cries and thrills to his priceless genius! ","Certificate":"See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Tiempos modernos ","Budget":"$1,500,000 (estimated)","Opening_Weekend":"$11,507 (USA) (9 January 2004)","Gross":"$163,245 (USA) (22 October 2004)","Production_Co":"Charles Chaplin Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"87 min","Sound_Mix":"Mono (Western Electric Noiseless Recording Sound System)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"According to some accounts, working together on the film put a strain on Charles Chaplin and Paulette Goddard's relationship. Contrary to the way young actresses were presented on screen, Goddard was to wear shabby clothing and no make-up as the Gamin. When she showed up for filming with her hair beautifully coiffed, Chaplin dumped a bucket of water over her head. See more »","Goofs":"After a brick hits the police officer all the officers go over to the tramp. The gate he is in front of is open at first with a wheelbarrow in the gate opening. This position of the gate and wheelbarrow occur for two or so scenes. In the last scene the gate is suddenly closed and the wheelbarrow has been moved to outside of the gate. See more »","Cast":"Charles Chaplin, Paulette Goddard, Henry Bergman, Tiny Sandford, Chester Conklin, Hank Mann, Stanley Blystone, Al Ernest Garcia, Richard Alexander, Cecil Reynolds, Mira McKinney, Murdock MacQuarrie, Wilfred Lucas, Edward LeSaint, Fred Malatesta","Plot":"The Tramp struggles to live in modern industrial society with the help of a young homeless woman. Chaplins last 'silent' film, filled with sound effects, was made when everyone else was making talkies. Charlie turns against modern society, the machine age, (The use of sound in films ?) and progress. Firstly we see him frantically trying to keep up with a production line, tightening bolts. He is selected for an experiment with an automatic feeding machine, but various mishaps leads his boss to believe he has gone mad, and Charlie is sent to a mental hospital... When he gets out, he is mistaken for a communist while waving a red flag, sent to jail, foils a jailbreak, and is let out again. We follow Charlie through many more escapades before the film is out. Written by Colin Tinto <cst@imdb.com>","Genre":"Comedy, Drama","Keywords":"actor director writer, music score composed by director, machine, tramp, invention","imdbRating":"8.6","imdbVotes":"135,450","Awards":"4 wins & 1 nomination.","Metascore":"96","Released":"25 February 1936 (USA) ","Location":"Santa Clarita, California, USA ","Actors":"Charles Chaplin, Paulette Goddard, Henry Bergman ","Running_time":"PT87M / 1h 27min","Description":"Directed by Charles Chaplin.  With Charles Chaplin, Paulette Goddard, Henry Bergman, Tiny Sandford. The Tramp struggles to live in modern industrial society with the help of a young homeless woman.","Rated":"N/A"}