{"imdbID":"tt0064115","Title":"Butch Cassidy and the Sundance Kid","Year":"1969","Director":"George Roy Hill","Writer":"William Goldman","Taglines":"Not that it matters, but most of it is true. ","Certificate":"M | See all certifications »","Country":"USA","Language":"English, Spanish","Also_Known_As":"The Sundance Kid and Butch Cassidy ","Budget":"$6,000,000 (estimated)","Gross":"$102,308,900 (USA)","Production_Co":"Twentieth Century Fox Film Corporation, Campanile Productions, Newman-Foreman Company ","":"Show detailed company contact information on IMDbPro »","Runtime":"110 min","Sound_Mix":"Mono (Westrex Recording System)","Color":"Color | Black and White (Sepiatone)","Aspect_Ratio":"2.35 : 1","Trivia":"The only major conflict between Paul Newman and George Roy Hill occurred over what became known as \"the Bledsoe scene,\" a break in the extended superposse chase when Butch and Sundance go to visit an old sheriff hoping to get his help enlisting them in the Army to fight in the Spanish-American War. Newman felt the scene should come at the end of the chase and be the motivation for their flight to South America. Hill disagreed strongly. Every day, Newman came on the set with fresh arguments for why it should be done his way and with increasing passion for his opinion. \"Paul was becoming almost anal about it,\" noted Robert Redford, who at one point jokingly suggested they rename the film \"The Bledsoe Scene.\" Ultimately, Hill won the argument. See more »","Goofs":"When Butch and Sundance blow up the safe on the train, their hats are blown off by the force of the explosion. A bare-headed Butch looks over as the second train arrives. The second train is shown for a moment and when the film cuts back to Butch, he suddenly has his hat on. See more »","Crazy_Credits":"The opening 20th Century-Fox logo is shown in sepia tone instead of the usual color scheme. See more »","Cast":"Paul Newman, Robert Redford, Katharine Ross, Strother Martin, Henry Jones, Jeff Corey, George Furth, Cloris Leachman, Ted Cassidy, Kenneth Mars, Donnelly Rhodes, Jody Gilbert, Timothy Scott, Don Keefer, Charles Dierkop","Plot":"Two Western bank/train robbers flee to Bolivia when the law gets too close. Butch and Sundance are the two leaders of the Hole-in-the-Wall Gang. Butch is all ideas, Sundance is all action and skill. The west is becoming civilized and when Butch and Sundance rob a train once too often, a special posse begins trailing them no matter where they run. Over rock, through towns, across rivers, the group is always just behind them. When they finally escape through sheer luck, Butch has another idea, \"Let's go to Bolivia\". Based on the exploits of the historical characters. Written by John Vogel <jlvogel@comcast.net>","Genre":"Biography, Crime, Drama","Keywords":"gang, train, posse, bolivia, outlaw","imdbRating":"8.1","imdbVotes":"146,014","Awards":"Won 4 Oscars. Another 16 wins & 14 nominations.","Metascore":"58","Released":"24 October 1969 (USA) ","Location":"Lake Sherwood, California, USA ","Actors":"Paul Newman, Robert Redford, Katharine Ross ","Running_time":"PT110M / 1h 50min","Description":"Directed by George Roy Hill.  With Paul Newman, Robert Redford, Katharine Ross, Strother Martin. Two Western bank/train robbers flee to Bolivia when the law gets too close.","Rated":"M"}