{"imdbID":"tt0044081","Title":"A Streetcar Named Desire","Year":"1951","Director":"Elia Kazan","Taglines":"...Blanche, who wanted so much to stay a lady... ","Country":"USA","Language":"English, Spanish","Also_Known_As":"Un tranvía llamado deseo ","Budget":"$1,800,000 (estimated)","Production_Co":"Charles K. Feldman Group, Warner Bros. ","":"Show detailed company contact information on IMDbPro »","Runtime":"122 min | 125 min (re-release)","Sound_Mix":"Mono (RCA Sound System)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Early in development, William Wyler had expressed an interest in adapting the play with Bette Davis in the part of Blanche. See more »","Goofs":"The position of the collar on Stanley's silk pajamas changes between shots, varying between up and down. See more »","Cast":"Vivien Leigh, Marlon Brando, Kim Hunter, Karl Malden, Rudy Bond, Nick Dennis, Peg Hillias, Wright King, Richard Garrick, Ann Dere, Edna Thomas, Mickey Kuhn","Plot":"Disturbed Blanche DuBois moves in with her sister in New Orleans and is tormented by her brutish brother-in-law while her reality crumbles around her. Blanche is in real need of a protector at this stage in her life when circumstances lead her into paying a visit to her younger sister Stella in New Orleans. She doesn't understand how Stella, who is expecting her first child, could have picked a husband so lacking in refinement. Stanley Kowalski's buddies come over to the house to play cards and one of them, Mitch, finds Blanche attractive until Stanley tells him about what kind of a woman Blanche really is. What will happen when Stella goes to the hospital to have her baby and just Blanche and her brother-in-law are in the house? Written by Dale O'Connor <daleoc@interaccess.com>","Genre":"Drama","Keywords":"off screen rape, brother in law sister in law relationship, expectant father, middle aged woman, light bulb","imdbRating":"8.1","imdbVotes":"76,389","Awards":"Won 4 Oscars. Another 13 wins & 15 nominations.","Metascore":"","Released":"1 December 1951 (West Germany) ","Location":"Los Angeles, California, USA ","Actors":"Vivien Leigh, Marlon Brando, Kim Hunter ","Writer":"Tennessee Williams (screen play), Oscar Saul (adaptation) | 1 more credit »","Running_time":"PT122M / 2h 2min","Description":"Directed by Elia Kazan.  With Vivien Leigh, Marlon Brando, Kim Hunter, Karl Malden. Disturbed Blanche DuBois moves in with her sister in New Orleans and is tormented by her brutish brother-in-law while her reality crumbles around her.","Rated":"PG"}