{"imdbID":"tt0054331","Title":"Spartacus","Year":"1960","Director":"Stanley Kubrick","Taglines":"More titanic than any story ever told! ","Certificate":"PG-13 | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Spartacus: Rebel Against Rome ","Budget":"$12,000,000 (estimated)","Production_Co":"Bryna Productions ","Runtime":"184 min (premiere) | 187 min (1968 re-release) | 161 min (1967 re-release) | 197 min (1991 restored) | 184 min (theatrical)","Sound_Mix":"70 mm 6-Track (70 mm prints)| Mono (Westrex Recording System) (35 mm prints, original release)| Dolby Stereo (1991 restoration)","Color":"Color (Technicolor)","Aspect_Ratio":"2.20 : 1","Trivia":"In July 1959, Hollywood Reporter announced that the budget had \"spiralled\" from $5,000,000 to $9,000,000, and according to studio press materials, the final budget was $12,000,000. Some sources stated that the massive production was the most expensive in film history to that point; however, the budget for Ben-Hur (1959) exceeded $15,000,000. The April 1991 New York Times article points out that this amount equalled more than Universal was worth at the time of the film's production, when the studio was purchased by MCA for $11,250,000. See more »","Goofs":"When Spartacus confronts Marcus Glabrus after the latter has been captured, the formed tears off Glabrus' medallion (which is the symbol of his office as commander of the garrison of Rome), breaking its chain. In the next shot Glabrus is shown wearing the medallion on its intact chain. See more »","Crazy_Credits":"The opening titles appear in a montage of silhouetted Roman sculptures and tablets, which according to title designer Saul Bass is meant to evoke the strength and power of the Roman Empire. The montage ends with a zoom into the eye of a crumbling Roman bust, which hints at the Empire's coming decline and fall. See more »","Cast":"Kirk Douglas, Laurence Olivier, Jean Simmons, Charles Laughton, Peter Ustinov, John Gavin, Nina Foch, John Ireland, Herbert Lom, John Dall, Charles McGraw, Joanna Barnes, Harold J. Stone, Woody Strode, Peter Brocco","Plot":"The slave Spartacus leads a violent revolt against the decadent Roman Republic. In 73 BCE, a Thracian slave leads a revolt at a gladiatorial school run by Lentulus Batiatus. The uprising soon spreads across the Italian Peninsula involving thousand of slaves. The plan is to acquire sufficient funds to acquire ships from Silesian pirates who could then transport them to other lands from Brandisium in the south. The Roman Senator Gracchus schemes to have Marcus Publius Glabrus, Commander of the garrison of Rome, lead an army against the slaves who are living on Vesuvius. When Glabrus is defeated his mentor, Senator and General Marcus Licinius Crassus is greatly embarrassed and leads his own army against the slaves. Spartacus and the thousands of freed slaves successfully make their way to Brandisium only to find that the Silesians have abandoned them. They then turn north and must face the might of Rome. Written by garykmcd","Genre":"Adventure, Biography, Drama","Keywords":"slave, spartacus, freedom, senator, uprising","imdbRating":"7.9","imdbVotes":"95,406","Awards":"Won 4 Oscars. Another 6 wins & 11 nominations.","Metascore":"","Released":"7 October 1960 (USA) ","Location":"Spain ","Actors":"Kirk Douglas, Laurence Olivier, Jean Simmons ","Writer":"Dalton Trumbo (screenplay), Howard Fast (based on the novel by)","Running_time":"PT197M / 3h 17min","Description":"Directed by Stanley Kubrick.  With Kirk Douglas, Laurence Olivier, Jean Simmons, Charles Laughton. The slave Spartacus leads a violent revolt against the decadent Roman Republic.","Rated":"PG-13"}