{"imdbID":"tt0057590","Title":"Tom Jones","Year":"1963","Director":"Tony Richardson","Country":"UK","Language":"English","Budget":"$1,000,000 (estimated)","Production_Co":"Woodfall Film Productions ","Runtime":"128 min | 121 min (director's cut)","Cast":"George Devine, Rachel Kempson, Angela Baddeley, Joyce Redman, Jack MacGowran, Albert Finney, Diane Cilento, Wilfrid Lawson, John Moffatt, Peter Bull, David Warner, Freda Jackson, Redmond Phillips, Hugh Griffith, Susannah York","Plot":"In eighteenth century England, \"first cousins\" Tom Jones and Master Blifil grew up together in privilege in the western countryside, but could not be more different in nature. Tom, the ... See full summary » In eighteenth century England, \"first cousins\" Tom Jones and Master Blifil grew up together in privilege in the western countryside, but could not be more different in nature. Tom, the bastard son of one of Squire Allworthy's servants Jenny Jones and the local barber Partridge, was raised by virtuous Allworthy as his own after he sent Jenny away. Tom is randy, chasing anything in a skirt, he's having a sexual relationship on the sly with Molly Seagrim, the peasant daughter of Allworthy's gamekeeper. Tom is nonetheless kind-hearted and good-natured, he who is willing to defend that and those in which he believes. Blifil, on the other hand, is dour, and although outwardly pious, is cold-hearted and vengeful. Despite his randiness, Tom eventually falls in love with Sophie Western, who has just returned to the area after a few years abroad. Despite Sophie's love for Tom, Squire Western and his spinster sister would rather see Sophie marry Blifil rather than a bastard, who Western ... Written by Huggo","Genre":"Adventure, Comedy, History","Keywords":"squire, tutor, rags to riches, 18th century, secret letter","imdbRating":"6.8","imdbVotes":"8,281","Awards":"Won 4 Oscars. Another 16 wins & 20 nominations.","Metascore":"","Released":"11 December 1963 (France) ","Location":"Bridgwater, Somerset, England, UK ","Actors":"Albert Finney, Susannah York, George Devine ","Writer":"John Osborne (screenplay), Henry Fielding (novel)","Running_time":"PT128M / 2h 8min","Description":"Directed by Tony Richardson.  With Albert Finney, Susannah York, George Devine, Rachel Kempson. In eighteenth century England, \"first cousins\" Tom Jones and Master Blifil grew up together in privilege in the western countryside, but could not be more different in nature. Tom, the bastard son of one of Squire Allworthy's servants Jenny Jones and the local barber Partridge, was raised by virtuous Allworthy as his own after he sent Jenny away. Tom is randy, chasing anything in a skirt, he's ...","Rated":"UNRATED"}