{"imdbID":"tt0075314","Title":"Taxi Driver","Year":"1976","Director":"Martin Scorsese","Writer":"Paul Schrader","Taglines":"On every street in every city, there's a nobody who dreams of being a somebody. ","Certificate":"See all certifications »","Country":"USA","Language":"English, Spanish","Also_Known_As":"Taksist ","Budget":"$1,300,000 (estimated)","Gross":"SEK 6,283,970 (Sweden)","Production_Co":"Columbia Pictures Corporation, Bill/Phillips, Italo/Judeo Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"113 min | 110 min (cut)","Sound_Mix":"Dolby SR (re-release)| Stereo","Color":"Color (Metrocolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Goldie Hawn did an audition for the role of Betsy. See more »","Goofs":"According to the exterior shot, and the Then-and-Now Special Feature on the 2-disc DVD, Iris lived at 226 East 13th Street. Travis writes \"240 East 13th Street\" on the envelope containing the letter and $500. See more »","Cast":"Diahnne Abbott, Frank Adu, Victor Argo, Gino Ardito, Garth Avery, Peter Boyle, Albert Brooks, Harry Cohn, Copper Cunningham, Robert De Niro, Brenda Dickson, Harry Fischler, Jodie Foster, Nat Grant, Leonard Harris","Plot":"A mentally unstable Vietnam war veteran works as a night-time taxi driver in New York City where the perceived decadence and sleaze feeds his urge for violent action, attempting to save a preadolescent prostitute in the process. Travis Bickle is an ex-Marine and Vietnam War veteran living in New York City. As he suffers from insomnia, he spends his time working as a taxi driver at night, watching porn movies at seedy cinemas during the day, or thinking about how the world, New York in particular, has deteriorated into a cesspool. He's a loner who has strong opinions about what is right and wrong with mankind. For him, the one bright spot in New York humanity is Betsy, a worker on the presidential nomination campaign of Senator Charles Palantine. He becomes obsessed with her. After an incident with her, he believes he has to do whatever he needs to make the world a better place in his opinion. One of his priorities is to be the savior for Iris, a twelve-year-old runaway and prostitute who he believes wants out of the profession and under the thumb of her pimp and lover Matthew. Written by Huggo","Genre":"Crime, Drama","Keywords":"loner, vigilante, night shift, taxi driver, alienation","imdbRating":"8.3","imdbVotes":"485,048","Awards":"Nominated for 4 Oscars. Another 21 wins & 15 nominations.","Metascore":"93","Released":"8 February 1976 (USA) ","Location":"Manhattan, New York City, New York, USA ","Actors":"Robert De Niro, Jodie Foster, Cybill Shepherd ","Running_time":"PT113M / 1h 53min","Description":"Directed by Martin Scorsese.  With Robert De Niro, Jodie Foster, Cybill Shepherd, Albert Brooks. A mentally unstable Vietnam war veteran works as a night-time taxi driver in New York City where the perceived decadence and sleaze feeds his urge for violent action, attempting to save a preadolescent prostitute in the process.","Rated":"N/A"}