{"imdbID":"tt0088763","Title":"Back to the Future","Year":"1985","Director":"Robert Zemeckis","Taglines":"17 year old Marty McFly got home early last night. 30 years early. ","Certificate":"U | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Volver al futuro ","Budget":"$19,000,000 (estimated)","Opening_Weekend":"£461,194 (UK) (1 October 2010)","Gross":"£461,194 (UK) (1 October 2010)","Production_Co":"Universal Pictures, Amblin Entertainment, U-Drive Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"116 min","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby (35 mm prints) (as Dolby Stereo)","Color":"Color (Technicolor)","Aspect_Ratio":"1.18 : 1","Trivia":"The Comic \"Tales From Space\" No. 8 Aug 54 is also seen in 3rd Rock from the Sun: Why Dickie Can't Teach (2000), at about 12 minutes and 30 seconds into the episode Harry is reading the comic and talking to Sally. See more »","Goofs":"At the dance, the picture under the strings at the head of Marty's guitar disappears in long shots. See more »","Crazy_Credits":"The character Marty McFly is credited as a performer on the song \"Johnny B. Goode\". It is actually sung by Mark Campbell with a guitar solo by Tim May. See more »","Cast":"Michael J. Fox, Christopher Lloyd, Lea Thompson, Crispin Glover, Thomas F. Wilson, Claudia Wells, Marc McClure, Wendie Jo Sperber, George DiCenzo, Frances Lee McCain, James Tolkan, J.J. Cohen, Casey Siemaszko, Billy Zane, Harry Waters Jr.","Plot":"A young man is accidentally sent thirty years into the past in a time-traveling DeLorean invented by his friend, Dr. Emmett Brown, and must make sure his high-school-age parents unite in order to save his own existence. Marty McFly, a typical American teenager of the Eighties, is accidentally sent back to 1955 in a plutonium-powered DeLorean \"time machine\" invented by a slightly mad scientist. During his often hysterical, always amazing trip back in time, Marty must make certain his teenage parents-to-be meet and fall in love - so he can get back to the future. Written by Robert Lynch <docrlynch@yahoo.com>","Genre":"Adventure, Comedy, Sci-Fi","Keywords":"time travel, delorean, future, time travel comedy, clock tower","imdbRating":"8.5","imdbVotes":"697,531","Awards":"Won 1 Oscar. Another 18 wins & 25 nominations.","Metascore":"86","Released":"3 July 1985 (USA) ","Location":"Santa Clarita, California, USA ","Actors":"Michael J. Fox, Christopher Lloyd, Lea Thompson ","Writer":"Robert Zemeckis, Bob Gale","Running_time":"PT116M / 1h 56min","Description":"Directed by Robert Zemeckis.  With Michael J. Fox, Christopher Lloyd, Lea Thompson, Crispin Glover. A young man is accidentally sent thirty years into the past in a time-traveling DeLorean invented by his friend, Dr. Emmett Brown, and must make sure his high-school-age parents unite in order to save his own existence.","Rated":"U"}