{"imdbID":"tt0055614","Title":"West Side Story","Year":"1961","Country":"USA","Language":"English, Spanish","Budget":"$6,000,000 (estimated)","Gross":"$43,650,000 (USA)","Production_Co":"Mirisch Corporation, The, Seven Arts Pictures, Beta Productions ","Runtime":"152 min","Cast":"Natalie Wood, Richard Beymer, Russ Tamblyn, Rita Moreno, George Chakiris, Simon Oakland, Ned Glass, William Bramley, Tucker Smith, Tony Mordente, David Winters, Eliot Feld, Bert Michaels, David Bean, Robert Banas","Plot":"Two youngsters from rival New York City gangs fall in love, but tensions between their respective friends build toward tragedy. West Side Story is the award-winning adaptation of the classic romantic tragedy, \"Romeo and Juliet\". The feuding families become two warring New York City gangs- the white Jets led by Riff and the Puerto Rican Sharks, led by Bernardo. Their hatred escalates to a point where neither can coexist with any form of understanding. But when Riff's best friend (and former Jet) Tony and Bernardo's younger sister Maria meet at a dance, no one can do anything to stop their love. Maria and Tony begin meeting in secret, planning to run away. Then the Sharks and Jets plan a rumble under the highway - whoever wins gains control of the streets. Maria sends Tony to stop it, hoping it can end the violence. It goes terribly wrong, and before the lovers know what's happened, tragedy strikes and doesn't stop until the climactic and heartbreaking ending. Written by Anonymous","Genre":"Crime, Drama, Musical","Keywords":"love, gang, new york city, dance, puerto rican","imdbRating":"7.6","imdbVotes":"69,618","Awards":"Won 10 Oscars. Another 18 wins & 11 nominations.","Metascore":"","Released":"23 December 1961 (Japan) ","Location":"Church of Saint Paul the Apostle, Columbus Avenue & West 60th Street, New York City, New York, USA ","Actors":"Natalie Wood, George Chakiris, Richard Beymer ","Director":"Jerome Robbins, Robert Wise","Writer":"Ernest Lehman (screenplay), Arthur Laurents (book) | 1 more credit »","Running_time":"PT152M / 2h 32min","Description":"Directed by Jerome Robbins, Robert Wise.  With Natalie Wood, George Chakiris, Richard Beymer, Russ Tamblyn. Two youngsters from rival New York City gangs fall in love, but tensions between their respective friends build toward tragedy.","Rated":"UNRATED"}