{"imdbID":"tt0072890","Title":"Dog Day Afternoon","Year":"1975","Director":"Sidney Lumet","Taglines":"The Most Bizarre Bank Siege Ever ","Certificate":"R | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Tarde de perros ","Budget":"$1,800,000 (estimated)","Production_Co":"Warner Bros., Artists Entertainment Complex ","":"Show detailed company contact information on IMDbPro »","Runtime":"125 min | 131 min (1975)","Sound_Mix":"Mono","Color":"Color (Technicolor)","Aspect_Ratio":"1.33 : 1","Trivia":"Penelope Allen, who plays the blonde chief bank teller, was a surrogate mother to Al Pacino. When he first left home in his teens to pursue acting, he lived with Allen and her husband for several years. See more »","Goofs":"When Sonny first meets the FBI agent he holds his hand up to shield his eyes from the light, when the camera cuts to the FBI Agent from the back of Sonny's waist, his hand is immediately at his side. When we see Sonny's face again he is raising his hand to shield his eyes from the light once again. See more »","Crazy_Credits":"Opening credits prologue: What you are about to see is true - It happened in Brooklyn, New York on August 22, 1972. See more »","Cast":"Penelope Allen, Sully Boyar, John Cazale, Beulah Garrick, Carol Kane, Sandra Kazan, Marcia Jean Kurtz, Amy Levitt, John Marriott, Estelle Omens, Al Pacino, Gary Springer, James Broderick, Charles Durning, Carmine Foresta","Plot":"A man robs a bank to pay for his lover's operation; it turns into a hostage situation and a media circus. Based upon a real-life story that happened in the early seventies in which the Chase Manhattan Bank in Gravesend, Brooklyn, was held siege by a gay bank robber determined to steal enough money for his male lover to undergo a sex change operation. On a hot summer afternoon, the First Savings Bank of Brooklyn is held up by Sonny and Sal, two down-and-out characters. Although the bank manager and female tellers agree not to interfere with the robbery, Sonny finds that there's actually nothing much to steal, as most of the cash has been picked up for the day. Sonny then gets an unexpected phone call from Police Captain Moretti, who tells him the place is surrounded by the city's entire police force. Having few options under the circumstances, Sonny nervously bargains with Moretti, demanding safe escort to the airport and a plane out of the country in return for the bank employees' safety. Written by alfiehitchie","Genre":"Crime, Drama","Keywords":"shot in the forehead, one day, bank, police, hostage","imdbRating":"8.0","imdbVotes":"176,042","Awards":"Won 1 Oscar. Another 13 wins & 19 nominations.","Metascore":"","Released":"21 September 1975 (USA) ","Location":"New York, USA ","Actors":"Al Pacino, John Cazale, Penelope Allen ","Writer":"Frank Pierson (screenplay), P.F. Kluge (based upon a magazine article by) | 1 more credit »","Running_time":"PT125M / 2h 5min","Description":"Directed by Sidney Lumet.  With Al Pacino, John Cazale, Penelope Allen, Sully Boyar. A man robs a bank to pay for his lover's operation; it turns into a hostage situation and a media circus.","Rated":"R"}