{"imdbID":"tt0095159","Title":"A Fish Called Wanda","Year":"1988","Country":"USA, UK","Language":"English, Italian, Russian, French","Budget":"$7,500,000 (estimated)","Gross":"$63,493,712 (USA)","Production_Co":"Metro-Goldwyn-Mayer (MGM), Prominent Features, Star Partners Limited Partnership ","Runtime":"108 min","Cast":"John Cleese, Jamie Lee Curtis, Kevin Kline, Michael Palin, Maria Aitken, Tom Georgeson, Patricia Hayes, Geoffrey Palmer, Cynthia Cleese, Mark Elwes, Neville Phillips, Peter Jonfield, Ken Campbell, Al Ashton, Roger Hume","Plot":"In London, four very different people team up to commit armed robbery, then try to doublecross each other for the loot. In London, George Thomason, his seductive American girlfriend Wanda Gershwitz, and their associate Ken Pile are planning their latest crime, a diamond heist that should net them £13 million. They plan on leaving the country with the goods after the heist. On Wanda's recommendation, they enlist the help of her brother, Otto, a weapons expert, for this heist. In reality, Otto is not Wanda's brother, but her latest lover, a dimwit who gets off on his own body odor, who believes he's an intellectual because he reads Nietzsche, and who does not tolerate being called stupid by anyone. Wanda has one weakness in men which is how Otto was able to get her to be his lover: speaking Italian in seduction. Wanda and Otto plan to double cross George by having him arrested for the heist, while they abscond with the jewels. Wanda further plans to triple cross Otto by eliminating him from the picture after she has the jewels. They are able to get George arrested with him not knowing who tipped the ... Written by Huggo","Genre":"Comedy, Crime","Keywords":"barrister, stuttering, lawyer, lifting someone into the air, real life father and daughter playing father and daughter","imdbRating":"7.6","imdbVotes":"105,973","Awards":"Won 1 Oscar. Another 8 wins & 15 nominations.","Metascore":"80","Released":"5 August 1988 (USA) ","Location":"Roehampton Church School, Wandsworth, London, England, UK ","Actors":"John Cleese, Jamie Lee Curtis, Kevin Kline ","Director":"Charles Crichton, John Cleese (uncredited)","Writer":"John Cleese (story), Charles Crichton (story) | 1 more credit »","Running_time":"PT108M / 1h 48min","Description":"Directed by Charles Crichton, John Cleese.  With John Cleese, Jamie Lee Curtis, Kevin Kline, Michael Palin. In London, four very different people team up to commit armed robbery, then try to doublecross each other for the loot.","Rated":"R"}