{"imdbID":"tt0035105","Title":"My Sister Eileen","Year":"1942","Director":"Alexander Hall","Country":"USA","Language":"English","Production_Co":"Columbia Pictures Corporation ","Runtime":"96 min","Cast":"Rosalind Russell, Brian Aherne, Janet Blair, George Tobias, Allyn Joslyn, Grant Mitchell, Gordon Jones, Elizabeth Patterson, Richard Quine, June Havoc, Donald MacBride, Frank Sully, Clyde Fillmore, Jeff Donnell","Plot":"Sisters Ruth and Eileen Sherwood move from Ohio to New York in the hopes of building their careers. Ruth wants to get a job as a writer, while Eileen hopes to succeed on the stage. The two ... See full summary » Sisters Ruth and Eileen Sherwood move from Ohio to New York in the hopes of building their careers. Ruth wants to get a job as a writer, while Eileen hopes to succeed on the stage. The two end up living in a dismal basement apartment in Greenwich Village, where a parade of odd characters are constantly breezing in and out. The women also meet up with magazine editor Bob Baker, who takes a personal interest in helping both with their career plans. Written by Daniel Bubbeo <dbubbeo@cmp.com>","Genre":"Comedy","Keywords":"ohio, female protagonist, manhattan new york city, new york city, greenwich village manhattan new york city","imdbRating":"7.1","imdbVotes":"874","Awards":"Nominated for 1 Oscar.","Metascore":"","Released":"24 September 1942 (USA) ","Location":"Columbia/Sunset Gower Studios - 1438 N. Gower Street, Hollywood, Los Angeles, California, USA","Actors":"Rosalind Russell, Brian Aherne, Janet Blair ","Writer":"Joseph Fields (screenplay), Jerome Chodorov (screenplay) | 3 more credits »","Running_time":"PT96M / 1h 36min","Description":"Directed by Alexander Hall.  With Rosalind Russell, Brian Aherne, Janet Blair, George Tobias. Sisters Ruth and Eileen Sherwood move from Ohio to New York in the hopes of building their careers. Ruth wants to get a job as a writer, while Eileen hopes to succeed on the stage. The two end up living in a dismal basement apartment in Greenwich Village, where a parade of odd characters are constantly breezing in and out. The women also meet up with magazine editor Bob Baker, who takes a ...","Rated":"APPROVED"}