{"imdbID":"tt0035751","Title":"The Constant Nymph","Year":"1943","Director":"Edmund Goulding","Country":"USA","Language":"English","Production_Co":"Warner Bros. ","Runtime":"112 min","Cast":"Charles Boyer, Joan Fontaine, Alexis Smith, Brenda Marshall, Charles Coburn, Dame May Whitty, Peter Lorre, Joyce Reynolds, Jean Muir, Montagu Love, Eduardo Ciannelli, Janine Crispin, Doris Lloyd, Joan Blair, André Charlot","Plot":"Fourteen-year-old Tessa is hopelessly in love with handsome composer Lewis Dodd, a family friend. Lewis adores Tessa, but has never shown any romantic feelings toward her. When Tessa's ... See full summary » Fourteen-year-old Tessa is hopelessly in love with handsome composer Lewis Dodd, a family friend. Lewis adores Tessa, but has never shown any romantic feelings toward her. When Tessa's father dies, Lewis contacts her late mother's wealthy family so they'll take care of Tessa and her sisters. Lewis becomes taken with Tessa's haughty cousin Florence and the two soon marry and head off for Florence's estate in England. Meanwhile, Florence sends Tessa and her sister Paula off to finishing school. The girls run away from school and Tessa moves in with Florence and Louis. Florence soon becomes consumed with jealousy over the bond between her husband and Tessa. Written by Daniel Bubbeo <dbubbeo@cmp.com>","Genre":"Drama, Music, Romance","Keywords":"composer, musician, jealousy, older man younger woman relationship, tyrol","imdbRating":"7.0","imdbVotes":"804","Awards":"Nominated for 1 Oscar.","Metascore":"","Released":"10 July 1943 (Mexico) ","Location":"Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA","Actors":"Charles Boyer, Joan Fontaine, Brenda Marshall ","Writer":"Kathryn Scola (screenplay), Margaret Kennedy (novel) | 1 more credit »","Running_time":"PT112M / 1h 52min","Description":"Directed by Edmund Goulding.  With Charles Boyer, Joan Fontaine, Brenda Marshall, Alexis Smith. Fourteen-year-old Tessa is hopelessly in love with handsome composer Lewis Dodd, a family friend. Lewis adores Tessa, but has never shown any romantic feelings toward her. When Tessa's father dies, Lewis contacts her late mother's wealthy family so they'll take care of Tessa and her sisters. Lewis becomes taken with Tessa's haughty cousin Florence and the two soon marry and head off for ...","Rated":"N/A"}