{"imdbID":"tt0039335","Title":"A Double Life","Year":"1947","Director":"George Cukor","Country":"USA","Language":"English, Italian","Production_Co":"Kanin Productions, Universal Pictures ","Runtime":"104 min","Cast":"Ronald Colman, Signe Hasso, Edmond O'Brien, Shelley Winters, Ray Collins, Philip Loeb, Millard Mitchell, Joe Sawyer, Charles La Torre, Whit Bissell, John Drew Colt, Peter M. Thompson, Elizabeth Dunne, Alan Edmiston, Art Smith","Plot":"Anthony John is an actor whose life is strongly influenced by the characters he plays. When he's playing comedy, he's the most enjoyable person in the world, but when he's playing drama, ... See full summary » Anthony John is an actor whose life is strongly influenced by the characters he plays. When he's playing comedy, he's the most enjoyable person in the world, but when he's playing drama, it's terrible to be around him. That's the reason why his wife Brita divorced him; although she still loves him and works with him, she couldn't stand living with him anymore. So when Anthony accepts to play Othello, he devotes himself entirely to the part, but it soon overwhelms him and with each day his mind gets filled more and more with Othello's murderous jealousy. Written by Leon Wolters <wolters@strw.LeidenUniv.nl>","Genre":"Crime, Drama, Film-Noir","Keywords":"actor, jealousy, bar, waitress, police","imdbRating":"7.1","imdbVotes":"2,041","Awards":"Won 2 Oscars. Another 1 win & 3 nominations.","Metascore":"","Released":"1948 (Turkey) ","Location":"Eùpire Theatre, New York City, New York, USA ","Actors":"Ronald Colman, Edmond O'Brien, Signe Hasso ","Writer":"Ruth Gordon, Garson Kanin","Running_time":"PT104M / 1h 44min","Description":"Directed by George Cukor.  With Ronald Colman, Edmond O'Brien, Signe Hasso, Shelley Winters. Anthony John is an actor whose life is strongly influenced by the characters he plays. When he's playing comedy, he's the most enjoyable person in the world, but when he's playing drama, it's terrible to be around him. That's the reason why his wife Brita divorced him; although she still loves him and works with him, she couldn't stand living with him anymore. So when Anthony accepts to play ...","Rated":"APPROVED"}