{"imdbID":"tt0064030","Title":"Anne of the Thousand Days","Year":"1969","Director":"Charles Jarrott","Country":"UK","Language":"English","Production_Co":"Hal Wallis Productions ","Runtime":"145 min","Cast":"Richard Burton, Geneviève Bujold, Irene Papas, Anthony Quayle, John Colicos, Michael Hordern, Katharine Blake, Peter Jeffrey, Joseph O'Conor, William Squire, Valerie Gearon, Vernon Dobtcheff, Gary Bond, Terence Wilton, Denis Quilley","Plot":"Henry VIII of England discards one wife, Katharine of Aragon, who has failed to produce a male heir, in favor of the young and beautiful Anne Boleyn. Henry VIII of England discards one wife Katharine of Aragon, who has failed to produce a male heir, in favor of a young and beautiful woman, Anne Boleyn, whose one-thousand-day reign as Queen of England ends with the loss of her head on the block. Henry weds Ann and soon she gives him a child. The girl, Elizabeth, is a bitter disappointment to Henry, who desperately wants an heir. Anne promises Henry a son \"next time,\" but Henry is doubtful. Shortly thereafter, rumors begin that the King's eye has already wandered. One Jane Seymour is at court for a moment. The Queen has her sent away, but, if Anne will bring Jane back to court, the King promises to sign the Act of Succession to insure that Elizabeth will be Queen. Written by alfiehitchie","Genre":"Drama, History","Keywords":"england, queen, king, heir, marriage","imdbRating":"7.6","imdbVotes":"5,006","Awards":"Won 1 Oscar. Another 5 wins & 16 nominations.","Metascore":"","Released":"18 December 1969 (USA) ","Location":"Plantagenent Manor House of Puttenden, Lingfield, Surrey, England, UK ","Actors":"Richard Burton, Geneviève Bujold, Irene Papas ","Writer":"Bridget Boland (screenplay), John Hale (screenplay) | 2 more credits »","Running_time":"PT145M / 2h 25min","Description":"Directed by Charles Jarrott.  With Richard Burton, Geneviève Bujold, Irene Papas, Anthony Quayle. Henry VIII of England discards one wife, Katharine of Aragon, who has failed to produce a male heir, in favor of the young and beautiful Anne Boleyn.","Rated":"M"}