{"imdbID":"tt0012349","Title":"The Kid","Year":"1921","Director":"Charles Chaplin (as Charlie Chaplin)","Writer":"Charles Chaplin (as Charlie Chaplin)","Taglines":"6 reels of Joy. ","Certificate":"Not Rated | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"El chico ","Budget":"$250,000 (estimated)","Gross":"$2,500,000 (USA)","Production_Co":"Charles Chaplin Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"68 min | 50 min (1971 edit with new Chaplin score)","Sound_Mix":"Mono (new music score) (1971)| Silent","Color":"Black and White","Aspect_Ratio":"1.33 : 1","Trivia":"The production company tried to cheat Charles Chaplin by paying him for this six-reel film what they would ordinarily pay him for a two-reel film, which was about $500,000. Chaplin took the unassembled film out of state until the company agreed to the $1.5 million he was supposed to be paid, plus half the surplus profits on rentals, along with reversion of the film to him after five years on the rental market. See more »","Goofs":"The kid's Brother played by Raymond Lee clearly has fake muscles. (To IMDB Staff: I know this is a 20's movie, and therefore they didn't have sophisticated resources, but they should cast an actor truly strong). See more »","Cast":"Carl Miller, Edna Purviance, Jackie Coogan, Charles Chaplin","Plot":"The Tramp cares for an abandoned child, but events put that relationship in jeopardy. The opening title reads: \"A comedy with a smile--and perhaps a tear\". As she leaves the charity hospital and passes a church wedding, Edna deposits her new baby with a pleading note in a limousine and goes off to commit suicide. The limo is stolen by thieves who dump the baby by a garbage can. Charlie the Tramp finds the baby and makes a home for him. Five years later Edna has become an opera star but does charity work for slum youngsters in hope of finding her boy. A doctor called by Edna discovers the note with the truth about the Kid and reports it to the authorities who come to take him away from Charlie. Before he arrives at the Orphan Asylum Charlie steals him back and takes him to a flophouse. The proprietor reads of a reward for the Kid and takes him to Edna. Charlie is later awakened by a kind policeman who reunites him with the Kid at Edna's mansion. Written by Ed Stephan <stephan@cc.wwu.edu>","Genre":"Comedy, Drama, Family","Keywords":"baby, boy, orphan, 1920s, 1910s","imdbRating":"8.4","imdbVotes":"63,123","Awards":"1 win.","Metascore":"","Released":"6 February 1921 (USA) ","Location":"Chaplin Studios - 1416 N. La Brea Avenue, Hollywood, Los Angeles, California, USA ","Actors":"Charles Chaplin, Edna Purviance, Jackie Coogan ","Running_time":"PT68M / 1h 8min","Description":"Directed by Charles Chaplin.  With Charles Chaplin, Edna Purviance, Jackie Coogan, Carl Miller. The Tramp cares for an abandoned child, but events put that relationship in jeopardy.","Rated":"NOT RATED"}