{"imdbID":"tt0071230","Title":"Blazing Saddles","Year":"1974","Director":"Mel Brooks","Taglines":"Never give a saga an even break!","Certificate":"R | See all certifications »","Country":"USA","Language":"English, Yiddish, German","Also_Known_As":"Black Bart ","Budget":"$2,600,000 (estimated)","Gross":"$119,500,000 (USA)","Production_Co":"Crossbow Productions ","Runtime":"93 min","Sound_Mix":"Mono","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"This film is ranked #6 on AFI's 100 Years... 100 Laughs. See more »","Goofs":"Since the movie breaks the fourth wall frequently, many crew/equipment visibilities may be deliberate. See more »","Crazy_Credits":"Karl Lukas is credited (as Karl Lucas) in opening credits only. See more »","Cast":"Cleavon Little, Gene Wilder, Slim Pickens, Harvey Korman, Madeline Kahn, Mel Brooks, Burton Gilliam, Alex Karras, David Huddleston, Liam Dunn, John Hillerman, George Furth, Jack Starrett, Carol Arthur, Richard Collier","Plot":"To ruin a western town, a corrupt political boss appoints a black sheriff, who promptly becomes his most formidable adversary. The Ultimate Western Spoof. A town where everyone seems to be named Johnson is in the way of the railroad. In order to grab their land, Hedley Lemar (Harvey Korman(R.I.P.)), a politically connected nasty person, sends in his henchmen to make the town unlivable. After the sheriff is killed, the town demands a new sheriff from the Governor (Mel Brooks). Hedley convinces him to send the town the first Black sheriff (Cleavon Little(R.I.P.)) in the west. Bart is a sophisticated urbanite who will have some difficulty winning over the townspeople. Written by John Vogel <jlvogel@comcast.net>","Genre":"Comedy, Western","Keywords":"ethnic slur, sheriff, western town, western spoof, railroad","imdbRating":"7.8","imdbVotes":"92,374","Awards":"Nominated for 3 Oscars. Another 3 wins & 2 nominations.","Metascore":"","Released":"7 February 1974 (USA) ","Location":"Santa Clarita, California, USA ","Actors":"Cleavon Little, Gene Wilder, Slim Pickens ","Writer":"Mel Brooks (screenplay), Norman Steinberg (screenplay) | 4 more credits »","Running_time":"PT93M / 1h 33min","Description":"Directed by Mel Brooks.  With Cleavon Little, Gene Wilder, Slim Pickens, Harvey Korman. To ruin a western town, a corrupt political boss appoints a black sheriff, who promptly becomes his most formidable adversary.","Rated":"R"}