{"imdbID":"tt0091867","Title":"A Room with a View","Year":"1985","Director":"James Ivory","Country":"UK","Language":"English, Italian","Budget":"$3,000,000 (estimated)","Gross":"$20,966,644 (USA)","Production_Co":"Goldcrest Films International, National Film Finance Corporation (NFFC), Curzon Film Distributors ","Runtime":"117 min","Cast":"Maggie Smith, Helena Bonham Carter, Denholm Elliott, Julian Sands, Simon Callow, Patrick Godfrey, Judi Dench, Fabia Drake, Joan Henley, Amanda Walker, Daniel Day-Lewis, Maria Britneva, Rosemary Leach, Rupert Graves, Peter Cellier","Plot":"When Lucy Honeychurch and chaperone Charlotte Bartlett find themselves in Florence with rooms without views, fellow guests Mr Emerson and son George step in to remedy the situation. Meeting... See full summary » When Lucy Honeychurch and chaperone Charlotte Bartlett find themselves in Florence with rooms without views, fellow guests Mr Emerson and son George step in to remedy the situation. Meeting the Emersons could change Lucy's life forever but, once back in England, how will her experiences in Tuscany affect her marriage plans? Written by Bridget Jones","Genre":"Drama, Romance","Keywords":"male nudity, nude bathing, male frontal nudity, pubic hair, male pubic hair","imdbRating":"7.4","imdbVotes":"28,648","Awards":"Won 3 Oscars. Another 21 wins & 23 nominations.","Metascore":"80","Released":"11 April 1986 (UK) ","Location":"Emmetts Garden, Sevenoaks, Kent, England, UK ","Actors":"Maggie Smith, Helena Bonham Carter, Denholm Elliott ","Writer":"E.M. Forster (novel), Ruth Prawer Jhabvala (screenplay)","Running_time":"PT117M / 1h 57min","Description":"Directed by James Ivory.  With Maggie Smith, Helena Bonham Carter, Denholm Elliott, Julian Sands. When Lucy Honeychurch and chaperone Charlotte Bartlett find themselves in Florence with rooms without views, fellow guests Mr Emerson and son George step in to remedy the situation. Meeting the Emersons could change Lucy's life forever but, once back in England, how will her experiences in Tuscany affect her marriage plans?","Rated":"UNRATED"}