{"imdbID":"tt0059578","Title":"For a Few Dollars More","Year":"1965","Director":"Sergio Leone","Taglines":"The man with no name is back... The man in black is waiting! As if one wasn't enough . . . as if death needed a double! ","Certificate":"Approved | See all certifications »","Country":"Italy, Spain, West Germany","Language":"Italian, English","Also_Known_As":"For a Few Dollars More ","Budget":"$750,000 (estimated)","Gross":"ESP 274,756,312 (Spain)","Production_Co":"Produzioni Europee Associati (PEA), Arturo González Producciones Cinematográficas, Constantin Film Produktion ","":"Show detailed company contact information on IMDbPro »","Runtime":"132 min","Sound_Mix":"Mono","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Sergio Leone broke many 1960s Hollywood rules with this film, although he did not know any of them at the time. Among them: showing the shooter and the victim in the same shot, a horse being gunned down, marijuana use, and a rape scene. See more »","Goofs":"When Colonel Mortimer first exits the train and speaks to the officer, alternate shots show his hand either on his hip or grasping his lapel. See more »","Crazy_Credits":"The title credits disappear as if being shot by a gun. See more »","Cast":"Clint Eastwood, Lee Van Cleef, Gian Maria Volontè, Mario Brega, Luigi Pistilli, Aldo Sambrell, Klaus Kinski, Benito Stefanelli, Luis Rodríguez, Panos Papadopulos, Mara Krupp, Roberto Camardiel, Joseph Egger, Tomás Blanco, Lorenzo Robledo","Plot":"Two bounty hunters with the same intentions team up to track down a Western outlaw. Monco is a bounty killer chasing El Indio and his gang. During his hunting, he meets Col. Douglas Mortimer, another bounty killer, and they decide to make a partnership, chase the bad guys together and split the reward. During their enterprise, there will be lots of bullets and funny situations. In the end, one of the bounty hunters shows the real intention of his hunting. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Western","Keywords":"bounty hunter, death, pot smoking, rural setting, mustache","imdbRating":"8.3","imdbVotes":"149,695","Awards":"","Metascore":"","Released":"10 May 1967 (USA) ","Location":"Almería Railway Station, Almería, Andalucía, Spain ","Actors":"Clint Eastwood, Lee Van Cleef, Gian Maria Volontè ","Writer":"Sergio Leone (scenario), Fulvio Morsella (scenario) | 3 more credits »","Running_time":"PT132M / 2h 12min","Description":"Directed by Sergio Leone.  With Clint Eastwood, Lee Van Cleef, Gian Maria Volontè, Mario Brega. Two bounty hunters with the same intentions team up to track down a Western outlaw.","Rated":"APPROVED"}