{"imdbID":"tt0094291","Title":"Wall Street","Year":"1987","Director":"Oliver Stone","Country":"USA","Language":"English","Budget":"$15,000,000 (estimated)","Gross":"$43,848,100 (USA)","Production_Co":"Twentieth Century Fox Film Corporation, American Entertainment Partners L.P., Amercent Films ","Runtime":"126 min","Cast":"Charlie Sheen, Tamara Tunie, Franklin Cover, Chuck Pfeiffer, John C. McGinley, Hal Holbrook, James Karen, Leslie Lyles, Michael Douglas, Faith Geer, Frank Adonis, John Capodice, Martin Sheen, Suzen Murakoshi, Dani Klein","Plot":"A young and impatient stockbroker is willing to do anything to get to the top, including trading on illegal inside information taken through a ruthless and greedy corporate raider who takes the youth under his wing. Bud Fox is a Wall Street stockbroker in early 1980's New York with a strong desire to get to the top. Working for his firm during the day, he spends his spare time working an on angle with the high-powered, extremely successful (but ruthless and greedy) broker Gordon Gekko. Fox finally meets with Gekko, who takes the youth under his wing and explains his philosophy that \"Greed is Good\". Taking the advice and working closely with Gekko, Fox soon finds himself swept into a world of \"yuppies\", shady business deals, the \"good life\", fast money, and fast women; something which is at odds with his family including his estranged father and the blue-collared way Fox was brought up. Written by Murray Chapman <muzzle@cs.uq.oz.au>","Genre":"Crime, Drama","Keywords":"1980s, fired from the job, f word, critique of capitalism, argument","imdbRating":"7.4","imdbVotes":"116,356","Awards":"Won 1 Oscar. Another 9 wins & 4 nominations.","Metascore":"56","Released":"11 December 1987 (USA) ","Location":"The St. James's tower, 415 East 54th Street, Manhattan, New York City, New York, USA ","Actors":"Charlie Sheen, Michael Douglas, Tamara Tunie ","Writer":"Stanley Weiser, Oliver Stone","Running_time":"PT126M / 2h 6min","Description":"Directed by Oliver Stone.  With Charlie Sheen, Michael Douglas, Tamara Tunie, Franklin Cover. A young and impatient stockbroker is willing to do anything to get to the top, including trading on illegal inside information taken through a ruthless and greedy corporate raider who takes the youth under his wing.","Rated":"R"}