{"imdbID":"tt0028313","Title":"The Story of Louis Pasteur","Year":"1936","Director":"William Dieterle","Country":"USA","Language":"English, French, Russian","Production_Co":"First National Productions ","Runtime":"86 min (Turner library print)","Cast":"Paul Muni, Josephine Hutchinson, Anita Louise, Donald Woods, Fritz Leiber, Henry O'Neill, Porter Hall, Raymond Brown, Akim Tamiroff, Halliwell Hobbes, Frank Reicher, Dickie Moore, Ruth Robinson, Walter Kingsford, Iphigenie Castiglioni","Plot":"The biography of the pioneering French microbiologist who helped revolutionize agriculture and medicine. In 1860 Paris, chemist Louis Pasteur is considered a quack within the medical community for advocating that doctors and surgeons wash their hands and boil their instruments to destroy microbes that can kill their patients. He came across this belief when discovering microscopic organisms in sour wine, the organisms which could be killed if heated sufficiently. The belief among the scientific community at large is that the organisms are the result of disease and not the cause. This belief is despite the fact that thirty percent of women die in childbirth due to child bed disease, accounting for twenty thousand annual deaths in Paris alone. The debate takes Pasteur all the way to a meeting with Emperor Napoleon III and his physician, Dr. Charbonnet, who is one of the leading opponents of Pasteur. Several years later - France now a republic - much of Pasteur's reputation changes as a government sanctioned experiment with anthrax and sheep shows that a vaccine created by Pasteur proves ... Written by Huggo","Genre":"Biography, Drama, History","Keywords":"microbe, vaccine, france, anthrax, rabies","imdbRating":"7.4","imdbVotes":"1,521","Awards":"Won 3 Oscars. Another 2 wins & 2 nominations.","Metascore":"","Released":"February 1936 (USA) ","Location":"Stage 12, Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA ","Actors":"Paul Muni, Josephine Hutchinson, Anita Louise ","Writer":"Sheridan Gibney (story), Pierre Collings (story)","Running_time":"PT86M / 1h 26min","Description":"Directed by William Dieterle.  With Paul Muni, Josephine Hutchinson, Anita Louise, Donald Woods. The biography of the pioneering French microbiologist who helped revolutionize agriculture and medicine.","Rated":"UNRATED"}