{"imdbID":"tt0096283","Title":"My Neighbor Totoro","Year":"1988","Director":"Hayao Miyazaki","Writer":"Hayao Miyazaki","Certificate":"G | See all certifications »","Country":"Japan","Language":"Japanese","Also_Known_As":"My Neighbor Totoro ","Budget":"$3,700,000 (estimated)","Production_Co":"Tokuma Japan Communications, Studio Ghibli, Nibariki ","":"Show detailed company contact information on IMDbPro »","Runtime":"86 min","Sound_Mix":"Dolby (Stereo)","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The movie initially did not do well at the box office, and did not break even until about two years after the release when stuffed dolls based on the King Totoro character hit the shelves. See more »","Goofs":"Some of the whiskers on Mei's drawing of Totoro vanish in a wide view. See more »","Crazy_Credits":"The ending sequence has animation of Totoro and some of the characters from the film walking. See more »","Cast":"Chika Sakamoto, Hitoshi Takagi, Noriko Hidaka, Shigesato Itoi, Tanie Kitabayashi, Toshiyuki Amagasa, Naoki Tatsuta, Frank Welker, Lea Salonga, Pat Carroll, Tim Daly, Paul Butcher, Cheryl Chase, Shigeru Chiba, Lara Cody","Plot":"When two girls move to the country to be near their ailing mother, they have adventures with the wonderous forest spirits who live nearby. Two young girls, Satsuki and her younger sister Mei, move into a house in the country with their father to be closer to their hospitalized mother. Satsuki and Mei discover that the nearby forest is inhabited by magical creatures called Totoros (pronounced toe-toe-ro). They soon befriend these Totoros, and have several magical adventures. Written by Christopher E. Meadows <cmeadows@nyx.cs.du.edu>","Genre":"Animation, Family, Fantasy","Keywords":"girl, forest spirit, japanese animation, magical realism, female protagonist","imdbRating":"8.3","imdbVotes":"161,605","Awards":"5 wins & 1 nomination.","Metascore":"","Released":"16 April 1988 (Japan) ","Actors":"Hitoshi Takagi, Noriko Hidaka, Chika Sakamoto ","Running_time":"PT86M / 1h 26min","Description":"Directed by Hayao Miyazaki.  With Hitoshi Takagi, Noriko Hidaka, Chika Sakamoto, Shigesato Itoi. When two girls move to the country to be near their ailing mother, they have adventures with the wonderous forest spirits who live nearby.","Rated":"G"}