{"imdbID":"tt0032553","Title":"The Great Dictator","Year":"1940","Director":"Charles Chaplin","Writer":"Charles Chaplin","Taglines":"The Comedy Masterpiece! ","Certificate":"See all certifications »","Country":"USA","Language":"English, Esperanto","Also_Known_As":"El gran dictador ","Budget":"$2,000,000 (estimated)","Production_Co":"Charles Chaplin Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"125 min","Sound_Mix":"Mono (RCA Sound System)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Charles Chaplin maintained a closed set throughout production, partly out of fear that other filmmakers would steal his idea. When Life magazine printed an unauthorized photo of him as dictator Adenoid Hynkel, Chaplin sued and won. Half the issues printed for that week were recalled before they could hit news stands. See more »","Goofs":"(at around 42 mins) When Hynkel opens the filing cabinet behind his desk to reveal and look into the full length mirrors inside of it, the studio lights can briefly be seen reflected in them. See more »","Crazy_Credits":"The film is obviously a satire on Adolf Hitler, represented by Adenoid Hynkel, and its story is based on Hynkel looking exactly like \"a Jewish barber\": both are played by Charles Chaplin. But it begins with a notice: \"Any resemblance between Hynkel the dictator and the Jewish barber is purely co-incidental\". See more »","Cast":"Charles Chaplin, Jack Oakie, Reginald Gardiner, Henry Daniell, Billy Gilbert, Grace Hayle, Carter DeHaven, Paulette Goddard, Maurice Moscovitch, Emma Dunn, Bernard Gorcey, Paul Weigel, Chester Conklin, Esther Michelson, Hank Mann","Plot":"Dictator Adenoid Hynkel tries to expand his empire while a poor Jewish barber tries to avoid persecution from Hynkel's regime. Twenty years after the end of WWI in which the nation of Tomainia was on the losing side, Adenoid Hynkel has risen to power as the ruthless dictator of the country. He believes in a pure Aryan state, and the decimation of the Jews. This situation is unknown to a simple Jewish-Tomainian barber who has since been hospitalized the result of a WWI battle. Upon his release, the barber, who had been suffering from memory loss about the war, is shown the new persecuted life of the Jews by many living in the Jewish ghetto, including a washerwoman named Hannah, with whom he begins a relationship. The barber is ultimately spared such persecution by Commander Schultz, who he saved in that WWI battle. The lives of all Jews in Tomainia are eventually spared with a policy shift by Hynkel himself, who is doing so for ulterior motives. But those motives include a want for world domination, starting with the invasion of neighboring Osterlich, which may be threatened by Benzino Napaloni, the dictator ... Written by Huggo","Genre":"Comedy, Drama, War","Keywords":"barber, dictator, jew, battle, persecution","imdbRating":"8.5","imdbVotes":"130,592","Awards":"Nominated for 5 Oscars. Another 5 wins & 1 nomination.","Metascore":"","Released":"7 March 1941 (USA) ","Location":"Agoura Hills, California, USA ","Actors":"Charles Chaplin, Paulette Goddard, Jack Oakie ","Running_time":"PT125M / 2h 5min","Description":"Directed by Charles Chaplin.  With Charles Chaplin, Paulette Goddard, Jack Oakie, Reginald Gardiner. Dictator Adenoid Hynkel tries to expand his empire while a poor Jewish barber tries to avoid persecution from Hynkel's regime.","Rated":"N/A"}