{"imdbID":"tt0058461","Title":"A Fistful of Dollars","Year":"1964","Director":"Sergio Leone","Taglines":"In his own way he is perhaps, the most dangerous man who ever lived! ","Country":"Italy, Spain, West Germany","Language":"Italian, Spanish, English","Also_Known_As":"A Fist Full of Dollars ","Budget":"$200,000 (estimated)","Gross":"ESP 134,156,214 (Spain)","Production_Co":"Jolly Film, Constantin Film Produktion, Ocean Films ","":"Show detailed company contact information on IMDbPro »","Runtime":"99 min","Sound_Mix":"Mono (Western Electric Sound System)","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"During its 1969 American re-release, it was double-billed with For a Few Dollars More (1965). See more »","Goofs":"Joe walks into a room with five bad guys, and starts shooting. Only four gunshots are heard, but when the smoke clears all five baddies are down. See more »","Cast":"Clint Eastwood, Marianne Koch, Gian Maria Volontè, Wolfgang Lukschy, Sieghardt Rupp, Joseph Egger, Antonio Prieto, José Calvo, Margarita Lozano, Daniel Martín, Benito Stefanelli, Mario Brega, Bruno Carotenuto, Aldo Sambrell","Plot":"A wandering gunfighter plays two rival families against each other in a town torn apart by greed, pride, and revenge. An anonymous, but deadly man rides into a town torn by war between two factions, the Baxters and the Rojo's. Instead of fleeing or dying, as most other would do, the man schemes to play the two sides off each other, getting rich in the bargain. Written by Andrew Hyatt <dres@uiuc.edu>","Genre":"Action, Drama, Western","Keywords":"bar, revenge, drifter, mexican, grindhouse film","imdbRating":"8.0","imdbVotes":"139,338","Awards":"1 win & 1 nomination.","Metascore":"","Released":"18 January 1967 (USA) ","Location":"Aldea del Fresno, Madrid, Spain ","Actors":"Clint Eastwood, Gian Maria Volontè, Marianne Koch ","Writer":"Adriano Bolzoni (story) (as A. Bonzzoni), Víctor Andrés Catena (story) | 4 more credits »","Running_time":"PT99M / 1h 39min","Description":"Directed by Sergio Leone.  With Clint Eastwood, Gian Maria Volontè, Marianne Koch, Wolfgang Lukschy. A wandering gunfighter plays two rival families against each other in a town torn apart by greed, pride, and revenge.","Rated":"R"}