{"imdbID":"tt0093277","Title":"Ironweed","Year":"1987","Director":"Hector Babenco","Country":"USA","Language":"English","Budget":"$27,000,000 (estimated)","Gross":"$7,393,346 (USA)","Production_Co":"Home Box Office (HBO), Keith Barish Productions, TAFT Entertainment Pictures ","Runtime":"143 min","Cast":"Jack Nicholson, Meryl Streep, Carroll Baker, Michael O'Keefe, Diane Venora, Fred Gwynne, Margaret Whitton, Tom Waits, Jake Dengel, Nathan Lane, James Gammon, Will Zahrn, Laura Esterman, Joe Grifasi, Hy Anzell","Plot":"A schizophrenic drifter spends Halloween in his home town after returning there for the first time in decades. Albany, New York, Halloween, 1938. Francis Phelan and Helen Archer are bums, back in their birth city. She was a singer on the radio, he a major league pitcher. Death surrounds them: she's sick, a pal has cancer, he digs graves at the cemetery and visits the grave of his infant son whom he dropped; visions of his past haunt him, including ghosts of two men he killed. That night, out drinking, Helen tries to sing at a bar. Next day, Fran visits his wife and children and meets a grandson. He could stay, but decides it's not for him. Helen gets their things out of storage and finds a hotel. Amidst their mistakes and dereliction, the film explores their code of fairness and loyalty. Written by <jhailey@hotmail.com>","Genre":"Drama","Keywords":"albany new york, drifter, cancer, singer, ghost","imdbRating":"6.8","imdbVotes":"6,057","Awards":"Nominated for 2 Oscars. Another 2 wins & 2 nominations.","Metascore":"","Released":"12 February 1988 (USA) ","Location":"Lark Street and Clinton Ave, Albany, New York, USA ","Actors":"Jack Nicholson, Meryl Streep, Carroll Baker ","Writer":"William Kennedy (novel), William Kennedy (screenplay)","Running_time":"PT143M / 2h 23min","Description":"Directed by Hector Babenco.  With Jack Nicholson, Meryl Streep, Carroll Baker, Michael O'Keefe. A schizophrenic drifter spends Halloween in his home town after returning there for the first time in decades.","Rated":"R"}