{"imdbID":"tt0046250","Title":"Roman Holiday","Year":"1953","Director":"William Wyler","Taglines":"Audrey Hepburn at her Oscar-winning best in an immortal comedy-romance! ","Certificate":"Not Rated | See all certifications »","Country":"USA","Language":"English, Italian, German","Also_Known_As":"La princesa que quería vivir ","Budget":"$1,500,000 (estimated)","Production_Co":"Paramount Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"118 min | 117 min (cut)","Sound_Mix":"Mono (Western Electric Recording)","Color":"Black and White (archive footage)| Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Paramount had assets frozen in Italy and was delighted to take advantage of the opportunity to film in Rome. See more »","Goofs":"Ann wears a white tie until she sits down on the Spanish steps. The tie is gone and the collar is open when Joe speaks to her on the next shot. When they are stopped at the Palazzo Venezia, Ann is wearing a striped neckerchief and continues to do so for the rest of the evening. See more »","Cast":"Gregory Peck, Audrey Hepburn, Eddie Albert, Hartley Power, Harcourt Williams, Margaret Rawlings, Tullio Carminati, Paolo Carlini, Claudio Ermelli, Paola Borboni, Alfredo Rizzo, Laura Solari, Gorella Gori","Plot":"A bored and sheltered princess escapes her guardians and falls in love with an American newsman in Rome. Joe Bradley is a reporter for the American News Service in Rome, a job he doesn't much like as he would rather work for what he considers a real news agency back in the States. He is on the verge of getting fired when he, sleeping in and getting caught in a lie by his boss Hennessy, misses an interview with HRH Princess Ann, who is on a goodwill tour of Europe, Rome only her latest stop. However, he thinks he may have stumbled upon a huge scoop. Princess Ann has officially called off all her Rome engagements due to illness. In reality, he recognizes the photograph of her as being the young well but simply dressed drunk woman he rescued off the street last night (as he didn't want to turn her into the police for being a vagrant), and who is still in his small studio apartment sleeping off her hangover. What Joe doesn't know is that she is really sleeping off the effects of a sedative given to her by her doctor to calm her down after an anxiety attack, that anxiety because she hates her... Written by Huggo","Genre":"Comedy, Romance","Keywords":"princess, american, reporter, sedative, photograph","imdbRating":"8.1","imdbVotes":"95,996","Awards":"Won 3 Oscars. Another 7 wins & 15 nominations.","Metascore":"76","Released":"2 September 1953 (USA) ","Location":"Viale del Policlinico, Rome, Lazio, Italy ","Actors":"Gregory Peck, Audrey Hepburn, Eddie Albert ","Writer":"Ian McLellan Hunter (screenplay), John Dighton (screenplay) | 2 more credits »","Running_time":"PT118M / 1h 58min","Description":"Directed by William Wyler.  With Gregory Peck, Audrey Hepburn, Eddie Albert, Hartley Power. A bored and sheltered princess escapes her guardians and falls in love with an American newsman in Rome.","Rated":"NOT RATED"}