{"imdbID":"tt0053580","Title":"The Alamo","Year":"1960","Director":"John Wayne","Writer":"James Edward Grant (original screenplay)","Country":"USA","Language":"English, Spanish","Budget":"$12,000,000 (estimated)","Gross":"$7,910,000 (USA)","Production_Co":"Batjac Productions, Alamo Company, The ","Runtime":"167 min | 203 min (director's cut) (1993 video release) | 140 min (1967 re-release) | 192 min (roadshow)","Cast":"John Wayne, Richard Widmark, Laurence Harvey, Frankie Avalon, Patrick Wayne, Linda Cristal, Joan O'Brien, Chill Wills, Joseph Calleia, Ken Curtis, Carlos Arruza, Jester Hairston, Veda Ann Borg, John Dierkes, Denver Pyle","Plot":"A small band of soldiers sacrifice their lives in hopeless combat against a massive army in order to prevent a tyrant from smashing the new Republic of Texas. In 1836 General Santa Anna and the Mexican army is sweeping across Texas. To be able to stop him, General Sam Houston needs time to get his main force into shape. To buy that time he orders Colonel William Travis to defend a small mission on the Mexicans' route at all costs. Travis' small troop is swelled by groups accompanying Jim Bowie and Davy Crockett, but as the situation becomes ever more desperate Travis makes it clear there will be no shame if they leave while they can. Written by Jeremy Perkins <jwp@aber.ac.uk>","Genre":"Adventure, Drama, History","Keywords":"army, texas, combat, mexican, mexican army","imdbRating":"6.9","imdbVotes":"10,516","Awards":"Won 1 Oscar. Another 6 wins & 8 nominations.","Metascore":"","Released":"24 October 1960 (USA) ","Location":"Alamo Village - Highway 674, Brackettville, Texas, USA ","Actors":"John Wayne, Richard Widmark, Laurence Harvey ","Running_time":"PT167M / 2h 47min","Description":"Directed by John Wayne.  With John Wayne, Richard Widmark, Laurence Harvey, Frankie Avalon. A small band of soldiers sacrifice their lives in hopeless combat against a massive army in order to prevent a tyrant from smashing the new Republic of Texas.","Rated":"UNRATED"}