{"imdbID":"tt0084503","Title":"Pink Floyd The Wall","Year":"1982","Director":"Alan Parker","Taglines":"Pink Floyd The Wall. Now The Film. ","Certificate":"R | See all certifications »","Country":"UK","Language":"English","Also_Known_As":"Pink Floyd: The Wall ","Gross":"SEK 2,384,861 (Sweden)","Production_Co":"Goldcrest Films International, Metro-Goldwyn-Mayer (MGM), Tin Blue ","Runtime":"95 min","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby (35 mm prints)| Mono (some 35 mm prints)","Color":"Color (Metrocolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Bob Geldof has only one line in the entire movie that is not a lyric by Pink Floyd: \"Take that, fuckers!\" See more »","Goofs":"In the \"Is there Anybody Out There\" sequence, when Pink is clawing at the wall, the blood on his hand (from the previous, hotel-trashing scene) switches hands repeatedly. See more »","Cast":"Bob Geldof, Christine Hargreaves, James Laurenson, Eleanor David, Kevin McKeon, Bob Hoskins, David Bingham, Jenny Wright, Alex McAvoy, Ellis Dale, James Hazeldine, Ray Mort, Margery Mason, Robert Bridges, Michael Ensign","Plot":"A confined but troubled rock star descends into madness in the midst of his physical and social isolation from everyone. The movie tells the story of rock singer \"Pink\" who is sitting in his hotel room in Los Angeles, burnt out from the music business and only able to perform on stage with the help of drugs. Based on the 1979 double album \"The Wall\" by Pink Floyd, the film begins in Pink's youth where he is crushed by the love of his mother. Several years later, he is punished by the teachers in school because he is starting to write poems. He slowly begins to build a wall around himself to be protected from the world outside. The film shows all this in massive and epic pictures until the very end where he tears down the wall and breaks free. Written by Harald Mayr <marvin@bike.augusta.de>","Genre":"Animation, Drama, Musical","Keywords":"wall, rock star, drugs, isolation, pink floyd","imdbRating":"8.0","imdbVotes":"58,250","Awards":"Won 2 BAFTA Film Awards. Another 1 nomination.","Metascore":"","Released":"17 September 1982 (USA) ","Location":"London, England, UK ","Actors":"Bob Geldof, Christine Hargreaves, James Laurenson ","Writer":"Roger Waters (album \"The Wall\"), Roger Waters (screenplay)","Running_time":"PT95M / 1h 35min","Description":"Directed by Alan Parker.  With Bob Geldof, Christine Hargreaves, James Laurenson, Eleanor David. A confined but troubled rock star descends into madness in the midst of his physical and social isolation from everyone.","Rated":"R"}