{"imdbID":"tt0050212","Title":"The Bridge on the River Kwai","Year":"1957","Director":"David Lean","Taglines":"It spans a whole new world of entertainment!","Certificate":"See all certifications »","Country":"UK, USA","Language":"English, Japanese, Thai","Also_Known_As":"El puente sobre el río Kwai ","Budget":"$3,000,000 (estimated)","Gross":"$27,200,000 (USA)","Production_Co":"Columbia Pictures Corporation, Horizon Pictures (II) ","":"Show detailed company contact information on IMDbPro »","Runtime":"161 min","Sound_Mix":"70 mm 6-Track (70 mm prints) (RCA Sound Recording)| Mono (35 mm prints) (RCA Sound Recording)| 4-Track Stereo (Linear PCM)","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Sam Spiegel had made the decision to credit Pierre Boulle as screenwriter despite the French writer's lack of involvement in the film. (Both Carl Foreman and Michael Wilson were blacklisted so therefore ineligible for screen credit.) This was a sharp point of dispute with David Lean who felt at the very least that he and Wilson should have received credit. The dispute continued to escalate and actually became physical at the Academy Awards that year. It is said that Spiegel and Lean dueled with the two Oscars they had just won. See more »","Goofs":"In the opening train sequence there is an engine and an open car full with POWs in front of the car with a Japanese soldier on top with a machine gun. In the next scene the train has approached the end of the track and the engine and the open car have vanished. In the immediately next scene the engine and the open car again appear from which the POWs are deboarding. See more »","Crazy_Credits":"And introducing Geoffrey Horne See more »","Cast":"William Holden, Alec Guinness, Jack Hawkins, Sessue Hayakawa, James Donald, Geoffrey Horne, André Morell, Peter Williams, John Boxer, Percy Herbert, Harold Goodwin, Ann Sears, Heihachirô Ôkawa, Keiichirô Katsumoto, M.R.B. Chakrabandhu","Plot":"After settling his differences with a Japanese PoW camp commander, a British colonel co-operates to oversee his men's construction of a railway bridge for their captors - while oblivious to a plan by the Allies to destroy it. The film deals with the situation of British prisoners of war during World War II who are ordered to build a bridge to accommodate the Burma-Siam railway. Their instinct is to sabotage the bridge but, under the leadership of Colonel Nicholson, they are persuaded that the bridge should be constructed as a symbol of British morale, spirit and dignity in adverse circumstances. At first, the prisoners admire Nicholson when he bravely endures torture rather than compromise his principles for the benefit of the Japanese commandant Saito. He is an honorable but arrogant man, who is slowly revealed to be a deluded obsessive. He convinces himself that the bridge is a monument to British character, but actually is a monument to himself, and his insistence on its construction becomes a subtle form of collaboration with the enemy. Unknown to him, the Allies have sent a mission into the jungle, led by Warden and an American, Shears, to blow up the bridge. Written by alfiehitchie","Genre":"Adventure, Drama, War","Keywords":"construction, bridge, jungle, river, torture","imdbRating":"8.2","imdbVotes":"143,258","Awards":"Won 7 Oscars. Another 23 wins & 7 nominations.","Metascore":"","Released":"11 October 1957 (UK) ","Location":"Kalugamuwa, Gelioya, Kandy, Sri Lanka ","Actors":"William Holden, Alec Guinness, Jack Hawkins ","Writer":"Pierre Boulle (novel), Carl Foreman (screenplay) | 1 more credit »","Running_time":"PT161M / 2h 41min","Description":"Directed by David Lean.  With William Holden, Alec Guinness, Jack Hawkins, Sessue Hayakawa. After settling his differences with a Japanese PoW camp commander, a British colonel co-operates to oversee his men's construction of a railway bridge for their captors - while oblivious to a plan by the Allies to destroy it.","Rated":"N/A"}