{"imdbID":"tt0025164","Title":"The Gay Divorcee","Year":"1934","Director":"Mark Sandrich","Country":"USA","Language":"English, French, Italian","Budget":"$520,000 (estimated)","Production_Co":"RKO Radio Pictures ","Runtime":"107 min","Cast":"Fred Astaire, Ginger Rogers, Alice Brady, Edward Everett Horton, Erik Rhodes, Eric Blore, Lillian Miles, Charles Coleman, William Austin, Betty Grable","Plot":"Mimi Glossop wants a divorce so her Aunt Hortense hires a professional to play the correspondent in apparent infidelity. American dancer Guy Holden meets Mimi while visiting Brightbourne (... See full summary » Mimi Glossop wants a divorce so her Aunt Hortense hires a professional to play the correspondent in apparent infidelity. American dancer Guy Holden meets Mimi while visiting Brightbourne (Brighton) and she thinks he is the correspondent. The plot is really an excuse for song and dance. The movie won three Academy nominations and the first Oscar for Best Song: \"The Continental\", a twenty-two minute production number. Written by Ed Stephan <stephan@cc.wwu.edu>","Genre":"Comedy, Musical, Romance","Keywords":"divorce, dancer, password, lawyer, luggage","imdbRating":"7.6","imdbVotes":"5,129","Awards":"Won 1 Oscar. Another 5 nominations.","Metascore":"","Released":"12 October 1934 (USA) ","Location":"Santa Monica, California, USA ","Actors":"Fred Astaire, Ginger Rogers, Alice Brady ","Writer":"Dwight Taylor (from the book by), Kenneth S. Webb (musical adaptation) (as Kenneth Webb) | 4 more credits »","Running_time":"PT107M / 1h 47min","Description":"Directed by Mark Sandrich.  With Fred Astaire, Ginger Rogers, Alice Brady, Edward Everett Horton. Mimi Glossop wants a divorce so her Aunt Hortense hires a professional to play the correspondent in apparent infidelity. American dancer Guy Holden meets Mimi while visiting Brightbourne (Brighton) and she thinks he is the correspondent. The plot is really an excuse for song and dance. The movie won three Academy nominations and the first Oscar for Best Song: \"The Continental\", a twenty-two ...","Rated":"APPROVED"}