{"imdbID":"tt0051525","Title":"The Defiant Ones","Year":"1958","Director":"Stanley Kramer","Country":"USA","Language":"English","Production_Co":"Curtleigh Productions, Stanley Kramer Productions ","Runtime":"96 min (Turner library print) (copyright length)","Cast":"Tony Curtis, Sidney Poitier, Theodore Bikel, Charles McGraw, Lon Chaney Jr., King Donovan, Claude Akins, Lawrence Dobkin, Whit Bissell, Carl 'Alfalfa' Switzer, Kevin Coughlin, Cara Williams","Plot":"Two escaped convicts chained together, white and black, must learn to get along in order to elude capture. When the truck that is transporting convicts has an accident on the road, the inmates John \"Joker\" Jackson and Noah Cullen that are chained to each other escape. They hate each other but they need to help each other to succeed in their intent of going north to jump in a train and reach freedom. Meanwhile the humane Sheriff Max Muller organizes a posse to track them down in a civilized manner and respecting justice. Joker and Cullen reach a small farm where a lonely woman helps them to get rid of their chains. She offers to drive her car with Joker and her son Billy while Cullen would escape through the swamp to the railroad. But when Joker learns that she sent Cullen to a trap, he leaves her and is shot in the shoulder by Billy. Joker seeks out Cullen to save him and when they meet each other, their former hatred has changed to friendship and respect. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Crime, Drama","Keywords":"escape, convict, train, freedom, swamp","imdbRating":"7.7","imdbVotes":"9,239","Awards":"Won 2 Oscars. Another 12 wins & 21 nominations.","Metascore":"","Released":"27 September 1958 (USA) ","Location":"Between Piru & Fillmore, Southern Pacific Railroad, California, USA ","Actors":"Tony Curtis, Sidney Poitier, Theodore Bikel ","Writer":"Nedrick Young, Harold Jacob Smith","Running_time":"PT96M / 1h 36min","Description":"Directed by Stanley Kramer.  With Tony Curtis, Sidney Poitier, Theodore Bikel, Charles McGraw. Two escaped convicts chained together, white and black, must learn to get along in order to elude capture.","Rated":"APPROVED"}