{"imdbID":"tt0031679","Title":"Mr. Smith Goes to Washington","Year":"1939","Director":"Frank Capra","Taglines":"Entertainment As Powerful As the Strength of the People! As Great As the Genius of Capra! ","Certificate":"Not Rated | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Frank Capra's Mr. Smith Goes to Washington ","Budget":"$1,500,000 (estimated)","Production_Co":"Columbia Pictures Corporation ","":"Show detailed company contact information on IMDbPro »","Runtime":"129 min | 120 min (TV)","Sound_Mix":"Mono (Western Electric Mirrophonic Recording)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"According to the New York Times, \"the Boy Scouts of America objected to having any part in Mr. Capra's reform movement,\" and Frank Capra therefore had to use the fictitious name of the Boy Rangers. See more »","Goofs":"(at around 30 mins) Twice, Saunders says that Jefferson Smith is going to go \"up\" to Mt. Vernon, the home of George Washington. Mt. Vernon is approximately 15 miles south of the Capitol in Washington [you can check that using Google maps], and is right on the Potomac River downstream from Washington, so it is not \"up\" in a north-south sense nor in the sense of elevation. The script should have had Saunders saying that Smith was going \"down\" to Mt. Vernon, which is how anyone living or working in Washington would have put it. See more »","Cast":"Jean Arthur, James Stewart, Claude Rains, Edward Arnold, Guy Kibbee, Thomas Mitchell, Eugene Pallette, Beulah Bondi, H.B. Warner, Harry Carey, Astrid Allwyn, Ruth Donnelly, Grant Mitchell, Porter Hall, Larry Simms","Plot":"A naive man is appointed to fill a vacancy in the US Senate. His plans promptly collide with political corruption, but he doesn't back down. Naive and idealistic Jefferson Smith, leader of the Boy Rangers, is appointed on a lark by the spineless governor of his state. He is reunited with the state's senior senator--presidential hopeful and childhood hero, Senator Joseph Paine. In Washington, however, Smith discovers many of the shortcomings of the political process as his earnest goal of a national boys' camp leads to a conflict with the state political boss, Jim Taylor. Taylor first tries to corrupt Smith and then later attempts to destroy Smith through a scandal. Written by James Yu <jamestyu@ccwf.cc.utexas.edu>","Genre":"Drama","Keywords":"u.s. senate, corruption, camp, governor, senate","imdbRating":"8.3","imdbVotes":"74,526","Awards":"Won 1 Oscar. Another 4 wins & 11 nominations.","Metascore":"","Released":"19 October 1939 (USA) ","Location":"Columbia/Sunset Gower Studios - 1438 N. Gower Street, Hollywood, Los Angeles, California, USA ","Actors":"James Stewart, Jean Arthur, Claude Rains ","Writer":"Sidney Buchman (screen play), Lewis R. Foster (story)","Running_time":"PT129M / 2h 9min","Description":"Directed by Frank Capra.  With James Stewart, Jean Arthur, Claude Rains, Edward Arnold. A naive man is appointed to fill a vacancy in the US Senate. His plans promptly collide with political corruption, but he doesn't back down.","Rated":"NOT RATED"}