{"imdbID":"tt0017925","Title":"The General","Year":"1926","Taglines":"Love, Locomotives and Laughs ","Certificate":"Unrated | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"General ","Budget":"$750,000 (estimated)","Production_Co":"Buster Keaton Productions, Joseph M. Schenck Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"67 min | 80 min (1982) | 83 min (1962) | 75 min (2003 alternate) | 78 min","Sound_Mix":"Silent","Color":"Black and White (Sepiatone)","Aspect_Ratio":"1.33 : 1","Trivia":"Producer Joseph M. Schenck gave Buster Keaton $400,000 to make this film, so the production company moved with 18 freight cars of props and sets to Oregon. In the next two months the town of Marietta, Georgia, was built near the Oregon town of Cottage Grove. See more »","Goofs":"When Johnnie is running through the woods to escape the Union soldiers, his hat drops from the tree before his head hits the hat to dislodge it. See more »","Cast":"Buster Keaton, Marion Mack, Glen Cavender, Jim Farley, Frederick Vroom, Charles Henry Smith, Frank Barnes, Joe Keaton, Mike Donlin, Tom Nawn","Plot":"When Union spies steal an engineer's beloved locomotive, he pursues it single-handedly and straight through enemy lines. Johnnie loves his train (\"The General\") and Annabelle Lee. When the Civil War begins he is turned down for service because he's more valuable as an engineer. Annabelle thinks it's because he's a coward. Union spies capture The General with Annabelle on board. Johnnie must rescue both his loves. Written by Ed Stephan <stephan@cc.wwu.edu>","Genre":"Action, Adventure, Comedy","Keywords":"train, confederate army, railway chase, general, engineer","imdbRating":"8.3","imdbVotes":"51,094","Awards":"2 wins & 1 nomination.","Metascore":"","Released":"24 February 1927 (France) ","Location":"34560 Row River Rd., Cottage Grove, Oregon, USA ","Actors":"Buster Keaton, Marion Mack, Glen Cavender ","Director":"Clyde Bruckman, Buster Keaton","Writer":"Buster Keaton, Clyde Bruckman | 2 more credits »","Running_time":"PT67M / 1h 7min","Description":"Directed by Clyde Bruckman, Buster Keaton.  With Buster Keaton, Marion Mack, Glen Cavender, Jim Farley. When Union spies steal an engineer's beloved locomotive, he pursues it single-handedly and straight through enemy lines.","Rated":"UNRATED"}