{"imdbID":"tt0062765","Title":"Bullitt","Year":"1968","Director":"Peter Yates","Taglines":"The word 'cop' isn't written all over him - something more puzzling is. ","Certificate":"PG | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Bullit ","Budget":"$5,500,000 (estimated)","Gross":"SEK 4,480,000 (Sweden)","Production_Co":"Warner Brothers/Seven Arts, Solar Productions ","Runtime":"114 min","Sound_Mix":"Mono","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"The safe house scenes were filmed in and around the Kennedy Hotel at 226 The Embarcadero near Howard Street. That building, along with the two-level freeway behind it, were torn down as part of a major development of the waterfront after the 1989 Loma Prieta earthquake. See more »","Goofs":"The DVD's subtitles read \"mess and baum scissors\" instead of \"Metzenbaum scissors\" which were named after the American surgeon/inventor Myron Firth Metzenbaum. See more »","Cast":"Steve McQueen, Robert Vaughn, Jacqueline Bisset, Don Gordon, Simon Oakland, Norman Fell, Robert Duvall, Georg Stanford Brown, Justin Tarr, Carl Reindel, Felice Orlandi, Vic Tayback, Robert Lipton, Ed Peck, Pat Renella","Plot":"An all guts, no glory San Francisco cop becomes determined to find the underworld kingpin that killed the witness in his protection. High profile San Francisco Police Lieutenant Frank Bullitt is asked personally by ambitious Walter Chalmers, who is in town to hold a US Senate subcommittee hearing on organized crime, to guard Johnny Ross, a Chicago based mobster who is about to turn evidence against the organization at the hearing. Chalmers wants Ross' safety at all cost, or else Bullitt will pay the consequences. Bullitt and his team of Sergeant Delgetti and Detective Carl Stanton have Ross in protective custody for 48 hours over the weekend until Ross provides his testimony that upcoming Monday. Bullitt's immediate superior, Captain Samuel Bennet, gives Bullitt full authority to lead the case, no questions asked for any move Bullitt makes. When an incident occurs early during their watch, Bullitt is certain that Ross and/or Chalmers are not telling them the full story to protect Ross properly. Without telling Bennet or an incensed Chalmers, Bullitt clandestinely moves Ross while he tries to find out who is after ... Written by Huggo","Genre":"Action, Crime, Mystery","Keywords":"witness, police, investigation, detective, killer","imdbRating":"7.5","imdbVotes":"44,931","Awards":"Won 1 Oscar. Another 6 wins & 9 nominations.","Metascore":"","Released":"17 October 1968 (USA) ","Location":"San Francisco Police Department, 850 Bryant Street, San Francisco, California, USA ","Actors":"Steve McQueen, Jacqueline Bisset, Robert Vaughn ","Writer":"Alan Trustman (screenplay) (as Alan R. Trustman), Harry Kleiner (screenplay) | 1 more credit »","Running_time":"PT114M / 1h 54min","Description":"Directed by Peter Yates.  With Steve McQueen, Jacqueline Bisset, Robert Vaughn, Don Gordon. An all guts, no glory San Francisco cop becomes determined to find the underworld kingpin that killed the witness in his protection.","Rated":"PG"}