{"imdbID":"tt0062229","Title":"Le Samouraï","Year":"1967","Director":"Jean-Pierre Melville","Taglines":"De kaldte ham Samoraien - den ensomme morder ","Certificate":"PG | See all certifications »","Country":"France, Italy","Language":"French","Also_Known_As":"Le Samourai ","Opening_Weekend":"$39,481 (USA) (28 February 1997)","Gross":"$39,481 (USA) (28 February 1997)","Production_Co":"Compagnie Industrielle et Commerciale Cinématographique (CICC), Fida Cinematografica, Filmel ","Runtime":"105 min","Sound_Mix":"Mono","Color":"Color (Eastmancolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Melville worried how he was going to shoot the scene where Jef drives the stolen car right into the scrap garage. Without missing a beat, Delon drove the car down the narrow alley and into the garage in one shot. See more »","Goofs":"When rounding up suspects the inspector refers to the population as 10 million. The 1968 population of Paris city proper was only 2.6 million. The population of the urban area was only 8.2 million. See more »","Cast":"Alain Delon, François Périer, Nathalie Delon, Cathy Rosier, Jacques Leroy, Michel Boisrond, Robert Favart, Jean-Pierre Posier, Catherine Jourdan, Roger Fradet, Carlo Nell, Robert Rondo, André Salgues, André Thorent, Jacques Deschamps","Plot":"After killing a night-club owner, professional hitman Jef Costello is seen by witnesses. His efforts to provide himself with an alibi fail and more and more he gets driven into a corner. Hitman Jef Costello is a perfectionist who always carefully plans his murders and who never gets caught. One night however, after killing a night-club owner, he's seen by witnesses. His efforts to provide himself with an alibi fail and more and more he gets driven into a corner. Written by Leon Wolters <wolters@strw.LeidenUniv.nl>","Genre":"Crime, Drama, Mystery","Keywords":"alibi, murder, gangster, witness, suspicion","imdbRating":"8.1","imdbVotes":"30,690","Awards":"","Metascore":"","Released":"January 1967 (USA) ","Location":"11 Boulevard de l'Amiral Bruix, Paris 16, Paris, France ","Actors":"Alain Delon, Nathalie Delon, François Périer ","Writer":"Jean-Pierre Melville, Georges Pellegrin","Running_time":"PT101M / 1h 41min","Description":"Directed by Jean-Pierre Melville.  With Alain Delon, Nathalie Delon, François Périer, Cathy Rosier. After killing a night-club owner, professional hitman Jef Costello is seen by witnesses. His efforts to provide himself with an alibi fail and more and more he gets driven into a corner.","Rated":"PG"}