{"imdbID":"tt0059646","Title":"Repulsion","Year":"1965","Director":"Roman Polanski","Taglines":"\"A classic chiller of the 'Psycho' school!\" ","Certificate":"Unrated | See all certifications »","Country":"UK","Language":"English","Also_Known_As":"Repulsión ","Budget":"$300,000 (estimated)","Production_Co":"Compton Films, Tekli British Productions ","Runtime":"105 min","Sound_Mix":"Mono (Westrex Recording System)","Color":"Black and White","Aspect_Ratio":"1.66 : 1","Trivia":"When Roman Polanski first announced this, he stated the actress he required would have to be \" an angel with a slightly soiled halo\". See more »","Goofs":"When Carol gets back home from work she takes off her shoes. A moment later, in the bathroom, she has them on her feet again. See more »","Cast":"Catherine Deneuve, Ian Hendry, John Fraser, Yvonne Furneaux, Patrick Wymark, Renee Houston, Valerie Taylor, James Villiers, Helen Fraser, Hugh Futcher, Monica Merlin, Imogen Graham, Mike Pratt","Plot":"A sex-repulsed woman who disapproves of her sister's boyfriend sinks into depression and has horrific visions of rape and violence. In London, Belgian immigrant Carol Ledoux shares an apartment with her older sister Helen, and works as a manicurist at a beauty salon. Helen uses the word \"sensitive\" to describe Carol's overall demeanor, which is almost like she walks around in a daze, rarely speaking up about anything. When she does speak up, it generally is about something against one of those few issues on which she obsesses, such as Helen's boyfriend Michael's invasion of her space at the apartment. That specific issue may be more about men in general than just Michael's actions, as witnessed by Carol being agitated by hearing Helen and Michael's lovemaking, and she not being able to rebuff the advances effectively of a male suitor, Colin, who is infatuated with her. One of those other obsessive issues is noticing cracks and always wanting to fix them. While Helen and Michael leave on a vacation to Pisa, Italy, Carol chooses largely to lock herself in the apartment, ditching work. There, she is almost hypnotized... Written by Huggo","Genre":"Drama, Horror, Thriller","Keywords":"rape, female protagonist, repression, sexual repression, apartment","imdbRating":"7.8","imdbVotes":"33,809","Awards":"Nominated for 1 BAFTA Film Award. Another 2 wins & 3 nominations.","Metascore":"91","Released":"3 October 1965 (USA) ","Location":"Thurloe Place, South Kensington, London, England, UK ","Actors":"Catherine Deneuve, Ian Hendry, John Fraser ","Writer":"Roman Polanski (original screenplay), Gérard Brach (original screenplay) (as Gerard Brach) | 1 more credit »","Running_time":"PT105M / 1h 45min","Description":"Directed by Roman Polanski.  With Catherine Deneuve, Ian Hendry, John Fraser, Yvonne Furneaux. A sex-repulsed woman who disapproves of her sister's boyfriend sinks into depression and has horrific visions of rape and violence.","Rated":"UNRATED"}