{"imdbID":"tt0096754","Title":"The Abyss","Year":"1989","Director":"James Cameron","Writer":"James Cameron","Taglines":"Believe your eyes. ","Country":"USA","Language":"English","Also_Known_As":"Abyss ","Budget":"$69,500,000 (estimated)","Gross":"$54,222,000 (USA)","Production_Co":"Twentieth Century Fox Film Corporation, Pacific Western, Lightstorm Entertainment ","Runtime":"145 min | 171 min (special edition)","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby SR (35 mm prints)","Color":"Color (DuArt)","Aspect_Ratio":"2.35 : 1","Trivia":"For financial reasons, the \"Deepcore\" set was never dismantled. It stood in the abandoned (and drained) South Carolina nuclear power plant, where the film was shot. 20th Century Fox had posted signs around the set informing potential photographers that Fox still owned the set (and the designs) and that any photographs or video shooting of the set was prohibited by copyright law. Their official copyright information was on the Deepcore rig itself. A favorite destination for \"urban explorers\", the sets and facility were eventually demolished in 2007 during a reconstruction project. See more »","Goofs":"When they are reviving Lindsey, there is one point where Bud slaps her and tells her to \"fight\". The moment before he slaps her you can see her blink in anticipation of the slap. See more »","Crazy_Credits":"There are no opening credits, save for the title, which emerges from darkness. The camera then follows down the \"Y\" of the title, and dissolves into the underwater blue of the ocean. See more »","Cast":"Ed Harris, Mary Elizabeth Mastrantonio, Michael Biehn, Leo Burmester, Todd Graff, John Bedford Lloyd, J.C. Quinn, Kimberly Scott, Captain Kidd Brewer Jr., George Robert Klek, Christopher Murphy, Adam Nelson, Dick Warlock, Jimmie Ray Weeks, J. Kenneth Campbell","Plot":"A civilian diving team is enlisted to search for a lost nuclear submarine and face danger while encountering an alien aquatic species. An American nuclear submarine encounters an alien species, which coincidentally causes massive electrical and hydraulic malfunctions, causing the sub to crash into an underwater cliff and sink. The navy asks the workers of a nearby underwater oil rig who are joined by a number of navy SEALS to locate and investigate the cause of the crash. As the crew embark on their mission, they encounter a number of difficulties and discover that they may not be alone. There is something else down there. Written by Anonymous","Genre":"Adventure, Drama, Sci-Fi","Keywords":"submarine, underwater, alien, ocean, estranged couple","imdbRating":"7.6","imdbVotes":"127,841","Awards":"Won 1 Oscar. Another 4 wins & 13 nominations.","Metascore":"62","Released":"9 August 1989 (USA) ","Location":"Harbor Star Stage, San Pedro, Los Angeles, California, USA ","Actors":"Ed Harris, Mary Elizabeth Mastrantonio, Michael Biehn ","Running_time":"PT145M / 2h 25min","Description":"Directed by James Cameron.  With Ed Harris, Mary Elizabeth Mastrantonio, Michael Biehn, Leo Burmester. A civilian diving team is enlisted to search for a lost nuclear submarine and face danger while encountering an alien aquatic species.","Rated":"PG-13"}