{"imdbID":"tt0061722","Title":"The Graduate","Year":"1967","Director":"Mike Nichols","Taglines":"The Movie That Became A Legend [Video Australia] ","Certificate":"Approved | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"El graduado ","Budget":"$3,000,000 (estimated)","Opening_Weekend":"$873 (USA) (18 May 2012)","Gross":"$104,397,102 (USA)","Production_Co":"Lawrence Turman ","":"Show detailed company contact information on IMDbPro »","Runtime":"106 min","Sound_Mix":"4-Track Stereo (Westrex Recording System)| Mono (35 mm optical prints)","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Faye Dunaway was considered for Elaine Robinson, but she had to turn it down in order to star in Bonnie and Clyde (1967). See more »","Goofs":"In the first scene at the airport, Ben walks close towards the automatic door, past a pillar. In the next shot, he hasn't reached the pillar, and walks for a few second to reach where he was where the cut occurred. See more »","Cast":"Anne Bancroft, Dustin Hoffman, Katharine Ross, William Daniels, Murray Hamilton, Elizabeth Wilson, Buck Henry, Brian Avery, Walter Brooke, Norman Fell, Alice Ghostley, Marion Lorne, Eddra Gale","Plot":"A disillusioned college graduate finds himself torn between his older lover and her daughter. Ben has recently graduated from college, with his parents now expecting great things from him. At his \"Homecoming\" party, Mrs. Robinson, the wife of his father's business partner, has Ben drive her home, which leads to an affair between the two. The affair eventually ends, but comes back to haunt him when he finds himself falling for Elaine, Mrs. Robinson's daughter. Written by Zac Abrams","Genre":"Comedy, Drama, Romance","Keywords":"older woman younger man relationship, graduate, anxiety, love, hotel room","imdbRating":"8.0","imdbVotes":"206,602","Awards":"Won 1 Oscar. Another 20 wins & 16 nominations.","Metascore":"77","Released":"22 December 1967 (USA) ","Location":"North Palm Drive, Beverly Hill, California, USA ","Actors":"Dustin Hoffman, Anne Bancroft, Katharine Ross ","Writer":"Calder Willingham (screenplay), Buck Henry (screenplay) | 1 more credit »","Running_time":"PT106M / 1h 46min","Description":"Directed by Mike Nichols.  With Dustin Hoffman, Anne Bancroft, Katharine Ross, William Daniels. A disillusioned college graduate finds himself torn between his older lover and her daughter.","Rated":"APPROVED"}