{"imdbID":"tt0093209","Title":"Hope and Glory","Year":"1987","Director":"John Boorman","Writer":"John Boorman","Country":"UK, USA","Language":"English","Gross":"$10,021,120 (USA)","Production_Co":"Columbia Pictures Corporation, Nelson Entertainment, Goldcrest Films International ","Runtime":"113 min","Cast":"Sebastian Rice-Edwards, Geraldine Muir, Sarah Miles, David Hayman, Sammi Davis, Derrick O'Connor, Susan Wooldridge, Jean-Marc Barr, Ian Bannen, Annie Leon, Jill Baker, Amelda Brown, Katrine Boorman, Colin Higgins, Shelagh Fraser","Plot":"A semi-autobiographical project by John Boorman about a nine year old boy called Bill as he grows up in London during the blitz of World War 2. For a young boy, this time in history was ... See full summary » A semi-autobiographical project by John Boorman about a nine year old boy called Bill as he grows up in London during the blitz of World War 2. For a young boy, this time in history was more of an adventure, a total upheaval of order, restrictions and discipline. The liberating effect of the war on the women left behind. And the joy when Hitler blows up your school. Written by Colin Tinto <cst@imdb.com>","Genre":"Comedy, Drama, Romance","Keywords":"school, warplane, school bombing, premarital sex, world war two","imdbRating":"7.4","imdbVotes":"9,586","Awards":"Nominated for 5 Oscars. Another 16 wins & 24 nominations.","Metascore":"","Released":"19 February 1988 (USA) ","Location":"Bray Studios, Down Place, Oakley Green, Berkshire, England, UK ","Actors":"Sarah Miles, David Hayman, Sebastian Rice-Edwards ","Running_time":"PT113M / 1h 53min","Description":"Directed by John Boorman.  With Sarah Miles, David Hayman, Sebastian Rice-Edwards, Geraldine Muir. A semi-autobiographical project by John Boorman about a nine year old boy called Bill as he grows up in London during the blitz of World War 2. For a young boy, this time in history was more of an adventure, a total upheaval of order, restrictions and discipline. The liberating effect of the war on the women left behind. And the joy when Hitler blows up your school.","Rated":"PG-13"}