{"imdbID":"tt0025948","Title":"Viva Villa!","Year":"1934","Country":"USA","Language":"English","Budget":"$1,017,400 (estimated)","Gross":"$1,109,000 (USA)","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"115 min | 110 min (Turner library print)","Cast":"Wallace Beery, Leo Carrillo, Fay Wray, Donald Cook, Stuart Erwin, Henry B. Walthall, Joseph Schildkraut, Katherine DeMille, George E. Stone, Phillip Cooper, David Durand, Frank Puglia, Ralph Bushman, Adrian Rosley, Henry Armetta","Plot":"In this fictionalized biography, young Pancho Villa takes to the hills after killing an overseer in revenge for his father's death. In 1910, he befriends American reporter Johnny Sykes. ... See full summary » In this fictionalized biography, young Pancho Villa takes to the hills after killing an overseer in revenge for his father's death. In 1910, he befriends American reporter Johnny Sykes. Then a meeting with visionary Francisco Madero transforms Villa from an avenging bandit to a revolutionary general. To the tune of 'La Cucaracha,' his armies sweep Mexico. After victory, Villa's bandit-like disregard for human life forces Madero to exile him. But Madero's fall brings Villa back to raise the people against a new tyrant... Written by Rod Crawford <puffinus@u.washington.edu>","Genre":"Biography, Western","Keywords":"pancho villa, revenge, general, army, reporter","imdbRating":"6.6","imdbVotes":"796","Awards":"Won 1 Oscar. Another 3 wins & 4 nominations.","Metascore":"","Released":"27 April 1934 (USA) ","Location":"San Marcos, Mexico ","Actors":"Wallace Beery, Fay Wray, Leo Carrillo ","Director":"Jack Conway, Howard Hawks (uncredited) | 1 more credit »","Writer":"Ben Hecht (screen play), Edgecumb Pinchon (suggested by the book by) (as Edgcumb Pinchon) | 1 more credit »","Running_time":"PT115M / 1h 55min","Description":"Directed by Jack Conway, Howard Hawks, William A. Wellman.  With Wallace Beery, Fay Wray, Leo Carrillo, Donald Cook. In this fictionalized biography, young Pancho Villa takes to the hills after killing an overseer in revenge for his father's death. In 1910, he befriends American reporter Johnny Sykes. Then a meeting with visionary Francisco Madero transforms Villa from an avenging bandit to a revolutionary general. To the tune of 'La Cucaracha,' his armies sweep Mexico. After victory, Villa's bandit-like ...","Rated":"N/A"}