{"imdbID":"tt0074119","Title":"All the President's Men","Year":"1976","Director":"Alan J. Pakula","Country":"USA","Language":"English, Spanish","Budget":"$8,500,000 (estimated)","Gross":"SEK 2,279,442 (Sweden)","Production_Co":"Warner Bros., Wildwood, Wildwood Enterprises ","Runtime":"138 min | 125 min (TV)","Cast":"Dustin Hoffman, Robert Redford, Jack Warden, Martin Balsam, Hal Holbrook, Jason Robards, Jane Alexander, Meredith Baxter, Ned Beatty, Stephen Collins, Penny Fuller, John McMartin, Robert Walden, Frank Wills, F. Murray Abraham","Plot":"\"The Washington Post\" reporters Bob Woodward and Carl Bernstein uncover the details of the Watergate scandal that leads to President Richard Nixon's resignation. In the run-up to the 1972 elections, Washington Post reporter Bob Woodward covers what seems to be a minor break-in at the Democratic Party National headquarters. He is surprised to find top lawyers already on the defense case, and the discovery of names and addresses of Republican fund organizers on the accused further arouses his suspicions. The editor of the Post is prepared to run with the story and assigns Woodward and Carl Bernstein to it. They find the trail leading higher and higher in the Republican Party, and eventually into the White House itself. Written by Jeremy Perkins {J-26}","Genre":"Biography, Drama, History","Keywords":"investigative journalism, watergate, washington post, newspaper, white house","imdbRating":"8.0","imdbVotes":"70,398","Awards":"Won 4 Oscars. Another 12 wins & 21 nominations.","Metascore":"","Released":"9 April 1976 (USA) ","Location":"2600 Virginia Avenue NW, Washington, District of Columbia, USA ","Actors":"Dustin Hoffman, Robert Redford, Jack Warden ","Writer":"Carl Bernstein (book), Bob Woodward (book) | 1 more credit »","Running_time":"PT138M / 2h 18min","Description":"Directed by Alan J. Pakula.  With Dustin Hoffman, Robert Redford, Jack Warden, Martin Balsam. \"The Washington Post\" reporters Bob Woodward and Carl Bernstein uncover the details of the Watergate scandal that leads to President Richard Nixon's resignation.","Rated":"R"}