{"imdbID":"tt0067805","Title":"Sunday Bloody Sunday","Year":"1971","Director":"John Schlesinger","Writer":"Penelope Gilliatt (screenplay)","Country":"UK","Language":"English, Italian, Hebrew, French","Production_Co":"Vectia ","Runtime":"110 min","Cast":"Peter Finch, Glenda Jackson, Murray Head, Peggy Ashcroft, Tony Britton, Maurice Denham, Bessie Love, Vivian Pickles, Frank Windsor, Thomas Baptiste, Richard Pearson, June Brown, Hannah Norbert, Harold Goldblatt, Marie Burke","Plot":"Divorced working woman Alex and well-to-do Jewish family doctor Daniel Hirsh share not only the same answering service but also the favours of young Bob Elkin who bed-hops between them as ... See full summary » Divorced working woman Alex and well-to-do Jewish family doctor Daniel Hirsh share not only the same answering service but also the favours of young Bob Elkin who bed-hops between them as the mood takes him. Both Alex and Dr Hirsh are aware of the other's existence but prefer to live with the situation rather than risk losing Elkin completely. But a wet winter weekend in London can be difficult. Written by Jeremy Perkins {J-26}","Genre":"Drama","Keywords":"female nudity, jewish, doctor, artist, sociologist","imdbRating":"7.2","imdbVotes":"3,784","Awards":"Nominated for 4 Oscars. Another 12 wins & 7 nominations.","Metascore":"","Released":"8 September 1971 (USA) ","Location":"38 Pembroke Square, Kensington, London, England, UK ","Actors":"Peter Finch, Glenda Jackson, Murray Head ","Running_time":"PT110M / 1h 50min","Description":"Directed by John Schlesinger.  With Peter Finch, Glenda Jackson, Murray Head, Peggy Ashcroft. Divorced working woman Alex and well-to-do Jewish family doctor Daniel Hirsh share not only the same answering service but also the favours of young Bob Elkin who bed-hops between them as the mood takes him. Both Alex and Dr Hirsh are aware of the other's existence but prefer to live with the situation rather than risk losing Elkin completely. But a wet winter weekend in London can be difficult.","Rated":"R"}