{"imdbID":"tt0058335","Title":"Marriage Italian Style","Year":"1964","Director":"Vittorio De Sica","Country":"Italy, France","Language":"Italian","Production_Co":"Compagnia Cinematografica Champion, Les Films Concordia ","Runtime":"102 min","Cast":"Sophia Loren, Marcello Mastroianni, Aldo Puglisi, Tecla Scarano, Marilù Tolo, Gianni Ridolfi, Generoso Cortini, Vito Moricone, Rita Piccione, Lino Mattera, Alfio Vita, Alberto Castaldi, Anna Santoro, Enza Maggi, Mara Marilli","Plot":"The rich man Domenico and Filumena, a penniless prostitute, share great part of their lives in the immediate post WWII Italy. Domenico, a successfull businessman, with an eye for the girls, begins an affair with Filumena when she is 17 years old. She becomes a prostitute, but also becomes the mistress of Domenico. He eventually sets her up in an apartment, and she works for him in his various businesses. She secretly bears three children, who are raised by nannys. Domenico starts planning to marry a young employee. Filumena tricks him into marriage by pretending to be dying. Domenico annuls the marriage. Filumena then tells him of the three children. She says that one of the children belongs to Domenico, but will not say which one is his. You start to believe that all of the children could be his, and Domenico then marries Filumena again, this time willingly. Written by Steve Jordan <jordan@warwick.net>","Genre":"Comedy, Drama, Romance","Keywords":"apartment, brothel, mistress, marriage, bakery","imdbRating":"7.5","imdbVotes":"4,889","Awards":"Nominated for 2 Oscars. Another 7 wins & 8 nominations.","Metascore":"","Released":"20 December 1964 (USA) ","Location":"Naples, Campania, Italy ","Actors":"Sophia Loren, Marcello Mastroianni, Aldo Puglisi ","Writer":"Eduardo De Filippo (play), Renato Castellani (screenplay) | 3 more credits »","Running_time":"PT102M / 1h 42min","Description":"Directed by Vittorio De Sica.  With Sophia Loren, Marcello Mastroianni, Aldo Puglisi, Tecla Scarano. The rich man Domenico and Filumena, a penniless prostitute, share great part of their lives in the immediate post WWII Italy.","Rated":"N/A"}