{"imdbID":"tt0079944","Title":"Stalker","Year":"1979","Director":"Andrei Tarkovsky (as Andrey Tarkovskiy)","Certificate":"Not Rated | See all certifications »","Country":"Soviet Union","Language":"Russian","Also_Known_As":"Stalker ","Budget":"RUR 6,000,000 (estimated)","Production_Co":"Kinostudiya ''Mosfilm'' ","":"Show detailed company contact information on IMDbPro »","Runtime":"163 min | 155 min (2002 DVD)","Sound_Mix":"Mono","Color":"Color (Sovcolor)| Black and White | Color (Eastmancolor)","Aspect_Ratio":"1.37 : 1","Trivia":"The original negatives were destroyed (by a processing error at the laboratory) and part of the film had to be shot again from scratch with a new director of photography. See more »","Cast":"Alisa Freyndlikh, Aleksandr Kaydanovskiy, Anatoliy Solonitsyn, Nikolay Grinko, Natalya Abramova, Faime Jurno, E. Kostin, Raymo Rendi","Plot":"A guide leads two men through an area known as the Zone to find a room that grants wishes. Near a gray and unnamed city is the Zone, an alien place guarded by barbed wire and soldiers. Over his wife's objections, a man rises in the early morning and leaves her with their disabled daughter to meet two men. He's a Stalker, one of a handful who have the mental gifts (and who risk imprisonment) to lead people into the Zone to the Room, a place where one's secret hopes come true. His clients are a burned out popular writer, cynical, and questioning his talent; and a quiet scientist more concerned about his knapsack than the journey. In the deserted Zone, the approach to the Room must be indirect. As they draw near, the rules seem to change and the stalker faces a crisis. Written by <jhailey@hotmail.com>","Genre":"Drama, Mystery, Sci-Fi","Keywords":"stalker, guide, barbed wire, writer, scientist","imdbRating":"8.2","imdbVotes":"65,131","Awards":"2 wins & 1 nomination.","Metascore":"","Released":"17 April 1980 (Netherlands) ","Location":"Dolgopa, Russia ","Actors":"Alisa Freyndlikh, Aleksandr Kaydanovskiy, Anatoliy Solonitsyn ","Writer":"Arkadiy Strugatskiy (novel), Boris Strugatskiy (novel) | 2 more credits »","Running_time":"PT163M / 2h 43min","Description":"Directed by Andrei Tarkovsky.  With Alisa Freyndlikh, Aleksandr Kaydanovskiy, Anatoliy Solonitsyn, Nikolay Grinko. A guide leads two men through an area known as the Zone to find a room that grants wishes.","Rated":"NOT RATED"}