{"imdbID":"tt0060196","Title":"Il buono, il brutto, il cattivo","Year":"1966","Director":"Sergio Leone","Taglines":"For Three Men The Civil War Wasn't Hell. It Was Practice! ","Certificate":"See all certifications »","Country":"Italy, Spain, West Germany, USA","Language":"Italian","Also_Known_As":"The Good, the Bad and the Ugly ","Budget":"$1,200,000 (estimated)","Gross":"$6,100,000 (USA)","Production_Co":"Produzioni Europee Associati (PEA), Arturo González Producciones Cinematográficas, S.A, Constantin Film Produktion ","":"Show detailed company contact information on IMDbPro »","Runtime":"161 min | 186 min (dubbed) | 179 min (2003 extended English) | 142 min (1968) (cut)","Sound_Mix":"Mono","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Eli Wallach would have been decapitated during the train scene if he had lifted his head up. In the wide-shot, you can see the step that would have impacted his head. See more »","Goofs":"After Blondie tells Angel Eyes of six being a perfect number because it is the number of bullets his revolver can carry, the latter gives off a laugh that audibly belongs to neither Lee Van Cleef nor Simon Prescott (Van Cleef's voice-over actor in the extended version of the film). The laugh belongs to Angel Eye's voice actor in the Italian version, Emilio Cigoli, so the presence of his laugh in the English version is a dubbing error in the extended English-language version. See more »","Cast":"Eli Wallach, Clint Eastwood, Lee Van Cleef, Aldo Giuffrè, Luigi Pistilli, Rada Rassimov, Enzo Petito, Claudio Scarchilli, John Bartha, Livio Lorenzon, Antonio Casale, Sandro Scarchilli, Benito Stefanelli, Angelo Novi, Antonio Casas","Plot":"A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery. Blondie (The Good) is a professional gunslinger who is out trying to earn a few dollars. Angel Eyes (The Bad) is a hit man who always commits to a task and sees it through, as long as he is paid to do so. And Tuco (The Ugly) is a wanted outlaw trying to take care of his own hide. Tuco and Blondie share a partnership together making money off Tuco's bounty, but when Blondie unties the partnership, Tuco tries to hunt down Blondie. When Blondie and Tuco come across a horse carriage loaded with dead bodies, they soon learn from the only survivor (Bill Carson) that he and a few other men have buried a stash of gold in a cemetery. Unfortunately Carson dies and Tuco only finds out the name of the cemetery, while Blondie finds out the name on the grave. Now the two must keep each other alive in order to find the gold. Angel Eyes (who had been looking for Bill Carson) discovers that Tuco and Blondie met with Carson and knows they know the location of the gold. All he needs is for the two to ... Written by Jeremy Thomson","Genre":"Western","Keywords":"spaghetti western, civil war, hitman, outlaw, shootout","imdbRating":"8.9","imdbVotes":"484,173","Awards":"1 win & 1 nomination.","Metascore":"90","Released":"23 December 1966 (Italy) ","Location":"Almería, Andalucía, Spain ","Actors":"Clint Eastwood, Eli Wallach, Lee Van Cleef ","Writer":"Luciano Vincenzoni (story), Sergio Leone (story) | 5 more credits »","Running_time":"PT161M / 2h 41min","Description":"Directed by Sergio Leone.  With Clint Eastwood, Eli Wallach, Lee Van Cleef, Aldo Giuffrè. A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery.","Rated":"N/A"}