{"imdbID":"tt0074958","Title":"Network","Year":"1976","Director":"Sidney Lumet","Writer":"Paddy Chayefsky","Taglines":"Television will never be the same! ","Certificate":"R | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Poder que mata ","Budget":"$3,800,000 (estimated)","Production_Co":"Metro-Goldwyn-Mayer (MGM), United Artists ","":"Show detailed company contact information on IMDbPro »","Runtime":"121 min","Sound_Mix":"Mono","Color":"Color (Metrocolor)","Aspect_Ratio":"1.85 : 1","Trivia":"The three Oscar winners--Faye Dunaway, Peter Finch, and Beatrice Straight-- all share scenes with William Holden, but they share no scenes with each other. Finch and Dunaway, who won the Best Actor and Best Actress Oscars, have no scenes or dialogue together in the film. See more »","Goofs":"Just after Beale announces his intention to commit suicide on the air, we see a row of TV screens showing how the story is being covered by the other channels. Playing a news anchor, John Gabriel claims that \"something happened at one of our sister networks...\" It should have been referred to as a \"competitive\" network - a \"sister\" implies the same corporate ownership, something prohibited by the FCC in 1976. See more »","Cast":"Faye Dunaway, William Holden, Peter Finch, Robert Duvall, Wesley Addy, Ned Beatty, Arthur Burghardt, Bill Burrows, John Carpenter, Jordan Charney, Kathy Cronkite, Ed Crowley, Jerome Dempsey, Conchata Ferrell, Gene Gross","Plot":"A television network cynically exploits a deranged former anchor's ravings and revelations about the news media for its own profit. In the 1970s, terrorist violence is the stuff of networks' nightly news programming and the corporate structure of the UBS Television Network is changing. Meanwhile, Howard Beale, the aging UBS news anchor, has lost his once strong ratings share and so the network fires him. Beale reacts in an unexpected way. We then see how this affects the fortunes of Beale, his coworkers (Max Schumacher and Diana Christensen), and the network. Written by Bruce Janson <bruce@cs.su.oz.au>","Genre":"Drama","Keywords":"television, television network, television news, media, monologue","imdbRating":"8.1","imdbVotes":"98,892","Awards":"Won 4 Oscars. Another 15 wins & 25 nominations.","Metascore":"","Released":"27 November 1976 (USA) ","Location":"CFTO-TV Studios, Scarborough, Toronto, Ontario, Canada ","Actors":"Faye Dunaway, William Holden, Peter Finch ","Running_time":"PT121M / 2h 1min","Description":"Directed by Sidney Lumet.  With Faye Dunaway, William Holden, Peter Finch, Robert Duvall. A television network cynically exploits a deranged former anchor's ravings and revelations about the news media for its own profit.","Rated":"R"}