{"imdbID":"tt0085334","Title":"A Christmas Story","Year":"1983","Director":"Bob Clark","Taglines":"'Tis better to give than to receive. ","Certificate":"PG | See all certifications »","Country":"USA, Canada","Language":"English","Also_Known_As":"Božićna priča ","Budget":"CAD 4,000,000 (estimated)","Production_Co":"Metro-Goldwyn-Mayer (MGM), Christmas Tree Films ","Runtime":"94 min","Sound_Mix":"Mono","Color":"Color (Metrocolor)","Aspect_Ratio":"1.85 : 1","Trivia":"The LOOK magazine used by Ralph Parker to insert his Red Ryder promotion for his mother's observation was a December 21, 1937 edition with a cover featuring Shirley Temple pouring tea for Santa Claus. See more »","Goofs":"When the kids run to their seats in the classroom after putting the plastic teeth in their mouths, a shadow of a boom mic is visible on the wall as the camera pans right to left. See more »","Crazy_Credits":"\"Ming the Merciless\" and \"Flash Gordon\" are listed as characters despite being cut from the general release. See more »","Cast":"Melinda Dillon, Darren McGavin, Peter Billingsley, Scott Schwartz, Jean Shepherd, Ian Petrella, Tedde Moore, R.D. Robb, Zack Ward, Yano Anaya, Jeff Gillen, Colin Fox, Paul Hubbard, Leslie Carlson, Jim Hunter","Plot":"Ralphie has to convince his parents, his teacher, and Santa that a Red Ryder B.B. gun really is the perfect gift for the 1940s. Christmas is approaching and 9 year-old Ralphie wants only one thing: a Red Ryder Range 200 Shot BB gun. When he mentions it at the dinner table, his mother's immediate reaction is that he'll put his eye out. He then decides on a perfect theme for his teacher but her reaction is like his. He fantasizes about what it would be like to be Red Ryder and catch the bad guys. When the big day arrives he gets lots of present under the tree including a lovely gift from his aunt that his mother just adores. But what about the BB gun? Written by garykmcd","Genre":"Comedy, Family","Keywords":"christmas, bb gun, tongue stuck on a pole, bully, school","imdbRating":"8.1","imdbVotes":"103,896","Awards":"3 wins & 11 nominations.","Metascore":"77","Released":"18 November 1983 (USA) ","Location":"232 Queen St W, Toronto, Ontario, Canada ","Actors":"Peter Billingsley, Melinda Dillon, Darren McGavin ","Writer":"Jean Shepherd (based on the novel \"In God We Trust, All Others Pay Cash\" by), Jean Shepherd (screenplay) | 2 more credits »","Running_time":"PT94M / 1h 34min","Description":"Directed by Bob Clark.  With Peter Billingsley, Melinda Dillon, Darren McGavin, Scott Schwartz. Ralphie has to convince his parents, his teacher, and Santa that a Red Ryder B.B. gun really is the perfect gift for the 1940s.","Rated":"PG"}