{"imdbID":"tt0069704","Title":"American Graffiti","Year":"1973","Director":"George Lucas","Country":"USA","Language":"English","Budget":"$777,000 (estimated)","Gross":"$115,000,000 (USA)","Production_Co":"Universal Pictures, Lucasfilm, The Coppola Company ","Runtime":"110 min | 112 min (re-release) (1978)","Cast":"Richard Dreyfuss, Ron Howard, Paul Le Mat, Charles Martin Smith, Cindy Williams, Candy Clark, Mackenzie Phillips, Wolfman Jack, Bo Hopkins, Manuel Padilla Jr., Beau Gentry, Harrison Ford, Jim Bohan, Jana Bellan, Deby Celiz","Plot":"A couple of high school grads spend one final night cruising the strip with their buddies before they go off to college. It's the proverbial end of the summer 1962 in a small southern California town. It's the evening before best friends and recent high school graduates, Curt Henderson and Steve Bolander, are scheduled to leave town to head to college back east. Curt, who received a lucrative local scholarship, is seen as the promise that their class holds. But Curt is having second thoughts about leaving what Steve basically sees as their dead end town. Curt's beliefs are strengthened when he spots an unknown beautiful blonde in a T-bird who mouths the words \"I love you\" to him. As Curt tries to find that blonde while trying to get away from a local gang who have him somewhat hostage, Curt may come to a decision about his immediate future. Outgoing class president Steve, on the other hand, wants to leave, despite meaning that he will leave girlfriend, head cheerleader and Curt's sister, Laurie Henderson, behind. Steve and Laurie spend the evening \"negotiating\" the state of their relationship. Meanwhile... Written by Huggo","Genre":"Comedy, Drama","Keywords":"night, college, car, summer, high school","imdbRating":"7.5","imdbVotes":"62,231","Awards":"Nominated for 5 Oscars. Another 8 wins & 8 nominations.","Metascore":"","Released":"1 August 1973 (USA) ","Location":"American Zoetrope Studios, San Francisco, California, USA ","Actors":"Richard Dreyfuss, Ron Howard, Paul Le Mat ","Writer":"George Lucas, Gloria Katz | 1 more credit »","Running_time":"PT110M / 1h 50min","Description":"Directed by George Lucas.  With Richard Dreyfuss, Ron Howard, Paul Le Mat, Charles Martin Smith. A couple of high school grads spend one final night cruising the strip with their buddies before they go off to college.","Rated":"PG"}