{"imdbID":"tt0031381","Title":"Gone with the Wind","Year":"1939","Taglines":"The greatest romance of all time! ","Certificate":"G | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Lo que el viento se llevó ","Budget":"$3,977,000 (estimated)","Opening_Weekend":"$1,192,593 (USA) (26 June 1998)","Gross":"$198,655,278 (USA) (13 November 1998)","Production_Co":"Selznick International Pictures, Metro-Goldwyn-Mayer (MGM) ","":"Show detailed company contact information on IMDbPro »","Runtime":"238 min | 223 min (1969 re-release) | 234 min (1985 re-release) | 224 min (1994 re-release) | 233 min (1989 re-release) | 226 min (copyright length)","Sound_Mix":"Mono (Western Electric Sound System)","Color":"Color (Technicolor)","Aspect_Ratio":"1.37 : 1","Trivia":"During the late days of the Civil War, Ellen O'Hara and her daughters Suellen and Carreen get sick with typhoid fever. Ellen dies but her daughter survives. The survival is attributed in the novel to treatment with laudanum and quinine by a Union surgeon. See more »","Goofs":"Bonnie mouths along with Rhett's dialog as he talks to her about going to London. See more »","Crazy_Credits":"Rather than simply saying \"Selznick International in association with Metro-Goldwyn Mayer presents Margaret Mitchell's 'Gone With the Wind'\", the opening credits say \"Selznick International in association with Metro-Goldwyn Mayer has the honor to present its Technicolor production of Margaret Mitchell's story of the Old South 'Gone With the Wind'\". See more »","Cast":"Thomas Mitchell, Barbara O'Neil, Vivien Leigh, Evelyn Keyes, Ann Rutherford, George Reeves, Fred Crane, Hattie McDaniel, Oscar Polk, Butterfly McQueen, Victor Jory, Everett Brown, Howard C. Hickman, Alicia Rhett, Leslie Howard","Plot":"A manipulative Southern belle carries on a turbulent affair with a blockade runner during the American Civil War. Scarlett is a woman who can deal with a nation at war, Atlanta burning, the Union Army carrying off everything from her beloved Tara, the carpetbaggers who arrive after the war. Scarlett is beautiful. She has vitality. But Ashley, the man she has wanted for so long, is going to marry his placid cousin, Melanie. Mammy warns Scarlett to behave herself at the party at Twelve Oaks. There is a new man there that day, the day the Civil War begins. Rhett Butler. Scarlett does not know he is in the room when she pleads with Ashley to choose her instead of Melanie. Written by Dale O'Connor <daleoc@interaccess.com>","Genre":"Drama, Romance, War","Keywords":"gallantry, honesty, indifference, scandal, battle of the sexes","imdbRating":"8.2","imdbVotes":"207,393","Awards":"Won 8 Oscars. Another 9 wins & 8 nominations.","Metascore":"","Released":"17 January 1940 (USA) ","Location":"Agoura Hills, California, USA ","Actors":"Clark Gable, Vivien Leigh, Thomas Mitchell ","Director":"Victor Fleming, George Cukor (uncredited) | 1 more credit »","Writer":"Margaret Mitchell (story), Sidney Howard (screenplay)","Running_time":"PT238M / 3h 58min","Description":"Directed by Victor Fleming, George Cukor, Sam Wood.  With Clark Gable, Vivien Leigh, Thomas Mitchell, Barbara O'Neil. A manipulative Southern belle carries on a turbulent affair with a blockade runner during the American Civil War.","Rated":"G"}