{"imdbID":"tt0091217","Title":"Hoosiers","Year":"1986","Director":"David Anspaugh","Writer":"Angelo Pizzo","Taglines":"They needed a second chance to finish first. ","Certificate":"PG | See all certifications »","Country":"UK, USA","Language":"English","Also_Known_As":"Best Shot ","Budget":"$6,000,000 (estimated)","Gross":"$28,607,524 (USA)","Production_Co":"De Haven Productions, Hemdale Film ","Runtime":"114 min","Sound_Mix":"Dolby SR","Color":"Color (CFI)","Aspect_Ratio":"1.85 : 1","Trivia":"The actual game was played between the Milan Indians and the Muncie Central Bearcats. For the movie, the South Bend Central Bears were the opponent. The true championship took place in 1954, not 1952 as in the movie, and the score was Milan 32, Muncie Central 30. See more »","Goofs":"Butler Fieldhouse did not have multicolored seats in 1952. See more »","Crazy_Credits":"Director David Anspaugh is credited as Jack Nemo in the edited (and disowned by Anspaugh) television cut. See more »","Cast":"Gene Hackman, Barbara Hershey, Dennis Hopper, Sheb Wooley, Fern Persons, Chelcie Ross, Robert Swan, Michael O'Guinne, Wil Dewitt, John Robert Thompson, Michael Sassone, Gloria Dorson, Mike Dalzell, Skip Welker, Eric Gilliom","Plot":"A coach with a checkered past and a local drunk train a small town high school basketball team to become a top contender for the championship. Based on the true story of a small-town Indiana team that made the state finals in 1954, this movie chronicles the attempts of a coach with a spotty past, and the town's basketball-loving drunk to lead their high school team to victory. Written by Thomas Pluck <stripey@winternet.com>","Genre":"Drama, Sport","Keywords":"team, coach, high school, championship, basketball","imdbRating":"7.6","imdbVotes":"33,320","Awards":"Nominated for 2 Oscars. Another 3 wins & 3 nominations.","Metascore":"76","Released":"27 February 1987 (USA) ","Location":"Amo, Indiana, USA ","Actors":"Gene Hackman, Barbara Hershey, Dennis Hopper ","Running_time":"PT114M / 1h 54min","Description":"Directed by David Anspaugh.  With Gene Hackman, Barbara Hershey, Dennis Hopper, Sheb Wooley. A coach with a checkered past and a local drunk train a small town high school basketball team to become a top contender for the championship.","Rated":"PG"}