{"imdbID":"tt0050976","Title":"The Seventh Seal","Year":"1957","Director":"Ingmar Bergman","Certificate":"Not Rated | See all certifications »","Country":"Sweden","Language":"Swedish, Latin","Also_Known_As":"The Seventh Seal ","Budget":"$150,000 (estimated)","Production_Co":"Svensk Filmindustri (SF) ","":"Show detailed company contact information on IMDbPro »","Runtime":"96 min","Sound_Mix":"Mono","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Ingmar Bergman based the entire iconography of the movie on murals in a church where his clergyman father used to go and preach. See more »","Goofs":"When Lisa (the Blacksmith's wife) is together with Skat and laughs, her inlays are visible. See more »","Cast":"Gunnar Björnstrand, Bengt Ekerot, Nils Poppe, Max von Sydow, Bibi Andersson, Inga Gill, Maud Hansson, Inga Landgré, Gunnel Lindblom, Bertil Anderberg, Anders Ek, Åke Fridell, Gunnar Olsson, Erik Strandmark","Plot":"A man seeks answers about life, death, and the existence of God as he plays chess against the Grim Reaper during the Black Plague. A Knight and his squire are home from the crusades. Black Death is sweeping their country. As they approach home, Death appears to the knight and tells him it is his time. The knight challenges Death to a chess game for his life. The Knight and Death play as the cultural turmoil envelopes the people around them as they try, in different ways, to deal with the upheaval the plague has caused. Written by John Vogel <jlvogel@comcast.net>","Genre":"Drama, Fantasy","Keywords":"death, knight, chess, personification of death, medieval times","imdbRating":"8.2","imdbVotes":"107,348","Awards":"7 wins & 1 nomination.","Metascore":"","Released":"13 October 1958 (USA) ","Location":"Gustavsberg, Värmdö, Stockholms län, Sweden ","Actors":"Max von Sydow, Gunnar Björnstrand, Bengt Ekerot ","Writer":"Ingmar Bergman (play), Ingmar Bergman (screenplay)","Running_time":"PT96M / 1h 36min","Description":"Directed by Ingmar Bergman.  With Max von Sydow, Gunnar Björnstrand, Bengt Ekerot, Nils Poppe. A man seeks answers about life, death, and the existence of God as he plays chess against the Grim Reaper during the Black Plague.","Rated":"NOT RATED"}