{"imdbID":"tt0092569","Title":"Anna","Year":"1987","Director":"Yurek Bogayevicz","Country":"USA","Language":"English","Gross":"$1,236,848 (USA)","Production_Co":"Magnus Films, Vestron Pictures ","Runtime":"100 min","Cast":"Sally Kirkland, Robert Fields, Paulina Porizkova, Gibby Brand, John Robert Tillotson, Julianne Gilliam, Joe Aufiery, Lance Davis, Deirdre O'Connell, Ruth Maleczech, Holly Villaire, Shirl Bernheim, Renée Coleman, Gabrielle Made, Jordana Levine","Plot":"Anna is a middle-aged actress looking for work in New York City, with the help of her sometime lover, Daniel. She used to be a Czech film star married to the director Tonda, who is now ... See full summary » Anna is a middle-aged actress looking for work in New York City, with the help of her sometime lover, Daniel. She used to be a Czech film star married to the director Tonda, who is now successfully making commercials in New York. After the 1968 invasion of Czechoslovakia, Anna was imprisoned and eventually exiled. Anna takes in the young girl Krystyna, who has just arrived from Czechoslovakia, and speaks no English. Anna and Daniel help Krystyna learn English and start a promising acting career. However, the only job Anna can find is as an understudy. Written by Will Gilbert","Genre":"Drama","Keywords":"czechoslovakia, actress, one word title, forename as title, suntan pantyhose","imdbRating":"6.5","imdbVotes":"511","Awards":"Nominated for 1 Oscar. Another 3 wins & 4 nominations.","Metascore":"","Released":"28 November 1987 (USA) ","Actors":"Sally Kirkland, Paulina Porizkova, Robert Fields ","Writer":"Yurek Bogayevicz (story), Agnieszka Holland (screenplay) | 1 more credit »","Running_time":"PT100M / 1h 40min","Description":"Directed by Yurek Bogayevicz.  With Sally Kirkland, Paulina Porizkova, Robert Fields, Gibby Brand. Anna is a middle-aged actress looking for work in New York City, with the help of her sometime lover, Daniel. She used to be a Czech film star married to the director Tonda, who is now successfully making commercials in New York. After the 1968 invasion of Czechoslovakia, Anna was imprisoned and eventually exiled. Anna takes in the young girl Krystyna, who has just arrived from Czechoslovakia, ...","Rated":"PG-13"}