{"imdbID":"tt0059742","Title":"The Sound of Music","Year":"1965","Director":"Robert Wise","Country":"USA","Language":"English, German","Budget":"$8,200,000 (estimated)","Gross":"$163,214,286 (USA)","Production_Co":"Robert Wise Productions, Argyle Enterprises ","Runtime":"174 min","Cast":"Julie Andrews, Christopher Plummer, Eleanor Parker, Richard Haydn, Peggy Wood, Charmian Carr, Heather Menzies-Urich, Nicholas Hammond, Duane Chase, Angela Cartwright, Debbie Turner, Kym Karath, Anna Lee, Portia Nelson, Ben Wright","Plot":"A woman leaves an Austrian convent to become a governess to the children of a Naval officer widower. In 1930's Austria, a young woman named Maria is failing miserably in her attempts to become a nun. When the Navy captain Georg Von Trapp writes to the convent asking for a governess that can handle his seven mischievous children, Maria is given the job. The Captain's wife is dead, and he is often away, and runs the household as strictly as he does the ships he sails on. The children are unhappy and resentful of the governesses that their father keeps hiring, and have managed to run each of them off one by one. When Maria arrives, she is initially met with the same hostility, but her kindness, understanding, and sense of fun soon draws them to her and brings some much-needed joy into all their lives -- including the Captain's. Eventually he and Maria find themselves falling in love, even though Georg is already engaged to a Baroness and Maria is still a postulant. The romance makes them both start questioning the decisions they have made. Their personal conflicts soon become ... Written by LOTUS73","Genre":"Biography, Drama, Family","Keywords":"orchestral music score, children, love, austria, governess","imdbRating":"8.0","imdbVotes":"142,697","Awards":"Won 5 Oscars. Another 12 wins & 13 nominations.","Metascore":"","Released":"29 March 1965 (UK) ","Location":"Bertelsmann, Salzburg, Salzburg, Austria ","Actors":"Julie Andrews, Christopher Plummer, Eleanor Parker ","Writer":"George Hurdalek (with the partial use of ideas by) (as Georg Hurdalek), Howard Lindsay (from the stage musical book by) | 2 more credits »","Running_time":"PT174M / 2h 54min","Description":"Directed by Robert Wise.  With Julie Andrews, Christopher Plummer, Eleanor Parker, Richard Haydn. A woman leaves an Austrian convent to become a governess to the children of a Naval officer widower.","Rated":"G"}