{"imdbID":"tt0038355","Title":"The Big Sleep","Year":"1946","Director":"Howard Hawks","Taglines":"It's terrific! ","Certificate":"Approved | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Tote schlafen fest ","Production_Co":"Warner Bros. ","":"Show detailed company contact information on IMDbPro »","Runtime":"114 min | 116 min (pre-release)","Sound_Mix":"Mono (RCA Sound System)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"Dorothy Malone was just starting out in movies when she played the bookstore clerk. She was so nervous making the scene they had to weight the glass of liquor she offers him to keep her hands from shaking. See more »","Goofs":"In the public library, a close-up reveals Marlowe is copying information out of a book opened to new chapter, with a large margin at top and a chapter heading in bold face type. In the long shot a second later, the book is opened to random page of dense text. See more »","Cast":"Humphrey Bogart, Lauren Bacall, John Ridgely, Martha Vickers, Dorothy Malone, Peggy Knudsen, Regis Toomey, Charles Waldron, Charles D. Brown, Bob Steele, Elisha Cook Jr., Louis Jean Heydt","Plot":"Private detective Philip Marlowe is hired by a rich family. Before the complex case is over, he's seen murder, blackmail, and what might be love. Private detective Philip Marlowe is hired by old General Sternwood to stop a blackmail attempt concerning his youngest daughter Carmen. Marlowe tails the blackmailer Geiger to his house at Laverne Terrace. Suddenly he hears a shot and sees some men rushing out to their cars. He breaks into the house, and finds Carmel drugged in a chair, with Geiger's dead body at her feet. An empty camera proves that a photo has been taken of her and the corpse, probably intended for further blackmailing. A series of clues lead Marlowe to various persons involved in gambling. Wherever he finds them, he also finds Sternwood's oldest daughter, Vivian Rutledge, a divorced beauty. She and Marlowe fall in love with each other, although she continues double-crossing him. When Marlowe's investigations lead him to the casino owner Eddie Mars, the situation starts becoming very dangerous. Everyone, including the district attorney, advises Marlowe to stop the investigation, but he is stubborn. Eddie Mars has a ... Written by Maths Jesperson {maths.jesperson1@comhem.se}","Genre":"Crime, Film-Noir, Mystery","Keywords":"philip marlowe, detective, private detective, murder, blackmail","imdbRating":"8.1","imdbVotes":"62,489","Awards":"1 win.","Metascore":"","Released":"31 August 1946 (USA) ","Location":"New York Street, Warner Brothers Burbank Studios - 4000 Warner Boulevard, Burbank, California, USA ","Actors":"Humphrey Bogart, Lauren Bacall, John Ridgely ","Writer":"William Faulkner (screen play), Leigh Brackett (screen play) | 2 more credits »","Running_time":"PT114M / 1h 54min","Description":"Directed by Howard Hawks.  With Humphrey Bogart, Lauren Bacall, John Ridgely, Martha Vickers. Private detective Philip Marlowe is hired by a rich family. Before the complex case is over, he's seen murder, blackmail, and what might be love.","Rated":"APPROVED"}