{"imdbID":"tt0053604","Title":"The Apartment","Year":"1960","Director":"Billy Wilder","Taglines":"Movie-wise, there has never been anything like it - laugh-wise, love-wise, or otherwise-wise! ","Certificate":"See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Das Appartement ","Budget":"$3,000,000 (estimated)","Production_Co":"Mirisch Corporation, The ","":"Show detailed company contact information on IMDbPro »","Runtime":"125 min","Sound_Mix":"Mono (Westrex Recording System)","Color":"Black and White","Aspect_Ratio":"2.35 : 1","Trivia":"Jack Lemmon said of his character - \"As I saw it, [Baxter] was ambitious; a nice guy but gullible, easily intimidated, and fast to excuse his behaviour. In the end, he changes because he faces up to having rationalized his morals. He realizes he's been a dumb kid, he's been had.\" See more »","Goofs":"The frozen daiquiri in the cocktail lounge melts, reforms, and melts again. See more »","Cast":"Jack Lemmon, Shirley MacLaine, Fred MacMurray, Ray Walston, Jack Kruschen, David Lewis, Hope Holiday, Joan Shawlee, Naomi Stevens, Johnny Seven, Joyce Jameson, Willard Waterman, David White, Edie Adams","Plot":"A man tries to rise in his company by letting its executives use his apartment for trysts, but complications and a romance of his own ensue. As of November 1, 1959, mild mannered C.C. Baxter has been working at Consolidated Life, an insurance company, for close to four years, and is one of close to thirty-two thousand employees located in their Manhattan head office. To distinguish himself from all the other lowly cogs in the company in the hopes of moving up the corporate ladder, he often works late, but only because he can't get into his apartment, located off of Central Park West, since he has provided it to a handful of company executives - Mssrs. Dobisch, Kirkeby, Vanderhoff and Eichelberger - on a rotating basis for their extramarital liaisons in return for a good word to the personnel director, Jeff D. Sheldrake. When Baxter is called into Sheldrake's office for the first time, he learns that it isn't just to be promoted as he expects, but also to add married Sheldrake to the list to who he will lend his apartment. What Baxter is unaware of is that Sheldrake's mistress is Fran Kubelik, an elevator girl in the ... Written by Huggo","Genre":"Comedy, Drama, Romance","Keywords":"apartment, love, elevator, elevator girl, moving","imdbRating":"8.3","imdbVotes":"104,699","Awards":"Won 5 Oscars. Another 19 wins & 8 nominations.","Metascore":"","Released":"16 September 1960 (France) ","Location":"205 Columbus Avenue, New York City, New York, USA ","Actors":"Jack Lemmon, Shirley MacLaine, Fred MacMurray ","Writer":"Billy Wilder, I.A.L. Diamond","Running_time":"PT125M / 2h 5min","Description":"Directed by Billy Wilder.  With Jack Lemmon, Shirley MacLaine, Fred MacMurray, Ray Walston. A man tries to rise in his company by letting its executives use his apartment for trysts, but complications and a romance of his own ensue.","Rated":"N/A"}