{"imdbID":"tt0021884","Title":"Frankenstein","Year":"1931","Director":"James Whale","Taglines":"The Man Who Made A Monster! ","Certificate":"Not Rated | See all certifications »","Country":"USA","Language":"English, Latin","Also_Known_As":"El doctor Frankenstein ","Budget":"$291,000 (estimated)","Gross":"$12,000,000 (USA)","Production_Co":"Universal Pictures ","Runtime":"70 min","Sound_Mix":"Mono (Western Electric Sound System)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"While preparing to film the scene where the monster attacks Elizabeth Mae Clarke admitted to Boris Karloff that she was worried that when she saw him in full makeup coming towards her, she might really be frightened. Karloff told her that throughout the scene he would wiggle his pinkie finger out of sight of the camera so that she could always see that, despite the horrific makeup, she could always see her friend Boris waving at her and letting her know that she was safe. See more »","Goofs":"When Frankenstein is thrown from the windmill by the Monster it is clearly a dummy. See more »","Crazy_Credits":"The closing credits start with \"A GOOD CAST IS WORTH REPEATING...\". The first four actors' names are listed in all caps-sans serif font with the \"S\" in John Boles & Boris Karloff plus in CAST & IS tilted to the right 45 degrees. The remaining 5 cast members have their names listed in Serif font with both Caps & lower case letters. See more »","Cast":"Colin Clive, Mae Clarke, John Boles, Boris Karloff, Edward Van Sloan, Frederick Kerr, Dwight Frye, Lionel Belmore, Marilyn Harris","Plot":"An obsessed scientist assembles a living being from parts of exhumed corpses. Henry Frankenstein is a doctor who is trying to discover a way to make the dead walk. He succeeds and creates a monster that has to deal with living again. Written by Josh Pasnak <chainsaw@intouch.bc.ca>","Genre":"Drama, Horror, Sci-Fi","Keywords":"monster, frankenstein, experiment, body part, girl","imdbRating":"8.0","imdbVotes":"46,803","Awards":"3 wins & 1 nomination.","Metascore":"","Released":"21 November 1931 (USA) ","Location":"Vasquez Rocks, Vasquez Rocks Natural Area Park - 10700 W. Escondido Canyon Rd., Agua Dulce, California, USA ","Actors":"Colin Clive, Mae Clarke, Boris Karloff ","Writer":"John L. Balderston (based upon the composition by), Mary Shelley (from the novel by) (as Mrs. Percy B. Shelley) | 4 more credits »","Running_time":"PT70M / 1h 10min","Description":"Directed by James Whale.  With Colin Clive, Mae Clarke, Boris Karloff, John Boles. An obsessed scientist assembles a living being from parts of exhumed corpses.","Rated":"NOT RATED"}