{"imdbID":"tt0068646","Title":"The Godfather","Year":"1972","Director":"Francis Ford Coppola","Taglines":"An offer you can't refuse.","Certificate":"A | See all certifications »","Country":"USA","Language":"English, Italian, Latin","Also_Known_As":"El padrino ","Budget":"$6,000,000 (estimated)","Opening_Weekend":"$223,758 (USA) (4 April 1997)","Gross":"$134,821,952 (USA) (2 May 1997)","Production_Co":"Paramount Pictures, Alfran Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"175 min","Sound_Mix":"DTS (re-release)| Mono","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"The smack that Vito gives Johnny Fontane was not in the script. Marlon Brando improvised the smack and Al Martino's confused reaction was real. According to James Caan, \"Martino didn't know whether to laugh or cry.\" See more »","Goofs":"When Moe Greene says his line \"I talked to Barzini,\" it's clearly obvious the line was dubbed in. See more »","Crazy_Credits":"In the end credits, Marlon Brando's name is the only one that is not accompanied by the character name that he plays (e.g. \"as Vito Corleone\"). See more »","Cast":"Marlon Brando, Al Pacino, James Caan, Richard S. Castellano, Robert Duvall, Sterling Hayden, John Marley, Richard Conte, Al Lettieri, Diane Keaton, Abe Vigoda, Talia Shire, Gianni Russo, John Cazale, Rudy Bond","Plot":"The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son. When the aging head of a famous crime family decides to transfer his position to one of his subalterns, a series of unfortunate events start happening to the family, and a war begins between all the well-known families leading to insolence, deportation, murder and revenge, and ends with the favorable successor being finally chosen. Written by J. S. Golden","Genre":"Crime, Drama","Keywords":"mafia, crime family, patriarch, rise to power, organized crime","imdbRating":"9.2","imdbVotes":"1,111,466","Awards":"Won 3 Oscars. Another 23 wins & 27 nominations.","Metascore":"100","Released":"24 March 1972 (USA) ","Location":"NY Eye and Ear Infirmary, 2nd Avenue & East 13th Street, New York City, New York, USA ","Actors":"Marlon Brando, Al Pacino, James Caan ","Writer":"Mario Puzo (screenplay), Francis Ford Coppola (screenplay) | 1 more credit »","Running_time":"PT175M / 2h 55min","Description":"Directed by Francis Ford Coppola.  With Marlon Brando, Al Pacino, James Caan, Diane Keaton. The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son.","Rated":"A"}