{"imdbID":"tt0052561","Title":"Anatomy of a Murder","Year":"1959","Director":"Otto Preminger","Taglines":"No search of human emotions has ever probed so deeply, so truthfully as ... Anatomy of a Murder. ","Certificate":"Unrated | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Anatomie eines Mordes ","Production_Co":"Carlyle Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"160 min","Sound_Mix":"Mono (Westrex Recording System)","Color":"Black and White","Aspect_Ratio":"1.85 : 1","Trivia":"The police car sitting in the parking lot of the jail, is a 1959 Edsel sedan. There is on record a few Edsels used by municipalities, but it was more common to find a Ford, Chevy, or Plymouth in use by law enforcement. See more »","Goofs":"Several times in the movie one of the characters makes a humorous comment and you hear the courtroom audience burst out laughing; however, when the camera immediately turns to the audience, they are shown completely still and without emotion. See more »","Cast":"James Stewart, Lee Remick, Ben Gazzara, Arthur O'Connell, Eve Arden, Kathryn Grant, George C. Scott, Orson Bean, Russ Brown, Murray Hamilton, Brooks West, Ken Lynch, John Qualen, Howard McNear, Alexander Campbell","Plot":"In a murder trial, the defendant says he suffered temporary insanity after the victim raped his wife. What is the truth, and will he win his case? Frederick Manion (Ben Gazzara), a lieutenant in the army, is arrested for the murder of a bartender, Barney Quill. He claims, in his defense, that the victim had raped and beaten up his wife Laura (Lee Remick). Although Laura supports her husband's story, the police surgeon can find no evidence that she has been raped. Manion is defended by Paul Biegler (James Stewart), a rather humble small-town lawyer. During the course of interviews, Biegler discovers that Manion is violently possessive and jealous, and also that his wife has a reputation for giving her favors to other men. Biegler realizes that the prosecution will try to make the court believe that Laura was the lover of the bartender and than Manion killed him and beat her up when he discovered them together. Manion pleads \"not guilty\" and Biegler, who knows that his case is weak, sets his assistants to try to find a witness who will save Manion. Written by alfiehitchie","Genre":"Crime, Drama, Mystery","Keywords":"murder trial, attorney, murder, rape, lawyer","imdbRating":"8.1","imdbVotes":"45,106","Awards":"Nominated for 7 Oscars. Another 9 wins & 11 nominations.","Metascore":"","Released":"September 1959 (Austria) ","Location":"2nd Floor, Marquette County Courthouse - 234 W. Baraga Avenue, Marquette, Michigan, USA ","Actors":"James Stewart, Lee Remick, Ben Gazzara ","Writer":"Wendell Mayes (screenplay), John D. Voelker (based on the novel by) (as Robert Traver)","Running_time":"PT160M / 2h 40min","Description":"Directed by Otto Preminger.  With James Stewart, Lee Remick, Ben Gazzara, Arthur O'Connell. In a murder trial, the defendant says he suffered temporary insanity after the victim raped his wife. What is the truth, and will he win his case?","Rated":"UNRATED"}