{"imdbID":"tt0038948","Title":"Sister Kenny","Year":"1946","Director":"Dudley Nichols","Country":"USA","Language":"English","Production_Co":"RKO Radio Pictures ","Runtime":"116 min","Cast":"Rosalind Russell, Alexander Knox, Dean Jagger, Philip Merivale, Beulah Bondi, Charles Dingle, John Litel, Doreen McCann, Fay Helm, Charles Kemper, Dorothy Peterson, James Burke, Teddy Infuhr","Plot":"Elizabeth Kenny, as a young nurse out in the Australian bush discovers an effective treatment for polio, but can't get official recognition or sanction for her techniques and theories. For ... See full summary » Elizabeth Kenny, as a young nurse out in the Australian bush discovers an effective treatment for polio, but can't get official recognition or sanction for her techniques and theories. For more than three decades (while she tells her fiancée she can't marry him, and repeatedly confronts the pigheaded orthopedic specialist Dr. Brack), she is prevented from treating acute cases and is ridiculed, while she seeks formal recognition for the efficacy of her treatment. Written by Kathy Li","Genre":"Biography, Drama","Keywords":"nurse, medical, polio, australia, female protagonist","imdbRating":"7.2","imdbVotes":"626","Awards":"Nominated for 1 Oscar. Another 1 win.","Metascore":"","Released":"10 October 1946 (USA) ","Location":"RKO Studios - 780 Gower Street, Hollywood, Los Angeles, California, USA","Actors":"Rosalind Russell, Alexander Knox, Dean Jagger ","Writer":"Dudley Nichols (screen play), Alexander Knox (screen play) | 3 more credits »","Running_time":"PT116M / 1h 56min","Description":"Directed by Dudley Nichols.  With Rosalind Russell, Alexander Knox, Dean Jagger, Philip Merivale. Elizabeth Kenny, as a young nurse out in the Australian bush discovers an effective treatment for polio, but can't get official recognition or sanction for her techniques and theories. For more than three decades (while she tells her fiancée she can't marry him, and repeatedly confronts the pigheaded orthopedic specialist Dr. Brack), she is prevented from treating acute cases and is ridiculed, ...","Rated":"APPROVED"}