{"imdbID":"tt0072308","Title":"The Towering Inferno","Year":"1974","Director":"John Guillermin","Country":"USA","Language":"English","Budget":"$14,000,000 (estimated)","Gross":"$116,000,000 (USA)","Production_Co":"Warner Bros., Twentieth Century Fox Film Corporation, Irwin Allen Productions ","Runtime":"165 min","Cast":"Steve McQueen, Paul Newman, William Holden, Faye Dunaway, Fred Astaire, Susan Blakely, Richard Chamberlain, Jennifer Jones, O.J. Simpson, Robert Vaughn, Robert Wagner, Susan Flannery, Sheila Allen, Norman Burton, Jack Collins","Plot":"At the opening party of a colossal, but poorly constructed, office building, a massive fire breaks out that threatens to destroy the tower and everyone in it. Doug Roberts, Architect, returns from a long vacation to find work nearly completed on his skyscraper. He goes to the party that night concerned he's found that his wiring specifications have not been followed and that the building continues to develop short circuits. When the fire begins, Michael O'Halleran is the chief on duty as a series of daring rescues punctuate the terror of a building too tall to have a fire successfully fought from the ground. Written by John Vogel <jlvogel@comcast.net>","Genre":"Action, Drama, Thriller","Keywords":"fire, trapped, party, architect, skyscraper","imdbRating":"6.9","imdbVotes":"29,166","Awards":"Won 3 Oscars. Another 9 wins & 13 nominations.","Metascore":"","Released":"20 December 1974 (USA) ","Location":"20th Century Fox Ranch, Malibu Creek State Park - 1925 Las Virgenes Road, Calabasas, California, USA ","Actors":"Paul Newman, Steve McQueen, William Holden ","Writer":"Richard Martin Stern (novel), Thomas N. Scortia (novel) | 2 more credits »","Running_time":"PT165M / 2h 45min","Description":"Directed by John Guillermin.  With Paul Newman, Steve McQueen, William Holden, Faye Dunaway. At the opening party of a colossal, but poorly constructed, office building, a massive fire breaks out that threatens to destroy the tower and everyone in it.","Rated":"PG"}