{"imdbID":"tt0021749","Title":"City Lights","Year":"1931","Director":"Charles Chaplin","Writer":"Charles Chaplin","Certificate":"See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Luces de la ciudad ","Budget":"$1,500,000 (estimated)","Production_Co":"Charles Chaplin Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"87 min","Sound_Mix":"Silent | Mono (musical score)","Color":"Black and White","Aspect_Ratio":"1.20 : 1","Trivia":"A scene where The Tramp attempts to retrieve a stick that was stuck in a wall was filmed, but it was removed at Charles Chaplin's insistence. See more »","Goofs":"When the Tramp is knocked out on the table in the locker room you see a pair of boxing gloves hooked on a post behind the table. The Tramp wakes up and struggles to sit up. The entire scene you can clearly see a wire attached to one of those gloves that when triggered, falls on his head, knocking him out once again. See more »","Cast":"Virginia Cherrill, Florence Lee, Harry Myers, Al Ernest Garcia, Hank Mann, Charles Chaplin","Plot":"With the aid of a wealthy erratic tippler, a dewy-eyed tramp who has fallen in love with a sightless flower girl accumulates money to be able to help her medically. A tramp falls in love with a beautiful blind girl. Her family is in financial trouble. The tramp's on-and-off friendship with a wealthy man allows him to be the girl's benefactor and suitor. Written by John J. Magee <magee@helix.mgh.harvard.edu>","Genre":"Comedy, Drama, Romance","Keywords":"tramp, little tramp, operation, blind girl, love","imdbRating":"8.6","imdbVotes":"102,610","Awards":"3 wins.","Metascore":"","Released":"7 March 1931 (USA) ","Location":"Chaplin Studios - 1416 N. La Brea Avenue, Hollywood, Los Angeles, California, USA ","Actors":"Charles Chaplin, Virginia Cherrill, Florence Lee ","Running_time":"PT87M / 1h 27min","Description":"Directed by Charles Chaplin.  With Charles Chaplin, Virginia Cherrill, Florence Lee, Harry Myers. With the aid of a wealthy erratic tippler, a dewy-eyed tramp who has fallen in love with a sightless flower girl accumulates money to be able to help her medically.","Rated":"N/A"}