{"imdbID":"tt0070034","Title":"Enter the Dragon","Year":"1973","Director":"Robert Clouse","Writer":"Michael Allin","Taglines":"Their deadly mission: to crack the forbidden island of Han! ","Country":"Hong Kong, USA","Language":"English, Cantonese","Also_Known_As":"The Deadly Three ","Budget":"$850,000 (estimated)","Gross":"HKD 3,307,526 (Hong Kong)","Production_Co":"Warner Bros., Concord Productions Inc., Golden Harvest Company ","Runtime":"102 min | 99 min (theatrical) | 86 min (VHS release) (USA)","Sound_Mix":"DTS (re-release)| Dolby Digital (re-release)| Mono (original release)| SDDS (re-release)","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"The hundreds of extras needed to play derelicts were real derelicts from the streets of Hong Kong. See more »","Goofs":"When Lee investigates the grounds, he has to jump into a tree to avoid being spotted. The jump was obviously filmed in reverse. See more »","Cast":"Bruce Lee, John Saxon, Jim Kelly, Ahna Capri, Kien Shih, Robert Wall, Angela Mao, Betty Chung, Geoffrey Weeks, Bolo Yeung, Peter Archer, Li Jen Ho, Marlene Clark, Allan Kent, William Keller","Plot":"A martial artist agrees to spy on a reclusive crime lord using his invitation to a tournament there as cover. Enter the Dragon revolves around the three main characters. Lee, a man recruited by an agency to investigate a tournament hosted by Han, since they believe he has an Opium trade there. Roper and Williams are former army buddies since Vietnam and they enter the tournament due to different problems that they have. Roper is on the run from the Mafia due to his gambling debts, while Williams is harassed by racist police officers and defends himself from them and uses the car for his getaway. It is a deadly tournament that they will enter on an island. Lee's job is to get the other two out of there alive. Written by Emphinix","Genre":"Action, Crime, Drama","Keywords":"tournament, martial arts, shaolin, island, monk","imdbRating":"7.7","imdbVotes":"75,713","Awards":"1 win.","Metascore":"","Released":"19 August 1973 (USA) ","Location":"Aberdeen Harbour, Aberdeen, Hong Kong, China ","Actors":"Bruce Lee, John Saxon, Jim Kelly ","Running_time":"PT102M / 1h 42min","Description":"Directed by Robert Clouse.  With Bruce Lee, John Saxon, Jim Kelly, Ahna Capri. A martial artist agrees to spy on a reclusive crime lord using his invitation to a tournament there as cover.","Rated":"R"}