{"imdbID":"tt0052618","Title":"Ben-Hur","Year":"1959","Director":"William Wyler","Taglines":"The Entertainment Experience of a Lifetime! ","Certificate":"G | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Ben-Hur: A Tale of the Christ ","Budget":"$15,900,000 (estimated)","Gross":"$70,000,000 (USA)","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","":"Show detailed company contact information on IMDbPro »","Runtime":"212 min | 219 min (1970) | 224 min (1962) | 222 min (1993 re-release) | 214 min (DVD edition) | 222 min (2005 DVD)","Sound_Mix":"6-Track Stereo (Westrex Recording System)","Color":"Color (Technicolor)","Aspect_Ratio":"2.66 : 1","Trivia":"The chariot race has a 263-to-1 cutting ratio (263 feet of film for every one foot kept), probably the highest for any 65mm sequence ever filmed. See more »","Goofs":"Sheik Ilderim pins a Star of David onto Ben Hur's belt before the race, obviously to goad the Romans. The Star of David didn't become a symbol of Judaism until the Middle Ages, in Eastern Europe. The first reference occurs in the 12th Century. See more »","Crazy_Credits":"The Metro-Goldwyn-Mayer lion is shown in a still-frame to appear looking peaceful at the beginning rather than roaring. See more »","Cast":"Charlton Heston, Jack Hawkins, Haya Harareet, Stephen Boyd, Hugh Griffith, Martha Scott, Cathy O'Donnell, Sam Jaffe, Finlay Currie, Frank Thring, Terence Longdon, George Relph, André Morell","Plot":"When a Jewish prince is betrayed and sent into slavery by a Roman friend, he regains his freedom and comes back for revenge. Judah Ben-Hur lives as a rich Jewish prince and merchant in Jerusalem at the beginning of the 1st century. Together with the new governor his old friend Messala arrives as commanding officer of the Roman legions. At first they are happy to meet after a long time but their different politic views separate them. During the welcome parade a roof tile falls down from Judah's house and injures the governor. Although Messala knows they are not guilty, he sends Judah to the galleys and throws his mother and sister into prison. But Judah swears to come back and take revenge. Written by Matthias Scheler <tron@lyssa.owl.de>","Genre":"Adventure, Drama, War","Keywords":"friend, roman, jerusalem, revenge, prince","imdbRating":"8.1","imdbVotes":"153,376","Awards":"Won 11 Oscars. Another 16 wins & 13 nominations.","Metascore":"","Released":"26 December 1959 (UK) ","Location":"Anzio, Italy ","Actors":"Charlton Heston, Jack Hawkins, Stephen Boyd ","Writer":"Lew Wallace (novel) (as General Lew Wallace), Karl Tunberg (screenplay)","Running_time":"PT212M / 3h 32min","Description":"Directed by William Wyler.  With Charlton Heston, Jack Hawkins, Stephen Boyd, Haya Harareet. When a Jewish prince is betrayed and sent into slavery by a Roman friend, he regains his freedom and comes back for revenge.","Rated":"G"}