{"imdbID":"tt0033870","Title":"The Maltese Falcon","Year":"1941","Director":"John Huston","Taglines":"It's thrilling . . . it's chilling . . . it's the most baffling mystery story in years ! ","Certificate":"Not Rated | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"The Gent from Frisco ","Budget":"$375,000 (estimated)","Production_Co":"Warner Bros. ","":"Show detailed company contact information on IMDbPro »","Runtime":"100 min","Sound_Mix":"Mono (RCA Sound System)","Color":"Black and White","Aspect_Ratio":"1.37 : 1","Trivia":"\"The Screen Guild Theater\" broadcast a 30 minute radio adaptation of the movie on September 20, 1943 with Humphrey Bogart, Mary Astor, Sydney Greenstreet and Peter Lorre, and on May 18, 1950 with Humphrey Bogart reprising his film role with his wife Lauren Bacall, and again at the \"Academy Award Theater\" on July 3, 1946 with Humphrey Bogart, Sydney Greenstreet and Mary Astor reprising their film roles. See more »","Goofs":"When he first enters his office, Archer is smoking a cigarette with his left hand, and appears to be holding a match in his lowered right hand. He seems to have been caught holding the match he used to light the cigarette before entering the scene, and disposes of it by casually dropping it to the floor. See more »","Cast":"Humphrey Bogart, Mary Astor, Gladys George, Peter Lorre, Barton MacLane, Lee Patrick, Sydney Greenstreet, Ward Bond, Jerome Cowan, Elisha Cook Jr., James Burke, Murray Alper, John Hamilton","Plot":"A private detective takes on a case that involves him with three eccentric criminals, a gorgeous liar, and their quest for a priceless statuette. Spade and Archer is the name of a San Francisco detective agency. That's for Sam Spade and Miles Archer. The two men are partners, but Sam doesn't like Miles much. A knockout, who goes by the name of Miss Wonderly, walks into their office; and by that night everything's changed. Miles is dead. And so is a man named Floyd Thursby. It seems Miss Wonderly is surrounded by dangerous men. There's Joel Cairo, who uses gardenia-scented calling cards. There's Kasper Gutman, with his enormous girth and feigned civility. Her only hope of protection comes from Sam, who is suspected by the police of one or the other murder. More murders are yet to come, and it will all be because of these dangerous men -- and their lust for a statuette of a bird: the Maltese Falcon. Written by J. Spurlin","Genre":"Crime, Drama, Film-Noir","Keywords":"private detective, murder, cult film, maltese falcon, detective","imdbRating":"8.2","imdbVotes":"109,024","Awards":"Nominated for 3 Oscars. Another 2 wins.","Metascore":"","Released":"18 October 1941 (USA) ","Location":"Bush Street, San Francisco, California, USA ","Actors":"Humphrey Bogart, Mary Astor, Gladys George ","Writer":"John Huston (screenplay), Dashiell Hammett (based upon the novel by)","Running_time":"PT100M / 1h 40min","Description":"Directed by John Huston.  With Humphrey Bogart, Mary Astor, Gladys George, Peter Lorre. A private detective takes on a case that involves him with three eccentric criminals, a gorgeous liar, and their quest for a priceless statuette.","Rated":"NOT RATED"}