{"imdbID":"tt0075148","Title":"Rocky","Year":"1976","Director":"John G. Avildsen","Writer":"Sylvester Stallone","Taglines":"Meet the \"Italian Stallion\": a small-time guy with big-time guts who yearns to be a hero...just once! ","Certificate":"PG | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Рокки ","Budget":"$960,000 (estimated)","Gross":"$117,235,247 (USA)","Production_Co":"Chartoff-Winkler Productions, United Artists ","":"Show detailed company contact information on IMDbPro »","Runtime":"120 min | 145 min (director's cut)","Sound_Mix":"Mono","Color":"Color (Technicolor)","Aspect_Ratio":"1.33 : 1","Trivia":"The highest-grossing movie of 1976. See more »","Goofs":"Apollo describes \"January First... The country's biggest birthday...\" July 4th is considered the country's birthday. See more »","Crazy_Credits":"The film opens with the title of the film scrolling from right to left underscored by music. However, instead of just doing the opening credits for the cast, Rocky is shown boxing. The rest of the credits appear later as Rocky is shown walking down a street, and this time there is nothing underscoring the credits. See more »","Cast":"Sylvester Stallone, Talia Shire, Burt Young, Carl Weathers, Burgess Meredith, Thayer David, Joe Spinell, Jimmy Gambina, Bill Baldwin, Al Silvani, George Memmoli, Jodi Letizia, Diana Lewis, George O'Hanlon, Larry Carroll","Plot":"Rocky Balboa, a small-time boxer, gets a supremely rare chance to fight the heavy-weight champion, Apollo Creed, in a bout in which he strives to go the distance for his self-respect. Rocky Balboa is a struggling boxer trying to make the big time, working as a debt collector for a pittance. When heavyweight champion Apollo Creed visits Philadelphia, his managers want to set up an exhibition match between Creed and a struggling boxer, touting the fight as a chance for a \"nobody\" to become a \"somebody\". The match is supposed to be easily won by Creed, but someone forgot to tell Rocky, who sees this as his only shot at the big time. Written by Murray Chapman <muzzle@cs.uq.oz.au>","Genre":"Drama, Sport","Keywords":"boxer, training, philadelphia pennsylvania, hometown hero, protective male","imdbRating":"8.1","imdbVotes":"356,845","Awards":"Won 3 Oscars. Another 16 wins & 21 nominations.","Metascore":"","Released":"3 December 1976 (USA) ","Location":"2822-2824 Rosehill St, Philadelphia, Pensylvannia, USA ","Actors":"Sylvester Stallone, Talia Shire, Burt Young ","Running_time":"PT120M / 2h","Description":"Directed by John G. Avildsen.  With Sylvester Stallone, Talia Shire, Burt Young, Carl Weathers. Rocky Balboa, a small-time boxer, gets a supremely rare chance to fight the heavy-weight champion, Apollo Creed, in a bout in which he strives to go the distance for his self-respect.","Rated":"PG"}