{"imdbID":"tt0066026","Title":"MASH","Year":"1970","Director":"Robert Altman","Country":"USA","Language":"English, Japanese, Korean","Budget":"$3,500,000 (estimated)","Gross":"$81,600,000 (USA)","Production_Co":"Aspen Productions (I), Ingo Preminger Productions, Twentieth Century Fox Film Corporation ","Runtime":"116 min | 112 min (PG)","Cast":"Donald Sutherland, Elliott Gould, Tom Skerritt, Sally Kellerman, Robert Duvall, Roger Bowen, Rene Auberjonois, David Arkin, Jo Ann Pflug, Gary Burghoff, Fred Williamson, Michael Murphy, Indus Arthur, Ken Prymus, Bobby Troup","Plot":"The staff of a Korean War field hospital use humor and hijinks to keep their sanity in the face of the horror of war. The personnel at the 4077 MASH unit deal with the horrors of the Korean War and the stresses faced in surgery by whatever means. The tone at the MASH is established by recent arrivals, surgeons Captains 'Hawkeye' Pierce, 'Duke' Forrest, and 'Trapper' John McIntyre - the latter who Hawkeye knows he's met somewhere, but Trapper who won't divulge where - whose antics can be best described as non-regulation, and in the negative words of one of their fellow MASH-ers: unmilitary. The unit's commanding officer, Colonel Henry Blake, doesn't care about this behavior as long as it doesn't affect him, and as long as they do their job and do it well, which they do. Their behavior does extremely bother fellow surgeon, Major Frank Burns, and recently arrived head nurse, Major Margaret Houlihan, who obtains the nickname 'Hot Lips' based on information they glean about her through underhanded means. Beyond their battles with Frank and Hot Lips, Hawkeye, Duke and/or Trapper help unit dentist Painless ... Written by Huggo","Genre":"Comedy, War, Drama","Keywords":"surgeon, mobile army surgical hospital, korean war, nurse, dentist","imdbRating":"7.6","imdbVotes":"54,004","Awards":"Won 1 Oscar. Another 14 wins & 25 nominations.","Metascore":"79","Released":"March 1970 (USA) ","Location":"Griffith Park - 4730 Crystal Springs Drive, Los Angeles, California, USA ","Actors":"Donald Sutherland, Elliott Gould, Tom Skerritt ","Writer":"Richard Hooker (from the novel by), Ring Lardner Jr. (screenplay)","Running_time":"PT116M / 1h 56min","Description":"Directed by Robert Altman.  With Donald Sutherland, Elliott Gould, Tom Skerritt, Sally Kellerman. The staff of a Korean War field hospital use humor and hijinks to keep their sanity in the face of the horror of war.","Rated":"R"}