{"imdbID":"tt0054215","Title":"Psycho","Year":"1960","Director":"Alfred Hitchcock","Taglines":"A new- and altogether different- screen excitement!!! ","Certificate":"See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Psicosis ","Budget":"$806,947 (estimated)","Gross":"$32,000,000 (USA)","Production_Co":"Shamley Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"109 min | 108 min (cut)","Sound_Mix":"Mono (Westrex Recording System)","Color":"Black and White","Aspect_Ratio":"1.85 : 1","Trivia":"The first scene to be shot was of Marion getting pulled over by the cop. This was filmed on Golden State Highway (U.S. 99). See more »","Goofs":"During the shower scene, when Marion is seen in front of the shower curtain, there are two different water jets, visible by different angles towards each other, revealing that besides the shower head, an additional source of water was used. See more »","Crazy_Credits":"Opening credits prologue: PHOENIX, ARIZONAFRIDAY, DECEMBER THE ELEVENTHTWO FORTY-THREE P.M. See more »","Cast":"Anthony Perkins, Vera Miles, John Gavin, Janet Leigh, Martin Balsam, John McIntire, Simon Oakland, Frank Albertson, Patricia Hitchcock, Vaughn Taylor, Lurene Tuttle, John Anderson, Mort Mills","Plot":"A Phoenix secretary steals $40,000 from her employer's client, goes on the run and checks into a remote motel run by a young man under the domination of his mother. Phoenix officeworker Marion Crane is fed up with the way life has treated her. She has to meet her lover Sam in lunch breaks and they cannot get married because Sam has to give most of his money away in alimony. One Friday Marion is trusted to bank $40,000 by her employer. Seeing the opportunity to take the money and start a new life, Marion leaves town and heads towards Sam's California store. Tired after the long drive and caught in a storm, she gets off the main highway and pulls into The Bates Motel. The motel is managed by a quiet young man called Norman who seems to be dominated by his mother. Written by Col Needham <col@imdb.com>","Genre":"Horror, Mystery, Thriller","Keywords":"motel, money, shower, theft, rain","imdbRating":"8.5","imdbVotes":"404,328","Awards":"Nominated for 4 Oscars. Another 4 wins & 8 nominations.","Metascore":"","Released":"8 September 1960 (USA) ","Location":"Title and Trust Building, 114 West Adams Street, downtown Phoenix, Arizona, USA ","Actors":"Anthony Perkins, Janet Leigh, Vera Miles ","Writer":"Joseph Stefano (screenplay), Robert Bloch (novel)","Running_time":"PT109M / 1h 49min","Description":"Directed by Alfred Hitchcock.  With Anthony Perkins, Janet Leigh, Vera Miles, John Gavin. A Phoenix secretary steals $40,000 from her employer's client, goes on the run and checks into a remote motel run by a young man under the domination of his mother.","Rated":"N/A"}