{"imdbID":"tt0052218","Title":"Some Came Running","Year":"1958","Director":"Vincente Minnelli","Country":"USA","Language":"English","Production_Co":"Metro-Goldwyn-Mayer (MGM) ","Runtime":"137 min","Cast":"Frank Sinatra, Dean Martin, Shirley MacLaine, Martha Hyer, Arthur Kennedy, Nancy Gates, Leora Dana, Betty Lou Keim, Larry Gates, Steve Peck, Connie Gilchrist, Ned Wever","Plot":"In the post-war, the alcoholic and bitter veteran military and former writer Dave Hirsch returns from Chicago to his hometown Parkman, Indiana. He is followed by Ginnie Moorehead, a vulgar ... See full summary » In the post-war, the alcoholic and bitter veteran military and former writer Dave Hirsch returns from Chicago to his hometown Parkman, Indiana. He is followed by Ginnie Moorehead, a vulgar and easy woman with whom he spent his last night in Chicago that has fallen in love with him. The resentful Dave meets his older brother Frank Hirsh, who owns a jewelry store and is a prominent citizen of Parkman that invites him to have dinner with his family. Dave meets his sister-in-law Agnes that hates him since one character of his novel had been visibly inspired on her, and his teenage niece Dawn. Frank introduces the school teacher Gwen French to him and Dave feels attracted by the beautiful woman that is daughter of his former Professor Robert Haven French and idolizes his work as writer. However, his unrequited love with Gwen drives Dave back to the local bar where he befriends the professional gambler Bama Dillert and meets Ginnie again with the Chicago's mobster Raymond Lanchak that was ... Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Drama, Romance","Keywords":"writer, teacher, love, indiana, veteran","imdbRating":"7.5","imdbVotes":"4,005","Awards":"Nominated for 5 Oscars. Another 3 wins & 5 nominations.","Metascore":"","Released":"18 December 1958 (USA) ","Location":"Jefferson County, Indiana, USA ","Actors":"Frank Sinatra, Dean Martin, Shirley MacLaine ","Writer":"James Jones (novel), John Patrick | 1 more credit »","Running_time":"PT137M / 2h 17min","Description":"Directed by Vincente Minnelli.  With Frank Sinatra, Dean Martin, Shirley MacLaine, Martha Hyer. In the post-war, the alcoholic and bitter veteran military and former writer Dave Hirsch returns from Chicago to his hometown Parkman, Indiana. He is followed by Ginnie Moorehead, a vulgar and easy woman with whom he spent his last night in Chicago that has fallen in love with him. The resentful Dave meets his older brother Frank Hirsh, who owns a jewelry store and is a prominent citizen of ...","Rated":"APPROVED"}