{"imdbID":"tt0082096","Title":"Das Boot","Year":"1981","Director":"Wolfgang Petersen","Taglines":"Eine Reise ans Ende des Verstandes ","Country":"West Germany","Language":"German, English, French","Also_Known_As":"El barco ","Budget":"$14,000,000 (estimated)","Opening_Weekend":"$68,369 (USA) (4 April 1997)","Gross":"$11,433,134 (USA) (25 April 1997)","Production_Co":"Bavaria Film, Radiant Film GmbH, Süddeutscher Rundfunk (SDR) ","":"Show detailed company contact information on IMDbPro »","Runtime":"149 min | 209 min (director's cut) | 138 min (VHS) | 239 min (special uncut DVD) | 293 min (Original Uncut Version)","Sound_Mix":"Dolby Digital (director's cut)| Dolby (original release)| SDDS (director's cut)","Color":"Color (Fujicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"While shooting scale models in the Northern Sea, filming was disturbed by doves landing on the submarine. See more »","Goofs":"U-32 is stated to have made contact with an enemy convoy. Following the convoy attack, Kriechbaum reads a report from U-112. U-32, a Type VIIA boat, actually sank in October 1940, a year prior to the events of this film. U-112 was a proposed Type IXB boat, which was designed to be a seaplane carrier but was never completed. See more »","Cast":"Jürgen Prochnow, Herbert Grönemeyer, Klaus Wennemann, Hubertus Bengsch, Martin Semmelrogge, Bernd Tauber, Erwin Leder, Martin May, Heinz Hoenig, Uwe Ochsenknecht, Claude-Oliver Rudolph, Jan Fedder, Ralf Richter, Joachim Bernhard, Oliver Stritzel","Plot":"The claustrophobic world of a WWII German U-boat; boredom, filth, and sheer terror. It is 1942 and the German submarine fleet is heavily engaged in the so-called \"Battle of the Atlantic\" to harass and destroy British shipping. With better escorts of the Destroyer Class, however, German U-Boats have begun to take heavy losses. \"Das Boot\" is the story of one such U-Boat crew, with the film examining how these submariners maintained their professionalism as soldiers and attempted to accomplish impossible missions, all the while attempting to understand and obey the ideology of the government under which they served. Written by Anthony Hughes <husnock31@hotmail.com>","Genre":"Adventure, Drama, Thriller","Keywords":"submarine, submarine movie, tension, u boat, duty","imdbRating":"8.4","imdbVotes":"162,408","Awards":"Nominated for 6 Oscars. Another 13 wins & 5 nominations.","Metascore":"86","Released":"17 September 1981 (West Germany) ","Location":"Bodensee, Bavaria, Germany ","Actors":"Jürgen Prochnow, Herbert Grönemeyer, Klaus Wennemann ","Writer":"Wolfgang Petersen (screenplay), Lothar G. Buchheim (novel)","Running_time":"PT149M / 2h 29min","Description":"Directed by Wolfgang Petersen.  With Jürgen Prochnow, Herbert Grönemeyer, Klaus Wennemann, Hubertus Bengsch. The claustrophobic world of a WWII German U-boat; boredom, filth, and sheer terror.","Rated":"R"}