{"imdbID":"tt0075686","Title":"Annie Hall","Year":"1977","Director":"Woody Allen","Taglines":"A nervous romance.","Certificate":"PG | See all certifications »","Country":"USA","Language":"English, German","Also_Known_As":"Anhedonia ","Budget":"$4,000,000 (estimated)","Gross":"$39,200,000 (USA)","Production_Co":"Rollins-Joffe Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"93 min","Sound_Mix":"Mono","Color":"Color","Aspect_Ratio":"1.37 : 1","Trivia":"One scene cut from the film is a fantasy sequence of Annie and Alvy visiting hell. This scene was rewritten 20 years later for Allen's Deconstructing Harry (1997). See more »","Goofs":"When Annie is driving on the freeway with Alvy, a police cruiser can be seen in the background holding back traffic. See more »","Crazy_Credits":"Christopher Walken's name is misspelled in the credits as \"Christopher Wlaken\". See more »","Cast":"Woody Allen, Diane Keaton, Tony Roberts, Carol Kane, Paul Simon, Shelley Duvall, Janet Margolin, Colleen Dewhurst, Christopher Walken, Donald Symington, Helen Ludlam, Mordecai Lawner, Joan Neuman, Jonathan Munk, Ruth Volner","Plot":"Neurotic New York comedian Alvy Singer falls in love with the ditsy Annie Hall. Alvy Singer, a forty year old twice divorced, neurotic, intellectual Jewish New York stand-up comic, reflects on the demise of his latest relationship, to Annie Hall, an insecure, flighty, Midwestern WASP aspiring nightclub singer. Unlike his previous relationships, Alvy believed he may have worked out all the issues in his life through fifteen years of therapy to make this relationship with Annie last, among those issues being not wanting to date any woman that would want to date him, and thus subconsciously pushing those women away. Alvy not only reviews the many ups and many downs of their relationship, but also reviews the many facets of his makeup that led to him starting to date Annie. Those facets include growing up next to Coney Island in Brooklyn, being attracted to the opposite sex for as long as he can remember, and enduring years of Jewish guilt with his constantly arguing parents. Written by Huggo","Genre":"Comedy, Romance","Keywords":"neurosis, breaking the fourth wall, singer, comedian, jewish","imdbRating":"8.1","imdbVotes":"184,814","Awards":"Won 4 Oscars. Another 26 wins & 8 nominations.","Metascore":"","Released":"20 April 1977 (USA) ","Location":"W. Century Blvd. & Airport Blvd, Los Angeles, California, USA ","Actors":"Woody Allen, Diane Keaton, Tony Roberts ","Writer":"Woody Allen, Marshall Brickman","Running_time":"PT93M / 1h 33min","Description":"Directed by Woody Allen.  With Woody Allen, Diane Keaton, Tony Roberts, Carol Kane. Neurotic New York comedian Alvy Singer falls in love with the ditsy Annie Hall.","Rated":"PG"}