{"imdbID":"tt0078748","Title":"Alien","Year":"1979","Director":"Ridley Scott","Taglines":"It's Alien, the 8th passenger. ","Certificate":"A | See all certifications »","Country":"USA, UK","Language":"English, Spanish","Also_Known_As":"Alien - El octavo pasajero ","Budget":"$11,000,000 (estimated)","Opening_Weekend":"£208,081 (UK) (31 October 2003)","Gross":"£379,140 (UK) (7 November 2003)","Production_Co":"Brandywine Productions, Twentieth Century-Fox Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"117 min | 116 min (director's cut)","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby (as Dolby Stereo)","Color":"Color (Eastman Kodak)| Color","Aspect_Ratio":"2.35 : 1","Trivia":"Entertainment Weekly voted this as the third scariest film of all time. See more »","Goofs":"(at around 28 mins) When Dallas, Kane and Lambert are inside the alien ship containing the space jockey, there is light coming from the left side of the screen, despite them being inside an internal chamber of the derelict spacecraft. See more »","Cast":"Tom Skerritt, Sigourney Weaver, Veronica Cartwright, Harry Dean Stanton, John Hurt, Ian Holm, Yaphet Kotto, Bolaji Badejo, Helen Horton","Plot":"After a space merchant vessel perceives an unknown transmission as distress call, their landing on the source planet finds one of the crew attacked by a mysterious lifeform. Continuing their journey back to Earth with the attacked crew having recovered and the critter deceased, they soon realize that its life cycle has merely begun. A commercial crew aboard the deep space towing vessel, Nostromo is on its way home when they pick up an SOS warning from a distant planet. What they don't know is that the SOS warning is not like any other ordinary warning call. Picking up the signal, the crew realize that they are not alone on the spaceship when an alien stowaway is on the cargo ship. Written by blazesnakes9","Genre":"Horror, Sci-Fi","Keywords":"alien, spaceship, outer space, creature, future","imdbRating":"8.5","imdbVotes":"540,266","Awards":"Won 1 Oscar. Another 15 wins & 19 nominations.","Metascore":"83","Released":"6 December 1979 (India) ","Location":"Shepperton Studios, Shepperton, Surrey, England, UK ","Actors":"Sigourney Weaver, Tom Skerritt, John Hurt ","Writer":"Dan O'Bannon (story), Ronald Shusett (story) | 1 more credit »","Running_time":"PT117M / 1h 57min","Description":"Directed by Ridley Scott.  With Sigourney Weaver, Tom Skerritt, John Hurt, Veronica Cartwright. After a space merchant vessel perceives an unknown transmission as distress call, their landing on the source planet finds one of the crew attacked by a mysterious lifeform. Continuing their journey back to Earth with the attacked crew having recovered and the critter deceased, they soon realize that its life cycle has merely begun.","Rated":"A"}