{"imdbID":"tt0088258","Title":"This Is Spinal Tap","Year":"1984","Director":"Rob Reiner","Taglines":"Does for rock and roll what \"The Sound of Music\" did for hills","Certificate":"R | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Rock 'n' Roll Nightmare ","Budget":"$2,500,000 (estimated)","Opening_Weekend":"$55,854 (USA) (8 September 2000)","Gross":"$4,671,831 (USA) (6 October 2000)","Production_Co":"Spinal Tap Prod. ","Runtime":"82 min","Sound_Mix":"Dolby","Color":"Color","Aspect_Ratio":"1.70 : 1","Trivia":"Rob Reiner was originally going to be one of the band members. He ended up directing the film after Harry Shearer said he \"didn't look good in spandex.\" See more »","Goofs":"David Kaff's position changes when the new album cover is revealed. See more »","Crazy_Credits":"Rob Reiner interviews all the members of the band. See more »","Cast":"Rob Reiner, Kimberly Stringer, Chazz Dominguez, Shari Hall, R.J. Parnell, David Kaff, Tony Hendra, Michael McKean, Christopher Guest, Harry Shearer, Bruno Kirby, Jean Cromie, Patrick Maher, Ed Begley Jr., Danny Kortchmar","Plot":"Spinal Tap, one of England's loudest bands, is chronicled by film director Marty DeBergi on what proves to be a fateful tour. In 1982 legendary British heavy metal band Spinal Tap attempt an American comeback tour accompanied by a fan who is also a film-maker. The resulting documentary, interspersed with powerful performances of Tap's pivotal music and profound lyrics, candidly follows a rock group heading towards crisis, culminating in the infamous affair of the eighteen-inch-high Stonehenge stage prop. Written by Jeremy Perkins <jwp@aber.ac.uk>","Genre":"Comedy, Music","Keywords":"heavy metal, cult film, mockumentary, washed out, concert tour","imdbRating":"8.0","imdbVotes":"102,901","Awards":"3 wins & 2 nominations.","Metascore":"85","Released":"2 March 1984 (USA) ","Location":"California, USA ","Actors":"Rob Reiner, Michael McKean, Christopher Guest ","Writer":"Christopher Guest, Michael McKean | 2 more credits »","Running_time":"PT82M / 1h 22min","Description":"Directed by Rob Reiner.  With Rob Reiner, Michael McKean, Christopher Guest, Kimberly Stringer. Spinal Tap, one of England's loudest bands, is chronicled by film director Marty DeBergi on what proves to be a fateful tour.","Rated":"R"}