{"imdbID":"tt0063462","Title":"The Producers","Year":"1967","Director":"Mel Brooks","Writer":"Mel Brooks","Taglines":"Hollywood Never Faced a Zanier Zero Hour! ","Certificate":"PG | See all certifications »","Country":"USA","Language":"English, German","Also_Known_As":"Mel Brooks' The Producers ","Budget":"$941,000 (estimated)","Opening_Weekend":"$6,091 (USA) (7 June 2002)","Gross":"$111,866 (USA) (10 January 2003)","Production_Co":"Crossbow Productions, Springtime Productions, U-M Productions ","Runtime":"88 min","Sound_Mix":"Mono","Color":"Color (Pathécolor) (uncredited)","Aspect_Ratio":"1.37 : 1","Trivia":"Mel Brooks worked on two real-life Broadway musical flops. He did a rewrite on the failed musical \"Shinbone Alley\" (1957), and wrote the libretto for \"All American\", which starred Ray Bolger and ran for 80 performances in 1962. See more »","Goofs":"When Max and Leo hide their faces from the audience in the bar, Leo's hands change positions just before the crowd enters. See more »","Crazy_Credits":"Zero Mostel is listed in the closing credits simply as \"Zero\". See more »","Cast":"Zero Mostel, Gene Wilder, Dick Shawn, Kenneth Mars, Lee Meredith, Christopher Hewett, Andréas Voutsinas, Estelle Winwood, Renée Taylor, David Patch, William Hickey, Barney Martin, Shimen Ruskin, Frank Campanella, Josip Elic","Plot":"Producers Max Bialystock and Leo Bloom make money by producing a sure-fire flop. Down-on-his-luck theatrical producer Max Bialystock is forced to romance rich old ladies to finance his efforts. When timid accountant Leo Bloom reviews Max's accounting books, the two hit upon a way to make a fortune by producing a sure-fire flop. The play which is to be their gold mine? \"Springtime for Hitler.\" Written by Scott Renshaw <as.idc@forsythe.stanford.edu>","Genre":"Comedy","Keywords":"broadway, hitler, accountant, scam, theatrical producer","imdbRating":"7.7","imdbVotes":"38,619","Awards":"Won 1 Oscar. Another 2 wins & 5 nominations.","Metascore":"97","Released":"10 November 1968 (USA) ","Location":"Broadway Theatre - 1681 Broadway, Manhattan, New York City, New York, USA ","Actors":"Zero Mostel, Gene Wilder, Dick Shawn ","Running_time":"PT88M / 1h 28min","Description":"Directed by Mel Brooks.  With Zero Mostel, Gene Wilder, Dick Shawn, Kenneth Mars. Producers Max Bialystock and Leo Bloom make money by producing a sure-fire flop.","Rated":"PG"}