{"imdbID":"tt0088322","Title":"Under the Volcano","Year":"1984","Director":"John Huston","Country":"Mexico, USA","Language":"English, Spanish","Production_Co":"Conacite Uno, Ithaca ","Runtime":"112 min","Cast":"Albert Finney, Jacqueline Bisset, Anthony Andrews, Ignacio López Tarso, Katy Jurado, James Villiers, Dawson Bray, Carlos Riquelme, Jim McCarthy, José René Ruiz, Eleazar Garcia Jr., Salvador Sánchez, Sergio Calderón, Araceli Ladewuen Castelun, Emilio Fernández","Plot":"Against a background of war breaking out in Europe and the Mexican fiesta Day of Death, we are taken through one day in the life of Geoffrey Firmin, a British consul living in alcoholic ... See full summary » Against a background of war breaking out in Europe and the Mexican fiesta Day of Death, we are taken through one day in the life of Geoffrey Firmin, a British consul living in alcoholic disrepair and obscurity in a small southern Mexican town in 1939. The Consul's self-destructive behaviour, perhaps a metaphor for a menaced civilization, is a source of perplexity and sadness to his nomadic, idealistic half-brother, Hugh, and his ex-wife, Yvonne, who has returned with hopes of healing Geoffrey and their broken marriage. Written by Eric Wees <eric_wees@ccmail.chin.doc.ca>","Genre":"Drama","Keywords":"mexico, half brother, one day, male full frontal nudity, self destruction","imdbRating":"7.1","imdbVotes":"3,462","Awards":"Nominated for 2 Oscars. Another 3 wins & 5 nominations.","Metascore":"","Released":"13 June 1984 (USA) ","Location":"Acapantzingo, Morelos, Mexico ","Actors":"Albert Finney, Jacqueline Bisset, Anthony Andrews ","Writer":"Malcolm Lowry (novel), Guy Gallo (screenplay)","Running_time":"PT112M / 1h 52min","Description":"Directed by John Huston.  With Albert Finney, Jacqueline Bisset, Anthony Andrews, Ignacio López Tarso. Against a background of war breaking out in Europe and the Mexican fiesta Day of Death, we are taken through one day in the life of Geoffrey Firmin, a British consul living in alcoholic disrepair and obscurity in a small southern Mexican town in 1939. The Consul's self-destructive behaviour, perhaps a metaphor for a menaced civilization, is a source of perplexity and sadness to his nomadic, ...","Rated":"R"}