{"imdbID":"tt0067217","Title":"The Hospital","Year":"1971","Director":"Arthur Hiller","Writer":"Paddy Chayefsky","Country":"USA","Language":"English","Production_Co":"Simcha Productions ","Runtime":"103 min","Cast":"George C. Scott, Diana Rigg, Barnard Hughes, Richard Dysart, Stephen Elliott, Donald Harron, Andrew Duncan, Nancy Marchand, Jordan Charney, Roberts Blossom, Lenny Baker, Richard Hamilton, Arthur Junaluska, Kate Harrington, Katherine Helmond","Plot":"Horror/mystery in which an over-burdened doctor struggles to find meaning in his life while a murderer stalks the halls of his hospital. Herbert Bock is chief of medicine in a major teaching hospital. His wife has left him, he is impotent and his children have both disowned him. He is toying with the idea of suicide when patients begin dying, not from complications, but from the erroneous treatments the Hospital is giving them. People in the wrong beds are given wrong medicines, sent to operating theaters for incorrect surgery, and found in waiting rooms dead of natural causes. Barbara Drummond has come to take her comatose father back to the Sioux reservation where he operates a clinic and they each reach out to each other for emotional support, as a shadowy figure stalks the patients and staff of the hospital. Written by John Vogel <jlvogel@comcast.net>","Genre":"Comedy, Drama, Mystery","Keywords":"hospital, doctor, dead patient, death on operating table, dead doctor","imdbRating":"7.2","imdbVotes":"4,128","Awards":"Won 1 Oscar. Another 6 wins & 5 nominations.","Metascore":"","Released":"16 June 1972 (Ireland) ","Location":"Manhattan, New York City, New York, USA ","Actors":"George C. Scott, Diana Rigg, Barnard Hughes ","Running_time":"PT103M / 1h 43min","Description":"Directed by Arthur Hiller.  With George C. Scott, Diana Rigg, Barnard Hughes, Richard Dysart. Horror/mystery in which an over-burdened doctor struggles to find meaning in his life while a murderer stalks the halls of his hospital.","Rated":"APPROVED"}