{"imdbID":"tt0081398","Title":"Raging Bull","Year":"1980","Director":"Martin Scorsese","Certificate":"See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Toro salvaje ","Budget":"$18,000,000 (estimated)","Opening_Weekend":"$13,568 (USA) (28 January 2005)","Gross":"$45,250 (USA) (11 February 2005)","Production_Co":"United Artists, Chartoff-Winkler Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"129 min | 121 min (TV)","Sound_Mix":"Dolby","Color":"Black and White | Color","Aspect_Ratio":"1.85 : 1","Trivia":"Paul Schrader was directing Hardcore (1979) when Robert De Niro talked to him about needing help with a script. The first thing Schrader did was drive down to Key West and check the archives of a local newspaper. It was there that he learned that there were two La Mottas, something which is not referenced in Jake LaMotta's autobiography. That was when Schrader knew he had found the hook for the screenplay. See more »","Goofs":"When Jake and Joey are trying to set the TV antenna towards the end of the film, the screen noise pattern is different in close-ups and wide shots. See more »","Crazy_Credits":"The film is in black and white, but during the opening credits, the title is in red letters. See more »","Cast":"Robert De Niro, Cathy Moriarty, Joe Pesci, Frank Vincent, Nicholas Colasanto, Theresa Saldana, Mario Gallo, Frank Adonis, Joseph Bono, Frank Topham, Lori Anne Flax, Charles Scorsese, Don Dunphy, Bill Hanrahan, Rita Bennett","Plot":"An emotionally self-destructive boxer's journey through life, as the violence and temper that leads him to the top in the ring, destroys his life outside it. When Jake LaMotta steps into a boxing ring and obliterates his opponent, he's a prizefighter. But when he treats his family and friends the same way, he's a ticking time bomb, ready to go off at any moment. Though LaMotta wants his family's love, something always seems to come between them. Perhaps it's his violent bouts of paranoia and jealousy. This kind of rage helped make him a champ, but in real life, he winds up in the ring alone. Written by alfiehitchie","Genre":"Biography, Drama, Sport","Keywords":"boxing, rage, violence, jealousy, hot temper","imdbRating":"8.3","imdbVotes":"226,910","Awards":"Won 2 Oscars. Another 23 wins & 24 nominations.","Metascore":"92","Released":"19 December 1980 (USA) ","Location":"Downtown, Los Angeles, California, USA ","Actors":"Robert De Niro, Cathy Moriarty, Joe Pesci ","Writer":"Jake LaMotta (based on the book by) (as Jake La Motta), Joseph Carter (with) | 3 more credits »","Running_time":"PT129M / 2h 9min","Description":"Directed by Martin Scorsese.  With Robert De Niro, Cathy Moriarty, Joe Pesci, Frank Vincent. An emotionally self-destructive boxer's journey through life, as the violence and temper that leads him to the top in the ring, destroys his life outside it.","Rated":"N/A"}