{"imdbID":"tt0114814","Title":"The Usual Suspects","Year":"1995","Director":"Bryan Singer","Writer":"Christopher McQuarrie","Taglines":"Who is Keyser Soze? ","Certificate":"A | See all certifications »","Country":"USA, Germany","Language":"English, Hungarian, Spanish, French","Also_Known_As":"Die üblichen Verdächtigen ","Budget":"$6,000,000 (estimated)","Gross":"£2,503,343 (UK) (15 September 1995)","Production_Co":"PolyGram Filmed Entertainment, Spelling Films International, Blue Parrot ","":"Show detailed company contact information on IMDbPro »","Runtime":"106 min","Sound_Mix":"Dolby Digital","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Christopher McQuarrie's inspiration for the character of Keyser Soze was a real-life murderer by the name of John List, who murdered his family and then disappeared for 17 years. See more »","Goofs":"(at around 1h 11 mins) Blood squib visible in the money bag as Hockney is shot. See more »","Crazy_Credits":"The editor, John Ottman, edited the movie on film. He felt that all the editing done electronically at the time was horrible because all the good editors were still working on film (which is much more difficult). Because of this he thought about putting \"Edited on a piece of s*** Steenbeck\" at the end of the credits, but instead settled for the more subtle line \"Edited on film.\" Tim Robbins was directing 'Dead Man Walking' at the time and heard about John's idea, which sparked that film's credit ending of \"This film was edited on old machines.\" See more »","Cast":"Stephen Baldwin, Gabriel Byrne, Benicio Del Toro, Kevin Pollak, Kevin Spacey, Chazz Palminteri, Pete Postlethwaite, Suzy Amis, Giancarlo Esposito, Dan Hedaya, Paul Bartel, Carl Bressler, Phillipe Simon, Jack Shearer, Christine Estabrook","Plot":"A sole survivor tells of the twisty events leading up to a horrific gun battle on a boat, which begin when five criminals meet at a seemingly random police lineup. Following a truck hijack in New York, five conmen are arrested and brought together for questioning. As none of them are guilty, they plan a revenge operation against the police. The operation goes well, but then the influence of a legendary mastermind criminal called Keyser Söze is felt. It becomes clear that each one of them has wronged Söze at some point and must pay back now. The payback job leaves 27 men dead in a boat explosion, but the real question arises now: Who actually is Keyser Söze? Written by Soumitra","Genre":"Crime, Drama, Mystery","Keywords":"criminal, suspect, criminal mastermind, dirty cop, burying a body","imdbRating":"8.6","imdbVotes":"711,851","Awards":"Won 2 Oscars. Another 31 wins & 15 nominations.","Metascore":"77","Released":"15 September 1995 (USA) ","Location":"Los Angeles, California, USA ","Actors":"Kevin Spacey, Gabriel Byrne, Chazz Palminteri ","Running_time":"PT106M / 1h 46min","Description":"Directed by Bryan Singer.  With Kevin Spacey, Gabriel Byrne, Chazz Palminteri, Stephen Baldwin. A sole survivor tells of the twisty events leading up to a horrific gun battle on a boat, which begin when five criminals meet at a seemingly random police lineup.","Rated":"A"}