{"imdbID":"tt0171804","Title":"Boys Don't Cry","Year":"1999","Director":"Kimberly Peirce","Country":"USA","Language":"English","Budget":"$2,000,000 (estimated)","Gross":"$11,533,945 (USA) (19 May 2000)","Production_Co":"Fox Searchlight Pictures, The Independent Film Channel Productions, Killer Films ","Runtime":"118 min","Cast":"Hilary Swank, Chloë Sevigny, Peter Sarsgaard, Brendan Sexton III, Alicia Goranson, Alison Folland, Jeannetta Arnette, Rob Campbell, Matt McGrath, Cheyenne Rushing, Robert Prentiss, Josh Ridgway, Craig Erickson, Stephanie Sechrist, Jerry Haynes","Plot":"Female born, Teena Brandon adopts his male identity of Brandon Teena and attempts to find himself and love in Nebraska. Based on actual events. Brandon Teena is the popular new guy in a tiny Nebraska town. He hangs out with the guys, drinking, cussing, and bumper surfing, and he charms the young women, who've never met a more sensitive and considerate young man. Life is good for Brandon, now that he's one of the guys and dating hometown beauty Lana; however, he's forgotten to mention one important detail. It's not that he's wanted in another town for GTA and other assorted crimes, but that Brandon Teena was actually born a woman named Teena Brandon. When his best friends make this discovery, Brandon's life is ripped apart. Written by Zhe","Genre":"Biography, Drama, Romance","Keywords":"female dressed as male, transgender, nebraska, drinking, love","imdbRating":"7.6","imdbVotes":"75,684","Awards":"Won 1 Oscar. Another 47 wins & 37 nominations.","Metascore":"86","Released":"31 March 2000 (USA) ","Location":"Austin, Texas, USA ","Actors":"Hilary Swank, Chloë Sevigny, Peter Sarsgaard ","Writer":"Kimberly Peirce, Andy Bienen","Running_time":"PT118M / 1h 58min","Description":"Directed by Kimberly Peirce.  With Hilary Swank, Chloë Sevigny, Peter Sarsgaard, Brendan Sexton III. Female born, Teena Brandon adopts his male identity of Brandon Teena and attempts to find himself and love in Nebraska.","Rated":"R"}