{"imdbID":"tt0104348","Title":"Glengarry Glen Ross","Year":"1992","Director":"James Foley","Taglines":"A Story For Everyone Who Works For A Living. ","Country":"USA","Language":"English","Also_Known_As":"El precio de la ambición ","Budget":"$12,500,000 (estimated)","Gross":"$10,725,228 (USA)","Production_Co":"GGR, New Line Cinema, Zupnik Cinema Group II ","Runtime":"100 min","Sound_Mix":"Dolby","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Alan Arkin turned down the film twice because he didn't like the character he was being offered; he thought Aaronow was an inherently unlikable and stupid character. However, upon reconsideration, Arkin created a backstory for Aaronow - he hadn't been a sales man very long, he was a teacher by trade, but the school in which he worked had got shut down, and he needed a job to support his family. Arkin says that he played Aaronow as an innocent rather that the usual stage depiction of him as a weak willed bumbler. See more »","Goofs":"When Levene enters and exits the Spannel house, the rain is pouring immediately outside the front door. But after he exits the camera pulls back to reveal he is on a large roofed porch. So the rain would actually be falling some distance from the door. See more »","Cast":"Al Pacino, Jack Lemmon, Alec Baldwin, Alan Arkin, Ed Harris, Kevin Spacey, Jonathan Pryce, Bruce Altman, Jude Ciccolella, Paul Butler, Lori Tan Chinn, Neal Jones, Barry Rohrssen, Leigh French, George Cheung","Plot":"An examination of the machinations behind the scenes at a real estate office. Times are tough in a Chicago real-estate office; the salesmen (Shelley Levene, Ricky Roma, Dave Moss, and George Aaronow) are given a strong incentive by Blake to succeed in a sales contest. The prizes? First prize is a Cadillac El Dorado, second prize is a set of steak knives, third prize is the sack! There is no room for losers in this dramatically masculine world; only \"closers\" will get the good sales leads. There is a lot of pressure to succeed, so a robbery is committed which has unforeseen consequences for all the characters. Written by Patrick Dominick <ptd@ccadfa.cc.adfa.oz.au>","Genre":"Drama","Keywords":"sales, office, real estate, pressure, robbery","imdbRating":"7.8","imdbVotes":"73,539","Awards":"Nominated for 1 Oscar. Another 5 wins & 7 nominations.","Metascore":"80","Released":"2 October 1992 (USA) ","Location":"Restaurant, 1520 Sheepshead Bay Road, Brooklyn, New York, USA ","Actors":"Al Pacino, Jack Lemmon, Alec Baldwin ","Writer":"David Mamet (play), David Mamet (screenplay)","Running_time":"PT100M / 1h 40min","Description":"Directed by James Foley.  With Al Pacino, Jack Lemmon, Alec Baldwin, Alan Arkin. An examination of the machinations behind the scenes at a real estate office.","Rated":"R"}