{"imdbID":"tt0172495","Title":"Gladiator","Year":"2000","Director":"Ridley Scott","Taglines":"The Gladiator Who Defied An Empire ","Country":"USA, UK","Language":"English","Also_Known_As":"Vijeta ","Budget":"$103,000,000 (estimated)","Opening_Weekend":"$34,819,017 (USA) (5 May 2000)","Gross":"ESP 3,252,726,610 (Spain) (29 June 2001)","Production_Co":"DreamWorks SKG, Universal Pictures, Scott Free Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"155 min | 171 min (Extended Edition)","Sound_Mix":"SDDS | DTS | Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The real life Commodus was born to a mother who was rumored to have either slept with a Gladiator or had bathed in the blood of one. Many took the myth as legend, believing that such led to the resulting \"Gladiator Emperor.\" See more »","Goofs":"Near the end of the Battle of Carthage, Juba runs towards a \"Roman\" fighter. As he runs, the metal spike on the top of his helmet waves back and forth, revealing that it's rubber. See more »","Crazy_Credits":"Both the Dreamworks & Universal logos are altered to appear gold in color so they match the opening theme of Maximus walking through a wheatfield. See more »","Cast":"Russell Crowe, Joaquin Phoenix, Connie Nielsen, Oliver Reed, Richard Harris, Derek Jacobi, Djimon Hounsou, David Schofield, John Shrapnel, Tomas Arana, Ralf Moeller, Spencer Treat Clark, David Hemmings, Tommy Flanagan, Sven-Ole Thorsen","Plot":"When a Roman general is betrayed and his family murdered by an emperor's corrupt son, he comes to Rome as a gladiator to seek revenge. Maximus is a powerful Roman general, loved by the people and the aging Emperor, Marcus Aurelius. Before his death, the Emperor chooses Maximus to be his heir over his own son, Commodus, and a power struggle leaves Maximus and his family condemned to death. The powerful general is unable to save his family, and his loss of will allows him to get captured and put into the Gladiator games until he dies. The only desire that fuels him now is the chance to rise to the top so that he will be able to look into the eyes of the man who will feel his revenge. Written by Chris \"Morphy\" Terry","Genre":"Action, Drama","Keywords":"roman empire, gladiator, blood, slavery, combat","imdbRating":"8.5","imdbVotes":"942,774","Awards":"Won 5 Oscars. Another 53 wins & 101 nominations.","Metascore":"64","Released":"1 September 2000 (India) ","Location":"Morocco ","Actors":"Russell Crowe, Joaquin Phoenix, Connie Nielsen ","Writer":"David Franzoni (story), David Franzoni (screenplay) | 2 more credits »","Running_time":"PT155M / 2h 35min","Description":"Directed by Ridley Scott.  With Russell Crowe, Joaquin Phoenix, Connie Nielsen, Oliver Reed. When a Roman general is betrayed and his family murdered by an emperor's corrupt son, he comes to Rome as a gladiator to seek revenge.","Rated":"R"}