{"imdbID":"tt0109830","Title":"Forrest Gump","Year":"1994","Director":"Robert Zemeckis","Taglines":"The world will never be the same once you've seen it through the eyes of Forrest Gump. ","Country":"USA","Language":"English","Also_Known_As":"Форрест Гамп ","Budget":"$55,000,000 (estimated)","Opening_Weekend":"£11,302,303 (UK) (11 November 1994)","Gross":"£15,803,823 (UK) (14 April 1995)","Production_Co":"Paramount Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"142 min","Sound_Mix":"DTS | Dolby Digital","Color":"Black and White | Color","Aspect_Ratio":"2.36 : 1","Trivia":"The first person Forrest Gump speaks to in the film has similarities with Civil Rights icon Rosa Parks. She is a working-class African American woman riding a public bus in Alabama. She even mentions to Forrest that her \"feet hurt\", a statement widely believed to have been uttered by Ms. Parks when she refused give up her seat for a white passenger on a bus in Montgomery in December 1955. Her act of defiance and subsequent arrest sparked the Montgomery Bus Boycott, a movement that set in motion the fight for equality in the South led by Dr. Martin Luther King, Jr. Years later, Rosa Parks denied telling the bus driver she was tired or that her feet hurt declaring, \"the only tired I was, was tired of giving in\". See more »","Goofs":"When the number 4 bus arrives for the first woman that Forrest talked to on the bench, the bus takes off right when she exits the frame, clearly not giving her enough time to board it. Since only a small portion of the end of the bus is shown, the bus would have had to wait a couple more seconds for the woman to walk to the front of the bus and then board it. See more »","Cast":"Tom Hanks, Rebecca Williams, Sally Field, Michael Conner Humphreys, Harold G. Herthum, George Kelly, Bob Penny, John Randall, Sam Anderson, Margo Moorer, Ione M. Telech, Christine Seabrook, John Worsham, Peter Dobson, Siobhan Fallon Hogan","Plot":"Forrest Gump, while not intelligent, has accidentally been present at many historic moments, but his true love, Jenny Curran, eludes him. Forrest Gump is a simple man with a low I.Q. but good intentions. He is running through childhood with his best and only friend Jenny. His 'mama' teaches him the ways of life and leaves him to choose his destiny. Forrest joins the army for service in Vietnam, finding new friends called Dan and Bubba, he wins medals, creates a famous shrimp fishing fleet, inspires people to jog, starts a ping-pong craze, creates the smiley, writes bumper stickers and songs, donates to people and meets the president several times. However, this is all irrelevant to Forrest who can only think of his childhood sweetheart Jenny Curran, who has messed up her life. Although in the end all he wants to prove is that anyone can love anyone. Written by aliw135","Genre":"Drama, Romance","Keywords":"vietnam war, amputee, war hero, love, vietnam","imdbRating":"8.8","imdbVotes":"1,191,680","Awards":"Won 6 Oscars. Another 37 wins & 51 nominations.","Metascore":"82","Released":"6 July 1994 (USA) ","Location":"Monument Valley, Arizona, USA ","Actors":"Tom Hanks, Robin Wright, Gary Sinise ","Writer":"Winston Groom (novel), Eric Roth (screenplay)","Running_time":"PT142M / 2h 22min","Description":"Directed by Robert Zemeckis.  With Tom Hanks, Robin Wright, Gary Sinise, Sally Field. Forrest Gump, while not intelligent, has accidentally been present at many historic moments, but his true love, Jenny Curran, eludes him.","Rated":"PG-13"}