{"imdbID":"tt0109306","Title":"Blue Sky","Year":"1994","Director":"Tony Richardson","Country":"USA","Language":"English, French","Budget":"$16,000,000 (estimated)","Gross":"$3,359,465 (USA)","Production_Co":"Heathrow Productions, Orion Pictures ","Runtime":"101 min","Cast":"Jessica Lange, Tommy Lee Jones, Powers Boothe, Carrie Snodgress, Amy Locane, Chris O'Donnell, Mitchell Ryan, Dale Dye, Timothy Scott, Annie Ross, Anna Klemp, Anthony Rene Jones, Jay H. Seidl, David Bradford, Matt Battaglia","Plot":"Jessica Lange stars in a period drama about a family moving to a military base, and she quickly becomes part of a cover-up involving nuclear bomb tests. It's the early 1960s. Nuclear engineer Hank Marshall is a major in the US Army, he who works on top secret nuclear testing projects. Trouble follows him from posting to posting largely because of his mentally unstable wife, Carly Marshall, who is bipolar. During her manic phases, her already overt sexuality, which she models after such sex symbols as Marilyn Monroe and Brigitte Bardot, is ratcheted up a notch, that partying behavior which is mixed with less frequent phases of physically destructive behavior. Regardless, Hank and Carly love each other, Hank who would admit to himself that he enjoys the fact that other men find Carly attractive, which is partly why he allows her to act the way she does in public. They, in turn, mutually love their now two teenaged daughters, Alex and Becky. Reassigned from their two year posting in Hawaii largely due to the ruckus Carly has caused there, they are next sent to Alabama, the base under the command of Vince Johnson, his wife, Vera Johnson, ... Written by Huggo","Genre":"Drama, Romance","Keywords":"military, army, military base, daughter, alabama","imdbRating":"6.4","imdbVotes":"5,053","Awards":"Won 1 Oscar. Another 3 wins & 5 nominations.","Metascore":"","Released":"16 September 1994 (USA) ","Location":"Alabama, USA ","Actors":"Jessica Lange, Tommy Lee Jones, Powers Boothe ","Writer":"Rama Laurie Stagner (story), Rama Laurie Stagner (screenplay) | 2 more credits »","Running_time":"PT101M / 1h 41min","Description":"Directed by Tony Richardson.  With Jessica Lange, Tommy Lee Jones, Powers Boothe, Carrie Snodgress. Jessica Lange stars in a period drama about a family moving to a military base, and she quickly becomes part of a cover-up involving nuclear bomb tests.","Rated":"PG-13"}