{"imdbID":"tt0113247","Title":"La Haine","Year":"1995","Director":"Mathieu Kassovitz","Writer":"Mathieu Kassovitz","Taglines":"So far, so good ","Certificate":"Not Rated | See all certifications »","Country":"France","Language":"French","Also_Known_As":"La Haine ","Budget":"€2,590,000 (estimated)","Gross":"$309,811 (USA)","Production_Co":"Canal+, Cofinergie 6, Egg Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"98 min","Sound_Mix":"Dolby SR","Color":"Black and White","Aspect_Ratio":"1.85 : 1","Trivia":"In some English-language versions, such as the 2007 Criterion Collection DVD, the name Astérix was changed to Snoopy in the subtitles, as the film traveled further than the Astérix books did. However, the character is still credited under the name of Astérix in Criterion's booklet and on their website. See more »","Goofs":"The trip across Paris is strange : the three characters should arrive at the Saint-Lazare station(north-west of Paris), coming from ChanteloupLesVignes. Yet, when they arrive, they are in front of the Montparnasse station(south of Paris), on the Rennes street. Then, they go to Asterix place, on the boulevard Pierre Ier of Serbia, close to Iena Place (west of Paris), and when they try to catch the last train, this time they are at the Saint-Lazare station, the right one to go back. But then, when they are on the roof, they see the Eiffel Tower and the Trocadero from the south-east, being probably close to Montparnasse station. Then, they come across a sculpture, L'Ecoute, in the Halles Garden(center of Paris), before going back. Hence, their trip goes : south, west, north-west, south and center of Paris. See more »","Cast":"Vincent Cassel, Hubert Koundé, Saïd Taghmaoui, Abdel Ahmed Ghili, Solo, Joseph Momo, Héloïse Rauth, Rywka Wajsbrot, Olga Abrego, Laurent Labasse, Choukri Gabteni, Nabil Ben Mhamed, Benoît Magimel, Médard Niang, Arash Mansour","Plot":"24 hours in the lives of three young men in the French suburbs the day after a violent riot. The film follows three young men and their time spent in the French suburban \"ghetto,\" over a span of twenty-four hours. Vinz, a Jew, Saïd, an Arab, and Hubert, a black boxer, have grown up in these French suburbs where high levels of diversity coupled with the racist and oppressive police force have raised tensions to a critical breaking point. During the riots that took place a night before, a police officer lost his handgun in the ensuing madness, only to leave it for Vinz to find. Now, with a newfound means to gain the respect he deserves, Vinz vows to kill a cop if his friend Abdel dies in the hospital, due the beating he received while in police custody. Written by b4arr2y","Genre":"Crime, Drama","Keywords":"gun, ghetto, riot, hospital, youth","imdbRating":"8.1","imdbVotes":"98,960","Awards":"8 wins & 13 nominations.","Metascore":"","Released":"23 February 1996 (USA) ","Location":"Chanteloup-les-Vignes, Yvelines, France ","Actors":"Vincent Cassel, Hubert Koundé, Saïd Taghmaoui ","Running_time":"PT98M / 1h 38min","Description":"Directed by Mathieu Kassovitz.  With Vincent Cassel, Hubert Koundé, Saïd Taghmaoui, Abdel Ahmed Ghili. 24 hours in the lives of three young men in the French suburbs the day after a violent riot.","Rated":"NOT RATED"}