{"imdbID":"tt0118799","Title":"La vita è bella","Year":"1997","Director":"Roberto Benigni","Taglines":"An unforgettable fable that proves love, family and imagination conquer all.","Country":"Italy","Language":"Italian, German, English","Also_Known_As":"La vida es bella ","Budget":"$20,000,000 (estimated)","Opening_Weekend":"$118,920 (USA) (23 October 1998)","Gross":"$57,598,247 (USA) (1 October 1999)","Production_Co":"Melampo Cinematografica, Cecchi Gori Group Tiger Cinematografica ","":"Show detailed company contact information on IMDbPro »","Runtime":"116 min | 122 min (first release)","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Roberto Benigni's Oscar for best actor marked only the second time that an actor had directed himself in an Academy Award winning performance. The other was Laurence Olivier for Hamlet (1948). See more »","Goofs":"When Giosuè comes out of hiding, he walks towards (and stares at) a visible spot on the ground. He stops right on top of the spot which indicates that it was his \"mark\" for the shot. See more »","Cast":"Roberto Benigni, Nicoletta Braschi, Giorgio Cantarini, Giustino Durano, Sergio Bini Bustric, Marisa Paredes, Horst Buchholz, Giuliana Lojodice, Amerigo Fontani, Pietro De Silva, Francesco Guzzo, Raffaella Lebboroni, Claudio Alfonsi, Gil Baroni, Massimo Bianchi","Plot":"When an open-minded Jewish librarian and his son become victims of the Holocaust, he uses a perfect mixture of will, humor and imagination to protect his son from the dangers around their camp. In 1930s Italy, a carefree Jewish book keeper named Guido starts a fairy tale life by courting and marrying a lovely woman from a nearby city. Guido and his wife have a son and live happily together until the occupation of Italy by German forces. In an attempt to hold his family together and help his son survive the horrors of a Jewish Concentration Camp, Guido imagines that the Holocaust is a game and that the grand prize for winning is a tank. Written by Anthony Hughes <husnock31@hotmail.com>","Genre":"Comedy, Drama, Romance","Keywords":"jewish, tank, italy, holocaust, 1930s","imdbRating":"8.6","imdbVotes":"399,408","Awards":"Won 3 Oscars. Another 61 wins & 43 nominations.","Metascore":"59","Released":"20 December 1997 (Italy) ","Location":"Ronciglione, Viterbo, Lazio, Italy ","Actors":"Roberto Benigni, Nicoletta Braschi, Giorgio Cantarini ","Writer":"Vincenzo Cerami (story), Roberto Benigni (story)","Running_time":"PT116M / 1h 56min","Description":"Directed by Roberto Benigni.  With Roberto Benigni, Nicoletta Braschi, Giorgio Cantarini, Giustino Durano. When an open-minded Jewish librarian and his son become victims of the Holocaust, he uses a perfect mixture of will, humor and imagination to protect his son from the dangers around their camp.","Rated":"PG-13"}