{"imdbID":"tt0144084","Title":"American Psycho","Year":"2000","Director":"Mary Harron","Taglines":"No introductions necessary. ","Country":"USA","Language":"English, Spanish, Cantonese","Also_Known_As":"Psicópata americano ","Budget":"$7,000,000 (estimated)","Opening_Weekend":"$4,961,015 (USA) (14 April 2000)","Gross":"ESP 466,785,361 (Spain) (29 June 2001)","Production_Co":"Am Psycho Productions, Edward R. Pressman Film, Lions Gate Films ","Runtime":"102 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"In a scene in the movie, Christian Bale's character Patrick Bateman kills a prostitute by throwing a chainsaw down at her while she runs down a spiraling staircase. Christian Bale later had a similar scene in The Dark Knight when he as the Batman, precisely times a jump down a spiraling ramp onto a van driven by the Scarecrow. See more »","Goofs":"The porno movie that goes on during Patrick's telephone conversation with his fiancé is taken from Red Vibe Diaries: Object of Desire, produced in 1997. See more »","Cast":"Christian Bale, Justin Theroux, Josh Lucas, Bill Sage, Chloë Sevigny, Reese Witherspoon, Samantha Mathis, Matt Ross, Jared Leto, Willem Dafoe, Cara Seymour, Guinevere Turner, Stephen Bogaert, Monika Meier, Reg E. Cathey","Plot":"A wealthy New York investment banking executive hides his alternate psychopathic ego from his co-workers and friends as he delves deeper into his violent, hedonistic fantasies. Patrick Bateman is handsome, well educated and intelligent. He is twenty-seven and living his own American dream. He works by day on Wall Street, earning a fortune to complement the one he was born with. At night he descends into madness, as he experiments with fear and violence. Written by Lion Films","Genre":"Drama","Keywords":"narcissism, materialism, business card, male rear nudity, 1980s","imdbRating":"7.6","imdbVotes":"344,294","Awards":"5 wins & 8 nominations.","Metascore":"64","Released":"14 April 2000 (USA) ","Location":"Boston Club - 4 Front Street East, Toronto, Ontario, Canada ","Actors":"Christian Bale, Justin Theroux, Josh Lucas ","Writer":"Bret Easton Ellis (novel), Mary Harron (screenplay) | 1 more credit »","Running_time":"PT102M / 1h 42min","Description":"Directed by Mary Harron.  With Christian Bale, Justin Theroux, Josh Lucas, Bill Sage. A wealthy New York investment banking executive hides his alternate psychopathic ego from his co-workers and friends as he delves deeper into his violent, hedonistic fantasies.","Rated":"R"}