{"imdbID":"tt0109348","Title":"Bullets Over Broadway","Year":"1994","Director":"Woody Allen","Country":"USA","Language":"English","Budget":"$20,000,000 (estimated)","Gross":"$13,383,737 (USA)","Production_Co":"Miramax, Sweetland Films, Magnolia Productions ","Runtime":"98 min","Cast":"John Cusack, Dianne Wiest, Jennifer Tilly, Chazz Palminteri, Mary-Louise Parker, Jack Warden, Joe Viterelli, Rob Reiner, Tracey Ullman, Jim Broadbent, Harvey Fierstein, Stacey Nelkin, Malgorzata Zajaczkowska, Charles Cragin, Nina von Arx","Plot":"In New York in 1928, a struggling playwright is forced to cast a mobster's talentless girlfriend in his latest drama in order to get it produced. Set in 1920's New York City, this movie tells the story of idealistic young playwright David Shayne. Producer Julian Marx finally finds funding for the project from gangster Nick Valenti. The catch is that Nick's girl friend Olive Neal gets the part of a psychiatrist, and Olive is a bimbo who could never pass for a psychiatrist as well as being a dreadful actress. Agreeing to this first compromise is the first step to Broadway's complete seduction of David, who neglects longtime girl friend Ellen. Meanwhile David puts up with Warner Purcell, the leading man who is a compulsive eater, Helen Sinclair, the grand dame who wants her part jazzed up, and Cheech, Olive's interfering hitman / bodyguard. Eventually, the playwright must decide whether art or life is more important. Written by Reid Gagle","Genre":"Comedy, Crime","Keywords":"actress, playwright, play, bodyguard, new york city","imdbRating":"7.5","imdbVotes":"28,706","Awards":"Won 1 Oscar. Another 18 wins & 15 nominations.","Metascore":"","Released":"24 February 1995 (USA) ","Location":"110th Street, Manhattan, New York City, New York, USA ","Actors":"John Cusack, Dianne Wiest, Jennifer Tilly ","Writer":"Woody Allen, Douglas McGrath","Running_time":"PT98M / 1h 38min","Description":"Directed by Woody Allen.  With John Cusack, Dianne Wiest, Jennifer Tilly, Chazz Palminteri. In New York in 1928, a struggling playwright is forced to cast a mobster's talentless girlfriend in his latest drama in order to get it produced.","Rated":"R"}