{"imdbID":"tt0180093","Title":"Requiem for a Dream","Year":"2000","Director":"Darren Aronofsky","Taglines":"From the director of [Pi]","Country":"USA","Language":"English","Also_Known_As":"Réquiem por un sueño ","Budget":"$4,500,000 (estimated)","Opening_Weekend":"$64,770 (USA) (6 October 2000)","Gross":"ESP 15,606,075 (Spain) (29 June 2001)","Production_Co":"Artisan Entertainment, Thousand Words, Sibling Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"102 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.37 : 1","Trivia":"When Sarah Goldfarb is on the subway and she is telling strangers that she is going to be on TV, a man tells her \"You are whacked\". That man was Darren Aronofsky's father. See more »","Goofs":"Whenever someone takes drugs and their pupils \"dilate\" you can see that it's a normal eye being distorted by a computer because the arc of reflected light also is distorted. See more »","Crazy_Credits":"The closing credits feature pictures of Coney Island Amusement Park, and during the credits, the sounds of the shore can be heard. See more »","Cast":"Ellen Burstyn, Jared Leto, Jennifer Connelly, Marlon Wayans, Christopher McDonald, Louise Lasser, Marcia Jean Kurtz, Janet Sarno, Suzanne Shepherd, Joanne Gordon, Charlotte Aronofsky, Mark Margolis, Michael Kaycheck, Jack O'Connell, Chas Mastin","Plot":"The drug-induced utopias of four Coney Island people are shattered when their addictions become stronger. Drugs. They consume mind, body and soul. Once you're hooked, you're hooked. Four lives. Four addicts. Four failures. Despite their aspirations of greatness, they succumb to their addictions. Watching the addicts spiral out of control, we bear witness to the dirtiest, ugliest portions of the underworld addicts reside in. It is shocking and eye-opening but demands to be seen by both addicts and non-addicts alike. Written by Jeff Mellinger <jmell@uclink4.berkeley.edu>","Genre":"Drama","Keywords":"drug addiction, addiction, heroin, diet pill, fast motion scene","imdbRating":"8.4","imdbVotes":"551,822","Awards":"Nominated for 1 Oscar. Another 32 wins & 61 nominations.","Metascore":"68","Released":"15 December 2000 (USA) ","Location":"Brooklyn, New York City, New York, USA ","Actors":"Ellen Burstyn, Jared Leto, Jennifer Connelly ","Writer":"Hubert Selby Jr. (based on the book by), Hubert Selby Jr. (screenplay) | 1 more credit »","Running_time":"PT102M / 1h 42min","Description":"Directed by Darren Aronofsky.  With Ellen Burstyn, Jared Leto, Jennifer Connelly, Marlon Wayans. The drug-induced utopias of four Coney Island people are shattered when their addictions become stronger.","Rated":"R"}