{"imdbID":"tt0112579","Title":"The Bridges of Madison County","Year":"1995","Director":"Clint Eastwood","Country":"USA","Language":"English","Budget":"$35,000,000 (estimated)","Gross":"£500,343 (UK) (15 September 1995)","Production_Co":"Warner Bros., Amblin Entertainment, Malpaso Productions ","Runtime":"135 min","Cast":"Clint Eastwood, Meryl Streep, Annie Corley, Victor Slezak, Jim Haynie, Sarah Kathryn Schmitt, Christopher Kroon, Phyllis Lyons, Debra Monk, Richard Lage, Michelle Benes, Alison Wiegert, Brandon Bobst, Pearl Faessler, R.E. 'Stick' Faessler","Plot":"Photographer Robert Kincaid wanders into the life of housewife Francesca Johnson, for four days in the 1960s. The path of Francesca Johnson's future seems destined when an unexpected fork in the road causes her to question everything she had come to expect from life. While her husband and children are away at the Illinois state fair in the summer of 1965, Robert Kincaid happens turn into the Johnson farm and asks Francesca for directions to Roseman Bridge. Francesca later learns that he was in Iowa on assignment from National Geographic magazine. She is reluctant seeing that he's a complete stranger and then she agrees to show him to the bridges and gradually she talks about her life from being a war-bride from Italy which sets the pace for this bittersweet and all-too-brief romance of her life. Through the pain of separation from her secret love and the stark isolation she feels as the details of her life consume her, she writes her thoughts of the four-day love affair which took up three journals. The journals are found by her children after the lawyer was going over Francesca's will and ... Written by Mark Fleetwood <mfleetwo@mail.coin.missouri.edu>","Genre":"Drama, Romance","Keywords":"love, bridge, photographer, housewife, 1960s","imdbRating":"7.5","imdbVotes":"53,162","Awards":"Nominated for 1 Oscar. Another 6 wins & 14 nominations.","Metascore":"66","Released":"2 June 1995 (USA) ","Location":"W Green St & John Wayne Dr, Winterset, Iowa, USA ","Actors":"Clint Eastwood, Meryl Streep, Annie Corley ","Writer":"Richard LaGravenese (screenplay), Robert James Waller (novel)","Running_time":"PT135M / 2h 15min","Description":"Directed by Clint Eastwood.  With Clint Eastwood, Meryl Streep, Annie Corley, Victor Slezak. Photographer Robert Kincaid wanders into the life of housewife Francesca Johnson, for four days in the 1960s.","Rated":"PG-13"}