{"imdbID":"tt0116282","Title":"Fargo","Year":"1996","Taglines":"A lot can happen in the middle of nowhere. ","Country":"USA, UK","Language":"English","Also_Known_As":"Фарго ","Budget":"$7,000,000 (estimated)","Opening_Weekend":"$137,301 (USA) (19 July 1996)","Gross":"£1,204,540 (UK) (19 July 1996)","Production_Co":"PolyGram Filmed Entertainment, Working Title Films ","":"Show detailed company contact information on IMDbPro »","Runtime":"98 min","Sound_Mix":"Dolby SR","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Jerry Lundegaard's last name comes from Bob Lundegaard, movie critic for the Minneapolis Star and Tribune from 1973-1986. See more »","Goofs":"Marge's scarf swaps sides on her first visit to Jerry's office. See more »","Crazy_Credits":"A symbol similar to the Artist Formerly Known as Prince is in the credits as \"victim in field\", but it is not him, it is J. Todd Anderson, the storyboard artist. See more »","Cast":"William H. Macy, Steve Buscemi, Peter Stormare, Kristin Rudrüd, Harve Presnell, Tony Denman, Gary Houston, Sally Wingert, Kurt Schweickhardt, Larissa Kokernot, Melissa Peterman, Steve Reevis, Warren Keith, Steve Edelman, Sharon Anderson","Plot":"Jerry Lundegaard's inept crime falls apart due to his and his henchmen's bungling and the persistent police work of the quite pregnant Marge Gunderson. Jerry works in his father-in-law's car dealership and has gotten himself in financial problems. He tries various schemes to come up with money needed for a reason that is never really explained. It has to be assumed that his huge embezzlement of money from the dealership is about to be discovered by father-in-law. When all else falls through, plans he set in motion earlier for two men to kidnap his wife for ransom to be paid by her wealthy father (who doesn't seem to have the time of day for son-in-law). From the moment of the kidnapping, things go wrong and what was supposed to be a non-violent affair turns bloody with more blood added by the minute. Jerry is upset at the bloodshed, which turns loose a pregnant sheriff from Brainerd, MN who is tenacious in attempting to solve the three murders in her jurisdiction. Written by Anonymous","Genre":"Crime, Drama, Thriller","Keywords":"ransom, satire, unintended consequences, tall tale, small town stereotype","imdbRating":"8.2","imdbVotes":"435,849","Awards":"Won 2 Oscars. Another 69 wins & 52 nominations.","Metascore":"85","Released":"5 April 1996 (USA) ","Location":"Chanhassen Dinner Theatre, Chanhassen, Minnesota, USA ","Actors":"William H. Macy, Frances McDormand, Steve Buscemi ","Director":"Joel Coen, Ethan Coen (uncredited)","Writer":"Ethan Coen, Joel Coen","Running_time":"PT98M / 1h 38min","Description":"Directed by Joel Coen, Ethan Coen.  With William H. Macy, Frances McDormand, Steve Buscemi, Peter Stormare. Jerry Lundegaard's inept crime falls apart due to his and his henchmen's bungling and the persistent police work of the quite pregnant Marge Gunderson.","Rated":"R"}