{"imdbID":"tt0181875","Title":"Almost Famous","Year":"2000","Director":"Cameron Crowe","Writer":"Cameron Crowe","Taglines":"Experience it. Enjoy it. Just don't fall for it.","Country":"USA","Language":"English, French","Also_Known_As":"Something Real ","Budget":"$60,000,000 (estimated)","Opening_Weekend":"$2,314,646 (USA) (15 September 2000)","Gross":"ESP 129,054,292 (Spain) (29 June 2001)","Production_Co":"Columbia Pictures, DreamWorks SKG, Vinyl Films ","Runtime":"122 min | 162 min (director's cut) | 152 min (DVD extended cut)","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Marti Frederiksen provided the lead singing vocals for Jason Lee as Jeff Bebe. When Jeff Bebe learns that Stillwater will make the cover of Rolling Stone magazine, Jason Lee's actual voice sings the song \"Cover of the Rolling Stone\" See more »","Goofs":"When William meets Lester Bangs for the first time and walks with him, the bag over his shoulder changes position often between angles. See more »","Crazy_Credits":"In the music credits at the end of the film, all songs sung by Stillwater are credited to the characters who would have written them. See more »","Cast":"Billy Crudup, Frances McDormand, Kate Hudson, Jason Lee, Patrick Fugit, Zooey Deschanel, Michael Angarano, Anna Paquin, Fairuza Balk, Noah Taylor, John Fedevich, Mark Kozelek, Philip Seymour Hoffman, Liz Stauber, Jimmy Fallon","Plot":"A high-school boy is given the chance to write a story for Rolling Stone Magazine about an up-and-coming rock band as he accompanies it on their concert tour. William Miller is a 15-year-old kid hired by Rolling Stone magazine to tour with and write about Stillwater, an up and coming rock band. This wonderfully witty coming-of-age film follows William as he falls face first to confront life, love, and lingo. Written by Filmtwob <webmaster@filmfreak.co.za>","Genre":"Adventure, Comedy, Drama","Keywords":"smoking marijuana, magazine, band, tour, rolling stone magazine","imdbRating":"7.9","imdbVotes":"201,125","Awards":"Won 1 Oscar. Another 51 wins & 102 nominations.","Metascore":"90","Released":"22 September 2000 (USA) ","Location":"Roosevelt Hotel, Hollywood, California, USA ","Actors":"Billy Crudup, Patrick Fugit, Kate Hudson ","Running_time":"PT122M / 2h 2min","Description":"Directed by Cameron Crowe.  With Billy Crudup, Patrick Fugit, Kate Hudson, Frances McDormand. A high-school boy is given the chance to write a story for Rolling Stone Magazine about an up-and-coming rock band as he accompanies it on their concert tour.","Rated":"R"}