{"imdbID":"tt0101921","Title":"Fried Green Tomatoes","Year":"1991","Director":"Jon Avnet","Taglines":"The secret of life? The secret's in the sauce.","Certificate":"PG-13 | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Tomates verdes fritos ","Budget":"$11,000,000 (estimated)","Gross":"$80,100,000 (USA)","Production_Co":"Universal Pictures, Act III Communications, Avnet/Kerner Productions ","Runtime":"130 min | 137 min (extended)","Sound_Mix":"Dolby SR","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Carol Sobieski wrote the first draft of the screenplay, which the director and producers thought were wonderful - but it wasn't the movie they wanted to do. Next, Fannie Flagg was brought on to do another draft and she finished seventy pages before quitting. With no money left to hire another writer, director Jon Avnet took it upon himself to write the screenplay and spent the next three years doing so. He did, however, stay in close contact with Flagg to make sure he stayed true to her book. See more »","Goofs":"Beer disappears from Ruth's hand between shots during baseball game See more »","Cast":"Kathy Bates, Mary Stuart Masterson, Mary-Louise Parker, Jessica Tandy, Cicely Tyson, Chris O'Donnell, Stan Shaw, Gailard Sartain, Timothy Scott, Gary Basaraba, Lois Smith, Jo Harvey Allen, Macon McCalman, Richard Riehle, Raynor Scheine","Plot":"A housewife who is unhappy with her life befriends an old lady in a nursing home and is enthralled by the tales she tells of people she used to know. Evelyn Couch is having trouble in her marriage, and no one seems to take her seriously. While in a nursing home visiting relatives, she meets Ninny Threadgoode, an outgoing old woman, who tells her the story of Idgie Threadgoode, a young woman in 1920's Alabama. Through Idgie's inspiring life, Evelyn learns to be more assertive and builds a lasting friendship of her own with Ninny. Written by Kevin <Kibble@vm.temple.edu>","Genre":"Drama","Keywords":"nursing home, friendship, alabama, romantic friendship, female protagonist","imdbRating":"7.6","imdbVotes":"50,182","Awards":"Nominated for 2 Oscars. Another 6 wins & 8 nominations.","Metascore":"","Released":"24 January 1992 (USA) ","Location":"Agnes Scott College - 141 E. College Avenue, Decatur, Georgia, USA ","Actors":"Kathy Bates, Jessica Tandy, Mary Stuart Masterson ","Writer":"Fannie Flagg (novel), Fannie Flagg (screenplay) | 1 more credit »","Running_time":"PT130M / 2h 10min","Description":"Directed by Jon Avnet.  With Kathy Bates, Jessica Tandy, Mary Stuart Masterson, Mary-Louise Parker. A housewife who is unhappy with her life befriends an old lady in a nursing home and is enthralled by the tales she tells of people she used to know.","Rated":"PG-13"}