{"imdbID":"tt0130827","Title":"Run Lola Run","Year":"1998","Director":"Tom Tykwer","Writer":"Tom Tykwer (screenplay)","Taglines":"The Pressure is Rising, The Adrenaline is Rushing, The Clock is Ticking ","Country":"Germany","Language":"German, English, Japanese","Also_Known_As":"Lola Runs ","Budget":"DEM 3,500,000 (estimated)","Opening_Weekend":"$92,488 (USA) (18 June 1999)","Gross":"$7,267,324 (USA) (21 January 2000)","Production_Co":"X-Filme Creative Pool, Westdeutscher Rundfunk (WDR), Arte ","Runtime":"81 min","Sound_Mix":"Dolby Digital","Color":"Black and White | Color","Aspect_Ratio":"1.85 : 1","Trivia":"There are many spirals in the film (stair cases, bar behind phone booth etc). This is because director Tom Tykwer was a fan of 'Alfred Hitchcock''s Vertigo (1958). See more »","Goofs":"The reflection of the crew and tripod can be seen when Lola's father enters the car. See more »","Crazy_Credits":"\"Special thanks to those who ran with us\". See more »","Cast":"Franka Potente, Moritz Bleibtreu, Herbert Knaup, Nina Petri, Armin Rohde, Joachim Król, Ludger Pistor, Suzanne von Borsody, Sebastian Schipper, Julia Lindig, Lars Rudolph, Heino Ferch","Plot":"After a botched money delivery, Lola has 20 minutes to come up with 100,000 Deutschmarks. Lola receives a phone call from her boyfriend Manni. He lost 100,000 DM in a subway train that belongs to a very bad guy. Lola has 20 min to raise this amount and meet Manni. Otherwise, he will rob a store to get the money. Three different alternatives may happen depending on some minor event along Lola's run. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Crime, Thriller","Keywords":"bechdel test failed, alternative reality, multiple outcomes, repeated event, money","imdbRating":"7.8","imdbVotes":"158,379","Awards":"Nominated for 1 BAFTA Film Award. Another 28 wins & 19 nominations.","Metascore":"77","Released":"18 June 1999 (USA) ","Location":"Mitte, Berlin, Germany ","Actors":"Franka Potente, Moritz Bleibtreu, Herbert Knaup ","Running_time":"PT80M / 1h 20min","Description":"Directed by Tom Tykwer.  With Franka Potente, Moritz Bleibtreu, Herbert Knaup, Nina Petri. After a botched money delivery, Lola has 20 minutes to come up with 100,000 Deutschmarks.","Rated":"R"}