{"imdbID":"tt0167261","Title":"The Lord of the Rings: The Two Towers","Year":"2002","Director":"Peter Jackson","Taglines":"The Journey Continues December 18th ","Country":"USA, New Zealand","Language":"English, Sindarin, Old English","Also_Known_As":"El señor de los anillos: Las dos torres ","Budget":"$94,000,000 (estimated)","Opening_Weekend":"£13,063,560 (UK) (20 December 2002)","Gross":"$49,935,319 (Europe) (19 December 2003)","Production_Co":"New Line Cinema, WingNut Films, The Saul Zaentz Company ","":"Show detailed company contact information on IMDbPro »","Runtime":"179 min | 172 min (DVD Widescreen) | 235 min (Blu Ray Extended Edition) | 223 min (DVD Special Extended Edition)","Sound_Mix":"DTS-ES | Dolby Digital EX | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The location for Edoras was in the midst of a national park. The Conservation Society of New Zealand gave them permission to film there on the proviso that they left it in exactly the same condition that they found it. This meant lifting most of the natural vegetation and grasses up and storing them in a purpose-built nursery, as filming in the location would last approximately 18 months. See more »","Goofs":"When Aragorn is lying on the river's shore, he forces himself onto an unsaddled horse. But, when he sees the Orc Army and starts to gallop towards Helms Deep, he is riding with a saddle. See more »","Crazy_Credits":"Special thanks to ... and to the thousands of others who helped make this film a reality. See more »","Cast":"Bruce Allpress, Sean Astin, John Bach, Sala Baker, Cate Blanchett, Orlando Bloom, Billy Boyd, Jed Brophy, Sam Comery, Brad Dourif, Calum Gittins, Bernard Hill, Bruce Hopkins, Paris Howe Strewe, Christopher Lee","Plot":"While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard. While Frodo and Sam, now accompanied by a new guide, continue their hopeless journey towards the land of shadow to destroy the One Ring, each member of the broken fellowship plays their part in the battle against the evil wizard Saruman and his armies of Isengard.","Genre":"Adventure, Drama, Fantasy","Keywords":"middle earth, epic, ring, wizard, evil wizard","imdbRating":"8.7","imdbVotes":"1,055,155","Awards":"Won 2 Oscars. Another 106 wins & 119 nominations.","Metascore":"88","Released":"28 March 2003 (India) ","Location":"Mount Sunday, Canterbury, South Island, New Zealand ","Actors":"Elijah Wood, Ian McKellen, Viggo Mortensen ","Writer":"J.R.R. Tolkien (novel), Fran Walsh (screenplay) | 3 more credits »","Running_time":"PT179M / 2h 59min","Description":"Directed by Peter Jackson.  With Elijah Wood, Ian McKellen, Viggo Mortensen, Orlando Bloom. While Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard.","Rated":"PG-13"}