{"imdbID":"tt0102536","Title":"Night on Earth","Year":"1991","Director":"Jim Jarmusch","Writer":"Jim Jarmusch","Taglines":"Five Taxis. Five Cities. One Night.","Country":"France, UK, Germany, USA, Japan","Language":"English, French, Finnish, Italian, German","Also_Known_As":"LANewYorkParisRomeHelsinki ","Budget":"$3,500,000 (estimated)","Gross":"$2,015,810 (USA)","Production_Co":"Victor Company of Japan (JVC), Victor Musical Industries, Pyramide Productions ","Runtime":"129 min","Sound_Mix":"Dolby","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Much of 'Roberto Begnini''s dialogue was unscripted and was spontaneously improvised by the actor. See more »","Goofs":"This film takes place sometime during the winter, and the opening story takes place in Los Angeles starting at 7:07 PM. At no time during the winter would Los Angeles be this sunny at 7:07 PM. In fact, the latest time of day the sun would set during the winter would be at 6:07 PM on March 20, the last day of winter. (Currently, March 20 would occur during Daylight Savings Time, but, in 1991, Daylight Savings Time did not begin until April.) See more »","Crazy_Credits":"During the end credits, the titles of the crew members are in the language of the place/unit they worked in (ie the Helsinki unit's credits are in Finnish, and so on). See more »","Cast":"Gena Rowlands, Winona Ryder, Lisanne Falk, Alan Randolph Scott, Anthony Portillo, Armin Mueller-Stahl, Giancarlo Esposito, Rosie Perez, Richard Boes, Isaach De Bankolé, Béatrice Dalle, Pascal N'Zonzi, Emile Abossolo M'bo, Stéphane Boucher, Noel Kaufmann","Plot":"An anthology of 5 different cab drivers in 5 American and European cities and their remarkable fares on the same eventful night. A collection of five stories involving cab drivers in five different cities. Los Angeles - A talent agent for the movies discovers her cab driver would be perfect to cast, but the cabbie is reluctant to give up her solid cab driver's career. New York - An immigrant cab driver is continually lost in a city and culture he doesn't understand. Paris - A blind girl takes a ride with a cab driver from the Ivory Coast and they talk about life and blindness. Rome - A gregarious cabbie picks up an ailing man and virtually talks him to death. Helsinki - an industrial worker gets laid off and he and his compatriots discuss the bleakness and unfairness of love and life and death. Written by Ed Sutton <esutton@mindspring.com>","Genre":"Comedy, Drama","Keywords":"taxi, death, night, anthology, los angeles international airport","imdbRating":"7.8","imdbVotes":"38,935","Awards":"1 win & 1 nomination.","Metascore":"","Released":"12 December 1991 (Germany) ","Location":"Brooklyn Bridge, New York City, New York, USA ","Actors":"Winona Ryder, Gena Rowlands, Lisanne Falk ","Running_time":"PT129M / 2h 9min","Description":"Directed by Jim Jarmusch.  With Winona Ryder, Gena Rowlands, Lisanne Falk, Alan Randolph Scott. An anthology of 5 different cab drivers in 5 American and European cities and their remarkable fares on the same eventful night.","Rated":"R"}