{"imdbID":"tt0120815","Title":"Saving Private Ryan","Year":"1998","Director":"Steven Spielberg","Writer":"Robert Rodat","Taglines":"In the Last Great Invasion of the Last Great War, The Greatest Danger for Eight Men was Saving... One. ","Certificate":"A | See all certifications »","Country":"USA","Language":"English, French, German, Czech","Also_Known_As":"Rescatando al soldado Ryan ","Budget":"$70,000,000 (estimated)","Opening_Weekend":"$30,576,104 (USA) (24 July 1998)","Gross":"$216,119,491 (USA) (21 May 1999)","Production_Co":"DreamWorks SKG, Paramount Pictures, Amblin Entertainment ","":"Show detailed company contact information on IMDbPro »","Runtime":"169 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"In an earlier draft of the script, Miller's squad takes Steamboat Willie with them and camps out for the night in a foxhole. That night, a German Panzer division arrives and camps out right next to the squad's foxhole. When a German soldier named Weiter approaches the foxhole asking for cigarettes, the squad forces Willie at gunpoint to converse with Weiter so their cover is not blown. (Weiter never sees the Americans due to the darkness of the night.) Through Willie, the squad ends up trading Reiben's Mickey Mouse lighter and Mellish's Hitler Youth Knife for food from Weiter, much to Mellish's displeasure. See more »","Goofs":"When the big soldier is first seen approaching Cpt. Miller as he is calling Ryan, he is a few yards away from him. In the next shot where he calls Joe, he is approaching from the same distance as the previous shot. See more »","Crazy_Credits":"There are no opening credits after the title is shown. See more »","Cast":"Tom Hanks, Tom Sizemore, Edward Burns, Barry Pepper, Adam Goldberg, Vin Diesel, Giovanni Ribisi, Jeremy Davies, Matt Damon, Ted Danson, Paul Giamatti, Dennis Farina, Joerg Stadler, Max Martini, Dylan Bruno","Plot":"Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action. Opening with the Allied invasion of Normandy on 6 June 1944, members of the 2nd Ranger Battalion under Cpt. Miller fight ashore to secure a beachhead. Amidst the fighting, two brothers are killed in action. Earlier in New Guinea, a third brother is KIA. Their mother, Mrs. Ryan, is to receive all three of the grave telegrams on the same day. The United States Army Chief of Staff, George C. Marshall, is given an opportunity to alleviate some of her grief when he learns of a fourth brother, Private James Ryan, and decides to send out 8 men (Cpt. Miller and select members from 2nd Rangers) to find him and bring him back home to his mother... Written by J.Zelman","Genre":"Action, Drama, War","Keywords":"invasion, normandy, army, killed in action, soldier","imdbRating":"8.6","imdbVotes":"843,226","Awards":"Won 5 Oscars. Another 72 wins & 74 nominations.","Metascore":"90","Released":"24 July 1998 (USA) ","Location":"Calvados, France ","Actors":"Tom Hanks, Matt Damon, Tom Sizemore ","Running_time":"PT169M / 2h 49min","Description":"Directed by Steven Spielberg.  With Tom Hanks, Matt Damon, Tom Sizemore, Edward Burns. Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action.","Rated":"A"}