{"imdbID":"tt0118715","Title":"The Big Lebowski","Year":"1998","Taglines":"Times like these call for a Big Lebowski. ","Country":"USA, UK","Language":"English, German, Hebrew, Spanish","Also_Known_As":"Big Lebowski ","Budget":"$15,000,000 (estimated)","Opening_Weekend":"$5,533,844 (USA) (6 March 1998)","Gross":"£1,462,880 (UK) (19 June 1998)","Production_Co":"Polygram Filmed Entertainment, Working Title Films ","":"Show detailed company contact information on IMDbPro »","Runtime":"117 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"When The Dude and Walter are bowling after the botched ransom drop off, Walter says \"Eitz chaim hi, Dude, as the ex used to say.\" This is the first half of a Hebrew verse, which means \"It is a tree of life\" (the second half of the verse is \"lamachazikim ba\", which means \"to those who take hold of it\") and it refers to the Old Testament. See more »","Goofs":"After Walter pulls out his hand gun at Smokie; Dude and Walter are walking to Dude's car with the dog. The dog disappears from the scene when they get into the car. See more »","Crazy_Credits":"Big Associate Editor.... Big Dave Diliberto See more »","Cast":"Jeff Bridges, John Goodman, Julianne Moore, Steve Buscemi, David Huddleston, Philip Seymour Hoffman, Tara Reid, Philip Moon, Mark Pellegrino, Peter Stormare, Flea, Torsten Voges, Jimmie Dale Gilmore, Jack Kehler, John Turturro","Plot":"\"The Dude\" Lebowski, mistaken for a millionaire Lebowski, seeks restitution for his ruined rug and enlists his bowling buddies to help get it. When \"The Dude\" Lebowski is mistaken for a millionaire Lebowski, two thugs urinate on his rug to coerce him into paying a debt he knows nothing about. While attempting to gain recompense for the ruined rug from his wealthy counterpart, he accepts a one-time job with high pay-off. He enlists the help of his bowling buddy, Walter, a gun-toting Jewish-convert with anger issues. Deception leads to more trouble, and it soon seems that everyone from porn empire tycoons to nihilists want something from The Dude. Written by J. Lake","Genre":"Comedy, Crime","Keywords":"nihilism, rug, white russian, death, drug","imdbRating":"8.2","imdbVotes":"515,665","Awards":"4 wins & 15 nominations.","Metascore":"69","Released":"6 March 1998 (USA) ","Location":"10231 Charing Cross Road, Beverly Hills, California, USA ","Actors":"Jeff Bridges, John Goodman, Julianne Moore ","Director":"Joel Coen, Ethan Coen (uncredited)","Writer":"Ethan Coen, Joel Coen","Running_time":"PT117M / 1h 57min","Description":"Directed by Joel Coen, Ethan Coen.  With Jeff Bridges, John Goodman, Julianne Moore, Steve Buscemi. \"The Dude\" Lebowski, mistaken for a millionaire Lebowski, seeks restitution for his ruined rug and enlists his bowling buddies to help get it.","Rated":"R"}