{"imdbID":"tt0120737","Title":"The Lord of the Rings: The Fellowship of the Ring","Year":"2001","Director":"Peter Jackson","Taglines":"Fate Has Chosen Him. A Fellowship Will Protect Him. Evil Will Hunt Them. ","Country":"New Zealand, USA","Language":"English, Sindarin","Also_Known_As":"El señor de los anillos: La comunidad del anillo ","Budget":"$93,000,000 (estimated)","Opening_Weekend":"£11,058,045 (UK) (21 December 2001)","Gross":"$36,116,967 (Europe) (19 December 2003)","Production_Co":"New Line Cinema, WingNut Films, The Saul Zaentz Company ","":"Show detailed company contact information on IMDbPro »","Runtime":"178 min | 228 min (Blu-Ray Extended Edition) | 208 min (DVD Special Extended Edition) | 171 min (DVD Widescreen)","Sound_Mix":"DTS-ES | Dolby Digital EX | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"When Frodo is leafing through Bilbo's Book in Rivendell, a page with dwarven runes is shown. The runes translate thus: \"Stand by the grey stone when the thrush knocks, and the setting sun with the last light of Durin's Day will shine upon the keyhole.\" This is a reference (actually a direct copy) to a map in the book \"The Hobbit\" and the runes tell of the secret entrance into The Lonely Mountain. See more »","Goofs":"When Frodo falls and rolls down the snowy slope of the mountain (when they approach the pass), the line where his prosthetic hobbit feet ends on his lower legs, is clearly visible. See more »","Crazy_Credits":"There are no opening credits after the title has been shown. See more »","Cast":"Alan Howard, Noel Appleby, Sean Astin, Sala Baker, Sean Bean, Cate Blanchett, Orlando Bloom, Billy Boyd, Marton Csokas, Megan Edwards, Michael Elsworth, Mark Ferguson, Ian Holm, Christopher Lee, Lawrence Makoare","Plot":"A meek Hobbit and eight companions set out on a journey to destroy the One Ring and the Dark Lord Sauron. An ancient Ring thought lost for centuries has been found, and through a strange twist in fate has been given to a small Hobbit named Frodo. When Gandalf discovers the Ring is in fact the One Ring of the Dark Lord Sauron, Frodo must make an epic quest to the Cracks of Doom in order to destroy it! However he does not go alone. He is joined by Gandalf, Legolas the elf, Gimli the Dwarf, Aragorn, Boromir and his three Hobbit friends Merry, Pippin and Samwise. Through mountains, snow, darkness, forests, rivers and plains, facing evil and danger at every corner the Fellowship of the Ring must go. Their quest to destroy the One Ring is the only hope for the end of the Dark Lords reign! Written by Paul Twomey <toomsp@hotmail.com>","Genre":"Adventure, Drama, Fantasy","Keywords":"ring, quest, hobbit, middle earth, elf","imdbRating":"8.8","imdbVotes":"1,191,293","Awards":"Won 4 Oscars. Another 109 wins & 121 nominations.","Metascore":"92","Released":"15 March 2002 (India) ","Location":"Fort Dorset, Miramar, Wellington, New Zealand ","Actors":"Elijah Wood, Ian McKellen, Orlando Bloom ","Writer":"J.R.R. Tolkien (novel), Fran Walsh (screenplay) | 2 more credits »","Running_time":"PT178M / 2h 58min","Description":"Directed by Peter Jackson.  With Elijah Wood, Ian McKellen, Orlando Bloom, Sean Bean. A meek Hobbit and eight companions set out on a journey to destroy the One Ring and the Dark Lord Sauron.","Rated":"PG-13"}