{"imdbID":"tt0139654","Title":"Training Day","Year":"2001","Director":"Antoine Fuqua","Writer":"David Ayer","Country":"USA, Australia","Language":"English, Russian, Spanish, Korean","Budget":"$45,000,000 (estimated)","Gross":"£1,942,439 (UK) (15 February 2002)","Production_Co":"Warner Bros., Village Roadshow Pictures, NPV Entertainment ","Runtime":"122 min","Cast":"Denzel Washington, Ethan Hawke, Scott Glenn, Tom Berenger, Harris Yulin, Raymond J. Barry, Cliff Curtis, Dr. Dre, Snoop Dogg, Macy Gray, Charlotte Ayanna, Eva Mendes, Nick Chinlund, Jaime Gomez, Raymond Cruz","Plot":"On his first day on the job as a Los Angeles narcotics officer, a rookie cop goes on a 24-hour training course with a rogue detective who isn't what he appears. In Los Angeles, a city where streets are overrun by drug dealers, those who have sworn to uphold the law are breaking them to clean up the streets. Denzel Washington plays L.A.P.D. detective Alonzo Harris, a veteran narcotics officer whose methods of enforcing the law are questionable, if not corrupt. 'Training Day' follows Harris as he trains rookie Jake Hoyt over a 24-hour period. Ethical dilemmas arise for Hoyt as well as the audience as questions present themselves as to whether or not Harris' methodology for ridding the streets of South Central Los Angeles of drugs is right or wrong. Written by Anna <dimenxia@yahoo.com>","Genre":"Action, Crime, Drama","Keywords":"title spoken by character, narc, training, lapd, narcotics","imdbRating":"7.7","imdbVotes":"297,031","Awards":"Won 1 Oscar. Another 14 wins & 22 nominations.","Metascore":"70","Released":"5 October 2001 (USA) ","Location":"Santa Clarita, California, USA ","Actors":"Denzel Washington, Ethan Hawke, Scott Glenn ","Running_time":"PT122M / 2h 2min","Description":"Directed by Antoine Fuqua.  With Denzel Washington, Ethan Hawke, Scott Glenn, Tom Berenger. On his first day on the job as a Los Angeles narcotics officer, a rookie cop goes on a 24-hour training course with a rogue detective who isn't what he appears.","Rated":"R"}