{"imdbID":"tt0120586","Title":"American History X","Year":"1998","Director":"Tony Kaye","Writer":"David McKenna","Taglines":"His father taught him to hate. His friends taught him rage. His enemies gave him hope. ","Certificate":"A | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"American History X ","Budget":"$7,500,000 (estimated)","Opening_Weekend":"$156,076 (USA) (30 October 1998)","Gross":"£291,438 (UK) (2 April 1999)","Production_Co":"New Line Cinema, Savoy Pictures, Turman-Morrissey Company, The ","":"Show detailed company contact information on IMDbPro »","Runtime":"119 min | 101 min (workprint)","Sound_Mix":"SDDS | Dolby Digital | DTS","Color":"Black and White | Color","Aspect_Ratio":"1.85 : 1","Trivia":"In the midst of the dispute about the time he was taking to edit the film, Director Tony Kaye attended a meeting with Michael De Luca (then New Line's senior product president). Kaye arranged for a Jewish Rabbi, a Catholic priest and a Buddhist monk to be present at the meeting to support his argument and \"make the meeting a more spiritual one\". See more »","Goofs":"In the beginning of the film, when Derek runs out of the house and finishes shooting at the thief stealing his truck, in slow motion he turns around facing the camera, with the gun still in the same hand he was using to fire it. Later on in the movie, when this scene is replayed from a different shot, he turns around and puts the gun in his other hand. See more »","Cast":"Edward Norton, Edward Furlong, Beverly D'Angelo, Jennifer Lien, Ethan Suplee, Fairuza Balk, Avery Brooks, Elliott Gould, Stacy Keach, William Russ, Guy Torry, Joe Cortese, Jason Bose Smith, Antonio David Lyons, Alex Sol","Plot":"A former neo-nazi skinhead tries to prevent his younger brother from going down the same wrong path that he did. Derek Vineyard is paroled after serving 3 years in prison for killing two thugs who tried to break into/steal his truck. Through his brother, Danny Vineyard's narration, we learn that before going to prison, Derek was a skinhead and the leader of a violent white supremacist gang that committed acts of racial crime throughout L.A. and his actions greatly influenced Danny. Reformed and fresh out of prison, Derek severs contact with the gang and becomes determined to keep Danny from going down the same violent path as he did. Written by Nitesh D.(nmxpa7@msn.com)","Genre":"Crime, Drama","Keywords":"prison, pubic hair, male pubic hair, prison shower, group shower","imdbRating":"8.6","imdbVotes":"753,386","Awards":"Nominated for 1 Oscar. Another 4 wins & 13 nominations.","Metascore":"62","Released":"20 November 1998 (USA) ","Location":"2206 Meade Place, Venice Beach, Los Angeles, California, USA ","Actors":"Edward Norton, Edward Furlong, Beverly D'Angelo ","Running_time":"PT119M / 1h 59min","Description":"Directed by Tony Kaye.  With Edward Norton, Edward Furlong, Beverly D'Angelo, Jennifer Lien. A former neo-nazi skinhead tries to prevent his younger brother from going down the same wrong path that he did.","Rated":"A"}