{"imdbID":"tt0118694","Title":"In the Mood for Love","Year":"2000","Director":"Kar-Wai Wong (as Kar Wai Wong)","Writer":"Kar-Wai Wong (as Kar Wai Wong)","Taglines":"Feel the heat, keep the feeling burning, let the sensation explode.","Country":"Hong Kong, China","Language":"Cantonese, Shanghainese, French","Also_Known_As":"In the Mood for Love ","Opening_Weekend":"£92,227 (UK) (27 October 2000)","Gross":"ESP 125,406,499 (Spain) (29 June 2001)","Production_Co":"Block 2 Pictures, Jet Tone Production, Paradis Films ","":"Show detailed company contact information on IMDbPro »","Runtime":"98 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.66 : 1","Trivia":"During filming, Kar-Wai Wong improvised often with the actors, crafting the story and mood of the film as he went along. Originally, \"In the Mood for Love\" was a much more obvious romance film, with the actors throwing witty dialog at each other and engaging in several scenes of love-making. Eventually, the actors and director decided to tone the mood down to the more subtle version that was released in theaters. See more »","Goofs":"At around 10:00, while they are using the rice cooker that Mr. Chan brought from his trip, Mrs. Chan's newspaper is inconsistently open/closed between shots. See more »","Cast":"Maggie Cheung, Tony Chiu Wai Leung, Ping Lam Siu, Tung Cho 'Joe' Cheung, Rebecca Pan, Kelly Lai Chen, Man-Lei Chan, Szu-Ying Chien, Roy Cheung, Paulyn Sun, Po-chun Chow, Kam-wah Koo, Hsien Yu","Plot":"Two neighbors, a woman and a man, form a strong bond after both suspect extramarital activities of their spouses. However, they agree to keep their bond platonic so as not to commit similar wrongs. Set in Hong Kong, 1962, Chow Mo-Wan is a newspaper editor who moves into a new building with his wife. At the same time, Su Li-zhen, a beautiful secretary and her executive husband also move in to the crowded building. With their spouses often away, Chow and Li-zhen spend most of their time together as friends. They have everything in common from noodle shops to martial arts. Soon, they are shocked to discover that their spouses are having an affair. Hurt and angry, they find comfort in their growing friendship even as they resolve not to be like their unfaithful mates. Written by Anonymous","Genre":"Drama, Romance","Keywords":"newspaper, hong kong, moving in, coincidence, noodles","imdbRating":"8.1","imdbVotes":"72,020","Awards":"Nominated for 1 BAFTA Film Award. Another 44 wins & 41 nominations.","Metascore":"85","Released":"9 March 2001 (USA) ","Location":"Angkor Wat, Siem Reap, Cambodia ","Actors":"Tony Chiu Wai Leung, Maggie Cheung, Ping Lam Siu ","Running_time":"PT98M / 1h 38min","Description":"Directed by Kar-Wai Wong.  With Tony Chiu Wai Leung, Maggie Cheung, Ping Lam Siu, Tung Cho 'Joe' Cheung. Two neighbors, a woman and a man, form a strong bond after both suspect extramarital activities of their spouses. However, they agree to keep their bond platonic so as not to commit similar wrongs.","Rated":"PG"}