{"imdbID":"tt0108394","Title":"Three Colors: Blue","Year":"1993","Director":"Krzysztof Kieslowski","Country":"France, Poland, Switzerland","Language":"French, Romanian, Polish","Also_Known_As":"Three Colors: Blue ","Gross":"SEK 6,807,316 (Sweden)","Production_Co":"MK2 Productions, CED Productions, France 3 Cinéma ","Runtime":"98 min","Sound_Mix":"Dolby SR","Color":"Color (Eastmancolor)","Aspect_Ratio":"1.85 : 1","Trivia":"When the pictures of Patrice are showed on TV, one of them shows him with the famous Bulgarian pianist Alexis Weissenberg. See more »","Goofs":"When Oliver tells Julie he will not incorporate her changes into the musical score, a boom mic is visible briefly as Julie puts down the phone. See more »","Crazy_Credits":"The final credit says in French, \"We thank Alfa Romeo who allowed the scene of the accident to the Alfa 164 whose dynamics are of course purely imaginary.\" See more »","Cast":"Juliette Binoche, Benoît Régent, Florence Pernel, Charlotte Véry, Hélène Vincent, Philippe Volter, Claude Duneton, Hugues Quester, Emmanuelle Riva, Florence Vignon, Daniel Martin, Jacek Ostaszewski, Catherine Therouenne, Yann Trégouët, Alain Ollivier","Plot":"A woman struggles to find a way to live her life after the death of her husband and child. The first part of Kieslowski's trilogy on France's national motto: Liberty, Equality, and Fraternity. 'Blue' is the story of Julie who loses her husband, an acclaimed composer and her young daughter in a car accident. The film's theme of liberty is manifested in Julie's attempt to start life anew, free of personal commitments, belongings, grief or love. She intends to numb herself by withdrawing from the world and living completely independently, anonymously and in solitude in the Parisian metropolis. Despite her intentions, people from her former and present life intrude with their own needs. However, the reality created by the people who need and care about her, a surprising discovery and the music around which the film revolves heal Julie and draws her back to the land of the living. Written by Anonymous","Genre":"Drama, Music, Mystery","Keywords":"liberty, grief, composer, car accident, first part of trilogy","imdbRating":"8.0","imdbVotes":"59,998","Awards":"Nominated for 3 Golden Globes. Another 19 wins & 9 nominations.","Metascore":"","Released":"8 September 1993 (France) ","Location":"Piscine Pontoise - 19 Rue de Pontoise, Paris 5, Paris, France ","Actors":"Juliette Binoche, Zbigniew Zamachowski, Julie Delpy ","Writer":"Krzysztof Kieslowski (scenario), Krzysztof Piesiewicz (scenario) | 3 more credits »","Running_time":"PT98M / 1h 38min","Description":"Directed by Krzysztof Kieslowski.  With Juliette Binoche, Zbigniew Zamachowski, Julie Delpy, Benoît Régent. A woman struggles to find a way to live her life after the death of her husband and child.","Rated":"R"}