{"imdbID":"tt0118929","Title":"Dark City","Year":"1998","Director":"Alex Proyas","Taglines":"Forget the Sun. Forget Time. Forget Your Memories. ","Country":"Australia, USA","Language":"English","Also_Known_As":"Dark City ","Budget":"$27,000,000 (estimated)","Opening_Weekend":"$5,576,953 (USA) (27 February 1998)","Gross":"£848,615 (UK) (19 June 1998)","Production_Co":"Mystery Clock Cinema, New Line Cinema ","Runtime":"100 min | 111 min (director's cut)","Sound_Mix":"Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The number of the motel room in which John Murdoch wakes up at the start of the film is 614. In the Bible John Chapter 6, Verse 14 talks about the coming of the Saviour. See more »","Goofs":"(at around 60 mins) After John Murdoch opens the door and almost falls from the building, as he hangs by his hands the door is on his left, except when shown from above, when it is on his right. See more »","Cast":"Rufus Sewell, William Hurt, Kiefer Sutherland, Jennifer Connelly, Richard O'Brien, Ian Richardson, Bruce Spence, Colin Friels, John Bluthal, Mitchell Butel, Melissa George, Frank Gallacher, Ritchie Singer, Justin Monjo, Nicholas Bell","Plot":"A man struggles with memories of his past, including a wife he cannot remember, in a nightmarish world with no sun. John Murdoch awakens alone in a strange hotel to find that he has lost his memory and is wanted for a series of brutal and bizarre murders. While trying to piece together his past, he stumbles upon a fiendish underworld controlled by a group of beings known as The Strangers who possess the ability to put people to sleep and alter the city and its inhabitants. Now Murdoch must find a way to stop them before they take control of his mind and destroy him. Written by Anonymous","Genre":"Drama, Fantasy, Sci-Fi","Keywords":"retrofuturism, neo noir, tech noir, memory, murder","imdbRating":"7.7","imdbVotes":"152,822","Awards":"9 wins & 14 nominations.","Metascore":"66","Released":"27 February 1998 (USA) ","Location":"Fox Studios, Moore Park, Sydney, New South Wales, Australia ","Actors":"Rufus Sewell, Kiefer Sutherland, Jennifer Connelly ","Writer":"Alex Proyas (story), Alex Proyas (screenplay) | 2 more credits »","Running_time":"PT100M / 1h 40min","Description":"Directed by Alex Proyas.  With Rufus Sewell, Kiefer Sutherland, Jennifer Connelly, William Hurt. A man struggles with memories of his past, including a wife he cannot remember, in a nightmarish world with no sun.","Rated":"R"}