{"imdbID":"tt0107207","Title":"In the Name of the Father","Year":"1993","Director":"Jim Sheridan","Taglines":"In the name of truth... In the name of justice... In the name of love. ","Country":"Ireland, UK, USA","Language":"English","Also_Known_As":"En el nombre del padre ","Budget":"$13,000,000 (estimated)","Gross":"$25,010,410 (USA)","Production_Co":"Hell's Kitchen Films, Universal Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"133 min","Sound_Mix":"Dolby | DTS","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Despite his executive producer credit, Gabriel Byrne distanced himself from the project, chiefly due to the \"artistic\" liberties that were taken with the details of the story. See more »","Goofs":"During the riot, Gerry's sister and her friend are on the swings, she says, \"Oh, my God,\" but clearly that is not what she is saying. See more »","Cast":"Alison Crosbie, Daniel Day-Lewis, Philip King, Emma Thompson, Nye Heron, Anthony Brophy, Frankie McCafferty, Paul Warriner, Julian Walsh, Stuart Wolfenden, Jo Connor, Karen Carlisle, Seamus Moran, Billy Byrne, Maureen McBride","Plot":"A man's coerced confession to an IRA bombing he did not commit results in the imprisonment of his father as well. An English lawyer fights to free them. A small time thief from Belfast, Gerry Conlon, is falsely implicated in the IRA bombing of a pub that kills several people while he is in London. Bullied by the British police, he and four of his friends are coerced into confessing their guilt. Gerry's father and other relatives in London are also implicated in the crime. He spends 15 years in prison with his father trying to prove his innocence with the help of a British attorney, Gareth Peirce. Based on a true story. Written by Liza Esser <essereli@student.msu.edu>","Genre":"Biography, Drama, History","Keywords":"pub, police, lawyer, justice, thief","imdbRating":"8.1","imdbVotes":"104,523","Awards":"Nominated for 7 Oscars. Another 7 wins & 20 nominations.","Metascore":"84","Released":"25 February 1994 (USA) ","Location":"Ardmore Studios, Herbert Road, Bray, County Wicklow, Ireland ","Actors":"Daniel Day-Lewis, Pete Postlethwaite, Alison Crosbie ","Writer":"Gerry Conlon (autobiographical book \"Proved Innocent\"), Terry George (screenplay) | 1 more credit »","Running_time":"PT133M / 2h 13min","Description":"Directed by Jim Sheridan.  With Daniel Day-Lewis, Pete Postlethwaite, Alison Crosbie, Philip King. A man's coerced confession to an IRA bombing he did not commit results in the imprisonment of his father as well. An English lawyer fights to free them.","Rated":"R"}