{"imdbID":"tt0107290","Title":"Jurassic Park","Year":"1993","Director":"Steven Spielberg","Taglines":"Life finds a way. ","Country":"USA","Language":"English, Spanish","Also_Known_As":"JP ","Budget":"$63,000,000 (estimated)","Opening_Weekend":"£32,723,932 (UK) (13 August 1993)","Gross":"SGD 4,700,000 (Singapore)","Production_Co":"Universal Pictures, Amblin Entertainment ","":"Show detailed company contact information on IMDbPro »","Runtime":"127 min","Sound_Mix":"Dolby | DTS","Color":"Color (Eastmancolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Production moved to Red Rock Canyon State Park, chosen for its similarities to a Montana dinosaur dig where Sam Neill and Laura Dern filmed they're first scene; they were coached by Jack Horner, the premier paleontologist and curator of paleontology at Bozeman, Montana's museum of the Rockies. See more »","Goofs":"As Dr. Grant lectures the cynical boy at the dig site about the velociraptor, he says that the velociraptor's claw was used to eviscerate and tear its victims apart, as opposed to going for the neck like many of today's predators. The fossilized remains of a velociraptor caught in a feud with its prey clearly show the velociraptor stabbing the prey in the neck with its claw. The Truth About Killer Dinosaurs also conducted an experiment to see if the claw could eviscerate flesh. It couldn't. See more »","Crazy_Credits":"The credits are a jungle typeface. See more »","Cast":"Sam Neill, Laura Dern, Jeff Goldblum, Richard Attenborough, Bob Peck, Martin Ferrero, Joseph Mazzello, Ariana Richards, Samuel L. Jackson, BD Wong, Wayne Knight, Gerald R. Molen, Miguel Sandoval, Cameron Thor, Christopher John Fields","Plot":"During a preview tour, a theme park suffers a major power breakdown that allows its cloned dinosaur exhibits to run amok. Huge advancements in scientific technology have enabled a mogul to create an island full of living dinosaurs. John Hammond has invited four individuals, along with his two grandchildren, to join him at Jurassic Park. But will everything go according to plan? A park employee attempts to steal dinosaur embryos, critical security systems are shut down and it now becomes a race for survival with dinosaurs roaming freely over the island. Written by Film_Fan","Genre":"Adventure, Sci-Fi, Thriller","Keywords":"dinosaur, theme park, survival, jurassic park, tyrannosaurus rex","imdbRating":"8.1","imdbVotes":"581,113","Awards":"Won 3 Oscars. Another 26 wins & 16 nominations.","Metascore":"68","Released":"11 June 1993 (USA) ","Location":"Jurassic Kahili Ranch, Kilauea, Kauai, Hawaii, USA ","Actors":"Sam Neill, Laura Dern, Jeff Goldblum ","Writer":"Michael Crichton (novel), Michael Crichton (screenplay) | 1 more credit »","Running_time":"PT127M / 2h 7min","Description":"Directed by Steven Spielberg.  With Sam Neill, Laura Dern, Jeff Goldblum, Richard Attenborough. During a preview tour, a theme park suffers a major power breakdown that allows its cloned dinosaur exhibits to run amok.","Rated":"PG-13"}