{"imdbID":"tt0113987","Title":"Nixon","Year":"1995","Director":"Oliver Stone","Country":"USA","Language":"English, Mandarin, Russian","Budget":"$50,000,000 (estimated)","Gross":"$13,560,960 (USA)","Production_Co":"Cinergi Pictures Entertainment, Hollywood Pictures, Illusion Entertainment ","Runtime":"192 min | 212 min (director's cut)","Cast":"Anthony Hopkins, Joan Allen, Powers Boothe, Ed Harris, Bob Hoskins, E.G. Marshall, David Paymer, David Hyde Pierce, Paul Sorvino, Mary Steenburgen, J.T. Walsh, James Woods, Brian Bedford, Kevin Dunn, Fyvush Finkel","Plot":"A biographical story of former U.S. president Richard Milhous Nixon, from his days as a young boy to his eventual presidency which ended in shame. Director Oliver Stone's exploration of former president Richard Nixon's strict Quaker upbringing, his nascent political strivings in law school, and his strangely self-effacing courtship of his wife, Pat. The contradictions in his character are revealed early, in the vicious campaign against Helen Gahagan Douglas and the oddly masochistic Checkers speech. His defeat at the hands of the hated and envied John F. Kennedy in the 1960 presidential election, followed by the loss of the 1962 California gubernatorial race, seem to signal the end of his career. Yet, although wholly lacking in charisma, Nixon remains a brilliant political operator, seizing the opportunity provided by the backlash against the antiwar movement to take the presidency in 1968. It is only when safely in office, running far ahead in the polls for the 1972 presidential election, that his growing paranoia comes to full flower, triggering the Watergate scandal. Written by alfiehitchie","Genre":"Biography, Drama, History","Keywords":"president, election, paranoia, courtship, quaker","imdbRating":"7.1","imdbVotes":"23,533","Awards":"Nominated for 4 Oscars. Another 9 wins & 13 nominations.","Metascore":"66","Released":"5 January 1996 (USA) ","Location":"Culver Studios - 9336 W. Washington Blvd., Culver City, California, USA ","Actors":"Anthony Hopkins, Joan Allen, Powers Boothe ","Writer":"Stephen J. Rivele, Christopher Wilkinson | 1 more credit »","Running_time":"PT192M / 3h 12min","Description":"Directed by Oliver Stone.  With Anthony Hopkins, Joan Allen, Powers Boothe, Ed Harris. A biographical story of former U.S. president Richard Milhous Nixon, from his days as a young boy to his eventual presidency which ended in shame.","Rated":"R"}