{"imdbID":"tt0107808","Title":"A Perfect World","Year":"1993","Director":"Clint Eastwood","Writer":"John Lee Hancock","Country":"USA","Language":"English","Also_Known_As":"Un mundo perfecto ","Budget":"$30,000,000 (estimated)","Opening_Weekend":"£3,034,130 (UK) (14 January 1994)","Gross":"£4,092,432 (UK) (4 February 1994)","Production_Co":"Warner Bros., Malpaso Productions ","Runtime":"138 min | 125 min (TV)","Sound_Mix":"Dolby Digital","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Kevin Costner and Clint Eastwood both received Best Director Oscars in the years shortly preceding this film. Both of their respective films ( Dances with Wolves (1990) and Unforgiven (1992) ) were westerns. Consequently, this marks perhaps the only time in film history when two such Oscar-winning directors co-starred as actors in the same film. (Also: see Chinatown (1974) Trivia.) See more »","Goofs":"When Butch is driving the blue Bel Air, the gear-shifter can be seen in P position. See more »","Cast":"Kevin Costner, Clint Eastwood, Laura Dern, T.J. Lowther, Keith Szarabajka, Leo Burmester, Paul Hewitt, Bradley Whitford, Ray McKinnon, Jennifer Griffin, Leslie Flowers, Belinda Flowers, Darryl Cox, Jay Whiteaker, Taylor Suzanna McBride","Plot":"A kidnapped boy strikes up a friendship with his captor: an escaped convict on the run from the law, headed by an honorable U.S. Marshal. After escaping from a Huntsville prison, convict Butch Haynes and his partner Terry Pugh kidnap a young boy, Philip Perry, and flee across Texas. As they travel together, Butch and Philip discover common bonds and suffer the abuses of the outside \"Perfect World.\" In pursuit is Texas Ranger \"Red\" Garnett and criminologist Sally Gerber. Written by James Yu <jamestyu@ccwf.cc.utexas.edu>","Genre":"Crime, Drama, Thriller","Keywords":"anti hero, prison, texas, on the run, violence","imdbRating":"7.5","imdbVotes":"56,265","Awards":"","Metascore":"","Released":"24 November 1993 (USA) ","Location":"Steiner Ranch - 896 Sayers Road, Bastrop, Texas, USA ","Actors":"Kevin Costner, Clint Eastwood, Laura Dern ","Running_time":"PT138M / 2h 18min","Description":"Directed by Clint Eastwood.  With Kevin Costner, Clint Eastwood, Laura Dern, T.J. Lowther. A kidnapped boy strikes up a friendship with his captor: an escaped convict on the run from the law, headed by an honorable U.S. Marshal.","Rated":"PG-13"}