{"imdbID":"tt0118843","Title":"Black Cat, White Cat","Year":"1998","Director":"Emir Kusturica","Writer":"Gordan Mihic","Country":"Federal Republic of Yugoslavia, France, Germany, Austria, Greece","Language":"Romany, Serbian, Bulgarian","Also_Known_As":"Black Cat, White Cat ","Opening_Weekend":"$15,359 (USA) (10 September 1999)","Gross":"$348,660 (USA) (10 December 1999)","Production_Co":"CiBy 2000, Pandora Filmproduktion, Komuna ","Runtime":"127 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"In the scene where mob boss Dadan (played by Srdjan Todorovic) talks about his father spinning in his grave, the picture on the wall is of his real life father Bora Todorovic, who played a mob boss in Emir Kusturica's Time of the Gypsies (1988). See more »","Goofs":"When Zare escapes from Dadan on the ladder, Dadan catches him by the right ear. In the next shot he is holding Zare's left ear. See more »","Crazy_Credits":"In the opening credits, the name of the movie isn't spelled out; a picture of a black cat and a white cat is shown instead. See more »","Cast":"Bajram Severdzan, Srdjan Todorovic, Branka Katic, Florijan Ajdini, Ljubica Adzovic, Zabit Memedov, Sabri Sulejmani, Jasar Destani, Stojan Sotirov, Predrag Lakovic, Predrag Manojlovic, Salija Ibraimova, Zdena Hurtocakova, Adnan Bekir, Irfan Jagli","Plot":"Matko is a small time hustler, living by the river Danube with his 17 year old son Zare. After a failed business deal he owes money to the much more successful gangster Dadan. Dadan has a ... See full summary » Matko is a small time hustler, living by the river Danube with his 17 year old son Zare. After a failed business deal he owes money to the much more successful gangster Dadan. Dadan has a sister, Afrodita, that he desperately wants to see get married so they strike a deal: Zare is to marry her. But none of the two care much for an arranged marriage: Zare is in love with Ida, Afrodita is waiting for the man of her dreams. Written by Mattias Thuresson","Genre":"Comedy, Crime, Romance","Keywords":"deal, marriage, sister, gangster, money","imdbRating":"8.1","imdbVotes":"39,742","Awards":"5 wins & 4 nominations.","Metascore":"73","Released":"1 June 1998 (Federal Republic of Yugoslavia) ","Location":"Danube River, Serbia","Actors":"Bajram Severdzan, Srdjan Todorovic, Branka Katic ","Running_time":"PT127M / 2h 7min","Description":"Directed by Emir Kusturica.  With Bajram Severdzan, Srdjan Todorovic, Branka Katic, Florijan Ajdini. Matko is a small time hustler, living by the river Danube with his 17 year old son Zare. After a failed business deal he owes money to the much more successful gangster Dadan. Dadan has a sister, Afrodita, that he desperately wants to see get married so they strike a deal: Zare is to marry her. But none of the two care much for an arranged marriage: Zare is in love with Ida, Afrodita is waiting ...","Rated":"R"}