{"imdbID":"tt0102713","Title":"The Prince of Tides","Year":"1991","Director":"Barbra Streisand","Country":"USA","Language":"English","Budget":"$30,000,000 (estimated)","Gross":"$74,787,599 (USA)","Production_Co":"Columbia Pictures Corporation, Barwood Films, Longfellow Pictures ","Runtime":"132 min","Cast":"Nick Nolte, Barbra Streisand, Blythe Danner, Kate Nelligan, Jeroen Krabbé, Melinda Dillon, George Carlin, Jason Gould, Brad Sullivan, Maggie Collier, Lindsay Wray, Brandlyn Whitaker, Justen Woods, Bobby Fain, Trey Yearwood","Plot":"A troubled man talks to his suicidal sister's psychiatrist about their family history and falls in love with her in the process. The Wingo family is from South Carolina, they growing up in a house on a tidal plain. The oldest offspring, Lucas, largely acted as the protector for his younger twins siblings, Tom and Savannah, in light of their dysfunctional growing up, with their shrimper father, Henry, distant and abusive if/when he did pay them any attention, and their mother, Lila, while not doting on them most concerned about appearances and striving for social standing. Now in middle age, Savannah is a New York based poet, Tom, still living on the South Carolina coast outside of Charleston with his wife Sally and their own three doting daughters, taking a break from his high school teaching/football coaching job, while Lucas has long since died while still standing up for himself and his beliefs. Lila, divorced and now remarried with that wealth and social standing she so long desired, receives news that Savannah is in the hospital following her most recent suicide attempt. Not wanting to face the blame ... Written by Huggo","Genre":"Drama","Keywords":"psychiatrist, twin brother, memory, new york, twin","imdbRating":"6.6","imdbVotes":"12,262","Awards":"Nominated for 7 Oscars. Another 3 wins & 10 nominations.","Metascore":"","Released":"25 December 1991 (USA) ","Location":"Beaufort, South Carolina, USA ","Actors":"Barbra Streisand, Nick Nolte, Blythe Danner ","Writer":"Pat Conroy (novel), Pat Conroy (screenplay) | 1 more credit »","Running_time":"PT132M / 2h 12min","Description":"Directed by Barbra Streisand.  With Barbra Streisand, Nick Nolte, Blythe Danner, Kate Nelligan. A troubled man talks to his suicidal sister's psychiatrist about their family history and falls in love with her in the process.","Rated":"R"}