{"imdbID":"tt0167260","Title":"The Lord of the Rings: The Return of the King","Year":"2003","Director":"Peter Jackson","Taglines":"The eye of the enemy is moving. ","Country":"USA, New Zealand","Language":"English, Quenya, Old English, Sindarin","Also_Known_As":"El señor de los anillos: El retorno del rey ","Budget":"$94,000,000 (estimated)","Opening_Weekend":"£15,021,761 (UK) (19 December 2003)","Gross":"$377,019,252 (USA) (28 May 2004)","Production_Co":"New Line Cinema, WingNut Films, The Saul Zaentz Company ","":"Show detailed company contact information on IMDbPro »","Runtime":"201 min | 192 min (DVD Widescreen) | 263 min (Blu-Ray Extended Edition) | 253 min (DVD Special Extended Edition)","Sound_Mix":"DTS-ES | Dolby Digital EX | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The only film to win more than 10 Academy Awards without receiving a single acting nomination. See more »","Goofs":"When Merry and Pippin are dancing on the table at Rohan you can see Gandalf from behind bouncing up and down on his feet but when you see the front of him he is nodding his head and clapping. See more »","Crazy_Credits":"In the theatrical version Sean Bean receives a major on- screen credit at the end of the film, even though he only appears on screen momentarily in a flashback from the first film. See more »","Cast":"Noel Appleby, Ali Astin, Sean Astin, David Aston, John Bach, Sean Bean, Cate Blanchett, Orlando Bloom, Billy Boyd, Sadwyn Brophy, Alistair Browning, Marton Csokas, Richard Edge, Jason Fitch, Bernard Hill","Plot":"Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring. While Frodo & Sam continue to approach Mount Doom to destroy the One Ring, unaware of the path Gollum is leading them, the former Fellowship aid Rohan & Gondor in a great battle in the Pelennor Fields, Minas Tirith and the Black Gates as Sauron wages his last war against Middle-earth. Written by Anonymous","Genre":"Adventure, Drama, Fantasy","Keywords":"orc, epic, ring, battle, king","imdbRating":"8.9","imdbVotes":"1,167,632","Awards":"Won 11 Oscars. Another 162 wins & 106 nominations.","Metascore":"94","Released":"6 February 2004 (India) ","Location":"Dry Creek Quarry, Wellington, New Zealand ","Actors":"Elijah Wood, Viggo Mortensen, Ian McKellen ","Writer":"J.R.R. Tolkien (novel), Fran Walsh (screenplay) | 2 more credits »","Running_time":"PT201M / 3h 21min","Description":"Directed by Peter Jackson.  With Elijah Wood, Viggo Mortensen, Ian McKellen, Orlando Bloom. Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.","Rated":"PG-13"}