{"imdbID":"tt0101507","Title":"Boyz n the Hood","Year":"1991","Director":"John Singleton","Writer":"John Singleton","Country":"USA","Language":"English","Budget":"$6,000,000 (estimated)","Gross":"$57,504,069 (USA)","Production_Co":"Columbia Pictures Corporation ","Runtime":"112 min","Cast":"Hudhail Al-Amir, Lloyd Avery II, Angela Bassett, Mia Bell, Lexie Bigham, Kenneth A. Brown, Nicole Brown, Ceal, Morris Chestnut, Darneicea Corley, John Cothran, Ice Cube, Na'Blonka Durden, Susan Falcon, Jessie Lawrence Ferguson","Plot":"Follows the lives of three young males living in the Crenshaw ghetto of Los Angeles, dissecting questions of race, relationships, violence and future prospects. John Singleton's portrayal of social problems in inner-city Los Angeles takes the form of a tale of three friends growing up together 'in the 'hood.' Half-brothers Doughboy and Ricky Baker are foils for each other's personality, presenting very different approaches to the tough lives they face. Ricky is the 'All-American' athlete, looking to win a football scholarship to USC and seeks salvation through sports, while 'Dough' succumbs to the violence, alcohol, and crime surrounding him in his environment, but maintains a strong sense of pride and code of honor. Between these two is their friend Tre, who is lucky to have a father, 'Furious' Styles, to teach him to have the strength of character to do what is right and to always take responsibility for his actions. Written by Tad Dibbern <DIBBERN_D@a1.mscf.upenn.edu>","Genre":"Crime, Drama","Keywords":"violence, friend, football, drugs, escape","imdbRating":"7.8","imdbVotes":"91,049","Awards":"Nominated for 2 Oscars. Another 10 wins & 12 nominations.","Metascore":"73","Released":"12 July 1991 (USA) ","Location":"5918 Cimarron Street, Los Angeles, California, USA ","Actors":"Cuba Gooding Jr., Laurence Fishburne, Hudhail Al-Amir ","Running_time":"PT112M / 1h 52min","Description":"Directed by John Singleton.  With Cuba Gooding Jr., Laurence Fishburne, Hudhail Al-Amir, Lloyd Avery II. Follows the lives of three young males living in the Crenshaw ghetto of Los Angeles, dissecting questions of race, relationships, violence and future prospects.","Rated":"R"}