{"imdbID":"tt0107822","Title":"The Piano","Year":"1993","Director":"Jane Campion","Writer":"Jane Campion","Country":"New Zealand, Australia, France","Language":"English, British Sign Language, Maori","Budget":"$7,000,000 (estimated)","Gross":"£3,512,343 (UK) (4 February 1994)","Production_Co":"Australian Film Commission, The, CiBy 2000, Jan Chapman Productions ","Runtime":"121 min","Cast":"Holly Hunter, Harvey Keitel, Sam Neill, Anna Paquin, Kerry Walker, Geneviève Lemon, Tungia Baker, Ian Mune, Peter Dennett, Te Whatanui Skipwith, Pete Smith, Bruce Allpress, Cliff Curtis, Carla Rupuha, Mahina Tunui","Plot":"A mute woman along with her young daughter, and her prized piano, are sent to 1850s New Zealand for an arranged marriage to a wealthy landowner, and she's soon lusted after by a local worker on the plantation. It is the mid-nineteenth century. Ada is a mute who has a young daughter, Flora. In an arranged marriage she leaves her native Scotland accompanied by her daughter and her beloved piano. Life in the rugged forests of New Zealand's North Island is not all she may have imagined and nor is her relationship with her new husband Stewart. She suffers torment and loss when Stewart sells her piano to a neighbour, George. Ada learns from George that she may earn back her piano by giving him piano lessons, but only with certain other conditions attached. At first Ada despises George but slowly their relationship is transformed and this propels them into a dire situation. Written by Patrick Dominick <ptd@ccadfa.cc.adfa.oz.au>","Genre":"Drama, Music, Romance","Keywords":"mute, male rear nudity, sex, adultery, male frontal nudity","imdbRating":"7.6","imdbVotes":"62,388","Awards":"Won 3 Oscars. Another 56 wins & 42 nominations.","Metascore":"89","Released":"11 February 1994 (USA) ","Location":"Auckland, New Zealand ","Actors":"Holly Hunter, Harvey Keitel, Sam Neill ","Running_time":"PT121M / 2h 1min","Description":"Directed by Jane Campion.  With Holly Hunter, Harvey Keitel, Sam Neill, Anna Paquin. A mute woman along with her young daughter, and her prized piano, are sent to 1850s New Zealand for an arranged marriage to a wealthy landowner, and she's soon lusted after by a local worker on the plantation.","Rated":"R"}