{"imdbID":"tt0118749","Title":"Boogie Nights","Year":"1997","Director":"Paul Thomas Anderson","Writer":"Paul Thomas Anderson","Taglines":"The life of a dreamer, the days of a business, and the nights in between. ","Country":"USA","Language":"English","Also_Known_As":"Pushing Thirteen ","Budget":"$15,000,000 (estimated)","Opening_Weekend":"$50,168 (USA) (10 October 1997)","Gross":"DEM 265,943 (Germany) (5 June 1998)","Production_Co":"New Line Cinema, Lawrence Gordon Productions, Ghoulardi Film Company ","Runtime":"155 min","Sound_Mix":"Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Paul Thomas Anderson: [long take] The opening scene is three minutes long, taken in a single camera shot, beginning in the street where Jack Horner and Amber Waves drive up and following them as they get out of the car and walk into a nightclub. Most of the characters are introduced in that shot. See more »","Goofs":"When Little Bill complains to the cinematographer about his wife having sex with other men, he says, \"My fucking wife's on the driveway with a fucking ass in her cock.\" Little Bill was supposed to say \"My fucking wife's on the driveway with a fucking COCK in her ASS\", but the director loved the way the incorrect line showed how angry and flustered Bill was, and left the scene intact. See more »","Crazy_Credits":"Towards the end of the credits, Mark Wahlberg's character speaks. See more »","Cast":"Luis Guzmán, Burt Reynolds, Julianne Moore, Rico Bueno, John C. Reilly, Nicole Ari Parker, Don Cheadle, Heather Graham, Mark Wahlberg, William H. Macy, Samson Barkhordarian, Nina Hartley, Brad Braeden, Joanna Gleason, Lawrence Hudd","Plot":"The story of a young man's adventures in the Californian pornography industry of the late 1970s and early 1980s. Adult film director Jack Horner is always on the lookout for new talent and it's only by chance that he meets Eddie Adams who is working as a busboy in a restaurant. Eddie is young, good looking and plenty of libido to spare. Using the screen name Dirk Diggler, he quickly rises to the top of his industry winning awards year after year. Drugs and ego however come between Dirk and those around him and he soon finds that fame is fleeting. Written by garykmcd","Genre":"Drama","Keywords":"1970s, porn industry, san fernando valley california, adult entertainment industry, nightclub","imdbRating":"7.9","imdbVotes":"183,479","Awards":"Nominated for 3 Oscars. Another 29 wins & 47 nominations.","Metascore":"85","Released":"31 October 1997 (USA) ","Location":"16801 Encino Hills Dr., Encino, California, USA ","Actors":"Mark Wahlberg, Julianne Moore, Burt Reynolds ","Running_time":"PT155M / 2h 35min","Description":"Directed by Paul Thomas Anderson.  With Mark Wahlberg, Julianne Moore, Burt Reynolds, Luis Guzmán. The story of a young man's adventures in the Californian pornography industry of the late 1970s and early 1980s.","Rated":"R"}