{"imdbID":"tt0113627","Title":"Leaving Las Vegas","Year":"1995","Director":"Mike Figgis","Country":"USA","Language":"English, Russian","Budget":"$3,600,000 (estimated)","Gross":"$31,968,347 (USA)","Production_Co":"Lumiere Pictures, Lila Cazès Production, A, Initial Productions ","Runtime":"111 min","Cast":"Nicolas Cage, Elisabeth Shue, Julian Sands, Richard Lewis, Steven Weber, Kim Adams, Emily Procter, Stuart Regen, Valeria Golino, Graham Beckel, Albert Henderson, Shashi Bhatia, Carey Lowell, Anne Lange, Thomas Kopache","Plot":"Ben Sanderson, an alcoholic Hollywood screenwriter who lost everything because of his drinking, arrives in Las Vegas to drink himself to death. There, he meets and forms an uneasy friendship and non-interference pact with prostitute Sera. Because his wife left him and took his son with her, screenwriter Ben Sanderson has started drinking, a lot. He's getting more and more isolated and he troubles women in bars because he wants to have sex with them. When he gets fired, he decides to leave everything behind and move to Las Vegas and drink himself to death. In Las Vegas he meets Sera, a prostitute with some problems as well who he moves in with. Written by Marco van Hoof <k_luifje7@hotmail.com>","Genre":"Drama, Romance","Keywords":"alcoholic, prostitute, sex, bar, love","imdbRating":"7.6","imdbVotes":"91,432","Awards":"Won 1 Oscar. Another 30 wins & 27 nominations.","Metascore":"82","Released":"9 February 1996 (USA) ","Location":"Bally's Casino Resort - 3645 Las Vegas Boulevard South, Las Vegas, Nevada, USA ","Actors":"Nicolas Cage, Elisabeth Shue, Julian Sands ","Writer":"John O'Brien (novel), Mike Figgis (screenplay)","Running_time":"PT111M / 1h 51min","Description":"Directed by Mike Figgis.  With Nicolas Cage, Elisabeth Shue, Julian Sands, Richard Lewis. Ben Sanderson, an alcoholic Hollywood screenwriter who lost everything because of his drinking, arrives in Las Vegas to drink himself to death. There, he meets and forms an uneasy friendship and non-interference pact with prostitute Sera.","Rated":"R"}