{"imdbID":"tt0109707","Title":"Ed Wood","Year":"1994","Director":"Tim Burton","Taglines":"When it came to making bad movies, Ed Wood was the best. ","Country":"USA","Language":"English","Also_Known_As":"Ed Vud ","Budget":"$18,000,000 (estimated)","Gross":"$5,887,457 (USA)","Production_Co":"Touchstone Pictures ","Runtime":"127 min","Sound_Mix":"Dolby Digital","Color":"Black and White","Aspect_Ratio":"1.85 : 1","Trivia":"One story claims that the decision to film in black and white was made because no one could decide how Bela Lugosi should look filmed in color. See more »","Goofs":"In the scene where Ed Wood meets Orson Welles, Ed asks him what he's working on. Welles takes a cigar out of his mouth with his right hand. When they cut to a frontal view of Welles, he's holding the cigar with his left hand. When they cut back to a frontal view of Wood, Welles puts the cigar in his mouth with his right hand. See more »","Crazy_Credits":"Immediately preceding the final credits, the film features a \"What Ever Happened To\" and/or \"Where They Are Now\" sequence about Edward D. Wood Jr., Kathy Wood, Bela Lugosi, John Breckinridge, Dolores Fuller, Tor Johnson, Maila Nurmi, Paul Marco' , Conrad Brooks, Tom Mason, and Criswell. The commentaries include such statements as: \"Bela Lugosi never rose from the grave, but after appearing in 103 films, he is more famous than ever. Today, his movie memorabilia outsells Boris Karloff's by a substantial margin\" and \"Dolores Fuller, after leaving Ed, went on to a successful songwriting career. Her compositions include the Elvis Presley hits 'Rock-a-Hula Baby' and 'Do the Clam.'\" See more »","Cast":"Johnny Depp, Martin Landau, Sarah Jessica Parker, Patricia Arquette, Jeffrey Jones, G.D. Spradlin, Vincent D'Onofrio, Bill Murray, Mike Starr, Max Casella, Brent Hinkley, Lisa Marie, George 'The Animal' Steele, Juliet Landau, Clive Rosengren","Plot":"An ambitious but troubled movie director tries his best to fulfill his dream, despite his lack of support. The life of 'Edward D. Wood Jr.', hailed as the worst director (of Plan 9 from Outer Space (1959), Glen or Glenda (1953) and Bride of the Monster (1955)) of all time. Written by Rogerio Santos","Genre":"Biography, Comedy, Drama","Keywords":"director, 1950s, friend, friendship, transvestism","imdbRating":"7.9","imdbVotes":"139,912","Awards":"Won 2 Oscars. Another 22 wins & 15 nominations.","Metascore":"70","Released":"7 October 1994 (USA) ","Location":"California, USA ","Actors":"Johnny Depp, Martin Landau, Sarah Jessica Parker ","Writer":"Rudolph Grey (book), Scott Alexander | 1 more credit »","Running_time":"PT127M / 2h 7min","Description":"Directed by Tim Burton.  With Johnny Depp, Martin Landau, Sarah Jessica Parker, Patricia Arquette. An ambitious but troubled movie director tries his best to fulfill his dream, despite his lack of support.","Rated":"R"}