{"imdbID":"tt0104691","Title":"The Last of the Mohicans","Year":"1992","Director":"Michael Mann","Taglines":"The first American hero.","Country":"USA","Language":"English, French, Mohawk","Also_Known_As":"El último de los mohicanos ","Budget":"$40,000,000 (estimated)","Gross":"$72,455,275 (USA)","Production_Co":"Morgan Creek Productions ","Runtime":"112 min | 117 min (director's cut)","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby (35 mm prints)","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Hawkeye's rifle is a beautiful example of the classic Pennsylvania long rifle - which is all too frequently misnamed the \"Kentucky\" rifle. Considered by many to be among the most beautiful firearms ever crafted, Pennsylvania long rifles often feature a small lock, long, slim, graceful lines, and beautifully carved \"tiger\" maple stocks. The dramatically down-turned \"Roman-nosed\" stock is a hallmark of the Allentown-Bethlehem area school, the rifle in the film being very similar to works created by several well-known gunsmiths from that tradition in 18th and early 19th century. Hermann Rupp, John Rupp, and Jacob Kuntz were among some of the well-known practitioners of this style; an excellent and gorgeous example of the Kuntz's craftsmanship can be seen at the Metropolitan Museum of Art in New York. See more »","Goofs":"During the scene at Fort William Henry where the colonials are arguing with General Munro about releasing them to go back to their farms, Cora is shown standing in a doorway. In the first scene where she is first shown, the doorway is over her left shoulder. In the subsequent scene, the doorway is over her right shoulder and she ultimately exits through this doorway. See more »","Cast":"Daniel Day-Lewis, Madeleine Stowe, Russell Means, Eric Schweig, Jodhi May, Steven Waddington, Wes Studi, Maurice Roëves, Patrice Chéreau, Edward Blatchford, Terry Kinney, Tracey Ellis, Justin M. Rice, Dennis Banks, Pete Postlethwaite","Plot":"Three trappers protect a British Colonel's daughters in the midst of the French and Indian War. British and French troops do battle in colonial America, with aid from various native American war parties. The British troops enlist the help of local colonial militia men, who are reluctant to leave their homes undefended. A budding romance between a British officer's daughter and an independent man who was reared as a Mohican complicates things for the British officer, as the adopted Mohican pursues his own agenda despite the wrath of different people on both sides of the conflict. Written by Ed Sutton <esutton@mindspring.com>","Genre":"Action, Adventure, Drama","Keywords":"revenge, based on novel, french and indian war, colonel, 18th century","imdbRating":"7.8","imdbVotes":"109,598","Awards":"Won 1 Oscar. Another 5 wins & 13 nominations.","Metascore":"76","Released":"25 September 1992 (USA) ","Location":"Asheville, North Carolina, USA ","Actors":"Daniel Day-Lewis, Madeleine Stowe, Russell Means ","Writer":"James Fenimore Cooper (novel), John L. Balderston (adaptation) | 5 more credits »","Running_time":"PT112M / 1h 52min","Description":"Directed by Michael Mann.  With Daniel Day-Lewis, Madeleine Stowe, Russell Means, Eric Schweig. Three trappers protect a British Colonel's daughters in the midst of the French and Indian War.","Rated":"R"}