{"imdbID":"tt0104765","Title":"Love Field","Year":"1992","Director":"Jonathan Kaplan","Writer":"Don Roos","Country":"USA","Language":"English","Budget":"$18,000,000 (estimated)","Gross":"$1,949,148 (USA)","Production_Co":"Sanford/Pillsbury Productions, Via Rosa Productions ","Runtime":"102 min","Cast":"Michelle Pfeiffer, Dennis Haysbert, Stephanie McFadden, Brian Kerwin, Louise Latham, Peggy Rea, Beth Grant, Johnny Ray McGhee, Cooper Huckabee, Troy Evans, Mark Jeffrey Miller, Pearl Jones, Janell McLeod, Bob Minor, Rhoda Griffis","Plot":"Dallas housewife Lurene Hallett's life revolves around the doings of Jacqueline Kennedy. She is devastated when President Kennedy is shot a few hours after she sees him arrive at Love Field... See full summary » Dallas housewife Lurene Hallett's life revolves around the doings of Jacqueline Kennedy. She is devastated when President Kennedy is shot a few hours after she sees him arrive at Love Field. Despite her husband Ray's prohibition, she decides to attend the funeral in Washington D.C. Forced to travel by bus, she befriends Jonell, the young black daughter of Paul Couter. Sensing something wrong, her good intentioned interference leads the mixed race threesome on an increasingly difficult journey to Washington with both the police and Ray looking for them. Written by Jeremy Perkins {J-26}","Genre":"Drama","Keywords":"bus, funeral, bare chested male, photo booth, understanding","imdbRating":"6.7","imdbVotes":"2,788","Awards":"Nominated for 1 Oscar. Another 1 win & 3 nominations.","Metascore":"","Released":"12 February 1993 (USA) ","Location":"California, USA ","Actors":"Michelle Pfeiffer, Dennis Haysbert, Stephanie McFadden ","Running_time":"PT102M / 1h 42min","Description":"Directed by Jonathan Kaplan.  With Michelle Pfeiffer, Dennis Haysbert, Stephanie McFadden, Brian Kerwin. Dallas housewife Lurene Hallett's life revolves around the doings of Jacqueline Kennedy. She is devastated when President Kennedy is shot a few hours after she sees him arrive at Love Field. Despite her husband Ray's prohibition, she decides to attend the funeral in Washington D.C. Forced to travel by bus, she befriends Jonell, the young black daughter of Paul Couter. Sensing something wrong, her...","Rated":"PG-13"}