{"imdbID":"tt0126029","Title":"Shrek","Year":"2001","Taglines":"Its Big! ","Country":"USA","Language":"English","Also_Known_As":"Sreka ","Budget":"$60,000,000 (estimated)","Opening_Weekend":"$42,347,760 (USA) (18 May 2001)","Gross":"$267,652,016 (USA) (30 November 2001)","Production_Co":"DreamWorks Animation, DreamWorks SKG, Pacific Data Images (PDI) ","Runtime":"90 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"First film to win the \"Best Animated Feature\" Oscar in a 2001, beating out Jimmy Neutron: Boy Genius and Monsters, Inc. See more »","Goofs":"When Shrek sits to eat his meal he has a slug on the left-hand side of his plate facing towards him. When he is invaded by the Three Blind Mice the slug is suddenly facing the other way. See more »","Crazy_Credits":"The film opens and closes using the famous \"Disney Fairytale\" storybook method; however the film makes fun of this approach by having Shrek tear a page out and use it as toilet paper. See more »","Cast":"Mike Myers, Eddie Murphy, Cameron Diaz, John Lithgow, Vincent Cassel, Peter Dennis, Clive Pearse, Jim Cummings, Bobby Block, Chris Miller, Cody Cameron, Kathleen Freeman, Michael Galasso, Christopher Knights, Simon J. Smith","Plot":"After his swamp is filled with magical creatures, an ogre agrees to rescue a princess for a villainous lord in order to get his land back. When a green ogre named Shrek discovers his swamp has been 'swamped' with all sorts of fairytale creatures by the scheming Lord Farquaad, Shrek sets out with a very loud donkey by his side to 'persuade' Farquaad to give Shrek his swamp back. Instead, a deal is made. Farquaad, who wants to become the King, sends Shrek to rescue Princess Fiona, who is awaiting her true love in a tower guarded by a fire-breathing dragon. But once they head back with Fiona, it starts to become apparent that not only does Shrek, an ugly ogre, begin to fall in love with the lovely princess, but Fiona is also hiding a huge secret. Written by Film_Fan","Genre":"Animation, Adventure, Comedy","Keywords":"ogre, princess, fairy tale, swamp, donkey","imdbRating":"7.9","imdbVotes":"449,615","Awards":"Won 1 Oscar. Another 36 wins & 59 nominations.","Metascore":"84","Released":"18 May 2001 (USA) ","Actors":"Mike Myers, Eddie Murphy, Cameron Diaz ","Director":"Andrew Adamson, Vicky Jenson","Writer":"William Steig (book), Ted Elliott | 6 more credits »","Running_time":"PT90M / 1h 30min","Description":"Directed by Andrew Adamson, Vicky Jenson.  With Mike Myers, Eddie Murphy, Cameron Diaz, John Lithgow. After his swamp is filled with magical creatures, an ogre agrees to rescue a princess for a villainous lord in order to get his land back.","Rated":"PG"}