{"imdbID":"tt0133093","Title":"The Matrix","Year":"1999","Taglines":"Reality is a thing of the past. ","Country":"USA, Australia","Language":"English","Also_Known_As":"Matrix ","Budget":"$63,000,000 (estimated)","Opening_Weekend":"$27,788,331 (USA) (2 April 1999)","Gross":"$653,151 (Europe) (23 May 2003)","Production_Co":"Warner Bros., Village Roadshow Pictures, Groucho II Film Partnership ","":"Show detailed company contact information on IMDbPro »","Runtime":"136 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"When Tank is uploading the Martial Arts training to Neo, there is a shot of the computer screen as it scrolls through the various Martial Arts styles. The graphics have a computer image of a person and the title of the style below. The fifth one on the screen is entitled \"Drunken Boxing\". Woo-Ping Yuen, the fight choreographer for this movie, was director and fight choreographer for Jackie Chan's early hit, Drunken Master (1978) in which Jackie Chan's character masters the style of Zui Chuan, or Drunken Boxing. Some of the other Martial Arts fighting styles being downloaded are Ju Jitsu, Savate, Kempo, Tae Kwon Do, and, of course, Kung Fu. See more »","Goofs":"When Neo is rescuing Trinity from the falling helicopter, he slides across the roof of a building. When he reaches the edge, his foot hits the block causing it to move, but in a way consistent with a real block whose grout is imperfect; after all, that's a rather large force. See more »","Crazy_Credits":"At the end of all the credits, the URL for the (now defunct) website of the film is given, www.whatisthematrix.com, along with a password, 'steak'. There's a 'secret' link on the page that requests a password. See more »","Cast":"Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss, Hugo Weaving, Gloria Foster, Joe Pantoliano, Marcus Chong, Julian Arahanga, Matt Doran, Belinda McClory, Anthony Ray Parker, Paul Goddard, Robert Taylor, David Aston, Marc Aden Gray","Plot":"A computer hacker learns from mysterious rebels about the true nature of his reality and his role in the war against its controllers. Thomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. Morpheus awakens Neo to the real world, a ravaged wasteland where most of humanity have been captured by a race of machines that live off of the humans' body heat and electrochemical energy and who imprison their minds within an artificial reality known as the Matrix. As a rebel against the machines, Neo must return to the Matrix and confront the agents: super-powerful computer programs devoted to snuffing out Neo and the entire human rebellion. Written by redcommander27","Genre":"Action, Sci-Fi","Keywords":"artificial reality, simulated reality, questioning reality, matrix, computer","imdbRating":"8.7","imdbVotes":"1,169,146","Awards":"Won 4 Oscars. Another 33 wins & 42 nominations.","Metascore":"73","Released":"31 March 1999 (USA) ","Location":"AON Tower, Kent Street, Sydney, New South Wales, Australia ","Actors":"Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss ","Director":"Lana Wachowski (as The Wachowski Brothers), Lilly Wachowski (as The Wachowski Brothers)","Writer":"Lilly Wachowski (as The Wachowski Brothers), Lana Wachowski (as The Wachowski Brothers)","Running_time":"PT136M / 2h 16min","Description":"Directed by Lana Wachowski, Lilly Wachowski.  With Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss, Hugo Weaving. A computer hacker learns from mysterious rebels about the true nature of his reality and his role in the war against its controllers.","Rated":"R"}