{"imdbID":"tt0111161","Title":"The Shawshank Redemption","Year":"1994","Director":"Frank Darabont","Taglines":"Fear can hold you prisoner. Hope can set you free.","Certificate":"U/A | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Die Verurteilten ","Budget":"$25,000,000 (estimated)","Gross":"£2,344,349 (UK) (19 May 1995)","Production_Co":"Castle Rock Entertainment ","":"Show detailed company contact information on IMDbPro »","Runtime":"142 min","Sound_Mix":"Dolby Digital","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"The role of Andy Dufresne was originally offered to Tom Hanks, who couldn't accept due to scheduling conflicts with Forrest Gump (1994). Hanks did, however, work on Frank Darabont's next film, The Green Mile (1999), also an adaptation of a Stephen King novel which takes place in a prison. See more »","Goofs":"When Red and Andy meet for the first time, an extra is seen behind each of them. It is the same scene but as the lines were filmed at different times, the extra is wearing different shirts - one prisoner shirt the day that Red's lines were shot, and a different shirt behind Andy the day his lines were filmed. See more »","Crazy_Credits":"The man who cried and was beaten when Andy first arrived is listed and credited as \"Fat Ass\" -- the other inmates' nickname for him. See more »","Cast":"Tim Robbins, Morgan Freeman, Bob Gunton, William Sadler, Clancy Brown, Gil Bellows, Mark Rolston, James Whitmore, Jeffrey DeMunn, Larry Brandenburg, Neil Giuntoli, Brian Libby, David Proval, Joseph Ragno, Jude Ciccolella","Plot":"Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency. Chronicles the experiences of a formerly successful banker as a prisoner in the gloomy jailhouse of Shawshank after being found guilty of a crime he claims he did not commit. The film portrays the man's unique way of dealing with his new, torturous life; along the way he befriends a number of fellow prisoners, most notably a wise long-term inmate named Red. Written by J-S-Golden","Genre":"Crime, Drama","Keywords":"prison, escape from prison, wrongful imprisonment, prison cell search, first person narration","imdbRating":"9.3","imdbVotes":"1,623,343","Awards":"Nominated for 7 Oscars. Another 14 wins & 20 nominations.","Metascore":"80","Released":"14 October 1994 (USA) ","Location":"St. Croix, U.S. Virgin Islands ","Actors":"Tim Robbins, Morgan Freeman, Bob Gunton ","Writer":"Stephen King (short story \"Rita Hayworth and Shawshank Redemption\"), Frank Darabont (screenplay)","Running_time":"PT142M / 2h 22min","Description":"Directed by Frank Darabont.  With Tim Robbins, Morgan Freeman, Bob Gunton, William Sadler. Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.","Rated":"U/A"}