{"imdbID":"tt0101902","Title":"For the Boys","Year":"1991","Director":"Mark Rydell","Country":"USA","Language":"English","Budget":"$40,000,000 (estimated)","Gross":"$17,860,280 (USA)","Production_Co":"All Girl Productions ","Runtime":"138 min","Cast":"Bette Midler, James Caan, George Segal, Patrick O'Neal, Christopher Rydell, Arye Gross, Norman Fell, Rosemary Murphy, Bud Yorkin, Dori Brenner, Jack Sheldon, Karen Martin, Shannon Wilcox, Michael Greene, Melissa Manchester","Plot":"With the help of the singer and dancer Dixie Leonhard US-Entertainer Eddie Sparks wants to bring some fun to the soldiers during World War II. Becoming a perfect team they tour from North ... See full summary » With the help of the singer and dancer Dixie Leonhard US-Entertainer Eddie Sparks wants to bring some fun to the soldiers during World War II. Becoming a perfect team they tour from North Africa to the Pacific to act for \"the boys\". Later they continue their work but when the author Silver gets involved into McCarthy's campaign and is being fired by Eddie, Dixie turns away from him, too. Written by Volker Boehm","Genre":"Comedy, Drama, Music","Keywords":"singer, entertainer, dancer, korean war, song","imdbRating":"6.2","imdbVotes":"4,055","Awards":"Nominated for 1 Oscar. Another 1 win & 2 nominations.","Metascore":"","Released":"27 November 1991 (USA) ","Location":"Santa Clarita, California, USA ","Actors":"Bette Midler, James Caan, George Segal ","Writer":"Neal Jimenez (story), Lindy Laub (story) | 3 more credits »","Running_time":"PT138M / 2h 18min","Description":"Directed by Mark Rydell.  With Bette Midler, James Caan, George Segal, Patrick O'Neal. With the help of the singer and dancer Dixie Leonhard US-Entertainer Eddie Sparks wants to bring some fun to the soldiers during World War II. Becoming a perfect team they tour from North Africa to the Pacific to act for \"the boys\". Later they continue their work but when the author Silver gets involved into McCarthy's campaign and is being fired by Eddie, Dixie turns away from him, too.","Rated":"R"}