{"imdbID":"tt0105107","Title":"Passion Fish","Year":"1992","Director":"John Sayles","Writer":"John Sayles","Country":"USA","Language":"English","Budget":"$3,330,000 (estimated)","Gross":"$5,414,619 (USA)","Production_Co":"Atchafalaya ","Runtime":"135 min","Cast":"Mary McDonnell, Angela Bassett, Lenore Banks, Will Mahoney, Nelle Stokes, Brett Ardoin, Michael Mantell, Daniel Dupont, Chuck Cain, Shana Ledet Qualls, Paula Lafleur, Maggie Renzi, Marianne Muellerleile, Victoria Edwards, Amanda Carlin","Plot":"May-Alice Culhane was a successful soap opera star, but a car accident has left her bound to a wheelchair. She returns to her now-empty family home in the bayous of Louisiana which she had ... See full summary » May-Alice Culhane was a successful soap opera star, but a car accident has left her bound to a wheelchair. She returns to her now-empty family home in the bayous of Louisiana which she had eagerly left years before. She drinks heavily and vents her bitterness on the succession of nurses who are hired to take care of her and immediately quit because she is so unbearable. Chantelle is the latest of these nurses, and May-Alice is told that Chantelle is the last nurse she'll get. Chantelle for reasons of her own, is also in a position where she badly needs the job to work out. The movie focuses on how these two women become friends and help each other heal emotionally. Written by Reid Gagle","Genre":"Drama","Keywords":"louisiana, accident, actress, soap opera, wheelchair","imdbRating":"7.5","imdbVotes":"4,193","Awards":"Nominated for 2 Oscars. Another 2 wins & 7 nominations.","Metascore":"","Released":"11 December 1992 (USA) ","Location":"Elton, Louisiana, USA ","Actors":"Mary McDonnell, Alfre Woodard, Angela Bassett ","Running_time":"PT135M / 2h 15min","Description":"Directed by John Sayles.  With Mary McDonnell, Alfre Woodard, Angela Bassett, Lenore Banks. May-Alice Culhane was a successful soap opera star, but a car accident has left her bound to a wheelchair. She returns to her now-empty family home in the bayous of Louisiana which she had eagerly left years before. She drinks heavily and vents her bitterness on the succession of nurses who are hired to take care of her and immediately quit because she is so unbearable. Chantelle is the latest of...","Rated":"R"}