{"imdbID":"tt0110428","Title":"The Madness of King George","Year":"1994","Director":"Nicholas Hytner","Country":"UK","Language":"English","Gross":"$15,238,994 (USA)","Production_Co":"Samuel Goldwyn Company, The, Channel Four Films, Close Call Films ","Runtime":"104 min","Cast":"Rupert Graves, Helen Mirren, Amanda Donohoe, Charlotte Curley, Peter Bride-Kirk, Eve Camden, Thomas Copeland, Joanna Hall, Cassandra Halliburton, Russell Martin, Natalie Palys, Rupert Everett, Julian Rhind-Tutt, David Leon, Martin Julier","Plot":"A meditation on power and the metaphor of the body of state, based on the real episode of dementia experienced by George III [now suspected a victim of porphyria, a blood disorder]. As he ... See full summary » A meditation on power and the metaphor of the body of state, based on the real episode of dementia experienced by George III [now suspected a victim of porphyria, a blood disorder]. As he loses his senses, he becomes both more alive and more politically marginalized; neither effect desirable to his lieutenants, who jimmy the rules to avoid a challenge to regal authority, raising the question of who is really in charge. Written by Dan Hartung <dhartung@mcs.com>","Genre":"Biography, Comedy, Drama","Keywords":"aristocracy, 18th century, king, england, porphyria","imdbRating":"7.3","imdbVotes":"11,834","Awards":"Won 1 Oscar. Another 15 wins & 18 nominations.","Metascore":"","Released":"28 December 1994 (USA) ","Location":"Arundel Castle, Arundel, West Sussex, England, UK ","Actors":"Nigel Hawthorne, Helen Mirren, Rupert Graves ","Writer":"Alan Bennett (play), Alan Bennett (screenplay)","Running_time":"PT104M / 1h 44min","Description":"Directed by Nicholas Hytner.  With Nigel Hawthorne, Helen Mirren, Rupert Graves, Amanda Donohoe. A meditation on power and the metaphor of the body of state, based on the real episode of dementia experienced by George III [now suspected a victim of porphyria, a blood disorder]. As he loses his senses, he becomes both more alive and more politically marginalized; neither effect desirable to his lieutenants, who jimmy the rules to avoid a challenge to regal authority, raising the question of ...","Rated":"PG-13"}