{"imdbID":"tt0116999","Title":"Marvin's Room","Year":"1996","Director":"Jerry Zaks","Country":"USA","Language":"English","Budget":"$23,000,000 (estimated)","Gross":"DEM 77,089 (Germany) (5 June 1998)","Production_Co":"Scott Rudin Productions, Tribeca Productions, Marvin Productions ","Runtime":"98 min","Cast":"Meryl Streep, Leonardo DiCaprio, Diane Keaton, Robert De Niro, Hume Cronyn, Gwen Verdon, Hal Scardino, Dan Hedaya, Margo Martindale, Cynthia Nixon, Kelly Ripa, John Callahan, Olga Merediz, Joe Lisi, Steve DuMouchel","Plot":"A leukemia patient attempts to end a 20-year feud with her sister to get her bone marrow. Estranged since their father's first stroke some 17 years earlier, Lee and Bessie lead separate lives in separate states. Lee's son, Hank, finds himself committed to a mental institution after setting fire to his mother's house. His younger brother, Charlie, seems unfazed by his brother's eccentricities or his mother's seeming disinterest. When Lee comes to the asylum to spring Hank for a week in Florida so that he can be tested as a possible bone marrow donor for Bessie, Hank is incredulous. \"I didn't even know you had a sister,\" he says. \"Remember, every Christmas, when I used to say 'Well, looks like Aunt Bessie didn't send us a card again this year?'\" \"Oh yeah,\" Hank says. Meanwhile, Marvin, the two women's bedridden father, has \"been dying for the past twenty years.\" \"He's doing it real slow so I don't miss anything,\" Bessie tells Dr. Wally. In Bessie's regular doctor's absence, it has fallen to Dr. Wally to inform Bessie that she has leukemia and will die without a bone marrow ... Written by Mark Fleetwood <mfleetwo@mail.coin.missouri.edu>","Genre":"Drama","Keywords":"leukemia, transplant, nursing home, house, fire","imdbRating":"6.7","imdbVotes":"19,474","Awards":"Nominated for 1 Oscar. Another 4 wins & 12 nominations.","Metascore":"68","Released":"28 February 1997 (USA) ","Location":"Greystone Park & Mansion - 905 Loma Vista Drive, Beverly Hills, California, USA ","Actors":"Meryl Streep, Leonardo DiCaprio, Diane Keaton ","Writer":"Scott McPherson (play), Scott McPherson (screenplay)","Running_time":"PT98M / 1h 38min","Description":"Directed by Jerry Zaks.  With Meryl Streep, Leonardo DiCaprio, Diane Keaton, Robert De Niro. A leukemia patient attempts to end a 20-year feud with her sister to get her bone marrow.","Rated":"PG-13"}