{"imdbID":"tt0161023","Title":"Tumbleweeds","Year":"1999","Director":"Gavin O'Connor","Country":"USA","Language":"English","Budget":"$312,000 (estimated)","Gross":"$1,281,176 (USA) (14 January 2000)","Production_Co":"Spanky Pictures, Solaris, River One Films ","Runtime":"102 min","Cast":"Janet McTeer, Kimberly J. Brown, Jay O. Sanders, Gavin O'Connor, Laurel Holloman, Lois Smith, Michael J. Pollard, Ashley Buccille, Cody McMains, Linda Porter, Brian Tahash, Josh Carmichael, Dennis Ford, Sara Downing, Joel Polis","Plot":"A woman constantly runs from town to town with her 12 year old daughter to escape failed relationships. The film opens with one escape and the shift into a new start in San Diego. There Mom... See full summary » A woman constantly runs from town to town with her 12 year old daughter to escape failed relationships. The film opens with one escape and the shift into a new start in San Diego. There Mom takes up with a controlling trucker and fights with her weirdo boss. Meanwhile, the daughter, used to making the constant shifts, finds a fit at school including getting chosen for a play lead. Written by John Sacksteder <jsackste@bellsouth.net>","Genre":"Drama, Comedy","Keywords":"fight, boss, written and directed by cast member, reference to william shakespeare, white trash","imdbRating":"6.7","imdbVotes":"2,901","Awards":"Nominated for 1 Oscar. Another 10 wins & 11 nominations.","Metascore":"75","Released":"3 March 2000 (UK) ","Location":"Agoura Hills, California, USA ","Actors":"Janet McTeer, Kimberly J. Brown, Jay O. Sanders ","Writer":"Angela Shelton (story), Gavin O'Connor (screenplay) | 1 more credit »","Running_time":"PT102M / 1h 42min","Description":"Directed by Gavin O'Connor.  With Janet McTeer, Kimberly J. Brown, Jay O. Sanders, Gavin O'Connor. A woman constantly runs from town to town with her 12 year old daughter to escape failed relationships. The film opens with one escape and the shift into a new start in San Diego. There Mom takes up with a controlling trucker and fights with her weirdo boss. Meanwhile, the daughter, used to making the constant shifts, finds a fit at school including getting chosen for a play lead.","Rated":"PG-13"}