{"imdbID":"tt0140352","Title":"The Insider","Year":"1999","Director":"Michael Mann","Country":"USA","Language":"English, Japanese, Arabic, Persian","Budget":"$68,000,000 (estimated)","Gross":"$28,965,197 (USA) (21 April 2000)","Production_Co":"Blue Lion Entertainment, Digital Image Associates, Forward Pass ","Runtime":"157 min","Cast":"Al Pacino, Russell Crowe, Christopher Plummer, Diane Venora, Philip Baker Hall, Lindsay Crouse, Debi Mazar, Stephen Tobolowsky, Colm Feore, Bruce McGill, Gina Gershon, Michael Gambon, Rip Torn, Lynne Thigpen, Hallie Kate Eisenberg","Plot":"A research chemist comes under personal and professional attack when he decides to appear in a \"60 Minutes\" expose on Big Tobacco. Balls-out \"60 Minutes\" producer Lowell Bergman sniffs a story when a former research biologist for Brown & Williamson, Jeff Wigand, won't talk to him. When the company leans hard on Wigand to honor a confidentiality agreement, he gets his back up. Trusting Bergman and despite a crumbling marriage, he goes on camera for a Mike Wallace interview and risks arrest for contempt of court. Westinghouse is negotiating to buy CBS, so CBS attorneys advise CBS News to shelve the interview and avoid a lawsuit. \"60 Minutes\" and CBS News bosses cave, Wigand is hung out to dry, Bergman is compromised, and the CEOs of Big Tobacco may get away with perjury. Will the truth out? Written by <jhailey@hotmail.com>","Genre":"Biography, Drama, Thriller","Keywords":"whistleblower, cbs, tobacco, research, cbs news","imdbRating":"7.9","imdbVotes":"130,508","Awards":"Nominated for 7 Oscars. Another 23 wins & 49 nominations.","Metascore":"84","Released":"5 November 1999 (USA) ","Location":"Long Beach Polytechnic High School - 1600 Atlantic Avenue, Long Beach, California, USA ","Actors":"Russell Crowe, Al Pacino, Christopher Plummer ","Writer":"Marie Brenner (article), Eric Roth | 1 more credit »","Running_time":"PT157M / 2h 37min","Description":"Directed by Michael Mann.  With Russell Crowe, Al Pacino, Christopher Plummer, Diane Venora. A research chemist comes under personal and professional attack when he decides to appear in a \"60 Minutes\" expose on Big Tobacco.","Rated":"R"}