{"imdbID":"tt0198781","Title":"Monsters, Inc.","Year":"2001","Taglines":"Monsters, Inc. : We Scare Because We Care ","Certificate":"G | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Hidden City ","Budget":"$115,000,000 (estimated)","Opening_Weekend":"$62,577,067 (USA) (2 November 2001)","Gross":"$289,907,418 (USA) (26 April 2013)","Production_Co":"Walt Disney Pictures, Pixar Animation Studios ","":"Show detailed company contact information on IMDbPro »","Runtime":"92 min","Sound_Mix":"SDDS | Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Boo's real name is Mary, as shown briefly on one of the crayon drawings she shows to Sulley in the scene where Boo is going to sleep on Sulley's bed. The actress who provided the voice of Boo is Mary Gibbs. See more »","Goofs":"In the international version of the video/DVD several instances of written English text have been replaced with universal symbols (see Alternate Versions). However on several occasions they switch back to the original appearance. For instance: The \"Standby/Scare\" sign in the factory, the \"Contamination alert\" on the video wall during the first 2319 and the joke on the video wall in the final scene. See more »","Crazy_Credits":"There is an eye following the credits at one point. See more »","Cast":"John Goodman, Billy Crystal, Mary Gibbs, Steve Buscemi, James Coburn, Jennifer Tilly, Bob Peterson, John Ratzenberger, Frank Oz, Daniel Gerson, Steve Susskind, Bonnie Hunt, Jeff Pidgeon, Samuel Lord Black, Jack Angel","Plot":"In order to power the city, monsters have to scare children so that they scream. However, the children are toxic to the monsters, and after a child gets through, two monsters realize things may not be what they think. A city of monsters with no humans called Monstropolis centers around the city's power company, Monsters, Inc. The lovable, confident, tough, furry blue behemoth-like giant monster named James P. Sullivan (better known as Sulley) and his wisecracking best friend, short, green cyclops monster Mike Wazowski, discover what happens when the real world interacts with theirs in the form of a 2-year-old baby girl dubbed \"Boo,\" who accidentally sneaks into the monster world with Sulley one night. And now it's up to Sulley and Mike to send Boo back in her door before anybody finds out, especially two evil villains such as Sulley's main rival as a scarer, chameleon-like Randall (a monster that Boo is very afraid of), who possesses the ability to change the color of his skin, and Mike and Sulley's boss Mr. Waternoose, the chairman and chief executive officer of Monsters, Inc. Written by Anthony Pereyra {hypersonic91@yahoo.com}","Genre":"Animation, Adventure, Comedy","Keywords":"monster, scream, friend, best friend, rival","imdbRating":"8.1","imdbVotes":"555,770","Awards":"Won 1 Oscar. Another 13 wins & 38 nominations.","Metascore":"78","Released":"2 November 2001 (USA) ","Location":"Pixar Animation Studios - 1200 Park Avenue, Emeryville, California, USA ","Actors":"Billy Crystal, John Goodman, Mary Gibbs ","Director":"Pete Docter, David Silverman | 1 more credit »","Writer":"Pete Docter (original story by), Jill Culton (original story by) | 4 more credits »","Running_time":"PT92M / 1h 32min","Description":"Directed by Pete Docter, David Silverman, Lee Unkrich.  With Billy Crystal, John Goodman, Mary Gibbs, Steve Buscemi. In order to power the city, monsters have to scare children so that they scream. However, the children are toxic to the monsters, and after a child gets through, two monsters realize things may not be what they think.","Rated":"G"}