{"imdbID":"tt0110322","Title":"Legends of the Fall","Year":"1994","Director":"Edward Zwick","Taglines":"The men of the Ludlow family. A woman's grace brought them together. Then her passion tore them apart. ","Country":"USA","Language":"English, Cornish","Also_Known_As":"Leyendas de pasión ","Budget":"$30,000,000 (estimated)","Gross":"£2,403,399 (UK) (19 May 1995)","Production_Co":"TriStar Pictures, Bedford Falls Company, The, Pangaea ","Runtime":"133 min","Sound_Mix":"SDDS (8 channels)| Dolby","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Johnny Depp was offered, and turned down, the role of Tristan Ludlow. See more »","Goofs":"When Tristan is preparing his horse to leave, after almost assaulting Susannah with his knife, he is shown tying a blanket to his saddle. As the shot changes from Tristan to Susannah's perspective, Tristan's hand positions switch constantly, from the top of the blanket to the bottom. See more »","Cast":"Brad Pitt, Anthony Hopkins, Aidan Quinn, Julia Ormond, Henry Thomas, Karina Lombard, Tantoo Cardinal, Gordon Tootoosis, Paul Desmond, Christina Pickles, Robert Wisden, John Novak, Kenneth Welsh, Bill Dow, Sam Sarkar","Plot":"Epic tale of three brothers and their father living in the remote wilderness of 1900s USA and how their lives are affected by nature, history, war, love and betrayal. Set in the Rocky Mountains of Montana in the early 1900s, this is a tale of love, betrayal, and brotherhood. After being discharged, Colonel Ludlow decides to raise his three sons in the wilds of Montana, where they can grow up away from the government and society he has learned to despise. The three brothers mature and seem to have an unbreakable bond, until Susanna enters their lives. When Samuel, the youngest of the three, returns from college he brings with him his beautiful fiancée, Susanna. The eldest son, Alfred, soon finds himself in love with his brother's fiancée, and things get worse when he discovers a growing passion between Susanna and Tristan. Colonel Ludlow's favorite son, Tristan is willful and as wild as the mountains. As the brothers set out to fight a war in Europe, suspicion and jealousy threatens to tear apart their once indestructible bond. Written by saunders11@yahoo.com","Genre":"Drama, Romance, War","Keywords":"usa, epic, passion, heart, killing an animal","imdbRating":"7.5","imdbVotes":"108,770","Awards":"Won 1 Oscar. Another 1 win & 8 nominations.","Metascore":"45","Released":"13 January 1995 (USA) ","Location":"43 Powell Street, Vancouver, British Columbia, Canada ","Actors":"Brad Pitt, Anthony Hopkins, Aidan Quinn ","Writer":"Susan Shilliday (screenplay), William D. Wittliff (screenplay) (as Bill Wittliff) | 1 more credit »","Running_time":"PT133M / 2h 13min","Description":"Directed by Edward Zwick.  With Brad Pitt, Anthony Hopkins, Aidan Quinn, Julia Ormond. Epic tale of three brothers and their father living in the remote wilderness of 1900s USA and how their lives are affected by nature, history, war, love and betrayal.","Rated":"R"}