{"imdbID":"tt0113568","Title":"Ghost in the Shell","Year":"1995","Director":"Mamoru Oshii","Taglines":"It's found its voice... now it needs a body. ","Certificate":"Not Rated | See all certifications »","Country":"Japan","Language":"Japanese","Also_Known_As":"Armored Riot Police ","Budget":"JPY 600,000,000 (estimated)","Production_Co":"Bandai Visual Company, Kôdansha, Production I.G. ","Runtime":"83 min","Sound_Mix":"Dolby | Dolby Digital (5.1 surround)","Color":"Color | Color (Eastmancolor)","Aspect_Ratio":"1.85 : 1","Trivia":"In the scene where Section 6 retrieves Project 2501, the programming language on Dr. Willis' terminal screen is actual C code. See more »","Cast":"Atsuko Tanaka, Akio Ôtsuka, Kôichi Yamadera, Yutaka Nakano, Tamio Ôki, Tesshô Genda, Namaki Masakazu, Masato Yamanouchi, Shinji Ogawa, Mitsuru Miyamoto, Kazuhiro Yamaji, Shigeru Chiba, Hiroshi Yanaka, Ginzô Matsuo, Takashi Matsuyama","Plot":"A cyborg policewoman and her partner hunt a mysterious and powerful hacker called the Puppet Master. The year is 2029. The world has become intensively information oriented and humans are well-connected to the network. Crime has developed into a sophisticated stage by hacking into the interactive network. To prevent this, Section 9 is formed. These are cyborgs with incredible strengths and abilities that can access any network on Earth. Written by L.H. Wong <as9401k56@ntuvax.ntu.ac.sg>","Genre":"Animation, Action, Mystery","Keywords":"cyborg, section 9, hacker, gun in a briefcase, ghost in the machine","imdbRating":"8.0","imdbVotes":"75,262","Awards":"5 wins & 7 nominations.","Metascore":"","Released":"29 March 1996 (USA) ","Actors":"Atsuko Tanaka, Iemasa Kayumi, Akio Ôtsuka ","Writer":"Kazunori Itô (screenplay), Masamune Shirow (comic)","Running_time":"PT83M / 1h 23min","Description":"Directed by Mamoru Oshii.  With Atsuko Tanaka, Iemasa Kayumi, Akio Ôtsuka, Kôichi Yamadera. A cyborg policewoman and her partner hunt a mysterious and powerful hacker called the Puppet Master.","Rated":"NOT RATED"}