{"imdbID":"tt0114388","Title":"Sense and Sensibility","Year":"1995","Director":"Ang Lee","Country":"USA, UK","Language":"English, French","Budget":"$16,500,000 (estimated)","Gross":"$42,700,000 (USA)","Production_Co":"Columbia Pictures Corporation, Mirage Enterprises ","Runtime":"136 min","Cast":"James Fleet, Tom Wilkinson, Harriet Walter, Kate Winslet, Emma Thompson, Gemma Jones, Hugh Grant, Emilie François, Elizabeth Spriggs, Robert Hardy, Ian Brimble, Isabelle Amyes, Alan Rickman, Greg Wise, Alexander John","Plot":"Rich Mr. Dashwood dies, leaving his second wife and her three daughters poor by the rules of inheritance. The two eldest daughters are the titular opposites. When Mr. Dashwood dies, he must leave the bulk of his estate to the son by his first marriage, which leaves his second wife and their three daughters (Elinor, Marianne, and Margaret) in straitened circumstances. They are taken in by a kindly cousin, but their lack of fortune affects the marriageability of both practical Elinor and romantic Marianne. When Elinor forms an attachment for the wealthy Edward Ferrars, his family disapproves and separates them. And though Mrs. Jennings tries to match the worthy (and rich) Colonel Brandon to her, Marianne finds the dashing and fiery John Willoughby more to her taste. Both relationships are sorely tried. Written by Kathy Li","Genre":"Drama, Romance","Keywords":"inheritance, female protagonist, horseback riding, three word title, 1810s","imdbRating":"7.7","imdbVotes":"76,004","Awards":"Won 1 Oscar. Another 31 wins & 44 nominations.","Metascore":"84","Released":"26 January 1996 (USA) ","Location":"Berry Pomeroy Church, Berry Pomeroy, Devon, England, UK ","Actors":"Emma Thompson, Kate Winslet, James Fleet ","Writer":"Jane Austen (novel), Emma Thompson (screenplay)","Running_time":"PT136M / 2h 16min","Description":"Directed by Ang Lee.  With Emma Thompson, Kate Winslet, James Fleet, Tom Wilkinson. Rich Mr. Dashwood dies, leaving his second wife and her three daughters poor by the rules of inheritance. The two eldest daughters are the titular opposites.","Rated":"PG"}