{"imdbID":"tt0105695","Title":"Unforgiven","Year":"1992","Director":"Clint Eastwood","Writer":"David Webb Peoples","Taglines":"It's a hell of a thing, killing a man","Country":"USA","Language":"English","Also_Known_As":"Los imperdonables ","Budget":"$14,400,000 (estimated)","Gross":"$101,157,447 (USA)","Production_Co":"Warner Bros., Malpaso Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"131 min","Sound_Mix":"Dolby (as Dolby Stereo)","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Ranked #4 on the American Film Institute's list of the 10 greatest films in the genre \"Western\" in June 2008. See more »","Goofs":"When Little Bill is first confronting English Bob there is a 50 state American Flag behind Little Bill. The 50 state flag wouldn't be adopted until July 4th 1960. See more »","Crazy_Credits":"Instead of the usual Warner Bros. closing logo, it shows the Warner Bros. shield in black and white without a banner. See more »","Cast":"Clint Eastwood, Gene Hackman, Morgan Freeman, Richard Harris, Jaimz Woolvett, Saul Rubinek, Frances Fisher, Anna Levine, David Mucci, Rob Campbell, Anthony James, Tara Frederick, Beverley Elliott, Liisa Repo-Martell, Josie Smith","Plot":"Retired Old West gunslinger William Munny reluctantly takes on one last job, with the help of his old partner and a young man. The town of Big Whisky is full of normal people trying to lead quiet lives. Cowboys try to make a living. Sheriff 'Little Bill' tries to build a house and keep a heavy-handed order. The town whores just try to get by.Then a couple of cowboys cut up a whore. Dissatisfied with Bill's justice, the prostitutes put a bounty on the cowboys. The bounty attracts a young gun billing himself as 'The Schofield Kid', and aging killer William Munny. Munny reformed for his young wife, and has been raising crops and two children in peace. But his wife is gone. Farm life is hard. And Munny is no good at it. So he calls his old partner Ned, saddles his ornery nag, and rides off to kill one more time, blurring the lines between heroism and villainy, man and myth. Written by Charlie Ness","Genre":"Western","Keywords":"one last job, leaving flowers on a grave, visiting wife's grave, reputation, englishman","imdbRating":"8.3","imdbVotes":"267,240","Awards":"Won 4 Oscars. Another 36 wins & 28 nominations.","Metascore":"82","Released":"7 August 1992 (USA) ","Location":"Alberta, Canada ","Actors":"Clint Eastwood, Gene Hackman, Morgan Freeman ","Running_time":"PT131M / 2h 11min","Description":"Directed by Clint Eastwood.  With Clint Eastwood, Gene Hackman, Morgan Freeman, Richard Harris. Retired Old West gunslinger William Munny reluctantly takes on one last job, with the help of his old partner and a young man.","Rated":"R"}