{"imdbID":"tt0125664","Title":"Man on the Moon","Year":"1999","Director":"Milos Forman","Taglines":"\"Hello, my name is Andy and people are talking about me!\" ","Country":"UK, Germany, Japan, USA","Language":"English","Also_Known_As":"Andy Kaufman ","Budget":"$52,000,000 (estimated)","Opening_Weekend":"$7,515,585 (USA) (24 December 1999)","Gross":"£501,786 (UK) (12 May 2000)","Production_Co":"Universal Pictures, Mutual Film Company, Jersey Films ","Runtime":"118 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Jim Carrey and Danny DeVito were both Batman villains. Jim Carrey played the Riddler in Batman Forever (1995) and Danny DeVito played the Penguin in Batman Returns (1992). See more »","Goofs":"At the college theatre, several theatrical lighting fixtures can be seen from the back stage view. These are known as Electronic Theatre Control's \"Source 4\" fixtures and were not produced until 1995. See more »","Crazy_Credits":"At the beginning of the movie, Andy appears, criticizing the movie as \"so stupid\" and \"terrible,\" and complains about the movie's events being changed for dramatic purposes. He then says that he has \"cut out all the baloney,\" making the movie \"much shorter. In fact, this is the end of the movie.\" To get the audience to leave, he cues up a record, and the end credits begin to roll, through the cast list, stunt performers, unit production manager, first assistant director, and second assistant director. See more »","Cast":"Jim Carrey, Gerry Becker, Greyson Erik Pendry, Brittany Colonna, Leslie Lyles, Bobby Boriello, George Shapiro, Danny DeVito, Budd Friedman, Tom Dreesen, Thomas Armbruster, Pamela Abdy, Wendy Polland, Cash Oshman, Matt Price","Plot":"The life and career of a legendary comedian, Andy Kaufman. Man on the Moon is a biographical movie on the late comedian Andy Kaufman. Kaufman, along with his role on Taxi (1978), was famous for being the self-declared Intergender Wrestling Champion of the world. After beating women time and time again, Jerry Lawler (who plays himself in the movie), a professional wrestler, got tired of seeing all of this and decided to challenge Kaufman to a match. In most of the matches the two had, Lawler prevailed with the piledriver, which is a move by spiking an opponent head-first into the mat. One of the most famous moments in this feud was in the early 80s when Kaufman threw coffee on Lawler on Late Night with David Letterman (1982), got into fisticuffs with Lawler, and proceeded to sue NBC. Written by Eli Boorstein <uahp@rocketmail.com>","Genre":"Biography, Comedy, Drama","Keywords":"comedian, wrestling, eccentric, andy kaufman, wrestler","imdbRating":"7.4","imdbVotes":"98,907","Awards":"Won 1 Golden Globe. Another 4 wins & 22 nominations.","Metascore":"58","Released":"22 December 1999 (USA) ","Location":"Ambassador Hotel - 3400 Wilshire Boulevard, Los Angeles, California, USA ","Actors":"Jim Carrey, Danny DeVito, Gerry Becker ","Writer":"Scott Alexander, Larry Karaszewski","Running_time":"PT118M / 1h 58min","Description":"Directed by Milos Forman.  With Jim Carrey, Danny DeVito, Gerry Becker, Greyson Erik Pendry. The life and career of a legendary comedian, Andy Kaufman.","Rated":"R"}