{"imdbID":"tt0120338","Title":"Titanic","Year":"1997","Director":"James Cameron","Writer":"James Cameron","Country":"USA","Language":"English, French, German, Swedish, Italian, Russian","Budget":"$200,000,000 (estimated)","Gross":"$658,672,302 (USA) (8 June 2012)","Production_Co":"Twentieth Century Fox Film Corporation, Paramount Pictures, Lightstorm Entertainment ","Runtime":"194 min","Cast":"Leonardo DiCaprio, Kate Winslet, Billy Zane, Kathy Bates, Frances Fisher, Gloria Stuart, Bill Paxton, Bernard Hill, David Warner, Victor Garber, Jonathan Hyde, Suzy Amis, Lewis Abernathy, Nicholas Cascone, Anatoly M. Sagalevitch","Plot":"A seventeen-year-old aristocrat falls in love with a kind, but poor artist aboard the luxurious, ill-fated R.M.S. Titanic. 84 years later, a 101-year-old woman named Rose DeWitt Bukater tells the story to her granddaughter Lizzy Calvert, Brock Lovett, Lewis Bodine, Bobby Buell and Anatoly Mikailavich on the Keldysh about her life set in April 10th 1912, on a ship called Titanic when young Rose boards the departing ship with the upper-class passengers and her mother, Ruth DeWitt Bukater, and her fiancé, Caledon Hockley. Meanwhile, a drifter and artist named Jack Dawson and his best friend Fabrizio De Rossi win third-class tickets to the ship in a game. And she explains the whole story from departure until the death of Titanic on its first and last voyage April 15th, 1912 at 2:20 in the morning. Written by Anthony Pereyra <hypersonic91@yahoo.com>","Genre":"Drama, Romance","Keywords":"ship, wet, titanic, love, artist","imdbRating":"7.7","imdbVotes":"765,479","Awards":"Won 11 Oscars. Another 108 wins & 73 nominations.","Metascore":"74","Released":"19 December 1997 (USA) ","Location":"Santa Clarita, California, USA ","Actors":"Leonardo DiCaprio, Kate Winslet, Billy Zane ","Running_time":"PT194M / 3h 14min","Description":"Directed by James Cameron.  With Leonardo DiCaprio, Kate Winslet, Billy Zane, Kathy Bates. A seventeen-year-old aristocrat falls in love with a kind, but poor artist aboard the luxurious, ill-fated R.M.S. Titanic.","Rated":"PG-13"}