{"imdbID":"tt0116922","Title":"Lost Highway","Year":"1997","Director":"David Lynch","Country":"France, USA","Language":"English","Also_Known_As":"Carretera perdida ","Budget":"$15,000,000 (estimated)","Opening_Weekend":"$212,710 (USA) (21 February 1997)","Gross":"$3,796,699 (USA) (18 April 1997)","Production_Co":"October Films, CiBy 2000, Asymmetrical Productions ","Runtime":"134 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"David Lynch: [actress playing a dual role] Patricia Arquette. See more »","Crazy_Credits":"A Real Trooper-Guadalupe Hurst See more »","Cast":"Bill Pullman, Patricia Arquette, John Roselius, Louis Eppolito, Jenna Maetlind, Michael Massee, Robert Blake, Henry Rollins, Michael Shamus Wiles, Mink Stole, Leonard Termo, Ivory Ocean, Jack Kehler, David Byrd, Gene Ross","Plot":"After a bizarre encounter at a party, a jazz saxophonist is framed for the murder of his wife and sent to prison, where he inexplicably morphs into a young mechanic and begins leading a new life. Fred Madison, a saxophonist, is accused under mysterious circumstances of murdering his wife Renee. On death row, he inexplicably morphs into a young man named Pete Dayton, leading a completely different life. When Pete is released, his and Fred's paths begin to cross in a surreal, suspenseful web of intrigue, orchestrated by a shady gangster boss named Dick Laurent. Written by <jdean@gslink.net>","Genre":"Mystery, Thriller","Keywords":"prison, videotape, detective, death row, death","imdbRating":"7.6","imdbVotes":"95,063","Awards":"1 win.","Metascore":"52","Released":"21 February 1997 (USA) ","Location":"803 South La Brea Avenue, Los Angeles, California, USA ","Actors":"Bill Pullman, Patricia Arquette, John Roselius ","Writer":"David Lynch, Barry Gifford","Running_time":"PT134M / 2h 14min","Description":"Directed by David Lynch.  With Bill Pullman, Patricia Arquette, John Roselius, Louis Eppolito. After a bizarre encounter at a party, a jazz saxophonist is framed for the murder of his wife and sent to prison, where he inexplicably morphs into a young mechanic and begins leading a new life.","Rated":"R"}