{"imdbID":"tt0115751","Title":"Breaking the Waves","Year":"1996","Director":"Lars von Trier (as Lars Von Trier)","Country":"Denmark, Sweden, France, Netherlands, Norway, Iceland, Spain","Language":"English","Gross":"$4,040,691 (USA) (2 May 1997)","Production_Co":"Argus Film Produktie, Arte, Canal+ ","Runtime":"159 min | 153 min (director's cut)","Cast":"Emily Watson, Stellan Skarsgård, Katrin Cartlidge, Jean-Marc Barr, Adrian Rawlins, Jonathan Hackett, Sandra Voe, Udo Kier, Mikkel Gaup, Roef Ragas, Phil McCall, Robert Robertson, Desmond Reilly, Sarah Gudgeon, Finlay Welsh","Plot":"Oilman Jan is paralyzed in an accident. His wife, who prayed for his return, feels guilty; even more, when Jan urges her to have sex with another. Drama set in a repressed, deeply religious community in the north of Scotland, where a naive young woman named Bess McNeil meets and falls in love with Danish oil-rig worker Jan. Bess and Jan are deeply in love but, when Jan returns to his rig, Bess prays to God that he returns for good. Jan does return, his neck broken in an accident aboard the rig. Because of his condition, Jan and Bess are now unable to enjoy a sexual relationship and Jan urges Bess to take another lover and tell him the details. As Bess becomes more and more deviant in her sexual behavior, the more she comes to believe that her actions are guided by God and are helping Jan recover. Written by Jonathan Broxton <j.w.broxton@sheffield.ac.uk>","Genre":"Drama, Romance","Keywords":"male frontal nudity, love, accident, sex, scotland","imdbRating":"7.9","imdbVotes":"47,474","Awards":"Nominated for 1 Oscar. Another 42 wins & 24 nominations.","Metascore":"76","Released":"13 November 1996 (USA) ","Location":"Copenhagen, Denmark ","Actors":"Emily Watson, Stellan Skarsgård, Katrin Cartlidge ","Writer":"Lars von Trier (as Lars Von Trier), Peter Asmussen","Running_time":"PT159M / 2h 39min","Description":"Directed by Lars von Trier.  With Emily Watson, Stellan Skarsgård, Katrin Cartlidge, Jean-Marc Barr. Oilman Jan is paralyzed in an accident. His wife, who prayed for his return, feels guilty; even more, when Jan urges her to have sex with another.","Rated":"R"}