{"imdbID":"tt0119177","Title":"Gattaca","Year":"1997","Director":"Andrew Niccol","Writer":"Andrew Niccol","Taglines":"The Prisoner. Her Cell. ","Country":"USA","Language":"English, Esperanto","Also_Known_As":"The Eighth Day ","Budget":"$36,000,000 (estimated)","Opening_Weekend":"$4,320,202 (USA) (24 October 1997)","Gross":"DEM 2,357,799 (Germany) (24 July 1998)","Production_Co":"Columbia Pictures Corporation, Jersey Films ","Runtime":"106 min","Sound_Mix":"Dolby Digital | SDDS","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Some interiors and exteriors of the Gattaca building belong, in reality, to the Marin County Civic Center in San Rafael, CA. It was designed by American star architect Frank Lloyd Wright in 1957. The largest Wright design ever constructed, it was largely built after his death in 1959. The central dome (prominent in the roof-cleaning scene) contains the county library. See more »","Goofs":"When Vincent alias Jerome has his interview at Gattaca you can see that the machine clearly shows a GNQ of 9.8612. When Irene gives the hair sample away for analysing, the woman at the counter states \"9.3, quite a catch\". See more »","Crazy_Credits":"All instances of the letters A, C, G, and T (representing the four nucleotides of DNA -- see trivia entry) are emphasized in almost all names of people and companies credited in the film. These letters appear in a different typeface from the rest of the name; also, in the opening credits they appear onscreen a little before the rest of the name, while in the closing credits they appear in blue instead of white. See more »","Cast":"Ethan Hawke, Uma Thurman, Gore Vidal, Xander Berkeley, Jayne Brook, Elias Koteas, Maya Rudolph, Una Damon, Elizabeth Dennehy, Blair Underwood, Mason Gamble, Vincent Nielson, Chad Christ, William Lee Scott, Clarence Graham","Plot":"A genetically inferior man assumes the identity of a superior one in order to pursue his lifelong dream of space travel. In the not-too-distant future, a less-than-perfect man wants to travel to the stars. Society has categorized Vincent Freeman as less than suitable given his genetic make-up and he has become one of the underclass of humans that are only useful for menial jobs. To move ahead, he assumes the identity of Jerome Morrow, a perfect genetic specimen who is a paraplegic as a result of a car accident. With professional advice, Vincent learns to deceive DNA and urine sample testing. Just when he is finally scheduled for a space mission, his program director is killed and the police begin an investigation, jeopardizing his secret. Written by garykmcd","Genre":"Drama, Sci-Fi, Thriller","Keywords":"mission, police, accident, genetics, future","imdbRating":"7.8","imdbVotes":"212,804","Awards":"Nominated for 1 Oscar. Another 6 wins & 14 nominations.","Metascore":"64","Released":"24 October 1997 (USA) ","Location":"Sepulveda Dam, Encino, Los Angeles, California, USA ","Actors":"Ethan Hawke, Uma Thurman, Jude Law ","Running_time":"PT106M / 1h 46min","Description":"Directed by Andrew Niccol.  With Ethan Hawke, Uma Thurman, Jude Law, Gore Vidal. A genetically inferior man assumes the identity of a superior one in order to pursue his lifelong dream of space travel.","Rated":"PG-13"}