{"imdbID":"tt0107688","Title":"The Nightmare Before Christmas","Year":"1993","Director":"Henry Selick","Taglines":"A ghoulish tale with wicked humour & stunning animation. ","Country":"USA","Language":"English","Also_Known_As":"Tim Burton's The Nightmare Before Christmas ","Budget":"$18,000,000 (estimated)","Opening_Weekend":"$175,022 (USA) (27 October 2000)","Gross":"$75,082,668 (USA) (13 November 2009)","Production_Co":"Touchstone Pictures, Skellington Productions Inc., Tim Burton Productions ","Runtime":"76 min","Sound_Mix":"Dolby Digital | Dolby (35mm)","Color":"Color (Technicolor)","Aspect_Ratio":"1.66 : 1","Trivia":"There is something of a controversy over exactly who has the rights to call the story and film their own, Henry Selick is the director and spent more time on the set and production than Tim Burton, however Burton has often claimed he is the owner of the story as it was all his idea, he wrote the original poem and most of the script, created the characters, served as a producer, and even wanted to direct but was simply too busy at the time to do so. However popular culture has long accepted the film as Burton's as the film heading is \"Tim Burton's The Nightmare Before Christmas\". Burton does however reinforce the fact that Selick directed the film, and is often annoyed that people don't remember him for that. See more »","Goofs":"When Jack is in Christmas Town, at one part he jumps across from house to house. For about several frames, you can see wires suspending the puppet. See more »","Crazy_Credits":"No credits are shown, except the company and the film's name. See more »","Cast":"Danny Elfman, Chris Sarandon, Catherine O'Hara, William Hickey, Glenn Shadix, Paul Reubens, Ken Page, Edward Ivory, Susan McBride, Debi Durst, Greg Proops, Kerry Katz, Randy Crenshaw, Sherwood Ball, Carmen Twillie","Plot":"Jack Skellington, king of Halloween Town, discovers Christmas Town, but doesn't quite understand the concept. Jack Skellington, the pumpkin king of Halloween Town, is bored with doing the same thing every year for Halloween. One day he stumbles into Christmas Town, and is so taken with the idea of Christmas that he tries to get the resident bats, ghouls, and goblins of Halloween town to help him put on Christmas instead of Halloween -- but alas, they can't get it quite right. Written by Jon Reeves <jreeves@imdb.com>","Genre":"Animation, Family, Fantasy","Keywords":"christmas, halloween, pumpkin, woods, dog","imdbRating":"8.0","imdbVotes":"215,807","Awards":"Nominated for 1 Oscar. Another 6 wins & 6 nominations.","Metascore":"","Released":"29 October 1993 (USA) ","Location":"San Francisco, California, USA","Actors":"Danny Elfman, Chris Sarandon, Catherine O'Hara ","Writer":"Tim Burton (based on: a story and characters by), Michael McDowell (adaptation) | 1 more credit »","Running_time":"PT76M / 1h 16min","Description":"Directed by Henry Selick.  With Danny Elfman, Chris Sarandon, Catherine O'Hara, William Hickey. Jack Skellington, king of Halloween Town, discovers Christmas Town, but doesn't quite understand the concept.","Rated":"PG"}