{"imdbID":"tt0114369","Title":"Se7en","Year":"1995","Director":"David Fincher","Writer":"Andrew Kevin Walker","Taglines":"Let he who is without sin try to survive ","Country":"USA","Language":"English","Also_Known_As":"Seven ","Budget":"$33,000,000 (estimated)","Opening_Weekend":"£11,434,343 (UK) (19 January 1996)","Gross":"$100,125,340 (USA)","Production_Co":"Cecchi Gori Pictures, Juno Pix, New Line Cinema ","":"Show detailed company contact information on IMDbPro »","Runtime":"127 min","Sound_Mix":"DTS | Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The autopsy of the first killing, as originally scripted, was incorrect according to the research of makeup man Rob Bottin (who viewed a real human autopsy as part of his prep work). The scene was truncated from the original script and shows only the sewn-up corpse of Gluttony, not the actual autopsy. See more »","Goofs":"At the end of the scene where both witnesses of the \"Lust\" crime scene are interrogated, there is a slow track from one interrogation room to the other. In the tracking shot, you can see the camera dolly reflection at the bottom of the two-way mirror. See more »","Crazy_Credits":"SPOILER: Kevin Spacey's name is not included in the opening titles to keep the John Doe intrigue going. To compensate, he is listed twice in the closing credits: once before the credits start rolling and once in the rolling credits in order of appearance. See more »","Cast":"Morgan Freeman, Andrew Kevin Walker, Daniel Zacapa, Brad Pitt, Gwyneth Paltrow, John Cassini, Bob Mack, Peter Crombie, Reg E. Cathey, R. Lee Ermey, George Christy, Endre Hules, Hawthorne James, William Davidson, Bob Collins","Plot":"Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his modus operandi. A film about two homicide detectives' desperate hunt for a serial killer who justifies his crimes as absolution for the world's ignorance of the Seven Deadly Sins. The movie takes us from the tortured remains of one victim to the next as the sociopathic \"John Doe\" sermonizes to Detectives Somerset and Mills -- one sin at a time. The sin of Gluttony comes first and the murderer's terrible capacity is graphically demonstrated in the dark and subdued tones characteristic of film noir. The seasoned and cultured but jaded Somerset researches the Seven Deadly Sins in an effort to understand the killer's modus operandi while the bright but green and impulsive Detective Mills scoffs at his efforts to get inside the mind of a killer... Written by Mark Fleetwood <mfleetwo@mail.coin.missouri.edu>","Genre":"Crime, Drama, Mystery","Keywords":"detective, serial killer, seven deadly sins, police partner, serial murder","imdbRating":"8.6","imdbVotes":"980,393","Awards":"Nominated for 1 Oscar. Another 25 wins & 33 nominations.","Metascore":"65","Released":"22 September 1995 (USA) ","Location":"Pacific Electric Building, Los Angeles, California, USA ","Actors":"Morgan Freeman, Brad Pitt, Kevin Spacey ","Running_time":"PT127M / 2h 7min","Description":"Directed by David Fincher.  With Morgan Freeman, Brad Pitt, Kevin Spacey, Andrew Kevin Walker. Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his modus operandi.","Rated":"R"}