{"imdbID":"tt0110357","Title":"The Lion King","Year":"1994","Taglines":"The King Has Returned. [for Christmas 2002 IMAX release.] ","Certificate":"U | See all certifications »","Country":"USA","Language":"English, Swahili, Xhosa, Zulu","Also_Known_As":"El rey león ","Budget":"$45,000,000 (estimated)","Opening_Weekend":"£16,650,343 (UK) (11 November 1994)","Gross":"$422,783,777 (USA) (13 January 2012)","Production_Co":"Walt Disney Pictures, Walt Disney Feature Animation ","":"Show detailed company contact information on IMDbPro »","Runtime":"89 min | 73 min (workprint)","Sound_Mix":"Dolby SR | Dolby Digital","Color":"Color (Technicolor)","Aspect_Ratio":"1.66 : 1","Trivia":"This movie was Gregory Peck's favorite animated film; he also ranked it in his top five all time favorite movies. See more »","Goofs":"When Nala is crouched in the grass right before she pounces at Pumbaa, her eyes are green. When she's fighting with Simba, her eyes are blue. See more »","Crazy_Credits":"The IMAX version uses the orange/black Walt Disney Pictures logo (usually used for live-action movies). See more »","Cast":"Matthew Broderick, Jonathan Taylor Thomas, James Earl Jones, Jim Cummings, Jeremy Irons, Moira Kelly, Niketa Calame, Ernie Sabella, Nathan Lane, Robert Guillaume, Rowan Atkinson, Madge Sinclair, Whoopi Goldberg, Cheech Marin, Jason Weaver","Plot":"Lion cub and future king Simba searches for his identity. His eagerness to please others and penchant for testing his boundaries sometimes gets him into trouble. A young lion Prince is cast out of his pride by his cruel uncle, who claims he killed his father. While the uncle rules with an iron fist, the prince grows up beyond the savannah, living by a philosophy: No worries for the rest of your days. But when his past comes to haunt him, the young Prince must decide his fate: will he remain an outcast, or face his demons and become what he needs to be? Written by femaledragon1234","Genre":"Animation, Adventure, Drama","Keywords":"unnecessary guilt, prince, king, scar, uncle","imdbRating":"8.5","imdbVotes":"611,637","Awards":"Won 2 Oscars. Another 28 wins & 26 nominations.","Metascore":"83","Released":"24 June 1994 (USA) ","Location":"Walt Disney Feature Animation - 500 S. Buena Vista Street, Burbank, California, USA","Actors":"Matthew Broderick, Jeremy Irons, James Earl Jones ","Director":"Roger Allers, Rob Minkoff","Writer":"Irene Mecchi (screenplay), Jonathan Roberts (screenplay) | 27 more credits »","Running_time":"PT89M / 1h 29min","Description":"Directed by Roger Allers, Rob Minkoff.  With Matthew Broderick, Jeremy Irons, James Earl Jones, Whoopi Goldberg. Lion cub and future king Simba searches for his identity. His eagerness to please others and penchant for testing his boundaries sometimes gets him into trouble.","Rated":"U"}