{"imdbID":"tt0110413","Title":"Léon","Year":"1994","Director":"Luc Besson","Writer":"Luc Besson","Taglines":"You can't stop what you can't see. ","Country":"France","Language":"English, Italian, French","Also_Known_As":"El perfecto asesino ","Budget":"FRF 115,000,000 (estimated)","Gross":"JPY 112,586,900 (Japan) (3 January 1997)","Production_Co":"Gaumont, Les Films du Dauphin ","":"Show detailed company contact information on IMDbPro »","Runtime":"110 min | 136 min (uncut) | 133 min (International)","Sound_Mix":"Dolby Digital | SDDS (8 channels)","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"The cut of the film had more scenes with \"awkward sexual tension\" between Mathilda and Léon. These scenes were later cut out for the American release dubbed \"The Professional\", but were included in the 1996 European release, as well as in the deleted scenes of the special edition DVD. They were reintegrated back into the film for the 'International Cut', which is now available on DVD. See more »","Goofs":"During Matilda's first \"hit\" with Leon, as Leon is instructing Matilda how to properly shoot the client, the client's position and body language against the wall, as well as his dialogue, are not consistent. See more »","Crazy_Credits":"Under the \"SPECIAL THANKS\" heading you will find: Chevalier KAMEN (Prince of the Mash Potatoes) Byblos Bill (King of Saint Tropez) Princess Trudy (Queen of Hearts) See more »","Cast":"Jean Reno, Gary Oldman, Natalie Portman, Danny Aiello, Peter Appel, Willi One Blood, Don Creech, Keith A. Glascoe, Randolph Scott, Michael Badalucco, Ellen Greene, Elizabeth Regen, Carl J. Matusovich, Frank Senger, Lucius Wyatt Cherokee","Plot":"Mathilda, a 12-year-old girl, is reluctantly taken in by Léon, a professional assassin, after her family is murdered. Léon and Mathilda form an unusual relationship, as she becomes his protégée and learns the assassin's trade. After her father, mother and little brother are killed by her father's employers, the 12-year-old daughter of an abject drug dealer is forced to take refuge in the apartment of a professional hitman who at her request teaches her the methods of his job so she can take her revenge on the corrupt DEA agent who ruined her life by killing her beloved brother. Written by J. S. Golden","Genre":"Crime, Drama, Thriller","Keywords":"girl, revenge, assassin, potted plant, fire axe","imdbRating":"8.6","imdbVotes":"694,742","Awards":"3 wins & 8 nominations.","Metascore":"64","Released":"14 September 1994 (France) ","Location":"1 Centre Street, New York City, New York, USA ","Actors":"Jean Reno, Gary Oldman, Natalie Portman ","Running_time":"PT110M / 1h 50min","Description":"Directed by Luc Besson.  With Jean Reno, Gary Oldman, Natalie Portman, Danny Aiello. Mathilda, a 12-year-old girl, is reluctantly taken in by Léon, a professional assassin, after her family is murdered. Léon and Mathilda form an unusual relationship, as she becomes his protégée and learns the assassin's trade.","Rated":"R"}