{"imdbID":"tt0103064","Title":"Terminator 2: Judgment Day","Year":"1991","Director":"James Cameron","Taglines":"Get terminated July 3rd. ","Certificate":"U | See all certifications »","Country":"USA, France","Language":"English, Spanish","Also_Known_As":"Tarminetara 2: Pralaya ka dina ","Budget":"$102,000,000 (estimated)","Gross":"$204,843,350 (USA)","Production_Co":"Carolco Pictures, Pacific Western, Lightstorm Entertainment ","":"Show detailed company contact information on IMDbPro »","Runtime":"137 min | 152 min (Special Edition) | 156 min (Skynet Edition) | 130 min (T-1000 Edition VHS) | 153 min (Extreme DVD)","Sound_Mix":"70 mm 6-Track (analog 70 mm prints)| CDS (digital 35 mm and 70 mm prints)| Dolby SR (analog 35 mm prints)| Dolby Stereo (selected in theaters)| Mono (original release)| Auro 11.1 (IMAX version)| Dolby Atmos (IMAX version)| Dolby Digital (Extreme Edition)","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Held the world record for highest opening-weekend gross of an R-rated film (with $52,306,548) until The Matrix Reloaded (2003). See more »","Goofs":"In the steel foundry toward the end, the Terminator slams a metal bar down through the T1000's shoulder. The T1000 grabs the bar, then spins and kicks the Terminator, sending the metal bar flying out of the Terminator's right hand. In the next scene, the metal bar is seen still embedded in the T1000's body. See more »","Crazy_Credits":"Now read the Bantam Book See more »","Cast":"Arnold Schwarzenegger, Linda Hamilton, Edward Furlong, Robert Patrick, Earl Boen, Joe Morton, S. Epatha Merkerson, Castulo Guerra, Danny Cooksey, Jenette Goldstein, Xander Berkeley, Leslie Hamilton Gearren, Ken Gibbel, Robert Winley, Peter Schrum","Plot":"A cyborg, identical to the one who failed to kill Sarah Connor, must now protect her young son, John Connor, from a more advanced cyborg, made out of liquid metal. Almost 10 years have passed since the first cyborg called The Terminator tried to kill Sarah Connor and her unborn son, John Connor. John Connor, the future leader of the human resistance, is now a healthy young boy. However another Terminator is sent back through time called the T-1000, which is more advanced and more powerful than its predecessor. The Mission: to kill John Connor when he's still a child. However, Sarah and John do not have to face this threat of a Terminator alone. Another Terminator is also sent back through time. The mission: to protect John and Sarah Connor at all costs. The battle for tomorrow has begun... Written by Eric ggg","Genre":"Action, Sci-Fi","Keywords":"future, liquid metal, time travel, famous song, female warrior","imdbRating":"8.5","imdbVotes":"715,394","Awards":"Won 4 Oscars. Another 20 wins & 22 nominations.","Metascore":"75","Released":"24 August 1991 (India) ","Location":"Santa Clarita, California, USA ","Actors":"Arnold Schwarzenegger, Linda Hamilton, Edward Furlong ","Writer":"James Cameron, William Wisher Jr. (as William Wisher)","Running_time":"PT137M / 2h 17min","Description":"Directed by James Cameron.  With Arnold Schwarzenegger, Linda Hamilton, Edward Furlong, Robert Patrick. A cyborg, identical to the one who failed to kill Sarah Connor, must now protect her young son, John Connor, from a more advanced cyborg, made out of liquid metal.","Rated":"U"}