{"imdbID":"tt0168629","Title":"Dancer in the Dark","Year":"2000","Director":"Lars von Trier (as Lars Von Trier)","Writer":"Lars von Trier (as Lars Von Trier)","Taglines":"In a world of shadows, she found the light of life. ","Country":"Denmark, Spain, Germany, Netherlands, Italy, USA, UK, France, Sweden, Finland, Iceland, Norway","Language":"English","Also_Known_As":"Bailando en la oscuridad ","Budget":"$12,800,000 (estimated)","Opening_Weekend":"$63,858 (Norway) (8 September 2000)","Gross":"ESP 290,047,040 (Spain) (29 June 2001)","Production_Co":"Zentropa Entertainments, Trust Film Svenska, Film Väst ","Runtime":"140 min","Sound_Mix":"Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Björk was known for crazy behavior during and after filming. She once attacked a news anchor when asked about working with Lars von Trier and supposedly ate part of her costume after filming was complete. See more »","Goofs":"Even though Selma is from Czechoslovakia, her accent is not Czech nor Slovak. See more »","Cast":"Björk, Catherine Deneuve, David Morse, Peter Stormare, Joel Grey, Cara Seymour, Vladica Kostic, Jean-Marc Barr, Vincent Paterson, Siobhan Fallon Hogan, Zeljko Ivanek, Udo Kier, Jens Albinus, Reathel Bean, Mette Berggreen","Plot":"An east European girl goes to America with her young son, expecting it to be like a Hollywood film. Selma has emigrated with her son from Central Europe to America. The year is 1964. Selma works day and night to save her son from the same disease she suffers from, a disease that inevitably will make her blind. But Selma has the energy to live because of her secret! She loves musicals. When life feels tough she can pretend that she is in the wonderful world of musicals...just for a short moment. All happiness life is not able to give her she finds there... Written by Fredrik Klasson <fredrik.klasson@telia.com>","Genre":"Crime, Drama, Musical","Keywords":"factory, year 1964, women's prison, execution, ends with quotation","imdbRating":"8.0","imdbVotes":"77,199","Awards":"Nominated for 1 Oscar. Another 33 wins & 45 nominations.","Metascore":"61","Released":"6 October 2000 (USA) ","Location":"Arlington, Washington, USA ","Actors":"Björk, Catherine Deneuve, David Morse ","Running_time":"PT140M / 2h 20min","Description":"Directed by Lars von Trier.  With Björk, Catherine Deneuve, David Morse, Peter Stormare. An east European girl goes to America with her young son, expecting it to be like a Hollywood film.","Rated":"R"}