{"imdbID":"tt0120363","Title":"Toy Story 2","Year":"1999","Taglines":"\"Oooh...3-D\" (USA 2009 re-release) ","Certificate":"G | See all certifications »","Country":"USA","Language":"English, Arabic, Spanish","Also_Known_As":"Toy Story 2 in 3-D ","Budget":"$90,000,000 (estimated)","Opening_Weekend":"$57,388,839 (USA) (26 November 1999)","Gross":"£1,832,385 (UK) (29 January 2010)","Production_Co":"Walt Disney Pictures, Pixar Animation Studios ","Runtime":"92 min | 82 min (TV)","Sound_Mix":"DTS | SDDS | Dolby Digital","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"The baggage handler at the airport who shouts \"Hold it! There's a couple more bags coming from the terminal!\" is the voice of UK television personality Andi Peters. When filming a documentary on the making of Toy Story 2 (1999), he was offered this one small line in the film by John Lasseter himself. The recording almost didn't happen because Andi Peters did not have a US work permit, but was allowed to record the dialogue from a London studio, supervised by John Lasseter via satellite. See more »","Goofs":"If Woody had been a big television star, he wouldn't be a \"rare Sheriff Woody doll\" because of all the characters, his doll would have the most in circulation. In fact, Stinky Pete would be the rarest doll because most parents would likely buy Woody, Bullseye, and Jessie first-and a good number of kids would have kept them. See more »","Crazy_Credits":"Heimlich and Flik from \"A Bug's Life\" make a cameo appearance in the credits. See more »","Cast":"Tom Hanks, Tim Allen, Joan Cusack, Kelsey Grammer, Don Rickles, Jim Varney, Wallace Shawn, John Ratzenberger, Annie Potts, Wayne Knight, John Morris, Laurie Metcalf, Estelle Harris, R. Lee Ermey, Jodi Benson","Plot":"When Woody is stolen by a toy collector, Buzz and his friends vow to rescue him, but Woody finds the idea of immortality in a museum tempting. While Andy is away at summer camp Woody has been toynapped by Al McWiggin, a greedy collector and proprietor of \"Al's Toy Barn\"! In this all-out rescue mission, Buzz and his friends Mr. Potato Head, Slinky Dog, Rex and Hamm springs into action to rescue Woody from winding up as a museum piece. They must find a way to save him before he gets sold in Japan forever and they'll never see him again! Written by Anthony Pereyra <hypersonic91@yahoo.com>","Genre":"Animation, Adventure, Comedy","Keywords":"toy, collector, rescue, friend, dog","imdbRating":"7.9","imdbVotes":"369,897","Awards":"Nominated for 1 Oscar. Another 20 wins & 27 nominations.","Metascore":"88","Released":"24 November 1999 (USA) ","Location":"Pixar Animation Studios - 1200 Park Avenue, Emeryville, California, USA ","Actors":"Tom Hanks, Tim Allen, Joan Cusack ","Director":"John Lasseter, Ash Brannon | 1 more credit »","Writer":"John Lasseter (original story by), Pete Docter (original story by) | 6 more credits »","Running_time":"PT92M / 1h 32min","Description":"Directed by John Lasseter, Ash Brannon, Lee Unkrich.  With Tom Hanks, Tim Allen, Joan Cusack, Kelsey Grammer. When Woody is stolen by a toy collector, Buzz and his friends vow to rescue him, but Woody finds the idea of immortality in a museum tempting.","Rated":"G"}