{"imdbID":"tt0109446","Title":"The Client","Year":"1994","Director":"Joel Schumacher","Country":"USA","Language":"English","Budget":"$45,000,000 (estimated)","Gross":"£2,100,033 (UK) (11 November 1994)","Production_Co":"Warner Bros., Regency Enterprises, Alcor Films ","Runtime":"119 min","Cast":"Susan Sarandon, Tommy Lee Jones, Mary-Louise Parker, Anthony LaPaglia, J.T. Walsh, Anthony Edwards, Brad Renfro, Will Patton, Bradley Whitford, Anthony Heald, Kim Coates, Kimberly Scott, David Speck, William H. Macy, Ossie Davis","Plot":"A young boy who witnessed the suicide of a mafia lawyer hires an attorney to protect him when the district attorney tries to use him to take down a mob family. Mark Sway is an 11 year old boy who lives with his mother and brother in a trailer. One day he and his brother are hanging out when a car pulls over beside them. The driver then sticks a hose in his exhaust and puts the other end into the car. Mark pulls it out. But the man sees him and grabs him and takes inside the car. The man talks to Mark then later shoots himself. The shock sends Mark's brother into a catatonic state. The police question him and slips out some stuff that makes them think he's saying more than he knows. Roy Foltrigg, a prosecutor with political ambitions tells Mark he wants to talk to him tomorrow. Mark feeling that he needs a lawyer, sees Reggie Love. Mark tells her about the man who killed himself. Reggie tells him he's a mob lawyer. And one of his clients is a member of a mob family who is suspected of killing a Senator who was trying to take down his family. But because the Senator's body is missing, they can't prosecute him. Reggie thinks Foltrigg thinks the... Written by rcs0411@yahoo.com","Genre":"Crime, Drama, Mystery","Keywords":"lawyer, mafia, senator, brother, boy","imdbRating":"6.7","imdbVotes":"44,430","Awards":"Nominated for 1 Oscar. Another 3 wins & 3 nominations.","Metascore":"65","Released":"20 July 1994 (USA) ","Location":"Clinton, Mississippi, USA ","Actors":"Susan Sarandon, Tommy Lee Jones, Brad Renfro ","Writer":"John Grisham (novel), Akiva Goldsman (screenplay) | 1 more credit »","Running_time":"PT119M / 1h 59min","Description":"Directed by Joel Schumacher.  With Susan Sarandon, Tommy Lee Jones, Brad Renfro, Mary-Louise Parker. A young boy who witnessed the suicide of a mafia lawyer hires an attorney to protect him when the district attorney tries to use him to take down a mob family.","Rated":"PG-13"}