{"imdbID":"tt0100395","Title":"Postcards from the Edge","Year":"1990","Director":"Mike Nichols","Country":"USA","Language":"English, Spanish","Budget":"$22,000,000 (estimated)","Gross":"$37,963,281 (USA)","Production_Co":"Columbia Pictures Corporation ","Runtime":"101 min | 95 min (edited)","Cast":"Meryl Streep, Shirley MacLaine, Dennis Quaid, Gene Hackman, Richard Dreyfuss, Rob Reiner, Mary Wickes, Conrad Bain, Annette Bening, Simon Callow, Gary Morton, CCH Pounder, Sidney Armus, Robin Bartlett, Barbara Garrick","Plot":"A substance-addicted actress tries to look on the bright side even as she is forced to move back in with her mother to avoid unemployment. Substance-addicted Hollywood actress Suzanne Vale is on the skids. After a spell at a detox centre her film company insists as a condition of continuing to employ her that she live with her mother Doris Mann, herself once a star and now a champion drinker. Such a set-up is bad news for Suzanne who has struggled for years to get out of her mother's shadow, and who finds her mother still treats her like a child. Despite these problems - and further ones to do with the men in in her life - Suzanne can begin to see the funny side of her situation, and it also starts to occur to her that not only do daughters have mothers, mothers do too. Written by Jeremy Perkins {J-26}","Genre":"Comedy, Drama","Keywords":"hollywood, actress, alcoholism, domineering mother, rehab","imdbRating":"6.6","imdbVotes":"10,773","Awards":"Nominated for 2 Oscars. Another 2 wins & 9 nominations.","Metascore":"71","Released":"14 September 1990 (USA) ","Location":"Los Angeles, California, USA","Actors":"Meryl Streep, Shirley MacLaine, Dennis Quaid ","Writer":"Carrie Fisher (book), Carrie Fisher (screenplay)","Running_time":"PT101M / 1h 41min","Description":"Directed by Mike Nichols.  With Meryl Streep, Shirley MacLaine, Dennis Quaid, Gene Hackman. A substance-addicted actress tries to look on the bright side even as she is forced to move back in with her mother to avoid unemployment.","Rated":"R"}