{"imdbID":"tt0114709","Title":"Toy Story","Year":"1995","Director":"John Lasseter","Taglines":"Hang on for the comedy that goes to infinity and beyond! ","Certificate":"G | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Toy Story in 3-D ","Budget":"$30,000,000 (estimated)","Opening_Weekend":"£18,210,323 (UK) (19 April 1996)","Gross":"SGD 186,000 (Singapore) (1 March 1996)","Production_Co":"Pixar Animation Studios, Walt Disney Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"81 min | 74 min (TV)","Sound_Mix":"Dolby Digital","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Woody and Buzz Lightyear are inspired by director John Lasseter's own childhood toys. He based Woody on his own pull-string Casper doll, and once he grew out of Casper he moved on to a G.I. Joe, a flashy toy at the time of his childhood. See more »","Goofs":"When Buzz is trying to prove that he can fly, he jumps from one of the bed legs. Therefore there is no way he could reach the ceiling without getting additional speed (which he gets only after reaching the ceiling). See more »","Crazy_Credits":"In the DVD version, when the THX logo appears it gets burned out like a flashlight then a robot comes out of the logo, fixes it, and the THX sound resumes and the robot goes back inside it. See more »","Cast":"Tom Hanks, Tim Allen, Don Rickles, Jim Varney, Wallace Shawn, John Ratzenberger, Annie Potts, John Morris, Erik von Detten, Laurie Metcalf, R. Lee Ermey, Sarah Freeman, Penn Jillette, Jack Angel, Spencer Aste","Plot":"A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room. A little boy named Andy loves to be in his room, playing with his toys, especially his doll named \"Woody\". But, what do the toys do when Andy is not with them, they come to life. Woody believes that he has life (as a toy) good. However, he must worry about Andy's family moving, and what Woody does not know is about Andy's birthday party. Woody does not realize that Andy's mother gave him an action figure known as Buzz Lightyear, who does not believe that he is a toy, and quickly becomes Andy's new favorite toy. Woody, who is now consumed with jealousy, tries to get rid of Buzz. Then, both Woody and Buzz are now lost. They must find a way to get back to Andy before he moves without them, but they will have to pass through a ruthless toy killer, Sid Phillips. Written by John Wiggins","Genre":"Animation, Adventure, Comedy","Keywords":"toy, jealousy, rivalry, boy next door, cult film","imdbRating":"8.3","imdbVotes":"592,741","Awards":"Nominated for 3 Oscars. Another 22 wins & 17 nominations.","Metascore":"92","Released":"22 November 1995 (USA) ","Location":"Pixar Animation Studios - 1200 Park Avenue, Emeryville, California, USA ","Actors":"Tom Hanks, Tim Allen, Don Rickles ","Writer":"John Lasseter (original story by), Pete Docter (original story by) | 6 more credits »","Running_time":"PT81M / 1h 21min","Description":"Directed by John Lasseter.  With Tom Hanks, Tim Allen, Don Rickles, Jim Varney. A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room.","Rated":"G"}