{"imdbID":"tt0169547","Title":"American Beauty","Year":"1999","Director":"Sam Mendes","Writer":"Alan Ball","Taglines":"... look closer","Certificate":"A | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Belleza americana ","Budget":"$15,000,000 (estimated)","Opening_Weekend":"$861,531 (USA) (17 September 1999)","Gross":"AUD 11,029,726 (Australia) (15 December 2000)","Production_Co":"DreamWorks SKG, Jinks/Cohen Company ","":"Show detailed company contact information on IMDbPro »","Runtime":"122 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"1.33 : 1","Trivia":"On the DVD's Audio Commentary, Alan Ball reveals that he came up with Angela's line \"You're defending him, you love him, you wanna have, like, ten thousand of his babies\" during an U2 concert after hearing a fan screaming to Bono that she wanted to have ten thousand of his babies. See more »","Goofs":"Carolyn Burnham's business phone number for Burnham Realty is listed as 555-0195 on her yard sign, but 555-0184 on the one-page fliers for the open house in the Plexiglas stand on the welcome/info table. See more »","Crazy_Credits":"thanks to all at the Donmar Warehouse in London and Dr. Bill and Alice See more »","Cast":"Kevin Spacey, Annette Bening, Thora Birch, Wes Bentley, Mena Suvari, Chris Cooper, Peter Gallagher, Allison Janney, Scott Bakula, Sam Robards, Barry Del Sherman, Ara Celi, John Cho, Fort Atkinson, Sue Casey","Plot":"A bored suburban father has a mid-life crisis after becoming infatuated with his daughter's best friend. Lester and Carolyn Burnham are, on the outside, a perfect husband and wife in a perfect house in a perfect neighborhood. But inside, Lester is slipping deeper and deeper into a hopeless depression. He finally snaps when he becomes infatuated with one of his daughter's friends. Meanwhile, his daughter Jane is developing a happy friendship with a shy boy-next-door named Ricky, who lives with an abusive father. Written by Jessie Skinner <eietherbinge@hotmail.com>","Genre":"Drama, Romance","Keywords":"domestic violence, drug dealer, midlife crisis, drugs, sex scene","imdbRating":"8.4","imdbVotes":"792,814","Awards":"Won 5 Oscars. Another 102 wins & 96 nominations.","Metascore":"86","Released":"1 October 1999 (USA) ","Location":"11388 Homedale Street, Brentwood, Los Angeles, California, USA ","Actors":"Kevin Spacey, Annette Bening, Thora Birch ","Running_time":"PT122M / 2h 2min","Description":"Directed by Sam Mendes.  With Kevin Spacey, Annette Bening, Thora Birch, Wes Bentley. A bored suburban father has a mid-life crisis after becoming infatuated with his daughter's best friend.","Rated":"A"}