{"imdbID":"tt0119008","Title":"Donnie Brasco","Year":"1997","Director":"Mike Newell","Taglines":"Donnie Brasco. Based On A True Story. ","Country":"USA","Language":"English, Italian, Japanese","Also_Known_As":"Brasco ","Budget":"$35,000,000 (estimated)","Opening_Weekend":"$11,660,216 (USA) (28 February 1997)","Gross":"$41,954,997 (USA) (13 June 1997)","Production_Co":"Mandalay Entertainment, Baltimore Pictures, Mark Johnson Productions ","Runtime":"127 min | 147 min (extended cut)","Sound_Mix":"SDDS | Dolby Digital","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"At various points Tom Cruise, John Travolta, and Andy Garcia were attached to star, and Stephen Frears was attached to direct. See more »","Goofs":"At one point, ELO's \"Don't Bring Me Down\" is playing in the background. Later in the movie, while in Florida, Sonny Black reads in the paper that John Wayne died. John Wayne died June 11, 1979, and \"Don't Bring Me Down\" wasn't released until July 21, 1979. See more »","Cast":"Al Pacino, Johnny Depp, Michael Madsen, Bruno Kirby, James Russo, Anne Heche, Zeljko Ivanek, Gerry Becker, Robert Miano, Brian Tarantina, Rocco Sisto, Zach Grenier, Walt MacPherson, Ronnie Farer, Terry Serpico","Plot":"An FBI undercover agent infiltrates the mob and finds himself identifying more with the mafia life, at the expense of his regular one. This true story follows FBI agent Joe Pistone as he infiltrates the mafia of New York. Befriending Lefty Ruggiero, Pistone (under the name Donnie Brasco) is able to embed himself in a mafia faction led by Sonny Black. Ruggiero and Pistone become tight as the group goes about collecting money for 'the bosses'. Eventually, the group become big-time when Black himself becomes a boss; all the while, Pistone collects evidence. However, the trials and tribulations of the undercover work become more than Pistone can bear. His marriage falls apart, and to top it off, the mafia suspect a mole in the organization. The real dilemma is afforded to Pistone, who knows if he walks away from the mafia, Ruggiero will be the one punished. Written by P. Wong <pwong@nt.net>","Genre":"Biography, Crime, Drama","Keywords":"mafia, fbi, money, racial slur, singer","imdbRating":"7.8","imdbVotes":"219,811","Awards":"Nominated for 1 Oscar. Another 2 wins & 14 nominations.","Metascore":"76","Released":"28 February 1997 (USA) ","Location":"Chambers Paper Fibers, Plymouth Street, Brooklyn, New York City, New York, USA ","Actors":"Al Pacino, Johnny Depp, Michael Madsen ","Writer":"Joseph D. Pistone (book), Richard Woodley (book) | 1 more credit »","Running_time":"PT127M / 2h 7min","Description":"Directed by Mike Newell.  With Al Pacino, Johnny Depp, Michael Madsen, Bruno Kirby. An FBI undercover agent infiltrates the mob and finds himself identifying more with the mafia life, at the expense of his regular one.","Rated":"R"}