{"imdbID":"tt0112641","Title":"Casino","Year":"1995","Director":"Martin Scorsese","Taglines":"Don't Push Your Luck. ","Country":"USA, France","Language":"English","Also_Known_As":"Kazino ","Budget":"$52,000,000 (estimated)","Gross":"£3,834,340 (UK) (15 March 1996)","Production_Co":"Universal Pictures, Syalis DA, Légende Entreprises ","":"Show detailed company contact information on IMDbPro »","Runtime":"178 min","Sound_Mix":"DTS-Stereo | DTS","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"To give Dante Ferretti an idea of the look of the production design, Martin Scorsese screened the original Ocean's 11 (1960) for him. See more »","Goofs":"When Nicky calls Sam after Sam kicked the big cowboy from Nicky's crew out of the casino for cursing him, Nicky apologizes, then hangs up the phone. Nicky then asks the cowboy why he \"took off his boots and put his feet on the blackjack table.\" However, Sam never told Nicky this information. See more »","Crazy_Credits":"SPOILER: Nicky is about to finish his narration, he's cut short by the mobsters wanting to whack him. See more »","Cast":"Robert De Niro, Sharon Stone, Joe Pesci, James Woods, Don Rickles, Alan King, Kevin Pollak, L.Q. Jones, Dick Smothers, Frank Vincent, John Bloom, Pasquale Cajano, Melissa Prophet, Bill Allison, Vinny Vella","Plot":"Greed, deception, money, power, and murder occur between two mobster best friends and a trophy wife over a gambling empire. This Martin Scorsese film depicts the Janus-like quality of Las Vegas--it has a glittering, glamorous face, as well as a brutal, cruel one. Ace Rothstein and Nicky Santoro, mobsters who move to Las Vegas to make their mark, live and work in this paradoxical world. Seen through their eyes, each as a foil to the other, the details of mob involvement in the casinos of the 1970's and '80's are revealed. Ace is the smooth operator of the Tangiers casino, while Nicky is his boyhood friend and tough strongman, robbing and shaking down the locals. However, they each have a tragic flaw--Ace falls in love with a hustler, Ginger, and Nicky falls into an ever-deepening spiral of drugs and violence. Written by Tad Dibbern <DIBBERN_D@a1.mscf.upenn.edu>","Genre":"Biography, Crime, Drama","Keywords":"gambling syndicate, casino, mafia, boyhood friend, italian mafia","imdbRating":"8.2","imdbVotes":"320,571","Awards":"Nominated for 1 Oscar. Another 3 wins & 9 nominations.","Metascore":"73","Released":"22 November 1995 (USA) ","Location":"357 Desert Inn Road, Las Vegas, Nevada, USA ","Actors":"Robert De Niro, Sharon Stone, Joe Pesci ","Writer":"Nicholas Pileggi (book), Nicholas Pileggi (screenplay) | 1 more credit »","Running_time":"PT178M / 2h 58min","Description":"Directed by Martin Scorsese.  With Robert De Niro, Sharon Stone, Joe Pesci, James Woods. Greed, deception, money, power, and murder occur between two mobster best friends and a trophy wife over a gambling empire.","Rated":"R"}