{"imdbID":"tt0103874","Title":"Bram Stoker's Dracula","Year":"1992","Director":"Francis Ford Coppola","Taglines":"The blood is life. ","Country":"USA","Language":"English, Romanian, Greek, Bulgarian, Latin","Also_Known_As":"Bram Stoker's Dracula ","Budget":"$40,000,000 (estimated)","Gross":"$321,659 (Argentina)","Production_Co":"American Zoetrope, Columbia Pictures Corporation, Osiris Films ","Runtime":"128 min | 155 min (original cut)","Sound_Mix":"Dolby Digital","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Miniatures were used extensively in the film. Examples can be seen when Dracula drops Mina off in the carriage; the house behind the gate is a miniature model. Also, when Mina looks out the window at Carfax Abbey when the men go there to sanitize Dracula's crates of soil, Carfax Abbey itself is a miniature model in this shot. See more »","Goofs":"The blood on Elisabeta's body. See more »","Cast":"Gary Oldman, Winona Ryder, Anthony Hopkins, Keanu Reeves, Richard E. Grant, Cary Elwes, Billy Campbell, Sadie Frost, Tom Waits, Monica Bellucci, Michaela Bercu, Florina Kendrick, Jay Robinson, I.M. Hobson, Laurie Franks","Plot":"The vampire comes to England to seduce a visitor's fiancee and inflict havoc in the foreign land. This version of Dracula is closely based on Bram Stoker's classic novel of the same name. A young lawyer (Jonathan Harker) is assigned to a gloomy village in the mists of eastern Europe. He is captured and imprisoned by the undead vampire Dracula, who travels to London, inspired by a photograph of Harker's betrothed, Mina Murray. In Britain, Dracula begins a reign of seduction and terror, draining the life from Mina's closest friend, Lucy Westenra. Lucy's friends gather together to try to drive Dracula away. Written by Goth <brooks@odie.ee.wits.ac.za>","Genre":"Fantasy, Horror, Romance","Keywords":"dracula, monster sex, vampire, maze, horror movie remake","imdbRating":"7.5","imdbVotes":"139,214","Awards":"Won 3 Oscars. Another 12 wins & 15 nominations.","Metascore":"57","Released":"13 November 1992 (USA) ","Location":"Culver City, California, USA ","Actors":"Gary Oldman, Winona Ryder, Anthony Hopkins ","Writer":"Bram Stoker (novel), James V. Hart (screenplay)","Running_time":"PT128M / 2h 8min","Description":"Directed by Francis Ford Coppola.  With Gary Oldman, Winona Ryder, Anthony Hopkins, Keanu Reeves. The vampire comes to England to seduce a visitor's fiancee and inflict havoc in the foreign land.","Rated":"R"}