{"imdbID":"tt0117665","Title":"Sleepers","Year":"1996","Director":"Barry Levinson","Taglines":"Four friends have made a mistake that will change their lives forever. ","Country":"USA","Language":"English","Also_Known_As":"Los hijos de la calle ","Budget":"$44,000,000 (estimated)","Opening_Weekend":"$12,305,745 (USA) (18 October 1996)","Gross":"$53,300,852 (USA) (24 January 1997)","Production_Co":"Astoria Films, Baltimore Pictures, Polygram Filmed Entertainment ","Runtime":"147 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Black and White | Color","Aspect_Ratio":"2.35 : 1","Trivia":"Author Lorenzo Carcaterra has claimed that his book on which the film is based was a true story of his childhood. When the New York legal community went on record stating that no cases resembling the events of his book could be found in any court records, Carcaterra refused to discuss the discrepancy. It is generally believed that his book was almost 100% fiction. Carcaterra's school attendance records show he could not have been in prison for as long as he said, and that he could not have been in prison at the dates given for certain events in the book. See more »","Goofs":"The R33/R36 cars on the IRT #7 line seen approaching 45 Road station in Long Island City, Queens were not painted red until 1985/1988. Most were in their original turquoise colors in 1981. The MTA \"M\" logos at the end of each car were not installed on these cars until the late 1980s (1986-88). See more »","Cast":"Kevin Bacon, Billy Crudup, Robert De Niro, Ron Eldard, Minnie Driver, Vittorio Gassman, Dustin Hoffman, Terry Kinney, Bruno Kirby, Frank Medrano, Jason Patric, Joe Perrino, Brad Pitt, Brad Renfro, Geoffrey Wigdor","Plot":"After a prank goes disastrously wrong, a group of boys are sent to a detention center where they are brutalized; over 10 years later, they get their chance for revenge. Four boys growing up in Hell's Kitchen play a prank that leads to an old man getting hurt. Sentenced to no less than one year in the Wilkenson Center in upstate New York, the four friends are changed by the beating, humiliation and sexual abuse by the guards sworn to protect them. Thirteen years later and a chance meeting lead to a chance for revenge against the Wilkenson Center and the guards. Written by Albert@SaveKoalas.com","Genre":"Crime, Drama, Thriller","Keywords":"sexual abuse, kicked in the crotch, boy, prank, guard","imdbRating":"7.5","imdbVotes":"151,014","Awards":"Nominated for 1 Oscar. Another 1 win & 4 nominations.","Metascore":"49","Released":"18 October 1996 (USA) ","Location":"Brooklyn, New York City, New York, USA ","Actors":"Robert De Niro, Kevin Bacon, Brad Pitt ","Writer":"Lorenzo Carcaterra (book), Barry Levinson (screenplay)","Running_time":"PT147M / 2h 27min","Description":"Directed by Barry Levinson.  With Robert De Niro, Kevin Bacon, Brad Pitt, Jason Patric. After a prank goes disastrously wrong, a group of boys are sent to a detention center where they are brutalized; over 10 years later, they get their chance for revenge.","Rated":"R"}