{"imdbID":"tt0175880","Title":"Magnolia","Year":"1999","Director":"Paul Thomas Anderson","Writer":"Paul Thomas Anderson","Taglines":"Things fall down. People look up. And when it rains, it pours.","Country":"USA","Language":"English, German, French","Also_Known_As":"Mag·no'li·a ","Budget":"$37,000,000 (estimated)","Opening_Weekend":"$193,604 (USA) (17 December 1999)","Gross":"$22,450,975 (USA) (12 May 2000)","Production_Co":"Ghoulardi Film Company, New Line Cinema, The Magnolia Project ","Runtime":"188 min","Sound_Mix":"Dolby Digital | SDDS | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"There were reported walkouts when Magnolia (1999) was first released into cinemas. See more »","Goofs":"Approximately 13 minutes into the film, Officer Jim Kurring is wearing sunglasses while driving that reflect the camera mounted on the hood. See more »","Crazy_Credits":"Pedestrian #2 is incorrectly spelled Pedistrian #2. See more »","Cast":"Pat Healy, Genevieve Zweig, Mark Flannagan, Neil Flynn, Rod McLachlan, Allan Graf, Patton Oswalt, Raymond 'Big Guy' Gonzales, Brad Hunt, Jim Meskimen, Chris O'Hara, Clement Blake, Frank Elmore, John Kraft Seitz, Cory Buck","Plot":"An epic mosaic of interrelated characters in search of love, forgiveness, and meaning in the San Fernando Valley. 24 hours in L.A.; it's raining cats and dogs. Two parallel and intercut stories dramatize men about to die: both are estranged from a grown child, both want to make contact, and neither child wants anything to do with dad. Earl Partridge's son is a charismatic misogynist; Jimmy Gator's daughter is a cokehead and waif. A mild and caring nurse intercedes for Earl, reaching the son; a prayerful and upright beat cop meets the daughter, is attracted to her, and leads her toward a new calm. Meanwhile, guilt consumes Earl's young wife, while two whiz kids, one grown and a loser and the other young and pressured, face their situations. The weather, too, is quirky. Written by <jhailey@hotmail.com>","Genre":"Drama","Keywords":"coincidence, cancer, forgiveness, ensemble, abusive father","imdbRating":"8.0","imdbVotes":"236,288","Awards":"Nominated for 3 Oscars. Another 28 wins & 49 nominations.","Metascore":"77","Released":"7 January 2000 (USA) ","Location":"Angelus Oaks, California, USA ","Actors":"Tom Cruise, Jason Robards, Julianne Moore ","Running_time":"PT188M / 3h 8min","Description":"Directed by Paul Thomas Anderson.  With Tom Cruise, Jason Robards, Julianne Moore, Philip Seymour Hoffman. An epic mosaic of interrelated characters in search of love, forgiveness, and meaning in the San Fernando Valley.","Rated":"R"}