{"imdbID":"tt0112471","Title":"Before Sunrise","Year":"1995","Director":"Richard Linklater","Taglines":"Can the greatest romance of your life last only one night? ","Country":"USA, Austria, Switzerland","Language":"English, German, French","Also_Known_As":"Antes del amanecer ","Budget":"$2,500,000 (estimated)","Gross":"$5,400,000 (USA)","Production_Co":"Castle Rock Entertainment, Detour Filmproduction, Filmhaus Wien Universa Filmproduktions ","Runtime":"105 min","Sound_Mix":"Dolby SR","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"The film takes place on June 16, Bloomsday. See more »","Goofs":"Jesse and Celine walk towards the back of the train heading for the dining car. As they enter the dining car, the train is now traveling in the opposite direction, backwards. See more »","Crazy_Credits":"Closing dedication: In Memory Of My Grandparents Thelma and Charles Krieger Ada and Cecil Harmon Shirley and Charles Linklater See more »","Cast":"Ethan Hawke, Julie Delpy, Andrea Eckert, Hanno Pöschl, Karl Bruckschwaiger, Tex Rubinowitz, Erni Mangold, Dominik Castell, Haymon Maria Buttinger, Harald Waiglein, Bilge Jeschim, Kurti, Hans Weingartner, Liese Lyon, Peter Ily Huemer","Plot":"A young man and woman meet on a train in Europe, and wind up spending one evening together in Vienna. Unfortunately, both know that this will probably be their only night together. American tourist Jesse and French student Celine meet by chance on the train from Budapest to Vienna. Sensing that they are developing a connection, Jesse asks Celine to spend the day with him in Vienna, and she agrees. So they pass the time before his scheduled flight the next morning together. How do two perfect strangers connect so intimately over the course of a single day? What is that special thing that bonds two people so strongly? As their bond turns to love, what will happen to them the next morning when Jesse flies away? Written by randywong70@comcast.net","Genre":"Drama, Romance","Keywords":"love, conversations, destiny, coincidence, restaurant","imdbRating":"8.1","imdbVotes":"174,688","Awards":"1 win & 7 nominations.","Metascore":"77","Released":"27 January 1995 (USA) ","Location":"Austria ","Actors":"Ethan Hawke, Julie Delpy, Andrea Eckert ","Writer":"Richard Linklater, Kim Krizan","Running_time":"PT105M / 1h 45min","Description":"Directed by Richard Linklater.  With Ethan Hawke, Julie Delpy, Andrea Eckert, Hanno Pöschl. A young man and woman meet on a train in Europe, and wind up spending one evening together in Vienna. Unfortunately, both know that this will probably be their only night together.","Rated":"R"}