{"imdbID":"tt0180073","Title":"Quills","Year":"2000","Director":"Philip Kaufman","Country":"UK, Germany, USA","Language":"English, Latin","Budget":"$13,500,000 (estimated)","Gross":"ESP 65,173,251 (Spain) (29 June 2001)","Production_Co":"Fox Searchlight Pictures, Industry Entertainment, Walrus & Associates ","Runtime":"124 min","Cast":"Geoffrey Rush, Kate Winslet, Joaquin Phoenix, Michael Caine, Billie Whitelaw, Patrick Malahide, Amelia Warner, Jane Menelaus, Stephen Moyer, Tony Pritchard, Michael Jenn, Danny Babington, George Antoni, Stephen Marcus, Elizabeth Berrington","Plot":"In a Napoleonic era insane asylum, an inmate, the irrepressible Marquis De Sade, fights a battle of wills against a tyrannically prudish doctor. The infamous writer, the Marquis de Sade of 18th Century France, is imprisoned at Charenton Insane Asylum for unmentionable activities. He manages to befriend the young Abbé de Coulmier, who runs the asylum, along with a beautiful laundress named Madeline. Things go terribly wrong when the Abbe finds out that the Marquis' books are being secretly published. The emperor Napoleon contemplates sending Dr. Royer-Collard to oversee the asylum, a man famed for his torturous punishments. It could mean the end of Charenton and possibly the Marquis himself. Written by Emily H and Janette W","Genre":"Biography, Drama","Keywords":"male pubic hair, lust, penis, pubic hair, asylum","imdbRating":"7.4","imdbVotes":"44,044","Awards":"Nominated for 3 Oscars. Another 18 wins & 41 nominations.","Metascore":"70","Released":"25 December 2000 (USA) ","Location":"London, England, UK ","Actors":"Geoffrey Rush, Kate Winslet, Joaquin Phoenix ","Writer":"Doug Wright (play), Doug Wright (screenplay)","Running_time":"PT124M / 2h 4min","Description":"Directed by Philip Kaufman.  With Geoffrey Rush, Kate Winslet, Joaquin Phoenix, Michael Caine. In a Napoleonic era insane asylum, an inmate, the irrepressible Marquis De Sade, fights a battle of wills against a tyrannically prudish doctor.","Rated":"R"}