{"imdbID":"tt0108149","Title":"Six Degrees of Separation","Year":"1993","Director":"Fred Schepisi","Country":"USA","Language":"English","Budget":"$12,000,000 (estimated)","Gross":"$6,410,676 (USA)","Production_Co":"Metro-Goldwyn-Mayer (MGM), Maiden Movies, New Regency Pictures ","Runtime":"112 min","Cast":"Stockard Channing, Will Smith, Donald Sutherland, Ian McKellen, Mary Beth Hurt, Bruce Davison, Richard Masur, Anthony Michael Hall, Heather Graham, Eric Thal, Anthony Rapp, Osgood Perkins, Catherine Kellner, J.J. Abrams, Joe Pentangelo","Plot":"An affluent New York couple find their lives touched, intruded upon, and compelled by a mysterious young black man who is never quite who he says he is. New Yorkers Ouisa and Flan Kittredge are upper class private art dealers, pretentious but compassionate. Their prized possession is a double sided Kandinsky, one side that represents control, the other side chaos. They relay a story to their friends and acquaintances that over time becomes legendary. It is their encounter with a young black man who they had never met or heard of but who comes stumbling upon their front door one evening as they are courting an important investor, Geoffrey Miller, who could make them wealthy beyond what they could have dreamed. That black man is Paul Poitier, who has just arrived in the city, was just mugged outside their building and is sporting a minor knife wound to the abdomen. He is a friend of the Kittredge's children, who are attending Harvard, but more importantly is the son of actor/director Sidney Poitier. Tomorrow, Paul is meeting up with his father who is in town directing a movie of \"Cats\". Beyond the attraction of talking Paul into getting... Written by Huggo","Genre":"Comedy, Drama, Mystery","Keywords":"pubic hair, male pubic hair, penis, male frontal nudity, gay lead character","imdbRating":"6.9","imdbVotes":"16,048","Awards":"Nominated for 1 Oscar. Another 5 nominations.","Metascore":"","Released":"8 December 1993 (USA) ","Location":"860 Fifth Avenue, Manhattan, New York City, New York, USA ","Actors":"Will Smith, Stockard Channing, Donald Sutherland ","Writer":"John Guare (play), John Guare (screenplay)","Running_time":"PT112M / 1h 52min","Description":"Directed by Fred Schepisi.  With Will Smith, Stockard Channing, Donald Sutherland, Ian McKellen. An affluent New York couple find their lives touched, intruded upon, and compelled by a mysterious young black man who is never quite who he says he is.","Rated":"R"}