{"imdbID":"tt0108037","Title":"The Sandlot","Year":"1993","Director":"David M. Evans (as David Mickey Evans)","Taglines":"The adventure of a lifetime, the summer of their dreams...the dog of their nightmares ","Country":"USA","Language":"English","Also_Known_As":"The Sandlot Kids ","Gross":"$32,416,586 (USA)","Production_Co":"Twentieth Century Fox Film Corporation, Island World ","Runtime":"101 min","Sound_Mix":"Dolby","Color":"Black and White | Color","Aspect_Ratio":"2.35 : 1","Trivia":"Brandon Quintin Adams and Mike Vitar also starred in the D2: The Mighty Ducks. See more »","Goofs":"The sound of a ball hitting a metal bat is sometimes used even though the kids are using wooden bats. See more »","Cast":"Tom Guiry, Mike Vitar, Patrick Renna, Chauncey Leopardi, Marty York, Brandon Quintin Adams, Grant Gelt, Shane Obedzinski, Victor DiMattia, Denis Leary, Karen Allen, James Earl Jones, Marley Shelton, Herb Muller, Daniel Zacapa","Plot":"A new kid in town is taken under the wing of a young baseball prodigy and his team. Together, they get themselves into many adventures involving rival teams, lifeguards, and a vicious dog. Scotty Smalls moves to a new neighborhood with his mom and stepdad, and wants to learn to play baseball. The neighborhood baseball guru Rodriquez takes Smalls under his wing, and soon he's part of the local baseball buddies. They fall into adventures involving baseball, treehouse sleep-ins, the desirous lifeguard at the local pool, the snooty rival ball team, and the travelling fair. Beyond the fence at the back of the sandlot menaces a legendary ball-eating dog called The Beast, and the kids inevitably must deal with him. Written by Ed Sutton <esutton@mindspring.com>","Genre":"Comedy, Drama, Family","Keywords":"baseball, kid, beast, team, fence","imdbRating":"7.8","imdbVotes":"55,068","Awards":"1 win.","Metascore":"","Released":"7 April 1993 (USA) ","Location":"1388 Glenrose Drive, Salt Lake City, Utah, USA ","Actors":"Tom Guiry, Mike Vitar, Patrick Renna ","Writer":"David M. Evans (as David Mickey Evans), Robert Gunter","Running_time":"PT101M / 1h 41min","Description":"Directed by David M. Evans.  With Tom Guiry, Mike Vitar, Patrick Renna, Chauncey Leopardi. A new kid in town is taken under the wing of a young baseball prodigy and his team. Together, they get themselves into many adventures involving rival teams, lifeguards, and a vicious dog.","Rated":"PG"}