{"imdbID":"tt0195685","Title":"Erin Brockovich","Year":"2000","Director":"Steven Soderbergh","Writer":"Susannah Grant","Country":"USA","Language":"English","Budget":"$52,000,000 (estimated)","Gross":"$125,548,685 (USA) (4 August 2000)","Production_Co":"Universal Pictures, Columbia Pictures, Jersey Films ","Runtime":"131 min","Cast":"Julia Roberts, David Brisbin, Dawn Didawick, Albert Finney, Valente Rodriguez, Conchata Ferrell, George Rocky Sullivan, Pat Skipper, Jack Gill, Irene Olga López, Emily Marks, Julie Marks, Scotty Leavenworth, Gemmenne de la Peña, Erin Brockovich-Ellis","Plot":"An unemployed single mother becomes a legal assistant and almost single-handedly brings down a California power company accused of polluting a city's water supply. Erin Brockovich is an unemployed single mother, desperate to find a job, but is having no luck. This losing streak even extends to a failed lawsuit against a doctor in a car accident she was in. With no alternative, she successfully browbeats her lawyer to give her a job in compensation for the loss. While no one takes her seriously, with her trashy clothes and earthy manners, that soon changes when she begins to investigate a suspicious real estate case involving the Pacific Gas & Electric Company. What she discovers is that the company is trying quietly to buy land that was contaminated by hexavalent chromium, a deadly toxic waste that the company is improperly and illegally dumping and, in turn, poisoning the residents in the area. As she digs deeper, Erin finds herself leading point in a series of events that would involve her lawfirm in one of the biggest class action lawsuits in American history against a multi-billion dollar corporation. Written by Kenneth Chisholm <kchishol@execulink.com>","Genre":"Biography, Drama","Keywords":"environmental issue, contamination, working single mother, corporate crime, female protagonist","imdbRating":"7.3","imdbVotes":"131,050","Awards":"Won 1 Oscar. Another 31 wins & 57 nominations.","Metascore":"73","Released":"17 March 2000 (USA) ","Location":"Santa Ventura Studios - 5301 North Ventura Avenue, Ventura, California, USA ","Actors":"Julia Roberts, Albert Finney, David Brisbin ","Running_time":"PT131M / 2h 11min","Description":"Directed by Steven Soderbergh.  With Julia Roberts, Albert Finney, David Brisbin, Dawn Didawick. An unemployed single mother becomes a legal assistant and almost single-handedly brings down a California power company accused of polluting a city's water supply.","Rated":"R"}