{"imdbID":"tt0108550","Title":"What's Eating Gilbert Grape","Year":"1993","Director":"Lasse Hallström","Taglines":"Arnie knows a secret. His big brother Gilbert is the greatest person on the planet. ","Country":"USA","Language":"English","Also_Known_As":"Gilbert Grape ","Budget":"$11,000,000 (estimated)","Gross":"$9,170,214 (USA)","Production_Co":"Paramount Pictures ","Runtime":"118 min","Sound_Mix":"Dolby | Dolby SR","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Johnny Depp dared Leonardo DiCaprio to sniff a rancid pickled egg and paid DiCaprio $500 when he did. See more »","Goofs":"When Gilbert finds Arnie in the bath and takes him out, you can see a towel around Arnie's waist. See more »","Cast":"Johnny Depp, Leonardo DiCaprio, Juliette Lewis, Mary Steenburgen, Darlene Cates, Laura Harrington, Mary Kate Schellhardt, Kevin Tighe, John C. Reilly, Crispin Glover, Penelope Branning, Tim Green, Susan Loughran, Robert B. Hedges, Mark Jordan","Plot":"After his father's death, Gilbert has to care for his mentally disabled brother, Arnie, and his morbidly obese mother, which is suddenly challenged when love walks into his life. What's Eating Gibert Grape is a beautifully shot movie of tenderness, caring and self-awareness that is set amongst the fictional working class one street town Endora. Centred around the Grape family Ellen and Amy and their two brothers Arnie and Gilbert, who, along with their morbidly obese widowed mother Bonnie Grape are striving to survive and coexist with the absence of a father figure, low wage work and seventeen-year-old Arnie's severe mental condition. It is in this awkward and extremely one sided affair that the unfortunate Gilbert has to constantly, while working for the town's slowly dying convenience store, take care of his younger brother Arnie. Gilbert's life, his future, is thwarted he knows this, but it is in this guardian angel that his love and bond for Arnie cannot, and will not, be let go. That is until the free spirit of Becky arrives in town, and with her grandmother are stranded for the week while waiting for parts for their vehicle. This realization unties new ... Written by Cinema_Fan","Genre":"Drama, Romance","Keywords":"police, grocery store, apostrophe in title, four word title, face slap","imdbRating":"7.8","imdbVotes":"166,360","Awards":"Nominated for 1 Oscar. Another 5 wins & 3 nominations.","Metascore":"","Released":"4 March 1994 (USA) ","Location":"Georgetown, Texas, USA ","Actors":"Johnny Depp, Leonardo DiCaprio, Juliette Lewis ","Writer":"Peter Hedges (novel), Peter Hedges (screenplay)","Running_time":"PT118M / 1h 58min","Description":"Directed by Lasse Hallström.  With Johnny Depp, Leonardo DiCaprio, Juliette Lewis, Mary Steenburgen. After his father's death, Gilbert has to care for his mentally disabled brother, Arnie, and his morbidly obese mother, which is suddenly challenged when love walks into his life.","Rated":"PG-13"}