{"imdbID":"tt0114746","Title":"Twelve Monkeys","Year":"1995","Director":"Terry Gilliam","Taglines":"The future is history. ","Country":"USA","Language":"English, French","Also_Known_As":"12 Monkeys ","Budget":"$29,000,000 (estimated)","Opening_Weekend":"£1,320,430 (UK) (19 April 1996)","Gross":"£3,532,343 (UK) (17 May 1996)","Production_Co":"Universal Pictures, Atlas Entertainment, Classico ","":"Show detailed company contact information on IMDbPro »","Runtime":"129 min","Sound_Mix":"DTS-Stereo | DTS | Dolby SR","Color":"Color (Rankcolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Director Terry Gilliam tried to persuade the studio to cast Nick Nolte as James Cole and Jeff Bridges as Jeffrey Goines, but was not successful as none of the two had any big hits since Another 48 Hrs. (1990) and The Fabulous Baker Boys (1989). Nolte and Bridges are in fact close friends, and have tried and failed to team up several times. Cutter's Way (1981) and Tequila Sunrise (1988) were both meant to star the pair. They finally worked together in Simpatico (1999). See more »","Goofs":"In the first surface scene, the bear shot is reversed and, thus, it manages to completely inhale the condensation of its breath. See more »","Crazy_Credits":"The symbol of the 12 Monkeys provides the backdrop for the opening and closing credits. See more »","Cast":"Joseph Melito, Bruce Willis, Jon Seda, Michael Chance, Vernon Campbell, H. Michael Walls, Bob Adrian, Simon Jones, Carol Florence, Bill Raymond, Ernest Abuba, Irma St. Paule, Madeleine Stowe, Joey Perillo, Bruce Kirkpatrick","Plot":"In a future world devastated by disease, a convict is sent back in time to gather information about the man-made virus that wiped out most of the human population on the planet. An unknown and lethal virus has wiped out five billion people in 1996. Only 1% of the population has survived by the year 2035, and is forced to live underground. A convict (James Cole) reluctantly volunteers to be sent back in time to 1996 to gather information about the origin of the epidemic (who he's told was spread by a mysterious \"Army of the Twelve Monkeys\") and locate the virus before it mutates so that scientists can study it. Unfortunately Cole is mistakenly sent to 1990, six years earlier than expected, and is arrested and locked up in a mental institution, where he meets Dr. Kathryn Railly, a psychiatrist, and Jeffrey Goines, the insane son of a famous scientist and virus expert. Written by Giancarlo Cairella <vertigo@imdb.com>","Genre":"Mystery, Sci-Fi, Thriller","Keywords":"underground, madness, plague, virus, monkey","imdbRating":"8.1","imdbVotes":"446,644","Awards":"Nominated for 2 Oscars. Another 9 wins & 18 nominations.","Metascore":"74","Released":"5 January 1996 (USA) ","Location":"344 North Gay Street, Baltimore, Maryland, USA ","Actors":"Bruce Willis, Madeleine Stowe, Brad Pitt ","Writer":"Chris Marker (film La Jetée), David Webb Peoples (screenplay) (as David Peoples) | 1 more credit »","Running_time":"PT129M / 2h 9min","Description":"Directed by Terry Gilliam.  With Bruce Willis, Madeleine Stowe, Brad Pitt, Joseph Melito. In a future world devastated by disease, a convict is sent back in time to gather information about the man-made virus that wiped out most of the human population on the planet.","Rated":"R"}