{"imdbID":"tt0117951","Title":"Trainspotting","Year":"1996","Director":"Danny Boyle","Taglines":"Choose life. Choose a job. Choose a starter home. Choose dental insurance, leisure wear and matching luggage. Choose your future. But why would anyone want to do a thing like that? ","Country":"UK","Language":"English","Also_Known_As":"Ferrovipathes ","Budget":"$3,500,000 (estimated)","Opening_Weekend":"£4,703,433 (UK) (15 March 1996)","Gross":"$16,501,785 (USA) (13 December 1996)","Production_Co":"Channel Four Films, Figment Films, The Noel Gay Motion Picture Company ","":"Show detailed company contact information on IMDbPro »","Runtime":"94 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The sex scene between Ewan McGregor and Kelly Macdonald had to be trimmed for the American release by a few seconds, mainly because it appeared that Diane - a schoolgirl in the film - seemed to be enjoying it too much. See more »","Goofs":"The amount of beer on Begbie's shirt after making the heroin deal. See more »","Crazy_Credits":"The voice-over during the end of the end credits cites the seven movies in which Sean Connery played \"James Bond\". See more »","Cast":"Ewan McGregor, Ewen Bremner, Jonny Lee Miller, Kevin McKidd, Robert Carlyle, Kelly Macdonald, Peter Mullan, James Cosmo, Eileen Nicholas, Susan Vidler, Pauline Lynch, Shirley Henderson, Stuart McQuarrie, Irvine Welsh, Dale Winton","Plot":"Renton, deeply immersed in the Edinburgh drug scene, tries to clean up and get out, despite the allure of the drugs and influence of friends. A wild, freeform, Rabelaisian trip through the darkest recesses of Edinburgh low-life, focusing on Mark Renton and his attempt to give up his heroin habit, and how the latter affects his relationship with family and friends: Sean Connery wannabe Sick Boy, dimbulb Spud, psycho Begbie, 14-year-old girlfriend Diane, and clean-cut athlete Tommy, who's never touched drugs but can't help being curious about them... Written by Michael Brooke <michael@everyman.demon.co.uk>","Genre":"Drama","Keywords":"heroin addict, filthy toilet, drugs, heroin withdrawal, drug culture","imdbRating":"8.2","imdbVotes":"452,420","Awards":"Nominated for 1 Oscar. Another 20 wins & 25 nominations.","Metascore":"83","Released":"9 August 1996 (USA) ","Location":"78A Talgarth Road, West Kensington, London, England, UK ","Actors":"Ewan McGregor, Ewen Bremner, Jonny Lee Miller ","Writer":"Irvine Welsh (novel), John Hodge (screenplay)","Running_time":"PT94M / 1h 34min","Description":"Directed by Danny Boyle.  With Ewan McGregor, Ewen Bremner, Jonny Lee Miller, Kevin McKidd. Renton, deeply immersed in the Edinburgh drug scene, tries to clean up and get out, despite the allure of the drugs and influence of friends.","Rated":"R"}