{"imdbID":"tt0181689","Title":"Minority Report","Year":"2002","Director":"Steven Spielberg","Taglines":"Everybody Runs... ","Country":"USA","Language":"English, Swedish","Also_Known_As":"Second Sight ","Budget":"$102,000,000 (estimated)","Opening_Weekend":"$35,677,125 (USA) (21 June 2002)","Gross":"$15,916,084 (Japan) (31 January 2003)","Production_Co":"Twentieth Century Fox Film Corporation, DreamWorks SKG, Cruise/Wagner Productions ","Runtime":"145 min","Sound_Mix":"Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"When Agatha and John Anderton enter Leo Crowe's building Agatha says, 'Anderson, Leave,' rather than 'Anderton.' See more »","Goofs":"As Anderton approaches Crow, he has his gun drawn. Then we see him from a different angle and he draws his (already drawn, as far as we know) gun. See more »","Crazy_Credits":"In Memory of Michael Macias See more »","Cast":"Tom Cruise, Max von Sydow, Steve Harris, Neal McDonough, Patrick Kilpatrick, Jessica Capshaw, Richard Coca, Keith Campbell, Kirk B.R. Woller, Klea Scott, Frank Grillo, Anna Maria Horsford, Sarah Simmons, Eugene Osment, James Henderson","Plot":"In a future where a special police unit is able to arrest murderers before they commit their crimes, an officer from that unit is himself accused of a future murder. In the year 2054 A.D. crime is virtually eliminated from Washington D.C. thanks to an elite law enforcing squad \"Precrime\". They use three gifted humans (called \"Pre-Cogs\") with special powers to see into the future and predict crimes beforehand. John Anderton heads Precrime and believes the system's flawlessness steadfastly. However one day the Pre-Cogs predict that Anderton will commit a murder himself in the next 36 hours. Worse, Anderton doesn't even know the victim. He decides to get to the mystery's core by finding out the 'minority report' which means the prediction of the female Pre-Cog Agatha that \"might\" tell a different story and prove Anderton innocent. Written by Soumitra","Genre":"Action, Mystery, Sci-Fi","Keywords":"neo noir, murder, future, washington d.c., year 2054","imdbRating":"7.7","imdbVotes":"388,011","Awards":"Nominated for 1 Oscar. Another 18 wins & 73 nominations.","Metascore":"80","Released":"21 June 2002 (USA) ","Location":"Butter Island, Penobscot Bay, Maine, USA ","Actors":"Tom Cruise, Colin Farrell, Samantha Morton ","Writer":"Philip K. Dick (short story), Scott Frank (screenplay) | 1 more credit »","Running_time":"PT145M / 2h 25min","Description":"Directed by Steven Spielberg.  With Tom Cruise, Colin Farrell, Samantha Morton, Max von Sydow. In a future where a special police unit is able to arrest murderers before they commit their crimes, an officer from that unit is himself accused of a future murder.","Rated":"PG-13"}