{"imdbID":"tt0167404","Title":"The Sixth Sense","Year":"1999","Director":"M. Night Shyamalan","Writer":"M. Night Shyamalan","Taglines":"1...Sight 2...Sound 3...Smell 4...Taste 5..Touch 6...The Sixth Sense ","Country":"USA","Language":"English, Latin, Spanish","Also_Known_As":"El sexto sentido ","Budget":"$40,000,000 (estimated)","Opening_Weekend":"$26,681,262 (USA) (6 August 1999)","Gross":"$293,501,675 (USA) (12 May 2000)","Production_Co":"Hollywood Pictures, Spyglass Entertainment, Kennedy/Marshall Company, The ","":"Show detailed company contact information on IMDbPro »","Runtime":"107 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"The Latin phrase Cole speaks in the church when he first meets Malcolm: \"De profundis clamo ad te domine\" translates to \"Out of the depths, I cry to you, O Lord.\" These are the first few words of Psalm 130 in the Book of Psalms. See more »","Goofs":"When Cole steps away from the chair because Malcolm can't guess his thoughts: in close-up he uses the other foot to step back. See more »","Crazy_Credits":"The Spanish phrase \"I don't want to die\" that was played on the tape recorder in Malcolm's office is repeated after the credits. See more »","Cast":"Bruce Willis, Haley Joel Osment, Toni Collette, Olivia Williams, Trevor Morgan, Donnie Wahlberg, Peter Anthony Tambakis, Jeffrey Zubernis, Bruce Norris, Glenn Fitzgerald, Greg Wood, Mischa Barton, Angelica Page, Lisa Summerour, Firdous Bamji","Plot":"A boy who communicates with spirits that don't know they're dead seeks the help of a disheartened child psychologist. Malcom Crowe is a child psychologist who receives an award on the same night that he is visited by a very unhappy ex-patient. After this encounter, Crowe takes on the task of curing a young boy with the same ills as the ex-patient. This boy \"sees dead people\". Crowe spends a lot of time with the boy (Cole) much to the dismay of his wife. Cole's mom is at her wit's end with what to do about her son's increasing problems. Crowe is the boy's only hope. Written by Jeff Mellinger <jmell@uclink4.berkeley.edu>","Genre":"Drama, Mystery, Thriller","Keywords":"able to see the dead, plot twist, surprise ending, ghost, psychic","imdbRating":"8.1","imdbVotes":"679,860","Awards":"Nominated for 6 Oscars. Another 32 wins & 47 nominations.","Metascore":"64","Released":"6 August 1999 (USA) ","Location":"Blue Bell, Pennsylvania, USA ","Actors":"Bruce Willis, Haley Joel Osment, Toni Collette ","Running_time":"PT107M / 1h 47min","Description":"Directed by M. Night Shyamalan.  With Bruce Willis, Haley Joel Osment, Toni Collette, Olivia Williams. A boy who communicates with spirits that don't know they're dead seeks the help of a disheartened child psychologist.","Rated":"PG-13"}