{"imdbID":"tt0174856","Title":"The Hurricane","Year":"1999","Director":"Norman Jewison","Country":"USA","Language":"English","Budget":"$38,000,000 (estimated)","Gross":"£579,291 (UK) (14 April 2000)","Production_Co":"Azoff Entertainment, Beacon Communications, Beacon Pictures ","Runtime":"146 min","Cast":"Denzel Washington, Vicellous Reon Shannon, Deborah Kara Unger, Liev Schreiber, John Hannah, Dan Hedaya, Debbi Morgan, Clancy Brown, David Paymer, Harris Yulin, Rod Steiger, Badja Djola, Vincent Pastore, Al Waxman, David Lansbury","Plot":"The story of Rubin \"Hurricane\" Carter, a boxer wrongly imprisoned for murder, and the people who aided in his fight to prove his innocence. This film tells the story of Rubin \"Hurricane\" Carter, an African-American man who rose above his troubled youth to become a top contender for the middle-weight boxing title. However, his dreams are shattered when he is accused of a triple murder, and is convicted to three natural-life terms. Despite becoming a cause celebre and his dogged efforts to prove his innocence through his autobiography, the years of fruitless efforts have left him discouraged. This changes when an African-American boy and his Canadian mentors read his book and are convinced of his innocence enough to work for his exoneration. However, what Hurricane and his friends learn is that this fight puts them against a racist establishment that profited from this travesty and have no intention of seeing it reversed. Written by Kenneth Chisholm <kchishol@execulink.com>","Genre":"Biography, Drama, Sport","Keywords":"african american, murder, boxer, book, boxing","imdbRating":"7.6","imdbVotes":"74,299","Awards":"Nominated for 1 Oscar. Another 7 wins & 16 nominations.","Metascore":"74","Released":"14 January 2000 (USA) ","Location":"East Jersey State Prison, Rahway, New Jersey, USA ","Actors":"Denzel Washington, Vicellous Reon Shannon, Deborah Kara Unger ","Writer":"Rubin 'Hurricane' Carter (book), Sam Chaiton (book) | 3 more credits »","Running_time":"PT146M / 2h 26min","Description":"Directed by Norman Jewison.  With Denzel Washington, Vicellous Reon Shannon, Deborah Kara Unger, Liev Schreiber. The story of Rubin \"Hurricane\" Carter, a boxer wrongly imprisoned for murder, and the people who aided in his fight to prove his innocence.","Rated":"R"}