{"imdbID":"tt0119488","Title":"L.A. Confidential","Year":"1997","Director":"Curtis Hanson","Taglines":"Off the record, on the QT, and very hush-hush... ","Country":"USA","Language":"English","Also_Known_As":"Los Ángeles al desnudo ","Budget":"$35,000,000 (estimated)","Opening_Weekend":"$5,211,198 (USA) (19 September 1997)","Gross":"$64,604,977 (USA) (29 May 1998)","Production_Co":"Regency Enterprises, Wolper Organization, The, Warner Bros. ","":"Show detailed company contact information on IMDbPro »","Runtime":"138 min","Sound_Mix":"Dolby Digital","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"The character of Brett Chase is modeled after Jack Webb. See more »","Goofs":"The glass of scotch that Lynn gives to White at her house disappears, and then reappears again. See more »","Crazy_Credits":"Characters from the movie were incorporated into period stock footage shown during the credits See more »","Cast":"Kevin Spacey, Russell Crowe, Guy Pearce, James Cromwell, Kim Basinger, Danny DeVito, David Strathairn, Ron Rifkin, Matt McCoy, Paul Guilfoyle, Paolo Seganti, Elisabeth Granli, Sandra Taylor, Steve Rankin, Graham Beckel","Plot":"As corruption grows in 1950s LA, three policemen - one strait-laced, one brutal, and one sleazy - investigate a series of murders with their own brand of justice. 1950's Los Angeles is the seedy backdrop for this intricate noir-ish tale of police corruption and Hollywood sleaze. Three very different cops are all after the truth, each in their own style: Ed Exley, the golden boy of the police force, willing to do almost anything to get ahead, except sell out; Bud White, ready to break the rules to seek justice, but barely able to keep his raging violence under control; and Jack Vincennes, always looking for celebrity and a quick buck until his conscience drives him to join Exley and White down the one-way path to find the truth behind the dark world of L.A. crime. Written by Greg Bole <bole@life.bio.sunysb.edu>","Genre":"Crime, Drama, Mystery","Keywords":"corruption, 1950s, murder, call girl, police detective","imdbRating":"8.3","imdbVotes":"401,063","Awards":"Won 2 Oscars. Another 82 wins & 77 nominations.","Metascore":"90","Released":"19 September 1997 (USA) ","Location":"501 Wilcox Avenue, Los Angeles, California, USA ","Actors":"Kevin Spacey, Russell Crowe, Guy Pearce ","Writer":"James Ellroy (novel), Brian Helgeland (screenplay) | 1 more credit »","Running_time":"PT138M / 2h 18min","Description":"Directed by Curtis Hanson.  With Kevin Spacey, Russell Crowe, Guy Pearce, Kim Basinger. As corruption grows in 1950s LA, three policemen - one strait-laced, one brutal, and one sleazy - investigate a series of murders with their own brand of justice.","Rated":"R"}