{"imdbID":"tt0108052","Title":"Schindler's List","Year":"1993","Director":"Steven Spielberg","Taglines":"Whoever saves one life, saves the world entire. ","Certificate":"A | See all certifications »","Country":"USA","Language":"English, Hebrew, German, Polish","Also_Known_As":"La lista de Schindler ","Budget":"$22,000,000 (estimated)","Opening_Weekend":"£1,234,591 (UK) (4 March 1994)","Gross":"£16,439,233 (UK) (17 June 1994)","Production_Co":"Universal Pictures, Amblin Entertainment ","":"Show detailed company contact information on IMDbPro »","Runtime":"195 min | 185 min (TV)","Sound_Mix":"DTS | DTS-Stereo","Color":"Black and White | Color","Aspect_Ratio":"1.85 : 1","Trivia":"Sid Sheinberg brought \"Schindler's List\" to Steven Spielberg's attention when the novel was published in 1982 and purchased the rights, hoping that Spielberg would someday direct it. The movie's enormous success finally came at around the same time that Sheinberg was leaving MCA/Universal. See more »","Goofs":"The cabaret song at the start of the film - \"Der fröhliche Wanderer\" or \"Mein Vater war ein Wandersmann,\" known in English as \"The Happy Wanderer\" - was written after WWII. See more »","Crazy_Credits":"There are no opening credits after the title is shown. See more »","Cast":"Liam Neeson, Ben Kingsley, Ralph Fiennes, Caroline Goodall, Jonathan Sagall, Embeth Davidtz, Malgorzata Gebel, Shmuel Levy, Mark Ivanir, Béatrice Macola, Andrzej Seweryn, Friedrich von Thun, Krzysztof Luft, Harry Nehring, Norbert Weisser","Plot":"In Poland during World War II, Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis. Oskar Schindler is a vainglorious and greedy German businessman who becomes an unlikely humanitarian amid the barbaric Nazi reign when he feels compelled to turn his factory into a refuge for Jews. Based on the true story of Oskar Schindler who managed to save about 1100 Jews from being gassed at the Auschwitz concentration camp, it is a testament to the good in all of us. Written by Harald Mayr <marvin@bike.augusta.de>","Genre":"Biography, Drama, History","Keywords":"nazi, jew, german soldier, jewish, death","imdbRating":"8.9","imdbVotes":"829,152","Awards":"Won 7 Oscars. Another 69 wins & 33 nominations.","Metascore":"93","Released":"4 February 1994 (USA) ","Location":"Józefa, Kraków, Malopolskie, Poland ","Actors":"Liam Neeson, Ralph Fiennes, Ben Kingsley ","Writer":"Thomas Keneally (book), Steven Zaillian (screenplay)","Running_time":"PT195M / 3h 15min","Description":"Directed by Steven Spielberg.  With Liam Neeson, Ralph Fiennes, Ben Kingsley, Caroline Goodall. In Poland during World War II, Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.","Rated":"A"}