{"imdbID":"tt0120669","Title":"Fear and Loathing in Las Vegas","Year":"1998","Director":"Terry Gilliam","Taglines":"Give us your brain for two hours and you will never be the same again.....(Icelandic) ","Country":"USA","Language":"English","Also_Known_As":"Pánico y locura en Las Vegas ","Budget":"$18,500,000 (estimated)","Opening_Weekend":"$4,335,095 (USA) (22 May 1998)","Gross":"£206,498 (UK) (13 November 1998)","Production_Co":"Fear and Loathing LLC, Rhino Films, Shark Productions ","Runtime":"118 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"According to Johnny Depp, the gorilla statue outside the Bazooko Circus, now \"lives\" in his front yard. See more »","Goofs":"White SUV visible in opening scene: in the opening convertible scene, just after picking up the hitchhiker and around the point where Duke narrates \"...when my attorney starts screaming about bats...\" in the closeup shot of the hitchhiker. Just before the shot changes, an out-of-place white SUV can be spotted the far right of the screen behind the hitchhiker, parked along the desert highway. See more »","Crazy_Credits":"The Ralph Steadman drawings from the book are put in with the credits, along with the Gonzo & Duke in the Red Shark picture that takes up the whole screen at the end. See more »","Cast":"Johnny Depp, Benicio Del Toro, Tobey Maguire, Ellen Barkin, Gary Busey, Katherine Helmond, Michael Jeter, Mark Harmon, Penn Jillette, Craig Bierko, Lyle Lovett, Flea, Laraine Newman, Harry Dean Stanton, Tim Thomerson","Plot":"An oddball journalist and his psychopathic lawyer travel to Las Vegas for a series of psychedelic escapades. The big-screen version of Hunter S. Thompson's seminal psychedelic classic about his road trip across Western America as he and his large Samoan lawyer searched desperately for the \"American dream\"... they were helped in large part by the huge amount of drugs and alcohol kept in their convertible, The Red Shark. Written by Laurence Mixson","Genre":"Comedy","Keywords":"american dream, drugs, lawyer, journalist, convertible","imdbRating":"7.7","imdbVotes":"207,636","Awards":"1 win & 1 nomination.","Metascore":"41","Released":"22 May 1998 (USA) ","Location":"Ambassador Hotel - 3400 Wilshire Boulevard, Los Angeles, California, USA ","Actors":"Johnny Depp, Benicio Del Toro, Tobey Maguire ","Writer":"Hunter S. Thompson (book), Terry Gilliam (screenplay) | 3 more credits »","Running_time":"PT118M / 1h 58min","Description":"Directed by Terry Gilliam.  With Johnny Depp, Benicio Del Toro, Tobey Maguire, Ellen Barkin. An oddball journalist and his psychopathic lawyer travel to Las Vegas for a series of psychedelic escapades.","Rated":"R"}