{"imdbID":"tt0106977","Title":"The Fugitive","Year":"1993","Director":"Andrew Davis","Country":"USA","Language":"English, Polish, Spanish","Budget":"$40,000,000 (estimated)","Gross":"£13,883,238 (UK) (10 December 1993)","Production_Co":"Warner Bros. ","Runtime":"130 min","Cast":"Harrison Ford, Tommy Lee Jones, Sela Ward, Julianne Moore, Joe Pantoliano, Andreas Katsulas, Jeroen Krabbé, Daniel Roebuck, L. Scott Caldwell, Tom Wood, Ron Dean, Joseph F. Kosala, Miguel Nino, John Drummond, Tony Fosco","Plot":"Dr. Richard Kimble, unjustly accused of murdering his wife, must find the real killer while being the target of a nationwide manhunt. A well respected Chicago surgeon Dr. Richard Kimble has found out that his wife, Helen, has been murdered ferociously in her own home. The police found Kimble and accused him of the murder. Then, Kimble (without Justifiable Reason) was tried, convicted, and sentenced to death. However, on the way to prison, Kimble's transport crashed. Kimble escapes and is now on the run. Deputy Samuel Gerard from Chicago takes charge of the chase of Kimble. Meanwhile, Kimble makes up his own investigation to find who really killed his wife, and to lure Gerard and his team into it as well. Written by John Wiggins","Genre":"Action, Adventure, Crime","Keywords":"surgeon, u.s. marshal, one armed man, on the run, chicago illinois","imdbRating":"7.8","imdbVotes":"208,273","Awards":"Won 1 Oscar. Another 11 wins & 27 nominations.","Metascore":"88","Released":"6 August 1993 (USA) ","Location":"11219 S St Lawrence Ave, Chicago, Illinois, USA ","Actors":"Harrison Ford, Tommy Lee Jones, Sela Ward ","Writer":"Jeb Stuart (screenplay), David Twohy (screenplay) | 2 more credits »","Running_time":"PT130M / 2h 10min","Description":"Directed by Andrew Davis.  With Harrison Ford, Tommy Lee Jones, Sela Ward, Julianne Moore. Dr. Richard Kimble, unjustly accused of murdering his wife, must find the real killer while being the target of a nationwide manhunt.","Rated":"PG-13"}