{"imdbID":"tt0104797","Title":"Malcolm X","Year":"1992","Director":"Spike Lee","Country":"USA, Japan","Language":"English","Budget":"$33,000,000 (estimated)","Gross":"$48,169,908 (USA)","Production_Co":"Largo International N.V., JVC Entertainment Networks, 40 Acres & A Mule Filmworks ","Runtime":"202 min","Cast":"Denzel Washington, Angela Bassett, Albert Hall, Al Freeman Jr., Delroy Lindo, Spike Lee, Theresa Randle, Kate Vernon, Lonette McKee, Tommy Hollis, James McDaniel, Ernest Thomas, Jean-Claude La Marre, O.L. Duke, Larry McCoy","Plot":"Biographical epic of the controversial and influential Black Nationalist leader, from his early life and career as a small-time gangster, to his ministry as a member of the Nation of Islam. Biograpical epic of Malcolm X, the legendary African American leader. Born Malcolm Little, his father (a Garveyite Baptist minister) was killed by the Ku Klux Klan. Malcolm became a gangster, and while in jail discovered the Nation of Islam writings of Elijah Muhammad. He preaches the teachings when let out of jail, but later on goes on a pilgrimage to the city of Mecca, there he converts to the original Islamic religion and becomes a Sunni Muslim and changes his name to El-Hajj Malik Al-Shabazz. He is assassinated on February 21, 1965 and dies a Muslim martyr. Written by Anonymous","Genre":"Biography, Drama, Romance","Keywords":"nation of islam, ku klux klan, african american, civil rights, black history","imdbRating":"7.7","imdbVotes":"62,131","Awards":"Nominated for 2 Oscars. Another 17 wins & 14 nominations.","Metascore":"72","Released":"18 November 1992 (USA) ","Location":"USA ","Actors":"Denzel Washington, Angela Bassett, Delroy Lindo ","Writer":"Alex Haley (book), Malcolm X (book) | 2 more credits »","Running_time":"PT202M / 3h 22min","Description":"Directed by Spike Lee.  With Denzel Washington, Angela Bassett, Delroy Lindo, Spike Lee. Biographical epic of the controversial and influential Black Nationalist leader, from his early life and career as a small-time gangster, to his ministry as a member of the Nation of Islam.","Rated":"PG-13"}