{"imdbID":"tt0132477","Title":"October Sky","Year":"1999","Director":"Joe Johnston","Taglines":"Sometimes one dream is enough to light up the whole sky. ","Country":"USA","Language":"English","Also_Known_As":"Rocket Boys ","Budget":"$25,000,000 (estimated)","Opening_Weekend":"$5,905,250 (USA) (19 February 1999)","Gross":"$32,481,825 (USA) (23 July 1999)","Production_Co":"Universal Pictures ","Runtime":"108 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The engineer driving the steam locomotive in the rail-harvesting scene was played by renowned railroad photographer O. Winston Link. See more »","Goofs":"During the last launch sequence where John Hickam launches the \"Miss Riley\" Homer Hickam activates the launch box by flipping a switch on the box with one hand. In the next shot, it is apparent that he used his other hand to flip the switch. See more »","Crazy_Credits":"The real life people portrayed in the movie are shown during the end credits. See more »","Cast":"Jake Gyllenhaal, Chris Cooper, Laura Dern, Chris Owen, William Lee Scott, Chad Lindberg, Natalie Canerday, Scott Thomas, Randy Stripling, Chris Ellis, Elya Baskin, Courtney Cole-Fendley, David Dwyer, Terry Loughlin, Kaili Hollister","Plot":"The true story of Homer Hickam, a coal miner's son who was inspired by the first Sputnik launch to take up rocketry against his father's wishes. In a 1950's mining town called Coalwood, Homer Hickam is a kid with only one future in sight, to work in the local coal mine like his father. However in October 1957, everything changes when the first artificial satellite, Sputnik goes into orbit. With that event, Homer becomes inspired to learn how to build rockets. With his friends and the local nerd, Homer sets to do just that by trial and a lot of error. Unfortunately, most of the town and especially Homer's father thinks that they are wasting their time. Only one teacher in the high school understands their efforts and lets them know that they could become contenders in the national science fair with college scholarships being the prize. Now the gang must learn to perfect their craft and overcome the many problems facing them as they shoot for the stars. Written by Kenneth Chisholm <kchishol@execulink.com>","Genre":"Biography, Drama, Family","Keywords":"rocket, coal, sputnik, mining, mine","imdbRating":"7.8","imdbVotes":"62,308","Awards":"3 wins & 12 nominations.","Metascore":"71","Released":"19 February 1999 (USA) ","Location":"USA ","Actors":"Jake Gyllenhaal, Chris Cooper, Laura Dern ","Writer":"Homer H. Hickam Jr. (book), Lewis Colick (screenplay)","Running_time":"PT108M / 1h 48min","Description":"Directed by Joe Johnston.  With Jake Gyllenhaal, Chris Cooper, Laura Dern, Chris Owen. The true story of Homer Hickam, a coal miner's son who was inspired by the first Sputnik launch to take up rocketry against his father's wishes.","Rated":"PG"}