{"imdbID":"tt0109424","Title":"Chungking Express","Year":"1994","Director":"Kar-Wai Wong (as Kar Wai Wong)","Writer":"Kar-Wai Wong (as Kar Wai Wong)","Taglines":"If my memory of her has an expiration date, let it be 10,000 years...","Country":"Hong Kong","Language":"Cantonese, English, Japanese, Hindi, Mandarin","Also_Known_As":"Chungking Express ","Gross":"SGD 167,000 (Singapore)","Production_Co":"Jet Tone Production ","Runtime":"102 min | 102 min (international)","Sound_Mix":"4-Track Stereo | Dolby SR","Color":"Color","Aspect_Ratio":"1.66 : 1","Trivia":"Included among the \"1001 Movies You Must See Before You Die\", edited by Steven Schneider. See more »","Goofs":"The woman in the blonde wig had no apparent opportunity to get the beeper number except from Cop 223 himself the night before, and he wouldn't have started to abandon his beeper as useless if he had just given someone new the number. See more »","Cast":"Brigitte Lin, Tony Chiu Wai Leung, Faye Wong, Takeshi Kaneshiro, Valerie Chow, Jinquan Chen, Lee-Na Kwan, Zhiming Huang, Liang Zhen, Songshen Zuo","Plot":"Two melancholy Hong Kong policemen fall in love: one with a mysterious female underworld figure, the other with a beautiful and ethereal server at a late-night restaurant he frequents. Wong Kar-Wai's movie about two love-struck cops is filmed in impressionistic splashes of motion and color. The first half deals with Cop 223, who has broken up with his girlfriend of five years. He purchases a tin of pineapples with an expiration date of May 1 each day for a month. By the end of that time, he feels that he will either be rejoined with his love or that it too will have expired forever. The second half shows Cop 663 dealing with his breakup with his flight attendant girlfriend. He talks to his apartment furnishings until he meets a new girl at a local lunch counter. Written by Tad Dibbern <DIBBERN_D@a1.mscf.upenn.edu>","Genre":"Comedy, Drama, Romance","Keywords":"love, hong kong, expiration date, date, camera","imdbRating":"8.1","imdbVotes":"38,811","Awards":"8 wins & 19 nominations.","Metascore":"77","Released":"8 March 1996 (USA) ","Location":"Chungking Mansions, 36-44 Nathan Road, Tsim Sha Tsui, Kowloon, Hong Kong ","Actors":"Brigitte Lin, Takeshi Kaneshiro, Tony Chiu Wai Leung ","Running_time":"PT102M / 1h 42min","Description":"Directed by Kar-Wai Wong.  With Brigitte Lin, Takeshi Kaneshiro, Tony Chiu Wai Leung, Faye Wong. Two melancholy Hong Kong policemen fall in love: one with a mysterious female underworld figure, the other with a beautiful and ethereal server at a late-night restaurant he frequents.","Rated":"PG-13"}