{"imdbID":"tt0106489","Title":"A Bronx Tale","Year":"1993","Director":"Robert De Niro","Taglines":"One man lives in the neighborhood, another man owns it. A devoted father battles the local crime boss for the life of his son.","Country":"USA","Language":"English, Italian","Also_Known_As":"In den Straßen der Bronx ","Budget":"$22,000,000 (estimated)","Gross":"$17,266,971 (USA)","Production_Co":"Price Entertainment, Penta Entertainment, Tribeca Productions ","Runtime":"121 min","Sound_Mix":"Dolby | Dolby SR","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"De Niro wanted Palminteri to be involved in every aspect of production. Palminteri was involved in casting, scouting locations, editing and sound mixing. See more »","Goofs":"Early in the movie, when we first see Calogero on the bus, he's wearing a white dress shirt. When Lorenzo drops him off at their bldg, Calogero is wearing a white T-shirt as he looks up at his Mom. After we see his Mom in the window waving, he has the dress shirt on again. See more »","Crazy_Credits":"Dedicated to the memory of Robert De Niro, Sr. See more »","Cast":"Robert De Niro, Chazz Palminteri, Lillo Brancato, Francis Capra, Taral Hicks, Kathrine Narducci, Clem Caserta, Alfred Sauchelli Jr., Frank Pietrangolare, Joe Pesci, Robert D'Andrea, Eddie Montanaro, Fred Fischer, Dave Salerno, Joseph D'Onofrio","Plot":"A father becomes worried when a local gangster befriends his son in the Bronx in the 1960s. Gangster Sonny is the big man in the Bronx neighborhood of an Italian small boy named Calogero. A shooting witnessed by the boy (nicknamed C) is the starting point of a lasting bond between the gangster and the boy. Father (bus driver Lorenzo), however, disapproves. C grows up under the wing of both men, torn between his own natural honesty and his fascination with Sonny. C's neighborhood cronies get involved in theft, use of guns, and racial fights. When C falls for an African American girl, things don't get any easier. C's leap to manhood is marked by tragedy, but also by his recognition of the many faces of love. Written by Horacio Abeledo <horabe@ipcabe.uba.ar>","Genre":"Crime, Drama","Keywords":"gangster, money, bus, bar, racist","imdbRating":"7.8","imdbVotes":"95,505","Awards":"1 win & 3 nominations.","Metascore":"80","Released":"1 October 1993 (USA) ","Location":"Astoria, Queens, New York City, New York, USA ","Actors":"Robert De Niro, Chazz Palminteri, Lillo Brancato ","Writer":"Chazz Palminteri (play), Chazz Palminteri (screenplay)","Running_time":"PT121M / 2h 1min","Description":"Directed by Robert De Niro.  With Robert De Niro, Chazz Palminteri, Lillo Brancato, Francis Capra. A father becomes worried when a local gangster befriends his son in the Bronx in the 1960s.","Rated":"R"}