{"imdbID":"tt0101410","Title":"Barton Fink","Year":"1991","Taglines":"There's only one thing stranger than what's going on inside his head. What's going on outside. ","Country":"USA, UK","Language":"English","Also_Known_As":"Barton Fink - Delírios de Hollywood ","Budget":"$9,000,000 (estimated)","Gross":"$6,153,939 (USA)","Production_Co":"Circle Films, Working Title Films ","Runtime":"116 min","Sound_Mix":"Dolby","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"In his play, \"Bare Ruined Choirs\", Barton's characters are named Lil, Maury, and Dave. According to the original script, these are also the names of his parents and uncle, although in the film, his father's name is Sam. See more »","Goofs":"When Mundt pulls the bedframe apart, the metal ball that drops to the floor has a metal rod through the center. When it hits the floor, the rod is nowhere to be seen. See more »","Cast":"John Turturro, John Goodman, Judy Davis, Michael Lerner, John Mahoney, Tony Shalhoub, Jon Polito, Steve Buscemi, David Warrilow, Richard Portnow, Christopher Murney, I.M. Hobson, Meagen Fay, Lance Davis, Harry Bugin","Plot":"A renowned New York playwright is enticed to California to write for the movies and discovers the hellish truth of Hollywood. In 1941, New York intellectual playwright Barton Fink comes to Hollywood to write a Wallace Beery wrestling picture. Staying in the eerie Hotel Earle, Barton develops severe writer's block. His neighbor, jovial insurance salesman Charlie Meadows, tries to help, but Barton continues to struggle as a bizarre sequence of events distracts him even further from his task. Written by Scott Renshaw <as.idc@forsythe.stanford.edu>","Genre":"Comedy, Drama, Mystery","Keywords":"film industry, 1940s, surprise ending, writer, playwright","imdbRating":"7.7","imdbVotes":"85,875","Awards":"Nominated for 3 Oscars. Another 13 wins & 11 nominations.","Metascore":"69","Released":"21 August 1991 (USA) ","Location":"Vermont Avenue Tunnel, Griffith Park - 4730 Crystal Springs Drive, Los Angeles, California, USA ","Actors":"John Turturro, John Goodman, Judy Davis ","Director":"Joel Coen, Ethan Coen (uncredited)","Writer":"Joel Coen, Ethan Coen","Running_time":"PT116M / 1h 56min","Description":"Directed by Joel Coen, Ethan Coen.  With John Turturro, John Goodman, Judy Davis, Michael Lerner. A renowned New York playwright is enticed to California to write for the movies and discovers the hellish truth of Hollywood.","Rated":"R"}