{"imdbID":"tt0102926","Title":"The Silence of the Lambs","Year":"1991","Director":"Jonathan Demme","Taglines":"Dr. Hannibal Lecter. Brilliant. Cunning. Psychotic. In his mind lies the clue to a ruthless killer. - Clarice Starling, FBI. Brilliant. Vulnerable. Alone. She must trust him to stop the killer. ","Certificate":"A | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"El silencio de los inocentes ","Budget":"$19,000,000 (estimated)","Gross":"SGD 513,930 (Singapore)","Production_Co":"Strong Heart/Demme Production, Orion Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"118 min | 138 min (original cut)","Sound_Mix":"Dolby SR","Color":"Color (Eastmancolor)","Aspect_Ratio":"1.85 : 1","Trivia":"When Anthony Hopkins found out that he was cast as Hannibal Lecter based on his performance as Dr. Frederick Treves in The Elephant Man (1980) he questioned Jonathan Demme and said \"But Dr. Treves was a good man.\" To which Demme replied \"So is Lecter, he is a good man too. Just trapped in an insane mind.\" See more »","Goofs":"In the novel \"Hannibal\", it is said that Clarice is 32, if that holds true for the movie that means that Clarice would have been 22 in \"Silence of the Lambs\", as this movie takes place 10 years before the \"Hannibal\" movie. Clarice would have been a year too young to apply for the FBI, as you must be 23 to apply. See more »","Crazy_Credits":"There is a 'Moth Wrangler/Make-Up' listed in the crew list. See more »","Cast":"Jodie Foster, Lawrence A. Bonney, Kasi Lemmons, Lawrence T. Wrentz, Scott Glenn, Anthony Heald, Frankie Faison, Don Brockett, Frank Seals Jr., Stuart Rudin, Anthony Hopkins, Maria Skorobogatov, Jeffrie Lane, Leib Lensky, George 'Red' Schwartz","Plot":"A young F.B.I. cadet must confide in an incarcerated and manipulative killer to receive his help on catching another serial killer who skins his victims. Young FBI agent Clarice Starling is assigned to help find a missing woman to save her from a psychopathic serial killer who skins his victims. Clarice attempts to gain a better insight into the twisted mind of the killer by talking to another psychopath: Hannibal Lecter, who used to be a respected psychiatrist. FBI agent Jack Crawford believes that Lecter, who is also a very powerful and clever mind manipulator, has the answers to their questions and can help locate the killer. However, Clarice must first gain Lecter's confidence before the inmate will give away any information. Written by Sami Al-Taher <staher2000@yahoo.com>","Genre":"Crime, Drama, Thriller","Keywords":"serial killer, fbi agent, psychopath, case file, psycho thriller","imdbRating":"8.6","imdbVotes":"846,643","Awards":"Won 5 Oscars. Another 48 wins & 33 nominations.","Metascore":"84","Released":"14 February 1991 (USA) ","Location":"Clay County, West Virginia, USA ","Actors":"Jodie Foster, Anthony Hopkins, Lawrence A. Bonney ","Writer":"Thomas Harris (novel), Ted Tally (screenplay)","Running_time":"PT118M / 1h 58min","Description":"Directed by Jonathan Demme.  With Jodie Foster, Anthony Hopkins, Lawrence A. Bonney, Kasi Lemmons. A young F.B.I. cadet must confide in an incarcerated and manipulative killer to receive his help on catching another serial killer who skins his victims.","Rated":"A"}