{"imdbID":"tt0190590","Title":"O Brother, Where Art Thou?","Year":"2000","Taglines":"Sometimes, you have to lose your way to get back home ","Country":"UK, France, USA","Language":"English","Also_Known_As":"¿Dónde estás, hermano? ","Budget":"$26,000,000 (estimated)","Opening_Weekend":"£564,064 (UK) (15 September 2000)","Gross":"$45,506,619 (USA) (3 August 2001)","Production_Co":"Touchstone Pictures, Universal Pictures, StudioCanal ","Runtime":"106 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Included among the \"1001 Movies You Must See Before You Die\", edited by Steven Schneider. See more »","Goofs":"During the picnic with Big Dan, the guys are drinking Budweiser, but the labels are clearly from a modern Budweiser bottle. See more »","Crazy_Credits":"Title Design and Other Cool Stuff Balsmeyer & Everett, Inc. See more »","Cast":"George Clooney, John Turturro, Tim Blake Nelson, John Goodman, Holly Hunter, Chris Thomas King, Charles Durning, Del Pentecost, Michael Badalucco, J.R. Horne, Brian Reddy, Wayne Duvall, Ed Gale, Ray McKinnon, Daniel von Bargen","Plot":"In the deep south during the 1930s, three escaped convicts search for hidden treasure while a relentless lawman pursues them. Loosely based on Homer's \"Odyssey,\" the movie deals with the picaresque adventures of Ulysses Everett McGill and his companions Delmar and Pete in 1930s Mississipi. Sprung from a chain gang and trying to reach Everett's home to recover the buried loot of a bank heist they are confronted by a series of strange characters--among them sirens, a cyclops, bank robber George \"Baby Face\" Nelson (very annoyed by that nickname), a campaigning governor and his opponent, a KKK lynch mob, and a blind prophet who warns the trio that \"the treasure you seek shall not be the treasure you find.\" Written by Armin Ortmann <armin@sfb288.math.tu-berlin.de>","Genre":"Adventure, Comedy, Crime","Keywords":"siren, bank, convict, baby, blind prophet","imdbRating":"7.8","imdbVotes":"218,559","Awards":"Nominated for 2 Oscars. Another 7 wins & 35 nominations.","Metascore":"69","Released":"2 February 2001 (USA) ","Location":"Vicksburg, Mississippi, USA ","Actors":"George Clooney, John Turturro, Tim Blake Nelson ","Director":"Joel Coen, Ethan Coen (uncredited)","Writer":"Homer (epic poem \"The Odyssey\"), Ethan Coen | 1 more credit »","Running_time":"PT106M / 1h 46min","Description":"Directed by Joel Coen, Ethan Coen.  With George Clooney, John Turturro, Tim Blake Nelson, John Goodman. In the deep south during the 1930s, three escaped convicts search for hidden treasure while a relentless lawman pursues them.","Rated":"PG-13"}