{"imdbID":"tt0181865","Title":"Traffic","Year":"2000","Director":"Steven Soderbergh","Country":"USA, Germany","Language":"English, Spanish","Budget":"$48,000,000 (estimated)","Gross":"$124,107,476 (USA) (6 July 2001)","Production_Co":"Bedford Falls Company, The, Compulsion Inc., Initial Entertainment Group (IEG) ","Runtime":"147 min","Cast":"Benicio Del Toro, Jacob Vargas, Andrew Chavez, Michael Saucedo, Tomas Milian, Jose Yenque, Emilio Rivera, Michael O'Neill, Michael Douglas, Russell G. Jones, Lorene Hetherington, Eric Collins, Beau Holden, Peter Stader, James Lew","Plot":"A conservative judge is appointed by the President to spearhead America's escalating war against drugs, only to discover that his teenage daughter is a crack addict. Two DEA agents protect an informant. A jailed drug baron's wife attempts to carry on the family business. A modern day look at America's war on drugs told through four separate stories that are connected in one way or another. A conservative judge who's just been appointed as the US drug czar learns that his teenage honor student daughter is a drug addict. A beautiful trophy wife struggles to save her wealthy husband's drug business, while two DEA agents protect a witness with inside knowledge of the spouse's business. In Mexico, a slightly corrupt, yet dedicated cop struggles with his conscience when he learns that his new boss may not be the anti-drug official he made himself out to be. Written by <MonkeyKingMA@aol.com>","Genre":"Crime, Drama, Thriller","Keywords":"judge, interlinked stories, drug smuggling, kidnapping, color filter","imdbRating":"7.6","imdbVotes":"167,724","Awards":"Won 4 Oscars. Another 69 wins & 83 nominations.","Metascore":"86","Released":"5 January 2001 (USA) ","Location":"California, USA ","Actors":"Michael Douglas, Benicio Del Toro, Catherine Zeta-Jones ","Writer":"Simon Moore (miniseries Traffik), Stephen Gaghan (screenplay)","Running_time":"PT147M / 2h 27min","Description":"Directed by Steven Soderbergh.  With Michael Douglas, Benicio Del Toro, Catherine Zeta-Jones, Jacob Vargas. A conservative judge is appointed by the President to spearhead America's escalating war against drugs, only to discover that his teenage daughter is a crack addict. Two DEA agents protect an informant. A jailed drug baron's wife attempts to carry on the family business.","Rated":"R"}