{"imdbID":"tt0119217","Title":"Good Will Hunting","Year":"1997","Director":"Gus Van Sant","Taglines":"Wildly charismatic. Impossibly brilliant. Totally rebellious. For the first 20 years of his life, Will Hunting has called the shots. Now he's about to meet his match. ","Country":"USA","Language":"English","Also_Known_As":"En busca del destino ","Budget":"$10,000,000 (estimated)","Opening_Weekend":"$272,912 (USA) (5 December 1997)","Gross":"$138,339,411 (USA) (24 July 1998)","Production_Co":"Be Gentlemen Limited Partnership, Lawrence Bender Productions, Miramax ","":"Show detailed company contact information on IMDbPro »","Runtime":"126 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The entire scene where Sean tells Will the \"farting wife\" sequence, was unscripted. See more »","Goofs":"The chalkboards in the first classroom scene raise and lower by themselves a couple of times. See more »","Crazy_Credits":"Throughout the end credits, Will's car is driving down the highway. See more »","Cast":"Matt Damon, Robin Williams, Ben Affleck, Stellan Skarsgård, Minnie Driver, Casey Affleck, Cole Hauser, John Mighton, Rachel Majorowski, Colleen McCauley, Matt Mercier, Ralph St. George, Rob Lynds, Dan Washington, Alison Folland","Plot":"Will Hunting, a janitor at M.I.T., has a gift for mathematics, but needs help from a psychologist to find direction in his life. A touching tale of a wayward young man who struggles to find his identity, living in a world where he can solve any problem, except the one brewing deep within himself, until one day he meets his soul mate who opens his mind and his heart. Written by Dima & Danielle","Genre":"Drama","Keywords":"professor, genius, janitor, friend, loss of wife","imdbRating":"8.3","imdbVotes":"578,296","Awards":"Won 2 Oscars. Another 20 wins & 52 nominations.","Metascore":"70","Released":"9 January 1998 (USA) ","Location":"Massachusetts Turnpike, Massachusetts, USA ","Actors":"Robin Williams, Matt Damon, Ben Affleck ","Writer":"Matt Damon, Ben Affleck","Running_time":"PT126M / 2h 6min","Description":"Directed by Gus Van Sant.  With Robin Williams, Matt Damon, Ben Affleck, Stellan Skarsgård. Will Hunting, a janitor at M.I.T., has a gift for mathematics, but needs help from a psychologist to find direction in his life.","Rated":"R"}