{"imdbID":"tt0137523","Title":"Fight Club","Year":"1999","Director":"David Fincher","Taglines":"Works great even on blood stains. ","Certificate":"A | See all certifications »","Country":"USA, Germany","Language":"English","Also_Known_As":"El club de la pelea ","Budget":"$63,000,000 (estimated)","Opening_Weekend":"$11,035,485 (USA) (15 October 1999)","Gross":"$37,023,395 (USA) (25 February 2000)","Production_Co":"Fox 2000 Pictures, Regency Enterprises, Linson Films ","":"Show detailed company contact information on IMDbPro »","Runtime":"139 min | 151 min (workprint)","Sound_Mix":"Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"During the shooting of the sex scene, actors Brad Pitt and Helena Bonham Carter posed in 10 different positions from the Kama Sutra. See more »","Goofs":"When the Narrator is getting off the table in the police station after getting the gun, the wireless mic pack is visible and connected to his underpants. See more »","Crazy_Credits":"Just as the closing credits are about to start, a flash-frame-shot of a penis appears on the screen. See more »","Cast":"Edward Norton, Brad Pitt, Helena Bonham Carter, Meat Loaf, Zach Grenier, Richmond Arquette, David Andrews, George Maguire, Eugenie Bondurant, Christina Cabot, Sydney 'Big Dawg' Colston, Rachel Singer, Christie Cronenweth, Tim DeZarn, Ezra Buzzington","Plot":"An insomniac office worker, looking for a way to change his life, crosses paths with a devil-may-care soap maker, forming an underground fight club that evolves into something much, much more... A ticking-time-bomb insomniac and a slippery soap salesman channel primal male aggression into a shocking new form of therapy. Their concept catches on, with underground \"fight clubs\" forming in every town, until an eccentric gets in the way and ignites an out-of-control spiral toward oblivion. Written by Anonymous","Genre":"Drama","Keywords":"surprise ending, fighting, multiple personality disorder, insomnia, graphic violence","imdbRating":"8.9","imdbVotes":"1,289,284","Awards":"Nominated for 1 Oscar. Another 8 wins & 27 nominations.","Metascore":"66","Released":"15 October 1999 (USA) ","Location":"421 W. Eighth Street, Los Angeles, California, USA ","Actors":"Brad Pitt, Edward Norton, Helena Bonham Carter ","Writer":"Chuck Palahniuk (novel), Jim Uhls (screenplay)","Running_time":"PT139M / 2h 19min","Description":"Directed by David Fincher.  With Brad Pitt, Edward Norton, Helena Bonham Carter, Meat Loaf. An insomniac office worker, looking for a way to change his life, crosses paths with a devil-may-care soap maker, forming an underground fight club that evolves into something much, much more...","Rated":"A"}