{"imdbID":"tt0117381","Title":"Primal Fear","Year":"1996","Director":"Gregory Hoblit","Taglines":"Sooner or later a man who wears two faces forgets which one is real. ","Country":"USA","Language":"English, Spanish","Also_Known_As":"Iskonski strah ","Budget":"$30,000,000 (estimated)","Opening_Weekend":"$293,515 (USA) (26 July 1996)","Gross":"JPY 197,208,300 (Japan) (6 December 1996)","Production_Co":"Paramount Pictures, Rysher Entertainment ","Runtime":"129 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Andre braugher who plays a Chicago cop in this film later played a queens New York cop in frequency four years later also directed by Gregory Hoblit. See more »","Goofs":"At the original interview, Dr. Molly asks Aaron \"How did you meet?\" and then she asks \"What was the relationship like?\". When Marty is watching the interview tape, Dr. Molly, after asking \"How did you meet?\" says \"Doing what?\". See more »","Cast":"Richard Gere, Laura Linney, John Mahoney, Alfre Woodard, Frances McDormand, Edward Norton, Terry O'Quinn, Andre Braugher, Steven Bauer, Joe Spano, Tony Plana, Stanley Anderson, Maura Tierney, Jon Seda, Reg Rogers","Plot":"An altar boy is accused of murdering a priest, and the truth is buried several layers deep. Courtroom thriller about a slick, hotshot lawyer who takes the seemingly unwinnable case of a young altar boy accused of murdering an eminent catholic priest. Written by Jonathan Broxton <j.w.broxton@sheffield.ac.uk>","Genre":"Crime, Drama, Mystery","Keywords":"murder, altar boy, lawyer, priest, trial","imdbRating":"7.7","imdbVotes":"126,430","Awards":"Nominated for 1 Oscar. Another 10 wins & 10 nominations.","Metascore":"47","Released":"3 April 1996 (USA) ","Location":"Stage 20, Paramount Studios - 5555 Melrose Avenue, Hollywood, Los Angeles, California, USA ","Actors":"Richard Gere, Laura Linney, Edward Norton ","Writer":"William Diehl (novel), Steve Shagan (screenplay) | 1 more credit »","Running_time":"PT129M / 2h 9min","Description":"Directed by Gregory Hoblit.  With Richard Gere, Laura Linney, Edward Norton, John Mahoney. An altar boy is accused of murdering a priest, and the truth is buried several layers deep.","Rated":"R"}