{"imdbID":"tt0104952","Title":"My Cousin Vinny","Year":"1992","Director":"Jonathan Lynn","Writer":"Dale Launer","Taglines":"Truth, Justice And The Gambini Way. ","Country":"USA","Language":"English","Also_Known_As":"Mi primo Vinny ","Budget":"$11,000,000 (estimated)","Gross":"$52,929,168 (USA)","Production_Co":"Palo Vista Productions, Peter V. Miller Investment Corp., Twentieth Century Fox Film Corporation ","Runtime":"120 min","Sound_Mix":"Dolby SR","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The American Bar Association's publication, the ABA Journal, ranked the film #3 on its list of the \"25 Greatest Legal Movies. See more »","Goofs":"After Vinny's successful court appearance the D.A. calls to congratulate him, and to inform him of new evidence. The tie Vinny is wearing is different than the one he wore to court. See more »","Cast":"Joe Pesci, Ralph Macchio, Marisa Tomei, Mitchell Whitfield, Fred Gwynne, Lane Smith, Austin Pendleton, Bruce McGill, Maury Chaykin, Paulene Myers, Raynor Scheine, James Rebhorn, Chris Ellis, Michael Simpson, Lou Walker","Plot":"Two New Yorkers are accused of murder in rural Alabama while on their way back to college, and one of their cousins--an inexperienced, loudmouth lawyer not accustomed to Southern rules and manners--comes in to defend them. Bill Gambini and Stanley Rothenstein are two friends from New York University who just received scholarships to UCLA. They decide to drive through the South. Once they arrive in Alabama, they stop at a local convenience store to pick up a few snacks. But, no sooner than they leave the store, they are arrested. They had thought that they were arrested for shoplifting, but they were arrested for murder and robbery. Worse, they are facing execution for this crime. Bill and Stan do not have enough money for a lawyer, so the good news is that Bill has a lawyer in his family, his cousin, Vincent Laguardia Gambini. The bad news is that Vinny is an inexperienced lawyer who has not been at a trial. So, Vinny has to defend his clients and battle an uncompromising judge, some tough locals, and even his fiancée, Mona Lisa Vito, who just does not know when to shut up, to prove his clients' innocence. But he will soon realize that he is going to need help. Written by John Wiggins","Genre":"Comedy, Crime","Keywords":"lawyer, alabama, trial, jail, pubic hair","imdbRating":"7.5","imdbVotes":"80,708","Awards":"Won 1 Oscar. Another 3 wins & 2 nominations.","Metascore":"","Released":"13 March 1992 (USA) ","Location":"Alto, Georgia, USA ","Actors":"Joe Pesci, Marisa Tomei, Ralph Macchio ","Running_time":"PT120M / 2h","Description":"Directed by Jonathan Lynn.  With Joe Pesci, Marisa Tomei, Ralph Macchio, Mitchell Whitfield. Two New Yorkers are accused of murder in rural Alabama while on their way back to college, and one of their cousins--an inexperienced, loudmouth lawyer not accustomed to Southern rules and manners--comes in to defend them.","Rated":"R"}