{"imdbID":"tt0120689","Title":"The Green Mile","Year":"1999","Director":"Frank Darabont","Taglines":"Walk a mile you'll never forget. ","Certificate":"A | See all certifications »","Country":"USA","Language":"English, French","Also_Known_As":"Milagros inesperados ","Budget":"$60,000,000 (estimated)","Opening_Weekend":"$18,017,152 (USA) (10 December 1999)","Gross":"AUD 7,730,847 (Australia) (15 December 2000)","Production_Co":"Castle Rock Entertainment, Darkwoods Productions, Warner Bros. ","":"Show detailed company contact information on IMDbPro »","Runtime":"189 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Rodney Barnes was Michael Clarke Duncan's stand-in. According to Barnes, he sneaked onto the set by hiding in the paddy wagon. He surprised Frank Darabont and asked for a job. Darabont was impressed with Barnes' effort and hired him. Barnes wanted to work on the film so that he could meet his favorite author, Stephen King. See more »","Goofs":"At Eduard Delacroix's execution, it's hard to tell, but the water level in the bucket is indeed the same throughout the scene. See more »","Crazy_Credits":"There are no opening credits after the title has been shown, followed by the opening scene for place of film. Although it is now commonplace for films to not have opening credits, in 1999 it was somewhat rather unusually and it was considered for a trademark of director Frank Darabont. See more »","Cast":"Tom Hanks, David Morse, Michael Clarke Duncan, Bonnie Hunt, James Cromwell, Michael Jeter, Graham Greene, Doug Hutchison, Sam Rockwell, Barry Pepper, Jeffrey DeMunn, Patricia Clarkson, Harry Dean Stanton, Dabbs Greer, Eve Brent","Plot":"The lives of guards on Death Row are affected by one of their charges: a black man accused of child murder and rape, yet who has a mysterious gift. Death Row guards at a penitentiary, in the 1930's, have a moral dilemma with their job when they discover one of their prisoners, a convicted murderer, has a special gift. Written by Guy Johns","Genre":"Crime, Drama, Fantasy","Keywords":"prison guard, 1930s, death row inmate, healing, southern u.s.","imdbRating":"8.5","imdbVotes":"746,007","Awards":"Nominated for 4 Oscars. Another 14 wins & 29 nominations.","Metascore":"61","Released":"10 December 1999 (USA) ","Location":"Blowing Rock, North Carolina, USA ","Actors":"Tom Hanks, Michael Clarke Duncan, David Morse ","Writer":"Stephen King (novel), Frank Darabont (screenplay)","Running_time":"PT189M / 3h 9min","Description":"Directed by Frank Darabont.  With Tom Hanks, Michael Clarke Duncan, David Morse, Bonnie Hunt. The lives of guards on Death Row are affected by one of their charges: a black man accused of child murder and rape, yet who has a mysterious gift.","Rated":"A"}