{"imdbID":"tt0151804","Title":"Office Space","Year":"1999","Director":"Mike Judge","Taglines":"Work Sucks. ","Country":"USA","Language":"English","Also_Known_As":"Cubiculos de la oficina ","Budget":"$10,000,000 (estimated)","Opening_Weekend":"$4,231,727 (USA) (19 February 1999)","Gross":"ESP 89,991,972 (Spain) (29 June 2001)","Production_Co":"Twentieth Century Fox Film Corporation, Cubicle Inc. ","Runtime":"89 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Artie Lange auditioned for the role of Milton. See more »","Goofs":"When Peter, Michael, and Samir go for morning coffee, Michael pours tons of sugar packets into his coffee. The position of the empty sugar packets changes in one shot, moving to the side of his coffee cup where the rest show the packets in the front. See more »","Crazy_Credits":"Credits begin with outtakes featuring various actors from the movie. See more »","Cast":"Ron Livingston, Jennifer Aniston, David Herman, Ajay Naidu, Diedrich Bader, Stephen Root, Gary Cole, Richard Riehle, Alexandra Wentworth, Joe Bays, John C. McGinley, Paul Willson, Kinna McInroe, Todd Duffey, Greg Pitts","Plot":"Three company workers who hate their jobs decide to rebel against their greedy boss. In the Initech office, the insecure Peter Gibbons hates his job and the abusive Division VP Bill Lumbergh that has just hired two consultants to downsize the company. His best friends are the software engineers Michael Bolton and Samir Nagheenanajar that also hate Initech, and his next door neighbor Lawrence. His girlfriend Anne is cheating on him but she convinces Peter to visit the hypnotherapist Dr. Swanson. Peter tells how miserable his life is and Dr. Swanson hypnotizes him and he goes into a state of ecstasy. However, Dr. Swanson dies immediately after giving the hypnotic suggestion to Peter. He dates the waitress Joanna and changes his attitude in the company, being promoted by the consultants. When he discovers that Michael and Samir will be fired, they decide to plant a virus in the account system to embezzle fraction of cents in each financial operation into Peter's account. However Michael commits a mistake in the software and instead of decimals, they steal a large amount.... Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Comedy","Keywords":"boss, neighbor, office, corporation, software engineer","imdbRating":"7.8","imdbVotes":"194,724","Awards":"2 nominations.","Metascore":"68","Released":"19 February 1999 (USA) ","Location":"LBJ Freeway, Dallas, Texas, USA ","Actors":"Ron Livingston, Jennifer Aniston, David Herman ","Writer":"Mike Judge (Milton animated shorts), Mike Judge (screenplay)","Running_time":"PT89M / 1h 29min","Description":"Directed by Mike Judge.  With Ron Livingston, Jennifer Aniston, David Herman, Ajay Naidu. Three company workers who hate their jobs decide to rebel against their greedy boss.","Rated":"R"}