{"imdbID":"tt0100150","Title":"Miller's Crossing","Year":"1990","Taglines":"What's the rumpus? ","Certificate":"R | See all certifications »","Country":"USA","Language":"English, Italian, Irish, Yiddish","Also_Known_As":"De paseo a la muerte ","Budget":"$14,000,000 (estimated)","Gross":"$5,080,409 (USA)","Production_Co":"Circle Films, Twentieth Century Fox Film Corporation ","Runtime":"115 min","Sound_Mix":"Dolby SR","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Bernie is referred to as a Schmatte. 'Schmatte' is a Yiddish word for an old rag and was also used colloquially as a label for things of poor quality or anything worthless. Caspar's use is derogatory, labeling Bernie worthless both as a man and as a Jew. See more »","Goofs":"The position of the police chief's arms while talking to Tom during the attack on Leo's club. See more »","Cast":"Gabriel Byrne, Marcia Gay Harden, John Turturro, Jon Polito, J.E. Freeman, Albert Finney, Mike Starr, Al Mancini, Richard Woods, Thomas Toner, Steve Buscemi, Mario Todisco, Olek Krupa, Michael Jeter, Lanny Flaherty","Plot":"Tom Regan, an advisor to a Prohibition-era crime boss, tries to keep the peace between warring mobs but gets caught in divided loyalties. A highly styled 'genre' film which can perhaps be seen as a pastiche of all gangster movies. Tom Reagan is the laconic anti-hero of this amoral tale which is also, paradoxically, a look at morals within the criminal underworld of the 1930s. Two rival gangs vie for control of a city where the police are pawns, and the periodic busts of illicit drinking establishments are no more than a way for one gang to get back at the other. Black humour and shocking violence compete for screen time as we question whether or not Tom, right-hand man of the Irish mob leader, really has a heart. Written by <morry@argonet.co.uk>","Genre":"Crime, Drama, Thriller","Keywords":"irish mob, loyalty, betrayal, organized crime, neo noir","imdbRating":"7.9","imdbVotes":"101,277","Awards":"3 wins & 6 nominations.","Metascore":"66","Released":"5 October 1990 (USA) ","Location":"Magazine Street, New Orleans, Louisiana, USA ","Actors":"Gabriel Byrne, Albert Finney, John Turturro ","Director":"Joel Coen, Ethan Coen (uncredited)","Writer":"Joel Coen, Ethan Coen","Running_time":"PT115M / 1h 55min","Description":"Directed by Joel Coen, Ethan Coen.  With Gabriel Byrne, Albert Finney, John Turturro, Marcia Gay Harden. Tom Regan, an advisor to a Prohibition-era crime boss, tries to keep the peace between warring mobs but gets caught in divided loyalties.","Rated":"R"}