{"imdbID":"tt0106308","Title":"Army of Darkness","Year":"1992","Director":"Sam Raimi","Taglines":"In an age of darkness. At a time of evil. When the world needed a hero. What it got was him. ","Country":"USA","Language":"English","Also_Known_As":"Army of Darkness: The Ultimate Experience in Medieval Horror ","Budget":"$13,000,000 (estimated)","Gross":"$11,501,093 (USA)","Production_Co":"Dino De Laurentiis Company, Renaissance Pictures, Universal Pictures ","Runtime":"81 min | 96 min (director's cut) | 88 min (international cut)","Sound_Mix":"Dolby SR","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"An issue of the magazine \"Fangoria\" can be seen in the car's trunk. This was director Sam Raimi showing his gratitude for Fangoria including the original Evil Dead when it initially premiered. See more »","Goofs":"During the end battle as Ash starts running over the deadites with his steam powered modified car one of the skeletons can be heard shouting, \"It's the one in the car we want, get him!\" but cars hadn't yet been invented at the time. See more »","Crazy_Credits":"Ash can be heard laughing over the beginning of the credits in the original ending. See more »","Cast":"Bruce Campbell, Embeth Davidtz, Marcus Gilbert, Ian Abercrombie, Richard Grove, Timothy Patrick Quill, Michael Earl Reid, Bridget Fonda, Patricia Tallman, Ted Raimi, Deke Anderson, Bruce Thomas, Sara Shearer, Shiva Gordon, Billy Bryan","Plot":"A man is accidentally transported to 1300 A.D., where he must battle an army of the dead and retrieve the Necronomicon so he can return home. In this sequel to the Evil Dead films, a discount-store employee (\"Name's Ash. Housewares.\") is time-warped to a medieval castle beset by monstrous forces. Initially mistaken for an enemy, he is soon revealed as the prophecised savior who can quest for the Necronomicon, a book which can dispel the evil. Unfortunately, he screws up the magic words while collecting the tome, and releases an army of skeletons, led by his own Deadite counterpart. What follows is a thrilling, yet tongue-in-cheek battle between Ash's 20th Century tactics and the minions of darkness. Written by David Thiel <d-thiel@uiuc.edu>","Genre":"Comedy, Fantasy, Horror","Keywords":"necronomicon, skeleton soldier, reluctant hero, battle, army of the dead","imdbRating":"7.6","imdbVotes":"124,670","Awards":"7 wins & 4 nominations.","Metascore":"57","Released":"19 February 1993 (USA) ","Location":"Acton, California, USA ","Actors":"Bruce Campbell, Embeth Davidtz, Marcus Gilbert ","Writer":"Sam Raimi, Ivan Raimi","Running_time":"PT81M / 1h 21min","Description":"Directed by Sam Raimi.  With Bruce Campbell, Embeth Davidtz, Marcus Gilbert, Ian Abercrombie. A man is accidentally transported to 1300 A.D., where he must battle an army of the dead and retrieve the Necronomicon so he can return home.","Rated":"R"}