{"imdbID":"tt0117666","Title":"Sling Blade","Year":"1996","Director":"Billy Bob Thornton","Country":"USA","Language":"English","Budget":"$890,000 (estimated)","Gross":"$24,475,416 (USA) (25 July 1997)","Production_Co":"Miramax, Shooting Gallery ","Runtime":"135 min | 148 min (director's cut)","Cast":"Billy Bob Thornton, Dwight Yoakam, J.T. Walsh, John Ritter, Lucas Black, Natalie Canerday, James Hampton, Robert Duvall, Rick Dial, Brent Briscoe, Christine Renee Ward, Sarah Boss, Kathy Sue Brown, Wendell Rafferty, Bruce Hampton","Plot":"Karl Childers, a simple man hospitalized since his childhood murder of his mother and her lover, is released to start a new life in a small town. A partially handicapped man named Karl is released from a mental hospital, about 20 years after murdering his mother and another person. Karl is often questioned if he will ever kill again, and he shrugs in response saying there is no reason to. Now out of the mental institution, Karl settles in his old, small hometown, occupying himself by fixing motors. After meeting a young boy named Frank, who befriends him, Karl is invited to stay at Frank's house with his mother Linda, who views Karl as a strange but kind and generous man. However, Linda's abusive boyfriend, Doyle, sees things differently in the way rules ought to be run- normally insulting Linda's homosexual friend Vaughan as well as Karl's disabilities, and having wild parties with his friends. As Karl's relationship with Frank grows, he is watchful of Doyle's cruel actions. Written by commanderblue","Genre":"Drama","Keywords":"friend, murder, repair shop, mental institution, small town","imdbRating":"8.0","imdbVotes":"70,680","Awards":"Won 1 Oscar. Another 13 wins & 11 nominations.","Metascore":"84","Released":"14 March 1997 (USA) ","Location":"Benton, Arkansas, USA ","Actors":"Billy Bob Thornton, Dwight Yoakam, J.T. Walsh ","Writer":"Billy Bob Thornton (play), Billy Bob Thornton (screenplay)","Running_time":"PT135M / 2h 15min","Description":"Directed by Billy Bob Thornton.  With Billy Bob Thornton, Dwight Yoakam, J.T. Walsh, John Ritter. Karl Childers, a simple man hospitalized since his childhood murder of his mother and her lover, is released to start a new life in a small town.","Rated":"R"}