{"imdbID":"tt0111507","Title":"Three Colors: White","Year":"1994","Director":"Krzysztof Kieslowski","Country":"France, Poland, Switzerland","Language":"Polish, French, English, Russian","Also_Known_As":"Three Colors: White ","Gross":"$1,464,625 (USA)","Production_Co":"MK2 Productions, France 3 Cinéma, CAB Productions ","Runtime":"91 min","Sound_Mix":"Dolby SR","Color":"Color (Eastmancolor)","Aspect_Ratio":"1.85 : 1","Trivia":"Almost every shot in the movie contains at least one white object. See more »","Goofs":"After the court-room scene, Karol Karol is throwing up, but we can't hear a \"vomit splash\", and there isn't vomit in the closet. See more »","Cast":"Zbigniew Zamachowski, Julie Delpy, Janusz Gajos, Jerzy Stuhr, Aleksander Bardini, Grzegorz Warchol, Cezary Harasimowicz, Jerzy Nowak, Jerzy Trela, Cezary Pazura, Michel Lisowski, Philippe Morier-Genoud, Piotr Machalica, Francis Coffinet, Barbara Dziekan","Plot":"Second of a trilogy of films dealing with contemporary French society shows a Polish immigrant who wants to get even with his former wife. Karol (Polish) marries Domininque (French) and moves to Paris. The marriage breaks down and Dominique divorces Karol, forcing him into the life of a metro beggar and eventually back to Poland. However, he never forgets Dominique and while building a new life for himself in Warsaw he begins to plot... Written by Anonymous","Genre":"Comedy, Drama, Romance","Keywords":"marriage, french, obsession, poland, metro","imdbRating":"7.7","imdbVotes":"42,716","Awards":"1 win & 3 nominations.","Metascore":"","Released":"10 June 1994 (USA) ","Location":"Paris, France ","Actors":"Zbigniew Zamachowski, Julie Delpy, Janusz Gajos ","Writer":"Krzysztof Kieslowski (scenario), Krzysztof Piesiewicz (scenario) | 4 more credits »","Running_time":"PT91M / 1h 31min","Description":"Directed by Krzysztof Kieslowski.  With Zbigniew Zamachowski, Julie Delpy, Janusz Gajos, Jerzy Stuhr. Second of a trilogy of films dealing with contemporary French society shows a Polish immigrant who wants to get even with his former wife.","Rated":"R"}