{"imdbID":"tt0116477","Title":"Hamlet","Year":"1996","Director":"Kenneth Branagh","Country":"UK, USA","Language":"English","Also_Known_As":"William Shakespeare's Hamlet ","Budget":"$18,000,000 (estimated)","Opening_Weekend":"$148,321 (USA) (27 December 1996)","Gross":"ITL 1,526,158,000 (Italy) (6 June 1997)","Production_Co":"Castle Rock Entertainment, Turner Pictures (I), Fishmonger Films ","Runtime":"242 min | 150 min (cut)","Sound_Mix":"70 mm 6-Track (70 mm prints)| Dolby Digital (35 mm prints)| SDDS (35 mm prints)","Color":"Color (Technicolor)","Aspect_Ratio":"2.20 : 1","Trivia":"Star/Director Kenneth Branagh first encountered the 'full length' version of the play while performing in the 1992 BBC Radio production of the play with co-stars Derek Jacobi and Richard Briers (who would reprise their roles as Claudius and Polonius respectively in the film). This radio performance anticipated the winter 1992 full text production of Hamlet by the Royal Shakespeare company - the one that would finally crystallize Branagh's interpretation of the character and lead to the film. See more »","Goofs":"When Hamlet and Polonius are walking down a hallway discussing Hamlet's sanity, in one shot Hamlet is holding a skull mask, and in the next it's gone. See more »","Cast":"Riz Abbasi, Richard Attenborough, David Blair, Brian Blessed, Kenneth Branagh, Richard Briers, Michael Bryant, Peter Bygott, Julie Christie, Billy Crystal, Charles Daish, Judi Dench, Gérard Depardieu, Reece Dinsdale, Ken Dodd","Plot":"Hamlet, Prince of Denmark, returns home to find his father murdered and his mother remarrying the murderer, his uncle. Meanwhile, war is brewing. Hamlet, son of the king of Denmark, is summoned home for his father's funeral and his mother's wedding to his uncle. In a supernatural episode, he discovers that his uncle, whom he hates anyway, murdered his father. In an incredibly convoluted plot--the most complicated and most interesting in all literature--he manages to (impossible to put this in exact order) feign (or perhaps not to feign) madness, murder the \"prime minister,\" love and then unlove an innocent whom he drives to madness, plot and then unplot against the uncle, direct a play within a play, successfully conspire against the lives of two well-meaning friends, and finally take his revenge on the uncle, but only at the cost of almost every life on stage, including his own and his mother's. Written by John Brosseau <brossj5683@aol.com>","Genre":"Drama","Keywords":"denmark, madness, prince, funeral, murder","imdbRating":"7.8","imdbVotes":"30,020","Awards":"Nominated for 4 Oscars. Another 9 wins & 19 nominations.","Metascore":"","Released":"25 December 1996 (USA) ","Location":"Blenheim Palace, Woodstock, Oxfordshire, England, UK ","Actors":"Kenneth Branagh, Julie Christie, Derek Jacobi ","Writer":"William Shakespeare (play), Kenneth Branagh (screenplay)","Running_time":"PT242M / 4h 2min","Description":"Directed by Kenneth Branagh.  With Kenneth Branagh, Julie Christie, Derek Jacobi, Kate Winslet. Hamlet, Prince of Denmark, returns home to find his father murdered and his mother remarrying the murderer, his uncle. Meanwhile, war is brewing.","Rated":"PG-13"}