{"imdbID":"tt0106519","Title":"Carlito's Way","Year":"1993","Director":"Brian De Palma","Taglines":"In his world, you got to shoot your way out. He wanted out. He'd do anything to get there.","Country":"USA","Language":"English, Spanish","Also_Known_As":"Carlito's Way ","Budget":"$30,000,000 (estimated)","Opening_Weekend":"£1,112,190 (UK) (14 January 1994)","Gross":"£2,122,432 (UK) (4 February 1994)","Production_Co":"Universal Pictures, Epic Productions, Bregman/Baer Productions ","Runtime":"144 min","Sound_Mix":"DTS | Dolby","Color":"Black and White | Color","Aspect_Ratio":"2.35 : 1","Trivia":"The exterior of the hospital where Carlito visits his bedridden attorney is the same one where Vito Corleone is taken in The Godfather (1972), also starring Al Pacino. See more »","Goofs":"Carlito gets off a #1 or #9 Broadway/Seventh Ave local train at 42nd Street/Times Square. He runs to a doorway marked \"Grand Central Station\". After arriving at Times Square, he would have to take a 42nd street subway shuttle train to 42nd Street/Lexington Ave before he could run into Grand Central Station. See more »","Cast":"Al Pacino, Sean Penn, Penelope Ann Miller, John Leguizamo, Ingrid Rogers, Luis Guzmán, James Rebhorn, Joseph Siravo, Viggo Mortensen, Richard Foronjy, Jorge Porcel, Frank Minucci, Adrian Pasdar, John Ortiz, Ángel Salazar","Plot":"A Puerto Rican former convict, just released from prison, pledges to stay away from drugs and violence despite the pressure around him and lead on to a better life outside of N.Y.C. A Puerto Rican ex-con pledges to stay away from his former drug dealing ways but finds himself being dragged back by his past connections and the naive machinations of his lawyer and best friend. Hoping to raise enough money to get away from New York, Carlito Brigante takes on the job of running a nightclub, renews an affair with a dancer but old associates and old instincts suck him back into a world of violence and mistrust. Written by Keith Loh <loh@sfu.ca>","Genre":"Crime, Drama","Keywords":"1970s, prison, violence, puerto rican, drugs","imdbRating":"7.9","imdbVotes":"158,996","Awards":"Nominated for 2 Golden Globes. Another 1 win & 2 nominations.","Metascore":"","Released":"12 November 1993 (USA) ","Location":"Dock Lane, Kings Point, Long Island, New York, USA ","Actors":"Al Pacino, Sean Penn, Penelope Ann Miller ","Writer":"Edwin Torres (novels), David Koepp (screenplay)","Running_time":"PT144M / 2h 24min","Description":"Directed by Brian De Palma.  With Al Pacino, Sean Penn, Penelope Ann Miller, John Leguizamo. A Puerto Rican former convict, just released from prison, pledges to stay away from drugs and violence despite the pressure around him and lead on to a better life outside of N.Y.C.","Rated":"R"}