{"imdbID":"tt0138704","Title":"Pi","Year":"1998","Director":"Darren Aronofsky","Taglines":"3.14159265358 ","Country":"USA","Language":"English, Hebrew","Also_Known_As":"3.14159265358 ","Budget":"$60,000 (estimated)","Opening_Weekend":"$31,069 (USA) (10 July 1998)","Gross":"£133,538 (UK) (15 January 1999)","Production_Co":"Harvest Filmworks, Truth and Soul Pictures, Plantain Films ","Runtime":"84 min","Sound_Mix":"Dolby","Color":"Black and White","Aspect_Ratio":"1.66 : 1","Trivia":"The number Max is searching for is 216 digits long. 216 is 6x6x6; 666 is the \"number of the beast\" according to the Book of Revelation. See more »","Goofs":"Max writes the golden ratio as (a/b) = (a/a+b). It should be a/b = (a+b)/a, if, by definition, a>b. See more »","Crazy_Credits":"End credits shown over bugs crawling on Max's papers. See more »","Cast":"Sean Gullette, Mark Margolis, Ben Shenkman, Pamela Hart, Stephen Pearlman, Samia Shoaib, Ajay Naidu, Kristyn Mae-Anne Lao, Espher Lao Nieves, Joanne Gordon, Lauren Fox, Stanley B. Herman, Clint Mansell, Tom Tumminello, Henri Falconi","Plot":"A paranoid mathematician searches for a key number that will unlock the universal patterns found in nature. Max is a genius mathematician who's built a supercomputer at home that provides something that can be understood as a key for understanding all existence. Representatives both from a Hasidic cabalistic sect and high-powered Wall Street firm hear of that secret and attempt to seduce him. Written by Anonymous","Genre":"Drama, Thriller","Keywords":"using a metal detector on a beach, pattern, nature, numbers, mathematician","imdbRating":"7.5","imdbVotes":"139,521","Awards":"8 wins & 12 nominations.","Metascore":"72","Released":"10 July 1998 (USA) ","Location":"Brooklyn, New York City, New York, USA ","Actors":"Sean Gullette, Mark Margolis, Ben Shenkman ","Writer":"Darren Aronofsky, Darren Aronofsky (story) | 4 more credits »","Running_time":"PT84M / 1h 24min","Description":"Directed by Darren Aronofsky.  With Sean Gullette, Mark Margolis, Ben Shenkman, Pamela Hart. A paranoid mathematician searches for a key number that will unlock the universal patterns found in nature.","Rated":"R"}