{"imdbID":"tt0101765","Title":"The Double Life of Veronique","Year":"1991","Director":"Krzysztof Kieslowski","Taglines":"Each of us is matched somewhere in the world, by our exact double - someone who shares our thoughts and dreams","Country":"France, Poland, Norway","Language":"French, Polish, Italian","Also_Known_As":"The Double Life of Veronique ","Gross":"$1,999,955 (USA)","Production_Co":"Sidéral Productions, Zespol Filmowy \"Tor\", Norsk Film ","Runtime":"98 min","Sound_Mix":"Dolby SR","Color":"Color","Aspect_Ratio":"1.66 : 1","Trivia":"The role of Alexandre Fabbri, played by Philippe Volter, was originally offered to Italian actor-director Nanni Moretti. See more »","Goofs":"When Weronika is at the window of the bus, she holds some papers up to Antek, who is on a motorcycle. The angle she's holding the papers at alternates from perfectly straight to slightly askew as the shot alternates repeatedly from back to front. See more »","Cast":"Irène Jacob, Halina Gryglaszewska, Kalina Jedrusik, Aleksander Bardini, Wladyslaw Kowalski, Jerzy Gudejko, Janusz Sterninski, Philippe Volter, Sandrine Dumas, Louis Ducreux, Claude Duneton, Lorraine Evanoff, Guillaume de Tonquedec, Gilles Gaston-Dreyfus, Alain Frérot","Plot":"Two parallel stories about two identical women; one living in Poland, the other in France. They don't know each other, but their lives are nevertheless profoundly connected. Weronika lives in Poland. Véronique lives in Paris. They don't know each other. Weronika gets a place in a music school, works hard, but collapses and dies on her first performance. At this point, Véronique's life seems to take a turn and she decides not to be a singer... Written by Colin Tinto <cst@imdb.com>","Genre":"Drama, Fantasy, Music","Keywords":"sex scene, breasts, female nudity, female pubic hair, krakow poland","imdbRating":"7.9","imdbVotes":"26,976","Awards":"Nominated for 1 Golden Globe. Another 8 wins & 7 nominations.","Metascore":"","Released":"22 November 1991 (USA) ","Location":"Clermont-Ferrand, Puy-de-Dôme, France ","Actors":"Irène Jacob, Wladyslaw Kowalski, Halina Gryglaszewska ","Writer":"Krzysztof Kieslowski, Krzysztof Piesiewicz","Running_time":"PT98M / 1h 38min","Description":"Directed by Krzysztof Kieslowski.  With Irène Jacob, Wladyslaw Kowalski, Halina Gryglaszewska, Kalina Jedrusik. Two parallel stories about two identical women; one living in Poland, the other in France. They don't know each other, but their lives are nevertheless profoundly connected.","Rated":"R"}