{"imdbID":"tt0210945","Title":"Remember the Titans","Year":"2000","Director":"Boaz Yakin","Writer":"Gregory Allen Howard","Taglines":"History is written by the winners. ","Country":"USA","Language":"English","Also_Known_As":"Duelo de Titanes ","Budget":"$30,000,000 (estimated)","Opening_Weekend":"$20,905,831 (USA) (29 September 2000)","Gross":"ESP 243,785,332 (Spain) (29 June 2001)","Production_Co":"Jerry Bruckheimer Films, Run It Up Productions Inc., Technical Black ","Runtime":"113 min | 120 min (Director's Cut DVD)","Sound_Mix":"DTS | Dolby Digital | SDDS | Dolby SR (Western Electric Recording)","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"In real life, Coach Bill Yoast and his wife, Betty Yoast, bore four daughters instead of just one. His daughters are: Bonnie Jean Yoast Jeffries, Angela \"Angie\" Mildred Yoast Garrison, Sheryl Elizabeth Yoast Matthews (who was portrayed by Hayden Panettiere in this film), and Deidre \"Dee Dee\" Louise Yoast Fox. Bonnie was born on January 17th, 1951, and died on November 10th, 2003. She is buried at Ivy Hill Cemetery in Alexandria, Virginia. She is survived by three daughters and six grandchildren. Angela was born in 1956 and lives in Springfield, Virginia with her husband and children. Sheryl was born on February 5th, 1962, and died on May 4th, 1996 from a heart malfunction. She is buried close to her oldest sister Bonnie in the same cemetery. She is survived by her husband and their only child. Deidre was born in 1968 and also lives in Springfield, Virginia with her husband and children. In total, Bill and Betty Yoast have seven grandchildren and at least six great-grandchildren. See more »","Goofs":"In the opening scene the train going by has sunken well double stack trailer cars. These were not in common use until the 80's. See more »","Crazy_Credits":"Home movies are shown of each person, when they state what happened to them after the '71 season. See more »","Cast":"Denzel Washington, Will Patton, Wood Harris, Ryan Hurst, Donald Faison, Craig Kirkwood, Ethan Suplee, Kip Pardue, Hayden Panettiere, Nicole Ari Parker, Kate Bosworth, Earl Poitier, Ryan Gosling, Burgess Jenkins, Neal Ghant","Plot":"The true story of a newly appointed African-American coach and his high school team on their first season as a racially integrated unit. Suburban Virginia schools have been segregated for generations. One Black and one White high school are closed and the students sent to T.C. Williams High School under federal mandate to integrate. The year is seen through the eyes of the football team where the man hired to coach the Black school is made head coach over the highly successful white coach. Based on the actual events of 1971, the team becomes the unifying symbol for the community as the boys and the adults learn to depend on and trust each other. Written by LMN13","Genre":"Biography, Drama, Sport","Keywords":"high school, head coach, american football, based on true story, school","imdbRating":"7.8","imdbVotes":"156,552","Awards":"8 wins & 17 nominations.","Metascore":"48","Released":"29 September 2000 (USA) ","Location":"Covington, Georgia, USA ","Actors":"Denzel Washington, Will Patton, Wood Harris ","Running_time":"PT113M / 1h 53min","Description":"Directed by Boaz Yakin.  With Denzel Washington, Will Patton, Wood Harris, Ryan Hurst. The true story of a newly appointed African-American coach and his high school team on their first season as a racially integrated unit.","Rated":"PG"}