{"imdbID":"tt0247196","Title":"Before Night Falls","Year":"2000","Director":"Julian Schnabel","Country":"USA","Language":"English, Spanish, Russian, French","Gross":"£317,371 (UK) (6 July 2001)","Production_Co":"El Mar Pictures, Grandview Pictures ","Runtime":"133 min","Cast":"Olatz López Garmendia, Giovanni Florido, Loló Navarro, Batan Silva, Carmen Beato, Cy Schnabel, Olmo Schnabel, Vito Schnabel, Pedro Armendáriz Jr., Diego Luna, Lia Chapman, Sean Penn, Jerzy Skolimowski, Aquiles Benites, Ewa Piaskowska","Plot":"Episodic look at the life of Cuban poet and novelist, Reinaldo Arenas (1943-1990), from his childhood in Oriente province to his death in New York City. He joins Castro's rebels. By 1964, ... See full summary » Episodic look at the life of Cuban poet and novelist, Reinaldo Arenas (1943-1990), from his childhood in Oriente province to his death in New York City. He joins Castro's rebels. By 1964, he is in Havana. He meets the wealthy Pepe, an early lover; a love-hate relationship lasts for years. Openly gay behavior is a way to spite the government. His writing and homosexuality get him into trouble: he spends two years in prison, writing letters for other inmates and smuggling out a novel. He befriends Lázaro Gomes Garriles, with whom he lives stateless and in poverty in Manhattan after leaving Cuba in the Mariel boat-lift. When asked why he writes, he replies cheerfully, \"Revenge.\" Written by <jhailey@hotmail.com>","Genre":"Biography, Drama","Keywords":"cuban, poet, novelist, gay, cuba","imdbRating":"7.3","imdbVotes":"20,547","Awards":"Nominated for 1 Oscar. Another 15 wins & 20 nominations.","Metascore":"85","Released":"23 February 2001 (USA) ","Location":"Mexico ","Actors":"Javier Bardem, Johnny Depp, Olatz López Garmendia ","Writer":"Cunningham O'Keefe, Lázaro Gómez Carriles (as Lazaro Gomez Carriles) | 3 more credits »","Running_time":"PT133M / 2h 13min","Description":"Directed by Julian Schnabel.  With Javier Bardem, Johnny Depp, Olatz López Garmendia, Giovanni Florido. Episodic look at the life of Cuban poet and novelist, Reinaldo Arenas (1943-1990), from his childhood in Oriente province to his death in New York City. He joins Castro's rebels. By 1964, he is in Havana. He meets the wealthy Pepe, an early lover; a love-hate relationship lasts for years. Openly gay behavior is a way to spite the government. His writing and homosexuality get him into trouble: he ...","Rated":"R"}