{"imdbID":"tt0257044","Title":"Road to Perdition","Year":"2002","Director":"Sam Mendes","Taglines":"Every father is a hero to his son. ","Country":"USA","Language":"English","Also_Known_As":"Camino a la perdición ","Budget":"$80,000,000 (estimated)","Opening_Weekend":"$22,079,481 (USA) (12 July 2002)","Gross":"$40,935,560 (Europe) (10 January 2003)","Production_Co":"DreamWorks SKG, Twentieth Century Fox Film Corporation, Zanuck Company, The ","Runtime":"117 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Sam Mendes: [Water marks the event of a death] See more »","Goofs":"When Michael and his son first arrive in Chicago, there is a brief shot of bright silver metal cars on the El. They were introduced in the 1980s. In 1931, the cars would have been made of wood and painted dark brown. See more »","Crazy_Credits":"Thanks to all at the Donmar Warehouse Theatre, London See more »","Cast":"Tyler Hoechlin, Rob Maxey, Liam Aiken, Jennifer Jason Leigh, Tom Hanks, Paul Newman, Daniel Craig, Ciarán Hinds, Craig Spidle, Ian Barford, Stephen P. Dunn, Paul Turner, Kathleen Keane, Brendan McKinney, Jackie Moran","Plot":"Bonds of loyalty are put to the test when a hitman's son witnesses what his father does for a living. 1931. Mike Sullivan and Connor Rooney are two henchmen of elderly Chicago-based Irish-American mobster John Rooney, Connor's father. In many respects, John treats Mike more as his son, who he raised as his own after Mike was orphaned, than the volatile Connor, who nonetheless sees himself as the heir apparent to the family business. One evening, Mike's eldest son, twelve year old Michael Sullivan Jr., who has no idea what his father does for a living, witnesses Connor and his father gun down an associate and his men, the situation gone wrong initiated from an action by Connor. Caught witnessing the incident, Michael is sworn to secrecy about what he saw. Regardless, Connor, not wanting any loose ends, makes an attempt to kill Mike, his wife and their two sons. Mike and the surviving members of his family know that they need to go on the run as Connor, who has gone into hiding, will be protected through mob loyalty, especially by John, who cannot turn on his own flesh and blood. Still,... Written by Huggo","Genre":"Crime, Drama, Thriller","Keywords":"on the run, blood, gun, revenge, hitman","imdbRating":"7.7","imdbVotes":"195,347","Awards":"Won 1 Oscar. Another 20 wins & 71 nominations.","Metascore":"72","Released":"12 July 2002 (USA) ","Location":"Aurora, Illinois, USA ","Actors":"Tom Hanks, Tyler Hoechlin, Rob Maxey ","Writer":"Max Allan Collins (graphic novel), Richard Piers Rayner (graphic novel) | 1 more credit »","Running_time":"PT117M / 1h 57min","Description":"Directed by Sam Mendes.  With Tom Hanks, Tyler Hoechlin, Rob Maxey, Liam Aiken. Bonds of loyalty are put to the test when a hitman's son witnesses what his father does for a living.","Rated":"R"}