{"imdbID":"tt0280778","Title":"Iris","Year":"2001","Director":"Richard Eyre","Country":"UK, USA","Language":"English","Budget":"$5,500,000 (estimated)","Gross":"$1,292,119 (USA) (7 August 2015)","Production_Co":"British Broadcasting Corporation (BBC), Fox Iris Productions, Intermedia Films ","Runtime":"91 min","Cast":"Kate Winslet, Hugh Bonneville, Judi Dench, Jim Broadbent, Eleanor Bron, Angela Morant, Penelope Wilton, Siobhan Hayes, Juliet Aubrey, Joan Bakewell, Nancy Carroll, Kris Marshall, Tom Mannion, Derek Hutchinson, Samuel West","Plot":"True story of the lifelong romance between novelist Iris Murdoch and her husband John Bayley, from their student days through her battle with Alzheimer's disease. Iris, based on the life of revered British writer and philosopher Iris Murdoch, is a story of unlikely yet enduring love. As a young academic, teaching philosophy at Oxford, Murdoch meets and eventually falls in love with fellow professor John Bayley, a man whose awkwardness seems in stark opposition to the spirited self-confidence of his future wife. The story unfolds as snippets of time, seen through Bayley's eyes. He recalls their first encounter over 40 years ago, activities they enjoyed doing together, and Iris' charismatic and individualistic personality. These images portray Murdoch as a vibrant young woman with great intellect and are contrasted with the novelist's later life, after the effects of Alzheimer's disease have ravaged her. Murdoch's great mind deteriorates until she is reduced to a mere vestige of her former self, unable to perform simple tasks and completely reliant on her at times frustrated yet devoted husband. Written by kem","Genre":"Biography, Drama, Romance","Keywords":"novelist, alzheimer's disease, love, book, writer","imdbRating":"7.1","imdbVotes":"14,528","Awards":"Won 1 Oscar. Another 13 wins & 28 nominations.","Metascore":"76","Released":"29 March 2002 (USA) ","Location":"Magpie Lane, Oxford, Oxfordshire, England, UK ","Actors":"Judi Dench, Jim Broadbent, Kate Winslet ","Writer":"John Bayley (books), Richard Eyre (screenplay) | 1 more credit »","Running_time":"PT91M / 1h 31min","Description":"Directed by Richard Eyre.  With Judi Dench, Jim Broadbent, Kate Winslet, Hugh Bonneville. True story of the lifelong romance between novelist Iris Murdoch and her husband John Bayley, from their student days through her battle with Alzheimer's disease.","Rated":"R"}