{"imdbID":"tt0221027","Title":"Blow","Year":"2001","Director":"Ted Demme","Taglines":"Based on a True Story.","Country":"USA","Language":"English","Also_Known_As":"Inhala ","Budget":"$30,000,000 (estimated)","Opening_Weekend":"$12,443,461 (USA) (6 April 2001)","Gross":"$8,844,782 (Europe) (10 August 2001)","Production_Co":"Apostle, Avery Pix, New Line Cinema ","Runtime":"124 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"When George is sharing a cell in prison with Diego, George is seen reading a paperback while reclining on his top bunk. The book is \"Hells Angels\" written by Hunter S. Thompson, the author whom Depp previously portrayed in the movie Fear and Loathing in Las Vegas (1998). See more »","Goofs":"The sweat stains on Diego's shirt when he first meets Escobar. See more »","Crazy_Credits":"A photograph of the real George Jung appears at the end of the film, as the credits start to roll. See more »","Cast":"Johnny Depp, Penélope Cruz, Franka Potente, Rachel Griffiths, Paul Reubens, Jordi Mollà, Cliff Curtis, Miguel Sandoval, Ethan Suplee, Ray Liotta, Kevin Gage, Max Perlich, Jesse James, Miguel Pérez, Dan Ferro","Plot":"The story of George Jung, the man who established the American cocaine market in the 1970s. A boy named George Jung grows up in a struggling family in the 1950's. His mother nags at her husband as he is trying to make a living for the family. It is finally revealed that George's father cannot make a living and the family goes bankrupt. George does not want the same thing to happen to him, and his friend Tuna, in the 1960's, suggests that he deal marijuana. He is a big hit in California in the 1960's, yet he goes to jail, where he finds out about the wonders of cocaine. As a result, when released, he gets rich by bringing cocaine to America. However, he soon pays the price. Written by Anonymous","Genre":"Biography, Crime, Drama","Keywords":"cocaine, 1960s, california, 1970s, wealth","imdbRating":"7.6","imdbVotes":"193,453","Awards":"1 win & 6 nominations.","Metascore":"52","Released":"6 April 2001 (USA) ","Location":"Spring Street Towers - 650 S. Spring Street, Downtown, Los Angeles, California, USA ","Actors":"Johnny Depp, Penélope Cruz, Franka Potente ","Writer":"Bruce Porter (book), David McKenna (screenplay) | 1 more credit »","Running_time":"PT124M / 2h 4min","Description":"Directed by Ted Demme.  With Johnny Depp, Penélope Cruz, Franka Potente, Rachel Griffiths. The story of George Jung, the man who established the American cocaine market in the 1970s.","Rated":"R"}