{"imdbID":"tt0258463","Title":"The Bourne Identity","Year":"2002","Director":"Doug Liman","Taglines":"He was the perfect weapon until he became the target. ","Country":"USA, Germany, Czech Republic","Language":"English, French, German, Dutch, Italian","Also_Known_As":"Identidad desconocida ","Budget":"$60,000,000 (estimated)","Opening_Weekend":"$27,118,640 (USA) (14 June 2002)","Gross":"$4,874,565 (Japan) (28 February 2003)","Production_Co":"Universal Pictures, Kennedy/Marshall Company, The, Hypnotic ","Runtime":"119 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The rifle the 'Professor' uses at various occasions, for example at the farm, is a Swiss SIG 550 Sniper. See more »","Goofs":"When the assassins receive their messages on their cell phones the first one receives the message on a Motorola phone which - as other phones also - isn't able to display the short message in the way as shown with light letters in small dark bars. The message clearly looks like a computer overlay. See more »","Crazy_Credits":"A thunderstorm sounds in the background of the Universal logo. See more »","Cast":"Matt Damon, Franka Potente, Chris Cooper, Clive Owen, Brian Cox, Adewale Akinnuoye-Agbaje, Gabriel Mann, Walton Goggins, Josh Hamilton, Julia Stiles, Orso Maria Guerrini, Tim Dutton, Denis Braccini, Nicky Naudé, David Selburg","Plot":"A man is picked up by a fishing boat, bullet-riddled and suffering from amnesia, before racing to elude assassins and regain his memory. Based very loosely on Robert Ludlum's novel, the Bourne Identity is the story of a man whose wounded body is discovered by fishermen who nurse him back to health. He can remember nothing and begins to try to rebuild his memory based on clues such as the Swiss bank account, the number of which, is implanted in his hip. He soon realizes that he is being hunted and takes off with Marie on a search to find out who he is and why he is being hunted. Written by ibjsm","Genre":"Action, Mystery, Thriller","Keywords":"amnesia, assassin, money, three word title, sleeping on park bench","imdbRating":"7.9","imdbVotes":"388,595","Awards":"3 wins & 5 nominations.","Metascore":"68","Released":"14 June 2002 (USA) ","Location":"Seine River, Paris, France ","Actors":"Franka Potente, Matt Damon, Chris Cooper ","Writer":"Tony Gilroy (screenplay), W. Blake Herron (screenplay) (as William Blake Herron) | 1 more credit »","Running_time":"PT119M / 1h 59min","Description":"Directed by Doug Liman.  With Franka Potente, Matt Damon, Chris Cooper, Clive Owen. A man is picked up by a fishing boat, bullet-riddled and suffering from amnesia, before racing to elude assassins and regain his memory.","Rated":"PG-13"}