{"imdbID":"tt0203009","Title":"Moulin Rouge!","Year":"2001","Director":"Baz Luhrmann","Country":"USA, Australia","Language":"English, French, Spanish","Budget":"$52,500,000 (estimated)","Gross":"$57,386,369 (USA) (19 April 2002)","Production_Co":"Twentieth Century Fox Film Corporation, Bazmark Films ","Runtime":"127 min","Cast":"Nicole Kidman, Ewan McGregor, John Leguizamo, Jim Broadbent, Richard Roxburgh, Garry McDonald, Jacek Koman, Matthew Whittet, Kerry Walker, Caroline O'Connor, Christine Anu, Natalie Mendoza, Lara Mulcahy, David Wenham, Kylie Minogue","Plot":"A poet falls for a beautiful courtesan whom a jealous duke covets in this stylish musical, with music drawn from familiar 20th century sources. The year is 1899, and Christian, a young English writer, has come to Paris to follow the Bohemian revolution taking hold of the city's drug and prostitute infested underworld. And nowhere is the thrill of the underworld more alive than at the Moulin Rouge, a night club where the rich and poor men alike come to be entertained by the dancers, but things take a wicked turn for Christian as he starts a deadly love affair with the star courtesan of the club, Satine. But her affections are also coveted by the club's patron: the Duke. A dangerous love triangle ensues as Satine and Christian attempt to fight all odds to stay together but a force that not even love can conquer is taking its toll on Satine... Written by O.G.","Genre":"Drama, Musical, Romance","Keywords":"jealousy, death of main character, two suitors, eiffel tower paris, tragedy","imdbRating":"7.6","imdbVotes":"219,385","Awards":"Won 2 Oscars. Another 81 wins & 126 nominations.","Metascore":"66","Released":"1 June 2001 (USA) ","Location":"Fox Studios, Moore Park, Sydney, New South Wales, Australia ","Actors":"Nicole Kidman, Ewan McGregor, John Leguizamo ","Writer":"Baz Luhrmann, Craig Pearce","Running_time":"PT127M / 2h 7min","Description":"Directed by Baz Luhrmann.  With Nicole Kidman, Ewan McGregor, John Leguizamo, Jim Broadbent. A poet falls for a beautiful courtesan whom a jealous duke covets in this stylish musical, with music drawn from familiar 20th century sources.","Rated":"PG-13"}