{"imdbID":"tt0206634","Title":"Children of Men","Year":"2006","Director":"Alfonso Cuarón","Taglines":"No children. No future. No hope. ","Country":"USA, UK","Language":"English, German, Italian, Romanian, Spanish, Arabic, Georgian, Russian","Also_Known_As":"Niños del hombre ","Budget":"$76,000,000 (estimated)","Opening_Weekend":"£1,284,254 (UK) (22 September 2006)","Gross":"$35,286,428 (USA) (9 March 2007)","Production_Co":"Universal Pictures, Strike Entertainment, Hit & Run Productions ","Runtime":"109 min","Sound_Mix":"SDDS | Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Newspaper headlines throughout the film read: Raid nabs refugees' weapons cache, AFRICA DEVASTATED BY NUCLEAR FALL OUT, U.S. TROOPS FULL ATTACK, EXTREMIST EXPLOSION A RIGHT ROYAL RIP OFF: CHARLES SHOULD BE THRONE OUT, MILITIAS OCCUPY CINCINNATI, BOZEMAN & SPOKANE, CHAOS IN REFUGEE CAMPS, FERTILITY DRUG KILLS! SURGEON ARRESTED, HORMONE ATTACKS: VIOLENT REACTION, 100 Suicides: Nation in Denial, RUSSIA IN CRISIS: Massive migration, Police put mosques under surveillance, Gatherings are forbidden, BOMBING OF SAUDI PIPELINE DISRUPTS WORLD'S OIL SUPPLY (Photo by Janice Palmer), REFUGEES BLAMED FOR INCREASE IN TERROR ATTACKS (Thursday April 6th, 2018), SOUTH COAST TOWNS TURNED INTO REFUGEE CAMPS (Tuesday February 11, 2020), PM DENIES \"TORTURE\" OF BRITISH CITIZENS, ALLEGATIONS OF ABUSE DISMISSED AS A SHAM, DIRTY BOMB DETONATED IN MUNICH (Report by Photojournalist Janice Palmer), England bans ALL immigration completely, 25% INFERTILITY RATE (21.12.2008), Two years since last baby born, NO BABY HOPE ADMIT SCIENTISTS, WAR AND FAMINE LEAD TO MASS MIGRATION, JANICE PALMER questions Britain's ethical response to the refugee situation, MASSIVE MIGRATION, CHANNEL TUNNEL CLOSED, All foreigners now ILLEGAL, Refugees mass on Europe, MI5 DENY INVOLVEMENT IN TORTURE OF PHOTOJOURNALIST (photo of Janice Palmer. Monday 16.7.2018). See more »","Goofs":"When Theo overhears Luke's plans to kill him, he wears socks. In the following scenes where he escapes the safe house and pushes the car, he wears shoes. See more »","Crazy_Credits":"At the very end, one can read \"Shantih, Shantih, Shantih\" with children shouting and laughing on the soundtrack, which can be heard repeatedly throughout the end credits. This is the last line of T.S. Eliot's 1922 poem \"The Wasteland.\" \"Shantih\" means \"peace\" in Hindi. See more »","Cast":"Clive Owen, Juan Gabriel Yacuzzi, Michael Caine, Mishal Husain, Rob Curling, Chiwetel Ejiofor, Jon Chevalier, Julianne Moore, Rita Davies, Charlie Hunnam, Kim Fenton, Danny Huston, Chris Gilbert, Phoebe Hawthorne, Rebecca Howard","Plot":"In 2027, in a chaotic world in which women have become somehow infertile, a former activist agrees to help transport a miraculously pregnant woman to a sanctuary at sea. The world's youngest citizen has just died at 18, and humankind is facing the likelihood of its own extinction. Set in and around a dystopian London fractious with violence and warring nationalistic sects, Children of Men follows the unexpected discovery of a lone pregnant woman and the desperate journey to deliver her to safety and restore faith for a future beyond those presently on Earth. Written by Production","Genre":"Drama, Sci-Fi, Thriller","Keywords":"long take, violence, chaos, england, survival","imdbRating":"7.9","imdbVotes":"352,050","Awards":"Nominated for 3 Oscars. Another 39 wins & 65 nominations.","Metascore":"84","Released":"5 January 2007 (USA) ","Location":"Buenos Aires, Federal District, Argentina ","Actors":"Julianne Moore, Clive Owen, Chiwetel Ejiofor ","Writer":"Alfonso Cuarón (screenplay), Timothy J. Sexton (screenplay) | 4 more credits »","Running_time":"PT109M / 1h 49min","Description":"Directed by Alfonso Cuarón.  With Julianne Moore, Clive Owen, Chiwetel Ejiofor, Michael Caine. In 2027, in a chaotic world in which women have become somehow infertile, a former activist agrees to help transport a miraculously pregnant woman to a sanctuary at sea.","Rated":"R"}