{"imdbID":"tt0266543","Title":"Finding Nemo","Year":"2003","Taglines":"Come Fly With Me. ","Certificate":"G | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Finding Nemo 3D ","Budget":"$94,000,000 (estimated)","Opening_Weekend":"$70,251,710 (USA) (30 May 2003)","Gross":"$380,838,870 (USA) (11 January 2013)","Production_Co":"Walt Disney Pictures, Pixar Animation Studios, Disney Enterprises ","":"Show detailed company contact information on IMDbPro »","Runtime":"100 min","Sound_Mix":"DTS-ES | Dolby Digital EX | SDDS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Rove McManus: the crab threatened by Dory. Rove was the biggest late night talk show host in Australia at the time, with his show Rove Live (2000). See more »","Goofs":"When Dory and Marlin are hanging onto the whale's tongue, they look down the throat and see the whale's uvula. No animals have uvulas. Only humans can claim to have them. See more »","Crazy_Credits":"Through the closing credits, various characters interact briefly with the credits. At the end, the frightened little fish from the shark therapy group makes a final appearance in front of the angler fish. See more »","Cast":"Albert Brooks, Ellen DeGeneres, Alexander Gould, Willem Dafoe, Brad Garrett, Allison Janney, Austin Pendleton, Stephen Root, Vicki Lewis, Joe Ranft, Geoffrey Rush, Andrew Stanton, Elizabeth Perkins, Nicholas Bird, Bob Peterson","Plot":"After his son is captured in the Great Barrier Reef and taken to Sydney, a timid clownfish sets out on a journey to bring him home. A clown fish named Marlin lives in the Great Barrier Reef loses his son, Nemo. After he ventures into the open sea, despite his father's constant warnings about many of the ocean's dangers. Nemo is abducted by a boat and netted up and sent to a dentist's office in Sydney. So, while Marlin ventures off to try to retrieve Nemo, Marlin meets a fish named Dory, a blue tang suffering from short-term memory loss. The companions travel a great distance, encountering various dangerous sea creatures such as sharks, anglerfish and jellyfish, in order to rescue Nemo from the dentist's office, which is situated by Sydney Harbor. While the two are doing this, Nemo and the other sea animals in the dentist's fish tank plot a way to return to Sydney Harbor to live their lives free again. Written by Anonymous","Genre":"Animation, Adventure, Comedy","Keywords":"great barrier reef, short term memory loss, shark, protective father, separation from family","imdbRating":"8.1","imdbVotes":"654,519","Awards":"Won 1 Oscar. Another 44 wins & 56 nominations.","Metascore":"90","Released":"30 May 2003 (USA) ","Location":"Pixar Animation Studios - 1200 Park Avenue, Emeryville, California, USA ","Actors":"Albert Brooks, Ellen DeGeneres, Alexander Gould ","Director":"Andrew Stanton, Lee Unkrich","Writer":"Andrew Stanton (original story by), Andrew Stanton (screenplay) | 2 more credits »","Running_time":"PT100M / 1h 40min","Description":"Directed by Andrew Stanton, Lee Unkrich.  With Albert Brooks, Ellen DeGeneres, Alexander Gould, Willem Dafoe. After his son is captured in the Great Barrier Reef and taken to Sydney, a timid clownfish sets out on a journey to bring him home.","Rated":"G"}