{"imdbID":"tt0246578","Title":"Donnie Darko","Year":"2001","Director":"Richard Kelly","Writer":"Richard Kelly","Taglines":"Be Afraid of the Dark ","Country":"USA","Language":"English","Also_Known_As":"Donnie Darko: The Director's Cut ","Budget":"$4,500,000 (estimated)","Opening_Weekend":"$110,494 (USA) (26 October 2001)","Gross":"$727,883 (USA) (1 October 2004)","Production_Co":"Pandora Cinema, Flower Films (II), Adam Fields Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"113 min | 133 min (director's cut)","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"In the \"Cunning Visions\" infomercial, Jim Cunningham pats a child on his behind. The young boy who wants to learn how to fight at the school assembly is the same boy in Jim Cunningham's infomercial (Larry Riesman). See more »","Goofs":"The movie is set in 1988, but license plates, book editions, news photographs and products from 1989-1999 appear throughout. These anachronisms fit in with the movie's themes of time travel and altered realities. (Chapter 4 even mentions how things from the future, such as Mayans having arrow heads, are symbols of future being brought to the past - these anachronisms are on purpose.) See more »","Crazy_Credits":"\"Proud to Be Loud\" Performed by The Dead Green Mummies -- this song is actually performed by the band Pantera. (The Dead Green Mummies do not exist.) Pantera has all but disowned their first four albums, this song is track 5 on the fourth of those albums, \"Power Metal.\" The band presumably did not want to be credited with the song (as they don't consider any of their pre-1990 material part of their discography) and made up the name The Dead Green Mummies. See more »","Cast":"Jake Gyllenhaal, Holmes Osborne, Maggie Gyllenhaal, Daveigh Chase, Mary McDonnell, James Duval, Arthur Taxier, Patrick Swayze, Mark Hoffman, David St. James, Tom Tangen, Jazzie Mahannah, Jolene Purdy, Stuart Stone, Gary Lundy","Plot":"A troubled teenager is plagued by visions of a large bunny rabbit that manipulates him to commit a series of crimes, after narrowly escaping a bizarre accident. Donnie Darko doesn't get along too well with his family, his teachers and his classmates; but he does manage to find a sympathetic friend in Gretchen, who agrees to date him. He has a compassionate psychiatrist, who discovers hypnosis is the means to unlock hidden secrets. His other companion may not be a true ally. Donnie has a friend named Frank - a large bunny which only Donnie can see. When an engine falls off a plane and destroys his bedroom, Donnie is not there. Both the event, and Donnie's escape, seem to have been caused by supernatural events. Donnie's mental illness, if such it is, may never allow him to find out for sure. Written by J. Spurlin","Genre":"Drama, Sci-Fi, Thriller","Keywords":"parallel universe, insanity, death, time travel, 1980s","imdbRating":"8.1","imdbVotes":"560,248","Awards":"11 wins & 14 nominations.","Metascore":"71","Released":"26 October 2001 (USA) ","Location":"Santa Clarita, California, USA ","Actors":"Jake Gyllenhaal, Jena Malone, Mary McDonnell ","Running_time":"PT113M / 1h 53min","Description":"Directed by Richard Kelly.  With Jake Gyllenhaal, Jena Malone, Mary McDonnell, Holmes Osborne. A troubled teenager is plagued by visions of a large bunny rabbit that manipulates him to commit a series of crimes, after narrowly escaping a bizarre accident.","Rated":"R"}