{"imdbID":"tt0245429","Title":"Sen to Chihiro no kamikakushi","Year":"2001","Director":"Hayao Miyazaki","Writer":"Hayao Miyazaki","Taglines":"(The tunnel led Chihiro to a mysterious town...)","Country":"Japan","Language":"Japanese","Also_Known_As":"Sen and the Mysterious Disappearance of Chihiro ","Budget":"JPY 1,900,000,000 (estimated)","Opening_Weekend":"$1,052,197 (France) (19 April 2002)","Gross":"£542,530 (UK) (26 September 2003)","Production_Co":"Tokuma Shoten, Studio Ghibli, Nippon Television Network (NTV) ","":"Show detailed company contact information on IMDbPro »","Runtime":"125 min","Sound_Mix":"DTS-ES | Dolby Digital EX | Dolby (English-language version)| Dolby Digital (English-language version)","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Hayao Miyazaki: [pigs] Chihiro's parents are turned into pigs as a result of eating food intended for the gods. See more »","Goofs":"When Sen steps in the Black Slug in the boiler room, the slug goes all over the bottom of her foot. When she kneels down next to Haku, the black slug remains are no longer on her foot. See more »","Crazy_Credits":"The credits have a series of still images from the film. The last image before the film fades is Chihiro's shoe in the river. See more »","Cast":"Rumi Hiiragi, Miyu Irino, Mari Natsuki, Takashi Naitô, Yasuko Sawaguchi, Tatsuya Gashûin, Ryûnosuke Kamiki, Yumi Tamai, Yô Ôizumi, Koba Hayashi, Tsunehiko Kamijô, Takehiko Ono, Bunta Sugawara, Shigeru Wakita, Shirô Saitô","Plot":"During her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches, and spirits, and where humans are changed into beasts. Chihiro and her parents are moving to a small Japanese town in the countryside, much to Chihiro's dismay. On the way to their new home, Chihiro's father makes a wrong turn and drives down a lonely one-lane road which dead-ends in front of a tunnel. Her parents decide to stop the car and explore the area. They go through the tunnel and find an abandoned amusement park on the other side, with its own little town. When her parents see a restaurant with great-smelling food but no staff, they decide to eat and pay later. However, Chihiro refuses to eat and decides to explore the theme park a bit more. She meets a boy named Haku who tells her that Chihiro and her parents are in danger, and they must leave immediately. She runs to the restaurant and finds that her parents have turned into pigs. In addition, the theme park turns out to be a town inhabited by demons, spirits, and evil gods. At the center of the town is a bathhouse where these creatures go to relax. The owner of the bathhouse ... Written by Zachary Harper","Genre":"Animation, Adventure, Family","Keywords":"spirit, bathhouse, pig, 10 year old, girl","imdbRating":"8.6","imdbVotes":"396,052","Awards":"Won 1 Oscar. Another 53 wins & 23 nominations.","Metascore":"94","Released":"20 July 2001 (Japan) ","Actors":"Daveigh Chase, Suzanne Pleshette, Miyu Irino ","Running_time":"PT125M / 2h 5min","Description":"Directed by Hayao Miyazaki.  With Daveigh Chase, Suzanne Pleshette, Miyu Irino, Rumi Hiiragi. During her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches, and spirits, and where humans are changed into beasts.","Rated":"PG"}