{"imdbID":"tt0266697","Title":"Kill Bill: Vol. 1","Year":"2003","Director":"Quentin Tarantino","Taglines":"This October, Go For The Kill ","Country":"USA","Language":"English, Japanese, French","Also_Known_As":"Kill Bill ","Budget":"$30,000,000 (estimated)","Opening_Weekend":"£162,857 (UK) (10 October 2003)","Gross":"$70,098,138 (USA) (21 May 2004)","Production_Co":"Miramax, A Band Apart, Super Cool ManChu ","":"Show detailed company contact information on IMDbPro »","Runtime":"111 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Black and White | Color","Aspect_Ratio":"2.35 : 1","Trivia":"Both Daryl Hannah and Uma Thurman have appeared in Playboy many years apart. See more »","Goofs":"This may have been intentional, but in the shot of the airliner (a model) in flight towards the end of the film, the wires holding it up, are visible through the strange red mist. See more »","Crazy_Credits":"R.I.P. Charles Bronson, Chang Cheh, Kinji Fukasaku, Lo Lieh, Shintaro Katsu, William Witney See more »","Cast":"Uma Thurman, Lucy Liu, Vivica A. Fox, Daryl Hannah, David Carradine, Michael Madsen, Julie Dreyfus, Chiaki Kuriyama, Shin'ichi Chiba, Chia-Hui Liu, Michael Parks, Michael Bowen, Jun Kunimura, Kenji Ohba, Yuki Kazamatsuri","Plot":"The Bride wakens from a four-year coma. The child she carried in her womb is gone. Now she must wreak vengeance on the team of assassins who betrayed her - a team she was once part of. The lead character, called 'The Bride,' was a member of the Deadly Viper Assassination Squad, led by her lover 'Bill.' Upon realizing she was pregnant with Bill's child, 'The Bride' decided to escape her life as a killer. She fled to Texas, met a young man, who, on the day of their wedding rehearsal was gunned down by an angry and jealous Bill (with the assistance of the Deadly Viper Assassination Squad). Four years later, 'The Bride' wakes from a coma, and discovers her baby is gone. She, then, decides to seek revenge upon the five people who destroyed her life and killed her baby. The saga of Kill Bill Volume I begins. Written by JD","Genre":"Action","Keywords":"bride, revenge, sword, japan, coma","imdbRating":"8.1","imdbVotes":"706,707","Awards":"Nominated for 1 Golden Globe. Another 19 wins & 77 nominations.","Metascore":"69","Released":"10 October 2003 (USA) ","Location":"5506 Atlas St, Los Angeles, California, USA ","Actors":"Uma Thurman, David Carradine, Daryl Hannah ","Writer":"Quentin Tarantino, Quentin Tarantino (character The Bride) (as Q) | 1 more credit »","Running_time":"PT111M / 1h 51min","Description":"Directed by Quentin Tarantino.  With Uma Thurman, David Carradine, Daryl Hannah, Michael Madsen. The Bride wakens from a four-year coma. The child she carried in her womb is gone. Now she must wreak vengeance on the team of assassins who betrayed her - a team she was once part of.","Rated":"R"}