{"imdbID":"tt0240772","Title":"Ocean's Eleven","Year":"2001","Director":"Steven Soderbergh","Taglines":"They're Having So Much Fun It's Illegal. ","Country":"USA","Language":"English, Italian, Cantonese","Also_Known_As":"11 ","Budget":"$85,000,000 (estimated)","Opening_Weekend":"$38,107,822 (USA) (7 December 2001)","Gross":"$183,405,771 (USA) (26 April 2002)","Production_Co":"Warner Bros., Village Roadshow Pictures, NPV Entertainment ","Runtime":"116 min","Sound_Mix":"DTS | Dolby Digital | SDDS (8 channels)","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The prison Danny Ocean is paroled from - North Jersey State Prison - is actually East Jersey State Prison, formerly known as Rahway State Prison. This facility was the setting of Scared Straight! (1978). There is actually a Northern State Prison located across the highway from Newark (NJ) International Airport. Parole hearings at \"Rahway State\" are held in a conference room near the inmate dining hall. The area he was having his parole interview was in the \"Drill Hall\" (indoor gym/recreation area). The cell block that Danny was being escorted from is \"3-Wing\" - a regular, working cell block. The inmates were either confined to their cells or relocated to other areas of the prison for the filming. The \"Officer\" escorting Danny out of the cell block and securing the gate, was actually a Lieutenant, and at the time, was the coordinator of the \"Scared Straight\" program. See more »","Goofs":"Turk races Virgil's R/C truck on a cloudy day. But as Turk crushes Virgil's truck, we see sunshine. As Turk leaves Virgil's truck in a crumpled heap, the sky is cloudy again. See more »","Crazy_Credits":"In the original DVD release, neither Don Cheadle nor \"Basher Tarr\" are listed in the end credits. See more »","Cast":"George Clooney, Cecelia Ann Birt, Paul L. Nolan, Carol Florence, Lori Galinski, Bernie Mac, Brad Pitt, Mark Gantt, Tim Perez, Elliott Gould, Frank Patton, Casey Affleck, Scott Caan, Eddie Jemison, Jorge R. Hernandez","Plot":"Danny Ocean and his eleven accomplices plan to rob three Las Vegas casinos simultaneously. Danny Ocean wants to score the biggest heist in history. He combines an eleven member team, including Frank Catton, Rusty Ryan and Linus Caldwell. Their target? The Bellagio, the Mirage and the MGM Grand. All casinos owned by Terry Benedict. It's not going to be easy, as they plan to get in secretly and out with $150 million. Written by Film_Fan","Genre":"Crime, Thriller","Keywords":"casino, card dealer, ulcer, criminal mastermind, recruiting","imdbRating":"7.8","imdbVotes":"389,633","Awards":"4 wins & 20 nominations.","Metascore":"74","Released":"7 December 2001 (USA) ","Location":"495 North Milwaukee Avenue, Chicago, Illinois, USA ","Actors":"George Clooney, Brad Pitt, Julia Roberts ","Writer":"George Clayton Johnson, Jack Golden Russell | 3 more credits »","Running_time":"PT116M / 1h 56min","Description":"Directed by Steven Soderbergh.  With George Clooney, Brad Pitt, Julia Roberts, Matt Damon. Danny Ocean and his eleven accomplices plan to rob three Las Vegas casinos simultaneously.","Rated":"PG-13"}