{"imdbID":"tt0266308","Title":"Battle Royale","Year":"2000","Director":"Kinji Fukasaku","Taglines":"Could you kill your best friend? ","Certificate":"Not Rated | See all certifications »","Country":"Japan","Language":"Japanese","Also_Known_As":"Battle Royale ","Budget":"$4,500,000 (estimated)","Production_Co":"AM Associates, Fukasaku-gumi, GAGA ","Runtime":"114 min | 122 min (director's cut)","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The director offered the role of Yoshitoki Kuninobu to popular rock vocalist 'Kyô' (from Dir en Grey), but Kyo's management forbade him to take it. See more »","Goofs":"Given that the events in the beginning of the film shows the winning student from previous year with rather intense media coverage, the students in the competition depicted in the film should have been aware of the existence of the competition and what was at stake before it was explained to them. See more »","Cast":"Tatsuya Fujiwara, Aki Maeda, Tarô Yamamoto, Takeshi Kitano, Chiaki Kuriyama, Sôsuke Takaoka, Takashi Tsukamoto, Yukihiro Kotani, Eri Ishikawa, Sayaka Kamiya, Aki Inoue, Takayo Mimura, Yutaka Shimada, Ren Matsuzawa, Hirohito Honda","Plot":"In the future, the Japanese government captures a class of ninth-grade students and forces them to kill each other under the revolutionary \"Battle Royale\" act. Forty-two students, three days, one deserted Island: welcome to Battle Royale. A group of ninth-grade students from a Japanese high school have been forced by legislation to compete in a Battle Royale. The students are each given a bag with a randomly selected weapon and a few rations of food and water and sent off to kill each other in a no-holds-barred (with a few minor rules) game to the death, which means that the students have three days to kill each other until one survives--or they all die. The movie focuses on a few of the students and how they cope. Some decide to play the game like the psychotic Kiriyama or the sexual Mitsuko, while others like the heroes of the movie--Shuya, Noriko, and Kawada--are trying to find a way to get off the Island without violence. However, as the numbers dwell down lower and lower on an hourly basis, is there any way for Shuya and his classmates to survive? Written by Prissy Panda Princess","Genre":"Action, Drama, Sci-Fi","Keywords":"fight to the death, most dangerous game, game of death, bloody body of a child, student","imdbRating":"7.7","imdbVotes":"135,213","Awards":"7 wins & 8 nominations.","Metascore":"81","Released":"16 December 2000 (Japan) ","Location":"Hachijo Island, Tokyo, Japan ","Actors":"Tatsuya Fujiwara, Aki Maeda, Tarô Yamamoto ","Writer":"Koushun Takami (novel), Kenta Fukasaku (screenplay)","Running_time":"PT114M / 1h 54min","Description":"Directed by Kinji Fukasaku.  With Tatsuya Fujiwara, Aki Maeda, Tarô Yamamoto, Takeshi Kitano. In the future, the Japanese government captures a class of ninth-grade students and forces them to kill each other under the revolutionary \"Battle Royale\" act.","Rated":"NOT RATED"}