{"imdbID":"tt0277027","Title":"I Am Sam","Year":"2001","Director":"Jessie Nelson","Country":"USA","Language":"English","Budget":"$22,000,000 (estimated)","Gross":"£456,635 (UK) (24 May 2002)","Production_Co":"New Line Cinema, Avery Pix, Bedford Falls Company, The ","Runtime":"132 min","Cast":"Sean Penn, Michelle Pfeiffer, Dakota Fanning, Dianne Wiest, Loretta Devine, Richard Schiff, Laura Dern, Brad Silverman, Joseph Rosenberg, Stanley DeSantis, Doug Hutchison, Rosalind Chao, Ken Jenkins, Wendy Phillips, Mason Lucero","Plot":"A mentally handicapped man fights for custody of his 7-year-old daughter, and in the process teaches his cold hearted lawyer the value of love and family. Sam Dawson has the mental capacity of a 7-year-old. He works at a Starbucks and is obsessed with the Beatles. He has a daughter with a homeless woman; she abandons them as soon as they leave the hospital. He names his daughter Lucy Diamond (after the Beatles song), and raises her. But as she reaches age 7 herself, Sam's limitations start to become a problem at school; she's intentionally holding back to avoid looking smarter than him. The authorities take her away, and Sam shames high-priced lawyer Rita Harrison into taking his case pro bono. In the process, he teaches her a great deal about love, and whether it's really all you need. Written by Jon Reeves <jreeves@imdb.com>","Genre":"Drama","Keywords":"disability, child custody, single father, custody battle, mentally impaired man","imdbRating":"7.6","imdbVotes":"119,321","Awards":"Nominated for 1 Oscar. Another 8 wins & 10 nominations.","Metascore":"28","Released":"25 January 2002 (USA) ","Location":"Echo Park, Los Angeles, California, USA ","Actors":"Sean Penn, Michelle Pfeiffer, Dakota Fanning ","Writer":"Kristine Johnson, Jessie Nelson","Running_time":"PT132M / 2h 12min","Description":"Directed by Jessie Nelson.  With Sean Penn, Michelle Pfeiffer, Dakota Fanning, Dianne Wiest. A mentally handicapped man fights for custody of his 7-year-old daughter, and in the process teaches his cold hearted lawyer the value of love and family.","Rated":"PG-13"}