{"imdbID":"tt0245844","Title":"The Count of Monte Cristo","Year":"2002","Director":"Kevin Reynolds","Taglines":"Prepare for adventure. Count on revenge.","Country":"UK, USA, Ireland","Language":"English","Also_Known_As":"Alexandre Dumas' The Count of Monte Cristo ","Budget":"$35,000,000 (estimated)","Opening_Weekend":"$11,376,150 (USA) (25 January 2002)","Gross":"$54,228,104 (USA) (14 June 2002)","Production_Co":"Touchstone Pictures, Spyglass Entertainment, World 2000 Entertainment ","Runtime":"131 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"The name that Vampa gives Dantes, Zatarra, means driftwood in Burmese, the language of Myanmar. See more »","Goofs":"The boxes containing the gold would have rotted away after so many years underwater. See more »","Cast":"Jim Caviezel, Guy Pearce, Richard Harris, James Frain, Dagmara Dominczyk, Michael Wincott, Luis Guzmán, Christopher Adamson, JB Blanc, Guy Carleton, Alex Norton, Barry Cassin, Henry Cavill, Zhara Moufid, Brendan Costello","Plot":"A young man, falsely imprisoned by his jealous \"friend,\" escapes and uses a hidden treasure to exact his revenge. 'The Count of Monte Cristo' is a remake of the Alexander Dumas tale by the same name. Dantes, a sailor who is falsely accused of treason by his best friend Fernand, who wants Dantes' girlfriend Mercedes for himself. Dantes is imprisoned on the island prison of Chateau d'If for 13 years, where he plots revenge against those who betrayed him. With the help of another prisoner, he escapes the island and proceeds to transform himself into the wealthy Count of Monte Cristo as part of his plan to exact revenge. Written by Anna <annachan@amazon.com>","Genre":"Action, Adventure, Drama","Keywords":"revenge, count, island, escape, sailor","imdbRating":"7.7","imdbVotes":"101,917","Awards":"","Metascore":"61","Released":"25 January 2002 (USA) ","Location":"Ardmore Studios, Herbert Road, Bray, County Wicklow, Ireland ","Actors":"Jim Caviezel, Guy Pearce, Richard Harris ","Writer":"Alexandre Dumas père (novel), Jay Wolpert (screenplay)","Running_time":"PT131M / 2h 11min","Description":"Directed by Kevin Reynolds.  With Jim Caviezel, Guy Pearce, Richard Harris, James Frain. A young man, falsely imprisoned by his jealous \"friend,\" escapes and uses a hidden treasure to exact his revenge.","Rated":"PG-13"}