{"imdbID":"tt0211915","Title":"Amélie","Year":"2001","Director":"Jean-Pierre Jeunet","Taglines":"One person can change your life forever. ","Country":"France, Germany","Language":"French, Russian","Also_Known_As":"Amélie ","Budget":"FRF 77,000,000 (estimated)","Opening_Weekend":"$496,031 (France) (10 August 2001)","Gross":"$33,201,661 (USA) (28 June 2002)","Production_Co":"Claudie Ossard Productions, Union Générale Cinématographique (UGC), Victoires Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"122 min","Sound_Mix":"DTS | Dolby Digital","Color":"Black and White | Color (Duboicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"In the original film, when Amélie goes to Mr Collignon's parents, the father, who makes holes in flowers, says he'd rather make these holes into lilacs. This is a direct reference to French singer Serge Gainsbourg's song \"Le poinçonneur des Lilas\". The reference is not translated in the English subtitles. See more »","Goofs":"When Amélie talks to Georgette about Joseph, she says, \"He always sits here, right?\"(Il s'assied toujours là, d'accord?) Georgette responds \"Ben, oui.\" (Basically, \"um, yeah.\") The English subtitle \"at number 8\" (huit) is incorrect. See more »","Crazy_Credits":"In the opening credits, the girl playing Amélie as a child is shown doing various things. If you give a careful look at these activities, you'll find they illustrate the credits shown at the same time. See more »","Cast":"Audrey Tautou, Mathieu Kassovitz, Rufus, Lorella Cravotta, Serge Merlin, Jamel Debbouze, Clotilde Mollet, Claire Maurier, Isabelle Nanty, Dominique Pinon, Artus de Penguern, Yolande Moreau, Urbain Cancelier, Maurice Bénichou, Michel Robin","Plot":"Amelie is an innocent and naive girl in Paris with her own sense of justice. She decides to help those around her and, along the way, discovers love. Amélie is a story about a girl named Amélie whose childhood was suppressed by her Father's mistaken concerns of a heart defect. With these concerns Amélie gets hardly any real life contact with other people. This leads Amélie to resort to her own fantastical world and dreams of love and beauty. She later on becomes a young woman and moves to the central part of Paris as a waitress. After finding a lost treasure belonging to the former occupant of her apartment, she decides to return it to him. After seeing his reaction and his new found perspective - she decides to devote her life to the people around her. Such as, her father who is obsessed with his garden-gnome, a failed writer, a hypochondriac, a man who stalks his ex girlfriends, the \"ghost\", a suppressed young soul, the love of her life and a man whose bones are as brittle as glass. But after consuming herself with these escapades - she finds out that she is disregarding her own life and damaging her quest for love. Amélie then ... Written by spragg_s","Genre":"Comedy, Romance","Keywords":"waitress, garden gnome, magical realism, cheerfulness, female protagonist","imdbRating":"8.4","imdbVotes":"514,377","Awards":"Nominated for 5 Oscars. Another 56 wins & 60 nominations.","Metascore":"69","Released":"25 April 2001 (France) ","Location":"France ","Actors":"Audrey Tautou, Mathieu Kassovitz, Rufus ","Writer":"Guillaume Laurant (scenario), Jean-Pierre Jeunet (scenario) | 1 more credit »","Running_time":"PT122M / 2h 2min","Description":"Directed by Jean-Pierre Jeunet.  With Audrey Tautou, Mathieu Kassovitz, Rufus, Lorella Cravotta. Amelie is an innocent and naive girl in Paris with her own sense of justice. She decides to help those around her and, along the way, discovers love.","Rated":"R"}