{"imdbID":"tt0264464","Title":"Catch Me If You Can","Year":"2002","Director":"Steven Spielberg","Taglines":"Die wahre Story einer genialen Täschung. (The true story of an ingenious deception.) ","Country":"USA, Canada","Language":"English, French","Also_Known_As":"Atrápame si puedes ","Budget":"$52,000,000 (estimated)","Opening_Weekend":"$30,082,000 (USA) (27 December 2002)","Gross":"$9,493,232 (Japan) (9 May 2003)","Production_Co":"DreamWorks SKG, Kemp Company, Splendid Pictures ","Runtime":"141 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Some FBI agents did occasionally chase Abagnale, but he didn't have a relationship with any of them, and he certainly didn't call them every Christmas. As Abagnale himself points out with flawless logic: \"Why would I do that? I didn't want the FBI to know where I was.\" See more »","Goofs":"During the engagement party, shots from inside the bedroom show it to be so windy that, when the window is left open, Frank's money is flying everywhere. However, outside shots of the party show it to be a calm night. See more »","Crazy_Credits":"For Bruce Paltrow See more »","Cast":"Leonardo DiCaprio, Tom Hanks, Christopher Walken, Martin Sheen, Nathalie Baye, Amy Adams, James Brolin, Brian Howe, Frank John Hughes, Steve Eastin, Chris Ellis, John Finn, Jennifer Garner, Nancy Lenehan, Ellen Pompeo","Plot":"A true story about Frank Abagnale Jr., who, before his 19th birthday, successfully conned millions of dollars' worth of checks as a Pan Am pilot, doctor, and legal prosecutor. New Rochelle, the 1960s. High schooler Frank Abagnale Jr. idolizes his father, who's in trouble with the IRS. When his parents separate, Frank runs away to Manhattan with $25 in his checking account, vowing to regain dad's losses and get his parents back together. Just a few years later, the FBI tracks him down in France; he's extradited, tried, and jailed for passing more than $4,000,000 in bad checks. Along the way, he's posed as a Pan Am pilot, a pediatrician, and an attorney. And, from nearly the beginning of this life of crime, he's been pursued by a dour FBI agent, Carl Hanratty. What starts as cat and mouse becomes something akin to father and son. Written by <jhailey@hotmail.com>","Genre":"Biography, Crime, Drama","Keywords":"fbi, pilot, pan am, attorney, fbi agent","imdbRating":"8.0","imdbVotes":"491,080","Awards":"Nominated for 2 Oscars. Another 11 wins & 35 nominations.","Metascore":"76","Released":"25 December 2002 (USA) ","Location":"2186 East Crary Street, Altadena, California, USA ","Actors":"Leonardo DiCaprio, Tom Hanks, Christopher Walken ","Writer":"Jeff Nathanson (screenplay), Frank Abagnale Jr. (book) (as Frank W. Abagnale) | 1 more credit »","Running_time":"PT141M / 2h 21min","Description":"Directed by Steven Spielberg.  With Leonardo DiCaprio, Tom Hanks, Christopher Walken, Martin Sheen. A true story about Frank Abagnale Jr., who, before his 19th birthday, successfully conned millions of dollars' worth of checks as a Pan Am pilot, doctor, and legal prosecutor.","Rated":"PG-13"}