{"imdbID":"tt0217505","Title":"Gangs of New York","Year":"2002","Director":"Martin Scorsese","Country":"USA, Italy","Language":"English, Irish, Chinese, Latin","Budget":"$97,000,000 (estimated)","Gross":"$77,679,638 (USA) (11 April 2003)","Production_Co":"Miramax, Initial Entertainment Group (IEG), Alberto Grimaldi Productions ","Runtime":"167 min | 216 min (original)","Cast":"Leonardo DiCaprio, Daniel Day-Lewis, Cameron Diaz, Jim Broadbent, John C. Reilly, Henry Thomas, Liam Neeson, Brendan Gleeson, Gary Lewis, Stephen Graham, Eddie Marsan, Alec McCowen, David Hemmings, Lawrence Gilliard Jr., Cara Seymour","Plot":"In 1863, Amsterdam Vallon returns to the Five Points area of New York City seeking revenge against Bill the Butcher, his father's killer. Having seen his father killed in a major gang fight in New York, young Amsterdam Vallon is spirited away for his own safety. Some years later, he returns to the scene of his father's death, the notorious Five Points district in New York. It's 1863 and lower Manhattan is run by gangs, the most powerful of which is the Natives, headed by Bill \"The Butcher\" Cutting. He believes that America should belong to native-born Americans and opposes the waves of immigrants, mostly Irish, entering the city. It's also the time of the Civil War and forced conscription leads to the worst riots in US history. Amid the violence and corruption, young Vallon tries to establish himself in the area and also seek revenge over his father's death. Written by garykmcd","Genre":"Crime, Drama, History","Keywords":"gangster, new york city, butcher, revenge, civil war","imdbRating":"7.5","imdbVotes":"304,554","Awards":"Nominated for 10 Oscars. Another 45 wins & 102 nominations.","Metascore":"72","Released":"20 December 2002 (USA) ","Location":"Cinecittà Studios, Cinecittà, Rome, Lazio, Italy ","Actors":"Leonardo DiCaprio, Cameron Diaz, Daniel Day-Lewis ","Writer":"Jay Cocks (story), Jay Cocks (screenplay) | 2 more credits »","Running_time":"PT167M / 2h 47min","Description":"Directed by Martin Scorsese.  With Leonardo DiCaprio, Cameron Diaz, Daniel Day-Lewis, Jim Broadbent. In 1863, Amsterdam Vallon returns to the Five Points area of New York City seeking revenge against Bill the Butcher, his father's killer.","Rated":"R"}