{"imdbID":"tt0245712","Title":"Amores Perros","Year":"2000","Director":"Alejandro González Iñárritu","Writer":"Guillermo Arriaga (as Guillermo Arriaga Jordán)","Taglines":"Love. Betrayal. Death. ","Country":"Mexico","Language":"Spanish","Also_Known_As":"Amores Perros ","Budget":"$2,000,000 (estimated)","Opening_Weekend":"$61,047 (USA) (30 March 2001)","Gross":"$5,383,834 (USA) (6 July 2001)","Production_Co":"Altavista Films, Zeta Film ","":"Show detailed company contact information on IMDbPro »","Runtime":"154 min | 115 min (TV)","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The Royal Society for Prevention of Cruelty to Animals in England filed a complaint to the British Board of Film Classification (BBFC) about a 21-second dog fight scene. See more »","Goofs":"For photos taken for the 2nd time in the photo booth, El Chivo is wearing the brother's black sportcoat, yet when he subsequently pastes the photo in the album, the sportcoat appears distinctly burgundy in color.. See more »","Crazy_Credits":"To Luciano: Because we also are what we have lost. Special Thanks to: \"Abba, Pater\" See more »","Cast":"Emilio Echevarría, Gael García Bernal, Goya Toledo, Álvaro Guerrero, Vanessa Bauche, Jorge Salinas, Marco Pérez, Rodrigo Murray, Humberto Busto, Gerardo Campbell, Rosa María Bianchi, Dunia Saldívar, Adriana Barraza, José Sefami, Lourdes Echevarría","Plot":"A horrific car accident connects three stories, each involving characters dealing with loss, regret, and life's harsh realities, all in the name of love. Three interconnected stories about the different strata of life in Mexico City all resolve with a fatal car accident. Octavio is trying to raise enough money to run away with his sister-in-law, and decides to enter his dog Cofi into the world of dogfighting. After a dogfight goes bad, Octavio flees in his car, running a red light and causing the accident. Daniel and Valeria's new-found bliss is prematurely ended when she loses her leg in the accident. El Chivo is a homeless man who cares for stray dogs and is there to witness the collision. Written by Anonymous","Genre":"Drama, Thriller","Keywords":"nonlinear timeline, multiple storyline, dog, car accident, mexico city","imdbRating":"8.1","imdbVotes":"167,849","Awards":"Nominated for 1 Oscar. Another 54 wins & 22 nominations.","Metascore":"83","Released":"13 April 2001 (USA) ","Location":"Colonia Condesa, Mexico City, Distrito Federal, Mexico ","Actors":"Emilio Echevarría, Gael García Bernal, Goya Toledo ","Running_time":"PT154M / 2h 34min","Description":"Directed by Alejandro González Iñárritu.  With Emilio Echevarría, Gael García Bernal, Goya Toledo, Álvaro Guerrero. A horrific car accident connects three stories, each involving characters dealing with loss, regret, and life's harsh realities, all in the name of love.","Rated":"R"}