{"imdbID":"tt0289879","Title":"The Butterfly Effect","Year":"2004","Taglines":"Such minor changes, such huge consequences. ","Country":"USA, Canada","Language":"English","Also_Known_As":"El efecto mariposa ","Budget":"$13,000,000 (estimated)","Opening_Weekend":"$17,065,227 (USA) (23 January 2004)","Gross":"$143,748 (Japan) (13 May 2005)","Production_Co":"BenderSpink, FilmEngine, Katalyst Films ","Runtime":"113 min | 120 min (director's cut)","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Ashton Kutcher did extensive research on psychology, mental disorders, and chaos theory to prepare for his role in this film. See more »","Goofs":"Although he is not yet convicted of a crime, Evan is held in a penitentiary (he should be in a jail). See more »","Crazy_Credits":"The title, \"The Butterfly Effect,\" is superimposed over a depiction of a butterfly beating its wings, which is itself superimposed upon an X-ray profile of a human brain. See more »","Cast":"Ashton Kutcher, Melora Walters, Amy Smart, Elden Henson, William Lee Scott, John Patrick Amedori, Irina Gorovaia, Kevin G. Schmidt, Jesse James, Logan Lerman, Sarah Widdows, Jake Kaese, Cameron Bright, Eric Stoltz, Callum Keith Rennie","Plot":"A young man blocks out harmful memories of significant events of his life. As he grows up, he finds a way to remember these lost memories and a supernatural way to alter his life. Evan Treborn grows up in a small town with his single, working mother and his friends. He suffers from memory blackouts where he suddenly finds himself somewhere else, confused. Evan's friends and mother hardly believe him, thinking he makes it up just to get out of trouble. As Evan grows up he has fewer of these blackouts until he seems to have recovered. Since the age of seven he has written a diary of his blackout moments so he can remember what happens. One day at college he starts to read one of his old diaries, and suddenly a flashback hits him like a brick! Written by Anonymous","Genre":"Sci-Fi, Thriller","Keywords":"time travel, child pornography, surprise ending, blackout, memory","imdbRating":"7.7","imdbVotes":"344,986","Awards":"1 win & 8 nominations.","Metascore":"30","Released":"23 January 2004 (USA) ","Location":"Ceperley House, Burnaby, British Columbia, Canada ","Actors":"Ashton Kutcher, Amy Smart, Melora Walters ","Director":"Eric Bress, J. Mackye Gruber","Writer":"J. Mackye Gruber, Eric Bress","Running_time":"PT113M / 1h 53min","Description":"Directed by Eric Bress, J. Mackye Gruber.  With Ashton Kutcher, Amy Smart, Melora Walters, Elden Henson. A young man blocks out harmful memories of significant events of his life. As he grows up, he finds a way to remember these lost memories and a supernatural way to alter his life.","Rated":"R"}