{"imdbID":"tt0243155","Title":"Bridget Jones's Diary","Year":"2001","Director":"Sharon Maguire","Country":"UK, France, USA, Ireland","Language":"English","Budget":"$26,000,000 (estimated)","Gross":"$149,761,366 (Europe) (30 November 2001)","Production_Co":"Miramax, Universal Pictures, StudioCanal ","Runtime":"97 min","Cast":"Renée Zellweger, Gemma Jones, Celia Imrie, James Faulkner, Jim Broadbent, Colin Firth, Charmian May, Hugh Grant, Paul Brooke, Felicity Montagu, Shirley Henderson, Sally Phillips, James Callis, Charlie Caine, Gareth Marks","Plot":"A British woman is determined to improve herself while she looks for love in a year in which she keeps a personal diary. Bridget Jones is an average woman struggling against her age, her weight, her job, her lack of a man, and her many imperfections. As a New Year's Resolution, Bridget decides to take control of her life, starting by keeping a diary in which she will always tell the complete truth. The fireworks begin when her charming though disreputable boss takes an interest in the quirky Miss Jones. Thrown into the mix are Bridget's band of slightly eccentric friends and a rather disagreeable acquaintance who Bridget cannot seem to stop running into or help finding quietly attractive. Written by Anuja Varghese <anujav@excite.com>","Genre":"Comedy, Drama, Romance","Keywords":"american actress playing british character, rabbit costume, calorie counting, new year's eve, book publishing","imdbRating":"6.7","imdbVotes":"165,834","Awards":"Nominated for 1 Oscar. Another 8 wins & 29 nominations.","Metascore":"66","Released":"13 April 2001 (USA) ","Location":"Shepperton Studios, Shepperton, Surrey, England, UK ","Actors":"Renée Zellweger, Colin Firth, Hugh Grant ","Writer":"Helen Fielding (novel), Helen Fielding (screenplay) | 2 more credits »","Running_time":"PT97M / 1h 37min","Description":"Directed by Sharon Maguire.  With Renée Zellweger, Colin Firth, Hugh Grant, Gemma Jones. A British woman is determined to improve herself while she looks for love in a year in which she keeps a personal diary.","Rated":"R"}