{"imdbID":"tt0208092","Title":"Snatch.","Year":"2000","Director":"Guy Ritchie","Writer":"Guy Ritchie","Taglines":"Now you see it, now you don't! ","Country":"UK, USA","Language":"English, Russian","Also_Known_As":"Diamonds ","Budget":"£6,000,000 (estimated)","Opening_Weekend":"£3,180,002 (UK) (1 September 2000)","Gross":"$30,093,107 (USA) (9 March 2001)","Production_Co":"Columbia Pictures Corporation, SKA Films ","":"Show detailed company contact information on IMDbPro »","Runtime":"104 min","Sound_Mix":"Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Tim Maurice-Jones, the cinematographer, plays the man who is repeatedly battered over the head at the beginning of the movie by Frankie Four-Fingers (Benicio Del Toro). In Lock, Stock and Two Smoking Barrels (1998), for which he was also the cinematographer, he was the man being drowned at the beginning of the film by Barry the Baptist (Lenny McLean). See more »","Goofs":"When Lincoln is talking to Sol in the shop about his diamond, he has his finger on his forehead in the surveillance camera, but in the next shot, his hand is not on his head. See more »","Crazy_Credits":"In the closing credits, \"Gypsy kids\" is misspelled \"Gyspy kids.\" See more »","Cast":"Benicio Del Toro, Dennis Farina, Vinnie Jones, Brad Pitt, Rade Serbedzija, Jason Statham, Alan Ford, Mike Reid, Robbie Gee, Lennie James, Ewen Bremner, Jason Flemyng, Ade, William Beck, Andy Beckwith","Plot":"Unscrupulous boxing promoters, violent bookmakers, a Russian gangster, incompetent amateur robbers, and supposedly Jewish jewelers fight to track down a priceless stolen diamond. Turkish and his close friend/accomplice Tommy get pulled into the world of match fixing by the notorious Brick Top. Things get complicated when the boxer they had lined up gets badly beaten by Pitt, a 'pikey' ( slang for an Irish Gypsy)- who comes into the equation after Turkish, an unlicensed boxing promoter wants to buy a caravan off the Irish Gypsies. They then try to convince Pitt not only to fight for them, but to lose for them too. Whilst all this is going on, a huge diamond heist takes place, and a fistful of motley characters enter the story, including 'Cousin Avi', 'Boris The Blade', 'Franky Four Fingers' and 'Bullet Tooth Tony'. Things go from bad to worse as it all becomes about the money, the guns, and the damned dog! Written by Filmtwob <webmaster@filmfreak.co.za>","Genre":"Comedy, Crime","Keywords":"diamond, fight, boxing, gypsy, boxer","imdbRating":"8.3","imdbVotes":"580,125","Awards":"4 wins & 6 nominations.","Metascore":"55","Released":"19 January 2001 (USA) ","Location":"Bethnal Green Town Hall, Bethnal Green, London, England, UK ","Actors":"Jason Statham, Brad Pitt, Benicio Del Toro ","Running_time":"PT102M / 1h 42min","Description":"Directed by Guy Ritchie.  With Jason Statham, Brad Pitt, Benicio Del Toro, Dennis Farina. Unscrupulous boxing promoters, violent bookmakers, a Russian gangster, incompetent amateur robbers, and supposedly Jewish jewelers fight to track down a priceless stolen diamond.","Rated":"R"}