{"imdbID":"tt0297884","Title":"Far from Heaven","Year":"2002","Director":"Todd Haynes","Writer":"Todd Haynes","Country":"USA, France","Language":"English","Budget":"$13,500,000 (estimated)","Gross":"$74,530 (Hong Kong) (2 May 2003)","Production_Co":"Focus Features, Vulcan Productions, Killer Films ","Runtime":"107 min","Cast":"Julianne Moore, Dennis Quaid, Dennis Haysbert, Patricia Clarkson, Viola Davis, James Rebhorn, Bette Henritze, Michael Gaston, Ryan Ward, Lindsay Andretta, Jordan Elizabeth, Kyle Timothy Smith, Celia Weston, Barbara Garrick, Olivia Birkelund","Plot":"In 1950s Connecticut, a housewife faces a marital crisis and mounting racial tensions in the outside world. Cathy is the perfect 50s housewife, living the perfect 50s life: healthy kids, successful husband, social prominence. Then one night she surprises her husband Frank kissing another man, and her tidy world starts spinning out of control. In her confusion and grief, she finds consolation in the friendship of their African-American gardener, Raymond - a socially taboo relationship that leads to the further disintegration of life as she knew it. Despite Cathy and Frank's struggle to keep their marriage afloat, the reality of his homosexuality and her feelings for Raymond open a painful, if more honest, chapter in their lives. Written by Jonas A. Reinartz <jonas.reinartz@web.de>","Genre":"Drama, Romance","Keywords":"african american, farewell scene, catastrophe, therapy, family relationships","imdbRating":"7.4","imdbVotes":"35,816","Awards":"Nominated for 4 Oscars. Another 98 wins & 83 nominations.","Metascore":"84","Released":"10 January 2003 (USA) ","Location":"Oakland, New Jersey, USA ","Actors":"Julianne Moore, Dennis Quaid, Dennis Haysbert ","Running_time":"PT107M / 1h 47min","Description":"Directed by Todd Haynes.  With Julianne Moore, Dennis Quaid, Dennis Haysbert, Patricia Clarkson. In 1950s Connecticut, a housewife faces a marital crisis and mounting racial tensions in the outside world.","Rated":"PG-13"}