{"imdbID":"tt0289043","Title":"28 Days Later...","Year":"2002","Director":"Danny Boyle","Writer":"Alex Garland","Taglines":"The Days Are Numbered ","Country":"UK","Language":"English, Spanish","Also_Known_As":"Exterminio ","Budget":"$8,000,000 (estimated)","Opening_Weekend":"£1,500,079 (UK) (1 November 2002)","Gross":"$164,846 (Hong Kong) (28 November 2003)","Production_Co":"DNA Films, British Film Council ","Runtime":"113 min","Sound_Mix":"Dolby Digital","Color":"Color (Technicolor)","Aspect_Ratio":"1.85 : 1","Trivia":"The angelic song that plays in the background, particularly during the car trip, is Gabriel Fauré's \"In Paradisum\". See more »","Goofs":"The common trope of the zombies being undead with a craving for brains (or human flesh) is notably and deliberately averted in this film, pinning the reason for the devastation on the rage virus which turns people into violently aggressive killers - but this opens up a considerable plot hole: Why don't the rage victims kill each other? \"Normal\" zombies don't because the undead kill the living but the rage-infected seem to act more like a dog in the final stage of rabies, attacking anything that moves and/or makes noise - the infected have no reason not to attack each other. See more »","Crazy_Credits":"Other than the Fox Searchlight logo, there are no opening credits whatsoever. The title of the movie, 28 Days Later, only appears as a descriptive subtitle. See more »","Cast":"Alex Palmer, Bindu De Stoppani, Jukka Hiltunen, David Schneider, Cillian Murphy, Toby Sedgwick, Naomie Harris, Noah Huntley, Christopher Dunne, Emma Hitching, Alexander Delamere, Kim McGarrity, Brendan Gleeson, Megan Burns, Justin Hackney","Plot":"Four weeks after a mysterious, incurable virus spreads throughout the UK, a handful of survivors try to find sanctuary. Animal activists invade a laboratory with the intention of releasing chimpanzees that are undergoing experimentation, infected by a virus -a virus that causes rage. The naive activists ignore the pleas of a scientist to keep the cages locked, with disastrous results. Twenty-eight days later, our protagonist, Jim, wakes up from a coma, alone, in an abandoned hospital. He begins to seek out anyone else to find London is deserted, apparently without a living soul. After finding a church, which had become inhabited by zombie like humans intent on his demise, he runs for his life. Selena and Mark rescue him from the horde and bring him up to date on the mass carnage and horror as all of London tore itself apart. This is a tale of survival and ultimately, heroics, with nice subtext about mankind's savage nature. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Horror, Sci-Fi, Thriller","Keywords":"virus, military, laboratory, london england, zombie apocalypse","imdbRating":"7.6","imdbVotes":"287,581","Awards":"9 wins & 26 nominations.","Metascore":"73","Released":"27 June 2003 (USA) ","Location":"Pinewood Studios, Iver Heath, Buckinghamshire, England, UK ","Actors":"Cillian Murphy, Naomie Harris, Christopher Eccleston ","Running_time":"PT113M / 1h 53min","Description":"Directed by Danny Boyle.  With Cillian Murphy, Naomie Harris, Christopher Eccleston, Alex Palmer. Four weeks after a mysterious, incurable virus spreads throughout the UK, a handful of survivors try to find sanctuary.","Rated":"R"}