{"imdbID":"tt0209144","Title":"Memento","Year":"2000","Director":"Christopher Nolan","Taglines":"Some memories are best forgotten","Country":"USA","Language":"English","Also_Known_As":"Amnesia ","Budget":"$9,000,000 (estimated)","Opening_Weekend":"£90,642 (UK) (20 October 2000)","Gross":"$25,530,884 (USA) (9 November 2001)","Production_Co":"Newmarket Capital Group, Team Todd, I Remember Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"113 min","Sound_Mix":"Dolby Digital","Color":"Black and White | Color","Aspect_Ratio":"2.35 : 1","Trivia":"The test given to Sammy Jankis involving the electrified objects is based on a real life case study of a patient commonly referred to as HM, who suffered from the same form of amnesia following surgery to treat severe epilepsy. A doctor repeatedly shook HM's hand with a joy buzzer, shocking him every time. After a few trials, HM refused to shake hands. The test shown in the movie is an illustration that Sammy's condition was not identical to a real life case study, but would not have excluded him from insurance coverage. See more »","Goofs":"When Natalie kisses Leonard goodbye, her lips are not cut, though they are before and after. See more »","Cast":"Guy Pearce, Carrie-Anne Moss, Joe Pantoliano, Mark Boone Junior, Russ Fega, Jorja Fox, Stephen Tobolowsky, Harriet Sansom Harris, Thomas Lennon, Callum Keith Rennie, Kimberly Campbell, Marianne Muellerleile, Larry Holden","Plot":"A man creates a strange system to help him remember things; so he can hunt for the murderer of his wife without his short-term memory loss being an obstacle. Memento chronicles two separate stories of Leonard, an ex-insurance investigator who can no longer build new memories, as he attempts to find the murderer of his wife, which is the last thing he remembers. One story line moves forward in time while the other tells the story backwards revealing more each time. Written by Scion013","Genre":"Mystery, Thriller","Keywords":"memory, short term memory, murder, telephone, flashback","imdbRating":"8.5","imdbVotes":"814,073","Awards":"Nominated for 2 Oscars. Another 54 wins & 54 nominations.","Metascore":"80","Released":"25 May 2001 (USA) ","Location":"Hill Crest Inn, 9111 Sepulveda Blvd, North Hills, California, USA ","Actors":"Guy Pearce, Carrie-Anne Moss, Joe Pantoliano ","Writer":"Christopher Nolan (screenplay), Jonathan Nolan (short story \"Memento Mori\")","Running_time":"PT113M / 1h 53min","Description":"Directed by Christopher Nolan.  With Guy Pearce, Carrie-Anne Moss, Joe Pantoliano, Mark Boone Junior. A man creates a strange system to help him remember things; so he can hunt for the murderer of his wife without his short-term memory loss being an obstacle.","Rated":"R"}