{"imdbID":"tt0253474","Title":"The Pianist","Year":"2002","Director":"Roman Polanski","Taglines":"Music was his passion. Survival was his masterpiece.","Country":"France, Poland, Germany, UK","Language":"English, German, Russian","Also_Known_As":"El pianista ","Budget":"$35,000,000 (estimated)","Opening_Weekend":"$1,949,422 (France) (27 September 2002)","Gross":"$32,519,322 (USA) (30 May 2003)","Production_Co":"R.P. Productions, Heritage Films, Studio Babelsberg ","":"Show detailed company contact information on IMDbPro »","Runtime":"150 min | 142 min (DVD edition)","Sound_Mix":"DTS | Dolby Digital","Color":"Black and White (archive footage)| Color","Aspect_Ratio":"1.85 : 1","Trivia":"Both Roman Polanski and Ronald Harwood sat through hours and hours of authentic footage shot by the Germans during the war and were both struck at how orchestrated the footage was, deliberately engineered to produce the most striking effect. See more »","Goofs":"The German sergeant opens the sack of beans with a bayonet that is not German issue. It appears to be a Turkish Model 1890 bayonet. However, in war it's common for soldiers to use a weapon stolen or bought from another country if their own supplies are low. See more »","Crazy_Credits":"Aside from the Universal and Focus Features credits, there are no opening credits. All credits, including the title, appear at the end of the film. See more »","Cast":"Adrien Brody, Emilia Fox, Michal Zebrowski, Ed Stoppard, Maureen Lipman, Frank Finlay, Jessica Kate Meyer, Julia Rayner, Wanja Mues, Richard Ridings, Nomi Sharron, Anthony Milner, Lucy Skeaping, Roddy Skeaping, Ben Harlan","Plot":"A Polish Jewish musician struggles to survive the destruction of the Warsaw ghetto of World War II. A brilliant pianist, a Polish Jew, witnesses the restrictions Nazis place on Jews in the Polish capital, from restricted access to the building of the Warsaw ghetto. As his family is rounded up to be shipped off to the Nazi labor camps, he escapes deportation and eludes capture by living in the ruins of Warsaw. Written by Anonymous","Genre":"Biography, Drama, War","Keywords":"jewish, warsaw ghetto, piano, nazi, ruins","imdbRating":"8.5","imdbVotes":"475,601","Awards":"Won 3 Oscars. Another 51 wins & 65 nominations.","Metascore":"85","Released":"25 September 2002 (France) ","Location":"Germany ","Actors":"Adrien Brody, Thomas Kretschmann, Frank Finlay ","Writer":"Ronald Harwood (screenplay), Wladyslaw Szpilman (book)","Running_time":"PT150M / 2h 30min","Description":"Directed by Roman Polanski.  With Adrien Brody, Thomas Kretschmann, Frank Finlay, Emilia Fox. A Polish Jewish musician struggles to survive the destruction of the Warsaw ghetto of World War II.","Rated":"R"}