{"imdbID":"tt0243017","Title":"Waking Life","Year":"2001","Director":"Richard Linklater","Writer":"Richard Linklater","Country":"USA","Language":"English","Also_Known_As":"Despertando a la vida ","Opening_Weekend":"$88,977 (USA) (19 October 2001)","Gross":"$2,892,011 (USA) (26 April 2002)","Production_Co":"Fox Searchlight Pictures, Independent Film Channel (IFC), Thousand Words ","Runtime":"99 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Some of the names of candy bars in a store toward the film's end were changed in animation. Hershey's bars become \"Hercules\", Mentos are now \"Memos\", and Junior Mints were changed to \"Junior Pants\". See more »","Crazy_Credits":"Because almost none of the characters are named, a clip from their appearance is shown during the credits. See more »","Cast":"Trevor Jack Brooks, Lorelei Linklater, Wiley Wiggins, Glover Gill, Lara Hicks, Ames Asbell, Leigh Mahoney, Sara Nelson, Jeanine Attaway, Erik Grostic, Bill Wise, Robert C. Solomon, Kim Krizan, Eamonn Healy, J.C. Shakespeare","Plot":"A man shuffles through a dream meeting various people and discussing the meanings and purposes of the universe. Dreams. What are they? An escape from reality or reality itself? Waking Life follows the dream(s) of one man and his attempt to find and discern the absolute difference between waking life and the dreamworld. While trying to figure out a way to wake up, he runs into many people on his way; some of which offer one sentence asides on life, others delving deeply into existential questions and life's mysteries. We become the main character. It becomes our dream and our questions being asked and answered. Can we control our dreams? What are they telling us about life? About death? About ourselves and where we come from and where we are going? The film does not answer all these for us. Instead, it inspires us to ask the questions and find the answers ourselves. Written by Jeff Mellinger <jmell@uclink4.berkeley.edu>","Genre":"Animation, Drama, Fantasy","Keywords":"philosophy, dream, dreaming, death, cult film","imdbRating":"7.8","imdbVotes":"47,388","Awards":"5 wins & 20 nominations.","Metascore":"82","Released":"16 November 2001 (USA) ","Location":"Texas, USA ","Actors":"Ethan Hawke, Trevor Jack Brooks, Lorelei Linklater ","Running_time":"PT99M / 1h 39min","Description":"Directed by Richard Linklater.  With Ethan Hawke, Trevor Jack Brooks, Lorelei Linklater, Wiley Wiggins. A man shuffles through a dream meeting various people and discussing the meanings and purposes of the universe.","Rated":"R"}