{"imdbID":"tt0276919","Title":"Dogville","Year":"2003","Director":"Lars von Trier (as Lars Von Trier)","Writer":"Lars von Trier (as Lars Von Trier)","Taglines":"A quiet little town not far from here.","Country":"Denmark, Sweden, UK, France, Germany, Netherlands, Norway, Finland, Italy","Language":"English","Also_Known_As":"The Film 'Dogville' as Told in Nine Chapters and a Prologue ","Budget":"DKK 83,000,000 (estimated)","Opening_Weekend":"$661,452 (France) (23 May 2003)","Gross":"$1,530,386 (USA) (11 June 2004)","Production_Co":"Zentropa Entertainments, Isabella Films B.V., Something Else B.V. ","Runtime":"178 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Jeremy Davies originally intended to be von Trier's apprentice, not to act in the film. He wrote a letter to the director stating that he plans on being a filmmaker and wanted to learn from him. von Trier invited him to the set, mentored Davies, and gave him a small role in the film. See more »","Goofs":"When Chuck takes the scarf from Grace's neck it shows up two shots later, then is gone again in next shot. See more »","Crazy_Credits":"Closing dedication: In loving memory of Katrin Cartlidge 15.05.1961 - 07.09.2002 See more »","Cast":"Nicole Kidman, Harriet Andersson, Lauren Bacall, Jean-Marc Barr, Paul Bettany, Blair Brown, James Caan, Patricia Clarkson, Jeremy Davies, Ben Gazzara, Philip Baker Hall, Thom Hoffman, Siobhan Fallon Hogan, John Hurt, Zeljko Ivanek","Plot":"A woman on the run from the mob is reluctantly accepted in a small Colorado town. In exchange, she agrees to work for them. As a search visits town, she finds out that their support has a price. Yet her dangerous secret is never far away... Late one night, a beautiful and well-dressed young woman, Grace, arrives in the mountainous old mining town of Dogville as a fugitive; following the sound of gunshots in the distance which have been heard by Tom, the self-appointed moral spokesman for the town. Persuaded by Tom, the town agree to hide Grace, and in return she freely helps the locals. However, when the Sheriff from a neighbouring town posts a Missing notice, advertising a reward for revealing her whereabouts, the townsfolk require a better deal from Grace, in return for their silence; and when the Sheriff returns some weeks later with a Wanted poster, even though the citizens know her to be innocent of the false charges against her, the town's sense of goodness takes a sinister turn and the price of Grace's freedom becomes a workload and treatment akin to that of a slave. But Grace has a deadly secret that the townsfolk will eventually encounter. Written by Neil Hillman.","Genre":"Crime, Drama","Keywords":"town, secret, sheriff, fugitive, wanted poster","imdbRating":"8.1","imdbVotes":"104,895","Awards":"19 wins & 24 nominations.","Metascore":"59","Released":"23 April 2004 (USA) ","Location":"Film i Väst, Nohab Industrial Estate, Trollhättan, Västra Götalands län, Sweden ","Actors":"Nicole Kidman, Paul Bettany, Lauren Bacall ","Running_time":"PT178M / 2h 58min","Description":"Directed by Lars von Trier.  With Nicole Kidman, Paul Bettany, Lauren Bacall, Harriet Andersson. A woman on the run from the mob is reluctantly accepted in a small Colorado town. In exchange, she agrees to work for them. As a search visits town, she finds out that their support has a price. Yet her dangerous secret is never far away...","Rated":"R"}