{"imdbID":"tt0268978","Title":"A Beautiful Mind","Year":"2001","Director":"Ron Howard","Taglines":"I need to believe that something extra ordinary is possible... ","Country":"USA","Language":"English","Also_Known_As":"Una mente brillante ","Budget":"$60,000,000 (estimated)","Opening_Weekend":"$2,501,096 (USA) (21 December 2001)","Gross":"$170,708,996 (USA) (24 May 2002)","Production_Co":"Universal Pictures, DreamWorks SKG, Imagine Entertainment ","":"Show detailed company contact information on IMDbPro »","Runtime":"135 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Akiva Goldsman's creative take on the project was to avoid having viewers understand they are viewing an alternate reality until a specific point in the film. This was done to rob the viewers of their understanding, to mimic how Nash comprehended his experiences. Ron Howard agreed to direct the film based on the first draft. He asked Goldsman to emphasize the love story of Nash and his wife; she was critical to his being able to continue living at home. See more »","Goofs":"In 1951 Nash drinks from a paper cup with the \"recycled\" symbol on it. See more »","Cast":"Russell Crowe, Ed Harris, Jennifer Connelly, Christopher Plummer, Paul Bettany, Adam Goldberg, Josh Lucas, Anthony Rapp, Jason Gray-Stanford, Judd Hirsch, Austin Pendleton, Vivien Cardone, Jillie Simon, Victor Steinbach, Tanya Clarke","Plot":"After a brilliant but asocial mathematician, John Nash, accepts secret work in cryptography, his life takes a turn for the nightmarish. From the heights of notoriety to the depths of depravity, John Forbes Nash, Jr. experienced it all. A mathematical genius, he made an astonishing discovery early in his career and stood on the brink of international acclaim. But the handsome and arrogant Nash soon found himself on a painful and harrowing journey of self-discovery. After many years of struggle, he eventually triumphed over his tragedy, and finally - late in life - received the Nobel Prize. Written by Universal Pictures and DreamWorks Pictures","Genre":"Biography, Drama","Keywords":"mathematician, conspiracy, cryptography, nobel prize, school","imdbRating":"8.2","imdbVotes":"582,741","Awards":"Won 4 Oscars. Another 31 wins & 63 nominations.","Metascore":"72","Released":"4 January 2002 (USA) ","Location":"Bayonne, New Jersey, USA ","Actors":"Russell Crowe, Ed Harris, Jennifer Connelly ","Writer":"Akiva Goldsman, Sylvia Nasar (book)","Running_time":"PT135M / 2h 15min","Description":"Directed by Ron Howard.  With Russell Crowe, Ed Harris, Jennifer Connelly, Christopher Plummer. After a brilliant but asocial mathematician, John Nash, accepts secret work in cryptography, his life takes a turn for the nightmarish.","Rated":"PG-13"}