{"imdbID":"tt0249462","Title":"Billy Elliot","Year":"2000","Director":"Stephen Daldry","Writer":"Lee Hall","Country":"UK, France","Language":"English","Budget":"$5,000,000 (estimated)","Gross":"ESP 1,227,765,776 (Spain) (29 June 2001)","Production_Co":"StudioCanal, Working Title Films, BBC Films ","Runtime":"110 min","Cast":"Jamie Bell, Jean Heywood, Jamie Draven, Gary Lewis, Stuart Wells, Mike Elliot, Billy Fane, Nicola Blackwell, Julie Walters, Carol McGuigan, Joe Renton, Colin MacLachlan, Janine Birkett, Trevor Fox, Charlie Hardwick","Plot":"A talented young boy becomes torn between his unexpected love of dance and the disintegration of his family. County Durham, during the endless, violent 1984 strike against the Thatcher closure of British coal mines. Widower Jackie Elliot and his firstborn, fellow miner Tony, take a dim view of 11 year-old second son Billy's poor record in boxing class, which worsens when they discover he sneakily transferred to the neighboring, otherwise girls-only-attended ballet class. Only one schoolmate, closet-gay Michael Caffrey, encourages Billy's desire, aroused by the teacher, who judged him talented enough for private lesson, to train and try out for the world-renowned Royal Ballet audition. Only the prospect of a fancy career unimagined in the pauper quarter may twist pa and big brother's opposition to indispensable support. Written by KGF Vissers","Genre":"Drama, Music","Keywords":"miner, ballet, boxing, miners strike, audition","imdbRating":"7.7","imdbVotes":"95,227","Awards":"Nominated for 3 Oscars. Another 54 wins & 63 nominations.","Metascore":"74","Released":"10 November 2000 (USA) ","Location":"Canary Wharf Underground Station, Canary Wharf, Isle of Dogs, London, England, UK ","Actors":"Jamie Bell, Julie Walters, Jean Heywood ","Running_time":"PT110M / 1h 50min","Description":"Directed by Stephen Daldry.  With Jamie Bell, Julie Walters, Jean Heywood, Jamie Draven. A talented young boy becomes torn between his unexpected love of dance and the disintegration of his family.","Rated":"R"}