{"imdbID":"tt0370986","Title":"Mysterious Skin","Year":"2004","Director":"Gregg Araki","Taglines":"Two boys. One can't remember. The other can't forget.","Certificate":"NC-17 | See all certifications »","Country":"USA, Netherlands","Language":"English","Also_Known_As":"Piel misteriosa ","Opening_Weekend":"$17,425 (USA) (6 May 2005)","Gross":"$697,181 (USA) (29 July 2005)","Production_Co":"Antidote Films (I), Desperate Pictures, Fortissimo Films ","Runtime":"105 min | 107 min (Sundance Channel Library Print)","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"After Brian steals the picture of his baseball team from the archives, the film cuts to Neil announcing a baseball game. He says \"That's two outs, Garfield the batter. Heim on deck.\" Scott Heim wrote the novel on which the film is based. See more »","Goofs":"Minivan and passenger car seen parked at 32:44 were manufactured after 2000. See more »","Crazy_Credits":"The Dead Next Door (1989) Film Clip Courtesy of Amsco Studios/Tempe Entertainment See more »","Cast":"Chase Ellison, George Webster, Rachael Nastassja Kraft, Lisa Long, Chris Mulkey, Elisabeth Shue, David Lee Smith, Bill Sage, Riley McGuire, Ryan Stenzel, Joseph Gordon-Levitt, Richard Riehle, Michelle Trachtenberg, Brady Corbet, Larry Marko","Plot":"A teenage hustler and a young man obsessed with alien abductions cross paths, together discovering a horrible, liberating truth. Brian Lackey is determined to discover what happened during an amnesia blackout when he was eight years old, and then later woke with a bloody nose. He believes he was abducted by aliens, and N. McCormick, a fellow player on Brian's childhood baseball team, may be the key as to exactly what happened that night. As Brian searches for the truth and tries to track him down, Neil McCormick takes up hustling and moves to New York, in attempts to forget childhood memories that haunt him. Together, the two of them uncover the terrible truth of the scars they share. Written by Anonymous","Genre":"Drama","Keywords":"gay male prostitute, male hustler, loss of innocence, buried memories, man boy relationship","imdbRating":"7.7","imdbVotes":"55,636","Awards":"5 wins & 8 nominations.","Metascore":"73","Released":"24 June 2005 (USA) ","Location":"Los Angeles, California, USA ","Actors":"Brady Corbet, Joseph Gordon-Levitt, Elisabeth Shue ","Writer":"Gregg Araki (screenplay), Scott Heim (novel)","Running_time":"PT105M / 1h 45min","Description":"Directed by Gregg Araki.  With Brady Corbet, Joseph Gordon-Levitt, Elisabeth Shue, Chase Ellison. A teenage hustler and a young man obsessed with alien abductions cross paths, together discovering a horrible, liberating truth.","Rated":"NC-17"}