{"imdbID":"tt0317248","Title":"City of God","Year":"2002","Taglines":"Based on a true story. ","Country":"Brazil, France","Language":"Portuguese","Also_Known_As":"City of God ","Budget":"$3,300,000 (estimated)","Opening_Weekend":"$541,996 (Brazil) (30 August 2002)","Gross":"$7,563,397 (USA) (18 June 2004)","Production_Co":"O2 Filmes, VideoFilmes, Globo Filmes ","":"Show detailed company contact information on IMDbPro »","Runtime":"130 min | 135 min","Sound_Mix":"Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The scene where the gang prays before the war was not scripted. During the shooting a young boy, who used to be on a real gang, asked director Fernando Meirelles if the group was not going to pray like they always did before any important confrontation with the enemies. Meirelles told him to lead the prayer as they shot the scene. See more »","Goofs":"When the Tender Trio are running away into the woods after they crashed into a neighbor's house, Shaggy says that Goose messed up his ankle but it's actually Clipper. Goose's ankle is fine. See more »","Crazy_Credits":"There are no actor credits in the opening credits. See more »","Cast":"Alexandre Rodrigues, Leandro Firmino, Phellipe Haagensen, Douglas Silva, Jonathan Haagensen, Matheus Nachtergaele, Seu Jorge, Jefechander Suplino, Alice Braga, Emerson Gomes, Edson Oliveira, Michel de Souza, Roberta Rodrigues, Luis Otávio, Maurício Marques","Plot":"Two boys growing up in a violent neighborhood of Rio de Janeiro take different paths: one becomes a photographer, the other a drug dealer. Brazil, 1960s, City of God. The Tender Trio robs motels and gas trucks. Younger kids watch and learn well...too well. 1970s: Li'l Zé has prospered very well and owns the city. He causes violence and fear as he wipes out rival gangs without mercy. His best friend Bené is the only one to keep him on the good side of sanity. Rocket has watched these two gain power for years, and he wants no part of it. Yet he keeps getting swept up in the madness. All he wants to do is take pictures. 1980s: Things are out of control between the last two remaining gangs...will it ever end? Welcome to the City of God. Written by Jeff Mellinger <jeffmellinger@astound.net>","Genre":"Crime, Drama","Keywords":"1980s, male nudity, male frontal nudity, coming of age, photographer","imdbRating":"8.7","imdbVotes":"513,859","Awards":"Nominated for 4 Oscars. Another 65 wins & 36 nominations.","Metascore":"79","Released":"30 August 2002 (Brazil) ","Location":"Cidade de Deus, Rio de Janeiro, Rio de Janeiro, Brazil ","Actors":"Alexandre Rodrigues, Matheus Nachtergaele, Leandro Firmino ","Director":"Fernando Meirelles, Kátia Lund","Writer":"Paulo Lins (novel), Bráulio Mantovani (screenplay)","Running_time":"PT130M / 2h 10min","Description":"Directed by Fernando Meirelles, Kátia Lund.  With Alexandre Rodrigues, Matheus Nachtergaele, Leandro Firmino, Phellipe Haagensen. Two boys growing up in a violent neighborhood of Rio de Janeiro take different paths: one becomes a photographer, the other a drug dealer.","Rated":"R"}