{"imdbID":"tt0319061","Title":"Big Fish","Year":"2003","Director":"Tim Burton","Taglines":"An adventure as big as life itself.","Country":"USA","Language":"English, Cantonese","Also_Known_As":"El gran pez ","Budget":"$70,000,000 (estimated)","Opening_Weekend":"$207,377 (USA) (12 December 2003)","Gross":"$3,559,255 (Japan) (18 June 2004)","Production_Co":"Columbia Pictures Corporation, Jinks/Cohen Company, Zanuck Company, The ","":"Show detailed company contact information on IMDbPro »","Runtime":"125 min","Sound_Mix":"DTS | Dolby Digital | SDDS (8 channels)","Color":"Color","Aspect_Ratio":"1.37 : 1","Trivia":"The actor who plays the banjo in Spectre, Billy Redden, is playing the iconic song Dueling Banjos from the film Deliverance (1972) when Edward Bloom arrives for the first time. Redden played Lonnie in Deliverance. See more »","Goofs":"Will and Josephine live in Paris as the movie begins. As they enter their apartment, they carry paper grocery bags. No such bags are used in France. Since the 1970s, all French supermarkets and grocery stores have been handing out plastic bags. See more »","Crazy_Credits":"The Columbia logo runs in reverse. See more »","Cast":"Ewan McGregor, Albert Finney, Billy Crudup, Jessica Lange, Helena Bonham Carter, Alison Lohman, Robert Guillaume, Marion Cotillard, Matthew McGrory, David Denman, Missi Pyle, Loudon Wainwright III, Ada Tai, Arlene Tai, Steve Buscemi","Plot":"A frustrated son tries to determine the fact from fiction in his dying father's life. United Press International journalist Will Bloom and his French freelance photojournalist wife Josephine Bloom, who is pregnant with their first child, leave their Paris base to return to Will's hometown of Ashton, Alabama on the news that his father, Edward Bloom, stricken with cancer, will soon die, he being taken off chemotherapy treatment. Although connected indirectly through Will's mother/Edward's wife, Sandra Bloom, Will has been estranged from his father for three years since his and Josephine's wedding. Will's issue with his father is the fanciful tales Edward has told of his life all his life, not only to Will but the whole world. As a child when Edward was largely absent as a traveling salesman, Will believed those stories, but now realizes that he does not know his father, who, as he continues to tell these stories, he will never get to know unless Edward comes clean with the truth before he dies. On the brink of his own family life beginning, Will does not want to be the ... Written by Huggo","Genre":"Adventure, Drama, Fantasy","Keywords":"sideburns, child, dying, death, traveling salesman","imdbRating":"8.0","imdbVotes":"343,438","Awards":"Nominated for 1 Oscar. Another 1 win & 52 nominations.","Metascore":"58","Released":"9 January 2004 (USA) ","Location":"USA ","Actors":"Ewan McGregor, Albert Finney, Billy Crudup ","Writer":"Daniel Wallace (novel), John August (screenplay)","Running_time":"PT125M / 2h 5min","Description":"Directed by Tim Burton.  With Ewan McGregor, Albert Finney, Billy Crudup, Jessica Lange. A frustrated son tries to determine the fact from fiction in his dying father's life.","Rated":"PG-13"}