{"imdbID":"tt0315983","Title":"House of Sand and Fog","Year":"2003","Director":"Vadim Perelman","Country":"USA","Language":"English, Persian","Budget":"$15,000,000 (estimated)","Gross":"$13,005,485 (USA) (26 March 2004)","Production_Co":"DreamWorks SKG, Cobalt Media Group, Bisgrove Entertainment ","Runtime":"126 min","Cast":"Jennifer Connelly, Ben Kingsley, Ron Eldard, Frances Fisher, Kim Dickens, Shohreh Aghdashloo, Jonathan Ahdout, Navi Rawat, Carlos Gómez, Kia Jam, Jaleh Modjallal, Samira Damavandi, Matthew Simonian, Namrata Singh Gujral, Nasser Faris","Plot":"An abandoned wife is evicted from her house and starts a tragic conflict with her home's new owners. An emotionally broken woman, Kathy, suddenly finds herself homeless after her house is wrongly repossessed and auctioned. Seeking respite from his marriage, Lester, a sympathetic sheriff's deputy comes to the aid of Kathy and becomes intimately involved in her situation. Soon, Behrani, a proud emigrant Iranian and his family move into the house only to find their new lives burdened by harassment from Lester and Kathy as they attempt to reclaim her former home. The once prosperous colonel denies Kathy's pleas for he knows his recent purchase promises a profitable return and a better future for his adolescent son and his wife. But latent consequences lie beneath Behrani's well intentioned plan as Kathy's emotions spiral out of control and her actions spark a tragic chain of events that will leave no resident unscathed in the House of Sand and Fog. Written by Tiler Faisal","Genre":"Drama","Keywords":"house, iranian, auction, home, marriage","imdbRating":"7.6","imdbVotes":"55,851","Awards":"Nominated for 3 Oscars. Another 12 wins & 34 nominations.","Metascore":"71","Released":"9 January 2004 (USA) ","Location":"San Francisco, California, USA ","Actors":"Jennifer Connelly, Ben Kingsley, Ron Eldard ","Writer":"Andre Dubus III (novel), Vadim Perelman (screenplay) | 1 more credit »","Running_time":"PT126M / 2h 6min","Description":"Directed by Vadim Perelman.  With Jennifer Connelly, Ben Kingsley, Ron Eldard, Frances Fisher. An abandoned wife is evicted from her house and starts a tragic conflict with her home's new owners.","Rated":"R"}