{"imdbID":"tt0310775","Title":"Sympathy for Mr. Vengeance","Year":"2002","Director":"Chan-wook Park","Taglines":"Revenge Was Never This Sweet","Country":"South Korea","Language":"Korean, Korean Sign Language","Also_Known_As":"Sympathy for Mr. Vengeance ","Budget":"$4,000,000 (estimated)","Opening_Weekend":"$9,827 (USA) (19 August 2005)","Gross":"$45,243 (USA) (10 February 2006)","Production_Co":"CJ Entertainment, Studio Box ","Runtime":"129 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"In the scene where Kang-ho Song's character waits for Ryu while lying down, it's suggested that he makes snoring noises to pretend that he is sleeping. However, Ryu is deaf and this strategy would prove useless. See more »","Goofs":"During the scene where engineer Peng slashes his stomach four times, notice his strokes. He makes a semi-short stroke, then two strokes that are similar in length, and then a very long stroke on the bottom. All of these strokes are relatively straight; although, when you see the close-up of his gashes bleeding, you see that the first stroke is very short and angled down, and the bottom stroke is much shorter than the middle two, even though it should obviously be longer. See more »","Cast":"Kang-ho Song, Ha-kyun Shin, Doona Bae, Ji-Eun Lim, Bo-bae Han, Se-dong Kim, Dae-yeon Lee, Masashi Fujimoto, Ju-bong Gi, Gyu-su Jeong, Jae-yeong Jeong, Kan-hie Lee, Kwang-rok Oh, Jae-woong Park, Seung-wan Ryoo","Plot":"A recently laid off factory worker kidnaps his former boss' daughter, hoping to use the ransom money to pay for his sister's kidney transplant. In Seoul, Ryu, a deaf worker has a sister who needs a kidney transplant. He tries to donate his own kidney to his sister, but his blood type is not compatible with hers. When Ryu is fired from Ilshin Electronics, he meets illegal dealers of organs, and the criminals propose that he give them his kidney plus ten millions Won to obtain a kidney suitable for his sister. Ryu accepts the trade, but he does not have money to pay for the surgery. His anarchist revolutionary girlfriend Cha Young-mi convinces him to kidnap Yossun, the daughter of his former employer Park, who owns Ilshin Electronics. However, a tragedy happens, generating revenge and a series of acts of violence. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Crime, Drama, Thriller","Keywords":"sign language, three act structure, kidney transplant, violence, revenge","imdbRating":"7.7","imdbVotes":"44,502","Awards":"2 wins.","Metascore":"56","Released":"29 March 2002 (South Korea) ","Actors":"Kang-ho Song, Ha-kyun Shin, Doona Bae ","Writer":"Jae-sun Lee, Jong-yong Lee | 2 more credits »","Running_time":"PT129M / 2h 9min","Description":"Directed by Chan-wook Park.  With Kang-ho Song, Ha-kyun Shin, Doona Bae, Ji-Eun Lim. A recently laid off factory worker kidnaps his former boss' daughter, hoping to use the ransom money to pay for his sister's kidney transplant.","Rated":"R"}