{"imdbID":"tt0307901","Title":"25th Hour","Year":"2002","Director":"Spike Lee","Taglines":"This life was so close to never happening ","Country":"USA","Language":"English","Also_Known_As":"The 25th Hour ","Budget":"$15,000,000 (estimated)","Opening_Weekend":"$108,865 (USA) (20 December 2002)","Gross":"$32,399 (Brazil) (23 May 2003)","Production_Co":"25th Hour Productions, 40 Acres & A Mule Filmworks, Gamut Films ","Runtime":"135 min | 108 min (TV)","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Spike Lee: [basketball] Both Monty and Naturelle played high school basketball; another scene depicts a playground game. Also, Frank is reminded by his boss that they have courtside seats for an upcoming game. See more »","Goofs":"(at around 57 mins) During Jacob's and Frank's dinner together, the clock in the restaurant keeps shifting between shots, even though it is supposed to be one continuous scene. At one point the clock reads 11:35, and at another it shows about 9:40. See more »","Crazy_Credits":"Special Thanks ... Bruce \"Da Boss\" Springsteen See more »","Cast":"Edward Norton, Philip Seymour Hoffman, Barry Pepper, Rosario Dawson, Anna Paquin, Brian Cox, Tony Siragusa, Levan Uchaneishvili, Tony Devon, Misha Kuznetsov, Isiah Whitlock Jr., Michael Genet, Patrice O'Neal, Al Palagonia, Aaron Stanford","Plot":"Cornered by the DEA, convicted New York drug dealer Montgomery Brogan reevaluates his life in the 24 remaining hours before facing a seven-year jail term. The 25th Hour depicts the last day of freedom for a young man before he begins serving a seven-year jail term for drug dealing. Prowling through the city until dawn with his two close male friends and his girlfriend, he is forced to re-examine his life and how he got himself into his predicament, which leads to a shocking, disturbing finale. Written by Justin Harris <jharris316@yahoo.com>","Genre":"Drama","Keywords":"drug dealing, dream, bar, nightclub, widower","imdbRating":"7.7","imdbVotes":"147,065","Awards":"Nominated for 1 Golden Globe. Another 3 wins & 9 nominations.","Metascore":"67","Released":"10 January 2003 (USA) ","Location":"Austin, Texas, USA ","Actors":"Edward Norton, Barry Pepper, Philip Seymour Hoffman ","Writer":"David Benioff (novel), David Benioff (screenplay)","Running_time":"PT135M / 2h 15min","Description":"Directed by Spike Lee.  With Edward Norton, Barry Pepper, Philip Seymour Hoffman, Rosario Dawson. Cornered by the DEA, convicted New York drug dealer Montgomery Brogan reevaluates his life in the 24 remaining hours before facing a seven-year jail term.","Rated":"R"}