{"imdbID":"tt0372183","Title":"The Bourne Supremacy","Year":"2004","Director":"Paul Greengrass","Taglines":"They stole his identity. Now he wants it back. ","Country":"USA, Germany","Language":"English, Russian, German, Italian","Also_Known_As":"Die Bourne Verschwörung ","Budget":"$75,000,000 (estimated)","Opening_Weekend":"$52,521,865 (USA) (23 July 2004)","Gross":"$4,138,339 (Japan) (11 March 2005)","Production_Co":"Universal Pictures, Motion Picture THETA Produktionsgesellschaft, Kennedy/Marshall Company, The ","Runtime":"108 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The 14 November 2003 draft of the screenplay credits Brian Helgeland for a rewrite. He is not credited in the final film. See more »","Goofs":"On the train bridge Jason clings on to the guardrail and jumps. The guardrail can be seen in several shots in that scene, but when Jason grabs it the very first shot shows a different guardrail. See more »","Crazy_Credits":"The opening titles only include the production company and the title of the film. See more »","Cast":"Matt Damon, Franka Potente, Brian Cox, Julia Stiles, Karl Urban, Gabriel Mann, Joan Allen, Marton Csokas, Tom Gallop, John Bedford Lloyd, Ethan Sandler, Michelle Monaghan, Karel Roden, Tomas Arana, Oksana Akinshina","Plot":"When Jason Bourne is framed for a CIA operation gone awry, he is forced to resume his former life as a trained assassin to survive. After escaping from the emotional and physical pain he previously encountered. Jason Bourne and his girlfriend Marie begin a new life as far away as possible. But when an assassination attempt on Bourne goes horribly wrong, Bourne must re-enter the life he wanted to leave behind, in order to find out the truth why they are still after him. Written by Film_Fan","Genre":"Action, Thriller","Keywords":"cia, assassin, one against many, hidden truth, car chase","imdbRating":"7.8","imdbVotes":"331,537","Awards":"5 wins & 21 nominations.","Metascore":"73","Released":"23 July 2004 (USA) ","Location":"Los Angeles, California, USA ","Actors":"Matt Damon, Franka Potente, Joan Allen ","Writer":"Robert Ludlum (novel), Tony Gilroy (screenplay)","Running_time":"PT108M / 1h 48min","Description":"Directed by Paul Greengrass.  With Matt Damon, Franka Potente, Joan Allen, Brian Cox. When Jason Bourne is framed for a CIA operation gone awry, he is forced to resume his former life as a trained assassin to survive.","Rated":"PG-13"}