{"imdbID":"tt0362225","Title":"Tell No One","Year":"2006","Director":"Guillaume Canet","Taglines":"8 years ago, Alex's wife was MURDERED. Today... She e-mailed him.","Certificate":"Unrated | See all certifications »","Country":"France","Language":"French","Also_Known_As":"Tell No One ","Budget":"€11,700,000 (estimated)","Opening_Weekend":"£173,852 (UK) (15 June 2007)","Gross":"$6,177,192 (USA) (6 February 2009)","Production_Co":"Les Productions du Trésor, EuropaCorp, M6 Films ","Runtime":"131 min","Sound_Mix":"Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Originally, author Harlan Coben had optioned off his novel to Hollywood, with director Michael Apted attached. During this time, director Guillaume Canet, who had loved the novel, had been calling up Coben with his take on the novel. Coben was immediately impressed with Canet's passion for the story, and his vision, stating that Canet understood that the novel was a love story first, and a thriller second, which Hollywood never got. When the option with Hollywood fell through, Coben contacted Canet and decided to give him a chance. See more »","Goofs":"When Alexandre gets out of the water to go help Margot in the beginning, his attacker hits him twice with the bat. Towards the end, when they show this same attack from farther away his attacker hits him thrice. See more »","Cast":"François Cluzet, Marie-Josée Croze, André Dussollier, Kristin Scott Thomas, François Berléand, Nathalie Baye, Jean Rochefort, Marina Hands, Gilles Lellouche, Philippe Lefebvre, Florence Thomassin, Olivier Marchal, Guillaume Canet, Brigitte Catillon, Samir Guesmi","Plot":"Police find two bodies at an old murder scene and evidence to suggest the scene's first victim's husband is a murderer. Coincidentally, the husband receives clues suggesting his deceased wife is actually alive and begins to investigate. The pediatrician Alexandre Beck misses his beloved wife Margot Beck, who was brutally murdered eight years ago when he was the prime suspect. When two bodies are found near where the corpse of Margot was dumped, the police reopen the case and Alex becomes suspect again. The mystery increases when Alex receives an e-mail showing Margot older and alive. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Crime, Drama, Mystery","Keywords":"skinny dipping, nude swimming, male rear nudity, male nudity, male frontal nudity","imdbRating":"7.6","imdbVotes":"36,457","Awards":"12 wins & 15 nominations.","Metascore":"82","Released":"8 August 2008 (USA) ","Location":"Adainville, Yvelines, France ","Actors":"François Cluzet, Marie-Josée Croze, André Dussollier ","Writer":"Guillaume Canet, Harlan Coben (novel) | 1 more credit »","Running_time":"PT131M / 2h 11min","Description":"Directed by Guillaume Canet.  With François Cluzet, Marie-Josée Croze, André Dussollier, Kristin Scott Thomas. Police find two bodies at an old murder scene and evidence to suggest the scene's first victim's husband is a murderer. Coincidentally, the husband receives clues suggesting his deceased wife is actually alive and begins to investigate.","Rated":"UNRATED"}