{"imdbID":"tt0375679","Title":"Crash","Year":"2004","Director":"Paul Haggis","Country":"Germany, USA","Language":"English, Persian, Spanish, Mandarin, Korean","Budget":"$6,500,000 (estimated)","Gross":"$230,508 (Hong Kong) (7 July 2006)","Production_Co":"Bob Yari Productions, DEJ Productions, Blackfriars Bridge Films ","Runtime":"112 min | 115 min (director's cut)","Cast":"Karina Arroyave, Dato Bakhtadze, Sandra Bullock, Don Cheadle, Art Chudabala, Sean Cory Cooper, Tony Danza, Keith David, Loretta Devine, Matt Dillon, Jennifer Esposito, Ime Etuk, Eddie J. Fernandez, William Fichtner, Howard Fong","Plot":"Los Angeles citizens with vastly separate lives collide in interweaving stories of race, loss and redemption. Over a thirty-six hour period in Los Angeles, a handful of disparate people's lives intertwine as they deal with the tense race relations that belie life in the city. Among the players are: the Caucasian district attorney, who uses race as a political card; his Caucasian wife, who, having recently been carjacked by two black men, believes that her stereotypical views of non-whites is justified and cannot be considered racism; the two black carjackers who use their race both to their advantage and as an excuse; partnered Caucasian police constables, one who is a racist and uses his authority to harass non-whites, and the other who hates his partner because of those racist views, but who may have the same underlying values in his subconscious; a black film director and his black wife, who believes her husband doesn't support their black background enough, especially in light of an incident with the racist white cop; partnered police detectives and sometimes lovers, one Hispanic female ... Written by Huggo","Genre":"Drama","Keywords":"racist, racism, race relations, social problem, social injustice","imdbRating":"7.9","imdbVotes":"354,612","Awards":"Won 3 Oscars. Another 61 wins & 100 nominations.","Metascore":"69","Released":"6 May 2005 (USA) ","Location":"3500 S. Gaffey Street, San Pedro, Los Angeles, California, USA ","Actors":"Don Cheadle, Sandra Bullock, Thandie Newton ","Writer":"Paul Haggis (story), Paul Haggis (screenplay) | 1 more credit »","Running_time":"PT112M / 1h 52min","Description":"Directed by Paul Haggis.  With Don Cheadle, Sandra Bullock, Thandie Newton, Karina Arroyave. Los Angeles citizens with vastly separate lives collide in interweaving stories of race, loss and redemption.","Rated":"R"}