{"imdbID":"tt0363163","Title":"Downfall","Year":"2004","Director":"Oliver Hirschbiegel","Taglines":"April 1945, a nation awaits its...","Country":"Germany, Austria, Italy","Language":"German, Russian, Hungarian","Also_Known_As":"Downfall ","Budget":"€13,500,000 (estimated)","Opening_Weekend":"$210,232 (Austria) (17 September 2004)","Gross":"$1,288,633 (Brazil) (8 July 2005)","Production_Co":"Constantin Film Produktion, Norddeutscher Rundfunk (NDR), Westdeutscher Rundfunk (WDR) ","":"Show detailed company contact information on IMDbPro »","Runtime":"156 min | 178 min (extended)","Sound_Mix":"Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The button that Adolf Hitler removes from his jacket and gives to Magda Goebbels is the Gold Nazi Party badge, awarded to high-ranking party members who had constant membership from 1925. Hitler gave himself Badge No. 1 when he authorized it in 1933, even though he was not the first party member. The Soviets found the badge in the bunker and it was stored in a vault at the Lubyanka, the KGB headquarters. In 1996 the FSB, the Russian Federation successor to the Soviet KGB, revealed that it had the badge and in 2005 put it on display. In November that year, it was stolen in a brazen smash-and-grab raid. The burglar escaped even though he triggered the display alarms. So far, it has not yet been recovered. See more »","Goofs":"During the flight from the bunker, Müller (Schenck's adjutant) is shot. When the camera cuts to his body on the ground there is a bullet wound in his right cheek. But no wound is seen on his face in the previous frames as we hear the shot and see him falling. See more »","Crazy_Credits":"After the final credits there is a statement by the real Traudl Jung about her feelings of guilt and responsibility. In the British Cinema release, this is moved to before the credits. See more »","Cast":"Bruno Ganz, Alexandra Maria Lara, Corinna Harfouch, Ulrich Matthes, Juliane Köhler, Heino Ferch, Christian Berkel, Matthias Habich, Thomas Kretschmann, Michael Mendl, André Hennicke, Ulrich Noethen, Birgit Minichmayr, Rolf Kanies, Justus von Dohnányi","Plot":"Traudl Junge, the final secretary for Adolf Hitler, tells of the Nazi dictator's final days in his Berlin bunker at the end of WWII. In April of 1945, Germany stands at the brink of defeat with the Soviet Armies closing in from the west and south. In Berlin, capital of the Third Reich, Adolf Hitler proclaims that Germany will still achieve victory and orders his Generals and advisers to fight to the last man. \"Downfall\" explores these final days of the Reich, where senior German leaders (such as Himmler and Goring) began defecting from their beloved Fuhrer, in an effort to save their own lives, while still others (Joseph Goebbels) pledge to die with Hitler. Hitler, himself, degenerates into a paranoid shell of a man, full of optimism one moment and suicidal depression the next. When the end finally does comes, and Hitler lies dead by his own hand, what is left of his military must find a way to end the killing that is the Battle of Berlin, and lay down their arms in surrender. Written by Anthony Hughes {husnock31@hotmail.com}","Genre":"Biography, Drama, History","Keywords":"hitler, bunker, nazi, no exit, war ruins","imdbRating":"8.3","imdbVotes":"239,976","Awards":"Nominated for 1 Oscar. Another 21 wins & 25 nominations.","Metascore":"82","Released":"8 April 2005 (USA) ","Location":"Bavaria Studios, Bavariafilmplatz 7, Geiselgasteig, Grünwald, Bavaria, Germany ","Actors":"Bruno Ganz, Alexandra Maria Lara, Ulrich Matthes ","Writer":"Bernd Eichinger (screenplay), Joachim Fest (book) | 2 more credits »","Running_time":"PT156M / 2h 36min","Description":"Directed by Oliver Hirschbiegel.  With Bruno Ganz, Alexandra Maria Lara, Ulrich Matthes, Juliane Köhler. Traudl Junge, the final secretary for Adolf Hitler, tells of the Nazi dictator's final days in his Berlin bunker at the end of WWII.","Rated":"R"}