{"imdbID":"tt0375063","Title":"Sideways","Year":"2004","Director":"Alexander Payne","Country":"USA, Hungary","Language":"English, Armenian","Budget":"$12,000,000 (estimated)","Gross":"$71,502,303 (USA) (13 May 2005)","Production_Co":"Fox Searchlight Pictures, Michael London Productions, Sideways Productions Inc. ","Runtime":"126 min","Cast":"Paul Giamatti, Thomas Haden Church, Virginia Madsen, Sandra Oh, Marylouise Burke, Jessica Hecht, Missy Doty, M.C. Gainey, Alysia Reiner, Shake Tukhmanyan, Shaun Duke, Robert Covarrubias, Patrick Gallagher, Stephanie Faracy, Joe Marinelli","Plot":"Two men reaching middle age with not much to show but disappointment embark on a week-long road trip through California's wine country, just as one is about to take a trip down the aisle. A week before his friend Jack is to be married, best man Miles and the prospective groom head off to wine country for a week of fun, relaxation and - of course - wine drinking. Miles is the oenophile and does his best to teach Jack a bit about the art of appreciating great wine. All Jack cares about is drinking and carousing, something he accomplishes when he meets the attractive Stephanie at one of the vineyards. Miles is something of a sad sack, a high school English teacher who is a failed writer at heart. He has yet to get over the fact that his wife has divorced him and that she has remarried and he now faces that nerve racking wait for word from a prospective publisher. Miles has an opportunity to start anew when he meets Stephanie's friend Maya but when he let's slip that Jack is about to be married any hope of a relationship seems to be lost. Written by garykmcd","Genre":"Adventure, Comedy, Drama","Keywords":"wine, california, actor, writer, middle age","imdbRating":"7.6","imdbVotes":"146,195","Awards":"Won 1 Oscar. Another 119 wins & 80 nominations.","Metascore":"94","Released":"21 January 2005 (USA) ","Location":"1785 South Broadway, Santa Maria, California, USA ","Actors":"Paul Giamatti, Thomas Haden Church, Virginia Madsen ","Writer":"Rex Pickett (novel), Alexander Payne (screenplay) | 1 more credit »","Running_time":"PT126M / 2h 6min","Description":"Directed by Alexander Payne.  With Paul Giamatti, Thomas Haden Church, Virginia Madsen, Sandra Oh. Two men reaching middle age with not much to show but disappointment embark on a week-long road trip through California's wine country, just as one is about to take a trip down the aisle.","Rated":"R"}