{"imdbID":"tt0382932","Title":"Ratatouille","Year":"2007","Taglines":"He's dying to become a chef. ","Certificate":"G | See all certifications »","Country":"USA","Language":"English, French","Also_Known_As":"Delicious Ratatouille 3D ","Budget":"$150,000,000 (estimated)","Opening_Weekend":"$47,027,395 (USA) (29 June 2007)","Gross":"£24,549,458 (UK) (7 December 2007)","Production_Co":"Pixar Animation Studios, Walt Disney Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"111 min","Sound_Mix":"SDDS | Dolby Digital EX | DTS-ES","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The room that Anton Ego writes his review in is shaped like a coffin; in addition the back of his typewriter resembles a skull face - appropriate, because he writes \"killer\" reviews. See more »","Goofs":"When Remy reunites with his brother outside the restaurant, he offers to steal some food from inside the business. However, Remy already was given a supply of food just a few minutes ago such as grapes and a large chunk of cheese to eat which he had barely started on himself. Why didn't Remy just have Emile help himself to that? See more »","Crazy_Credits":"A cartoon Remy is lying over the final credit (Produced by Pixar Animation Studios). When the credit fades away, Remy falls and limps off screen. See more »","Cast":"Patton Oswalt, Ian Holm, Lou Romano, Brian Dennehy, Peter Sohn, Peter O'Toole, Brad Garrett, Janeane Garofalo, Will Arnett, Julius Callahan, James Remar, John Ratzenberger, Teddy Newton, Tony Fucile, Jake Steinfeld","Plot":"A rat who can cook makes an unusual alliance with a young kitchen worker at a famous restaurant. A rat named Remy dreams of becoming a great French chef despite his family's wishes and the obvious problem of being a rat in a decidedly rodent-phobic profession. When fate places Remy in the sewers of Paris, he finds himself ideally situated beneath a restaurant made famous by his culinary hero, Auguste Gusteau. Despite the apparent dangers of being an unlikely - and certainly unwanted - visitor in the kitchen of a fine French restaurant, Remy's passion for cooking soon sets into motion a hilarious and exciting rat race that turns the culinary world of Paris upside down. Written by Orange","Genre":"Animation, Comedy, Family","Keywords":"rat, chef, restaurant, french, food","imdbRating":"8.0","imdbVotes":"453,298","Awards":"Won 1 Oscar. Another 64 wins & 42 nominations.","Metascore":"96","Released":"29 June 2007 (USA) ","Location":"Pixar Animation Studios - 1200 Park Avenue, Emeryville, California, USA ","Actors":"Brad Garrett, Lou Romano, Patton Oswalt ","Director":"Brad Bird, Jan Pinkava","Writer":"Brad Bird (screenwriter), Jan Pinkava (original story by) | 2 more credits »","Running_time":"PT111M / 1h 51min","Description":"Directed by Brad Bird, Jan Pinkava.  With Brad Garrett, Lou Romano, Patton Oswalt, Ian Holm. A rat who can cook makes an unusual alliance with a young kitchen worker at a famous restaurant.","Rated":"G"}