{"imdbID":"tt0364517","Title":"Love Me If You Dare","Year":"2003","Director":"Yann Samuell","Writer":"Yann Samuell","Taglines":"Are you game? ","Country":"France, Belgium","Language":"French","Also_Known_As":"Love Me If You Dare ","Opening_Weekend":"$1,846,997 (France) (19 September 2003)","Gross":"$548,707 (USA) (1 October 2004)","Production_Co":"Nord-Ouest Productions, StudioCanal, Artémis Productions ","Runtime":"93 min","Sound_Mix":"DTS | Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Marion Cotillard and Guillaume Canet played a couple in this movie and in 2007 they started dating. In 2011, their first child was born. The two actors didn't met on the set of \"Love Me If You Dare\", it happened years before starring together in the movie and they were friends since the '90s. See more »","Goofs":"The first time we see the bus driver chasing the bus his hat falls off towards the left side of the road. The second time it drops directly behind him to the right of the middle. See more »","Cast":"Guillaume Canet, Marion Cotillard, Thibault Verhaeghe, Joséphine Lebas-Joly, Emmanuelle Grönvold, Gérard Watkins, Gilles Lellouche, Julia Faure, Laëtizia Venezia Tarnowska, Élodie Navarre, Nathalie Nattier, Robert Willar, Frédéric Geerts, Manuela Sanchez, Philippe Drecq","Plot":"A love story between two psychopaths that turns into a dare-or-not-dare game. Julien Janvier lost his mother young, drifted apart from his working class father and ever closer to confident Sophie Kowalsky, the Polish class outsider. Their dares game, symbolized by an interchanged music-box, grows ever bolder, regardless of harm to others and each-other. In his college years, it even suspends their relationship and toys with their marriages, but they are drawn back to each-other irresistibly. Written by KGF Vissers","Genre":"Comedy, Drama, Romance","Keywords":"game, competition, dare, polish, music box","imdbRating":"7.7","imdbVotes":"54,031","Awards":"5 wins & 2 nominations.","Metascore":"45","Released":"28 May 2004 (USA) ","Location":"Liège, Wallonia, Belgium ","Actors":"Guillaume Canet, Marion Cotillard, Thibault Verhaeghe ","Running_time":"PT93M / 1h 33min","Description":"Directed by Yann Samuell.  With Guillaume Canet, Marion Cotillard, Thibault Verhaeghe, Joséphine Lebas-Joly. A love story between two psychopaths that turns into a dare-or-not-dare game.","Rated":"R"}