{"imdbID":"tt0338013","Title":"Eternal Sunshine of the Spotless Mind","Year":"2004","Director":"Michel Gondry","Taglines":"I already forget how I used to feel about you. ","Certificate":"A | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Eterno resplandor de una mente sin recuerdos ","Budget":"$20,000,000 (estimated)","Opening_Weekend":"$8,175,198 (USA) (19 March 2004)","Gross":"$1,747,623 (Japan) (8 April 2005)","Production_Co":"Focus Features, Anonymous Content, This Is That Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"108 min","Sound_Mix":"DTS (as dts)| Dolby","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The small computer hooked up to the memory erasing headset is an old Amstrad PPC 512 or 640, manufactured back in 1988. See more »","Goofs":"Many of the continuity errors listed here may well be deliberate. In the DVD extras, the movie makers explain that they played with the continuity to underline the struggle between the doctor and technicians trying to erase the memories and Joel trying to hold on to them. See more »","Crazy_Credits":"The credits are right justified, versus the usual center justified credits. See more »","Cast":"Jim Carrey, Kate Winslet, Gerry Robert Byrne, Elijah Wood, Thomas Jay Ryan, Mark Ruffalo, Jane Adams, David Cross, Kirsten Dunst, Tom Wilkinson, Ryan Whitney, Debbon Ayer, Amir Ali Said, Brian Price, Paulie Litt","Plot":"When their relationship turns sour, a couple undergoes a procedure to have each other erased from their memories. But it is only through the process of loss that they discover what they had to begin with. A man, Joel Barish, heartbroken that his girlfriend Clementine underwent a procedure to erase him from her memory, decides to do the same. However, as he watches his memories of her fade away, he realizes that he still loves her, and may be too late to correct his mistake. Written by anonymous","Genre":"Drama, Romance, Sci-Fi","Keywords":"memory, retrograde narrative, loneliness, playing against type, borderline personality disorder","imdbRating":"8.4","imdbVotes":"639,986","Awards":"Won 1 Oscar. Another 66 wins & 98 nominations.","Metascore":"89","Released":"19 March 2004 (USA) ","Location":"123 Valentine Lane, Yonkers, New York, USA ","Actors":"Jim Carrey, Kate Winslet, Tom Wilkinson ","Writer":"Charlie Kaufman (story), Michel Gondry (story) | 2 more credits »","Running_time":"PT108M / 1h 48min","Description":"Directed by Michel Gondry.  With Jim Carrey, Kate Winslet, Tom Wilkinson, Gerry Robert Byrne. When their relationship turns sour, a couple undergoes a procedure to have each other erased from their memories. But it is only through the process of loss that they discover what they had to begin with.","Rated":"A"}