{"imdbID":"tt0318462","Title":"The Motorcycle Diaries","Year":"2004","Director":"Walter Salles","Taglines":"Let the world change you... and you can change the world ","Country":"Argentina, USA, Chile, Peru, Brazil, UK, Germany, France","Language":"Spanish, Quechua, Mapudungun","Also_Known_As":"The Motorcycle Diaries ","Opening_Weekend":"$375,461 (Brazil) (7 May 2004)","Gross":"$16,756,372 (USA) (11 February 2005)","Production_Co":"FilmFour, Wildwood Enterprises, Tu Vas Voir Productions ","Runtime":"126 min","Sound_Mix":"DTS | Dolby Digital","Color":"Black and White | Color","Aspect_Ratio":"1.85 : 1","Trivia":"Despite being based upon an Argentinean book, about a Cuban-Argentinean legend, with a Mexican and an Argentinean actor in the leading roles and spoken in Spanish, the film represented Brazil in many film festivals worldwide. Only the director, Walter Salles, is Brazilian. See more »","Goofs":"On the boat to San Pablo, Ernesto writes in a notebook with a pencil. When he gets up to look for his bag, the notebook and pencil are gone. See more »","Crazy_Credits":"The real Alberto appears at the very end of the film just before the credits. See more »","Cast":"Gael García Bernal, Rodrigo De la Serna, Mía Maestro, Mercedes Morán, Jean Pierre Noher, Lucas Oro, Marina Glezer, Sofia Bertolotto, Franco Solazzi, Ricardo Díaz Mourelle, Sergio Boris, Daniel Kargieman, Diego Giorzi, Facundo Espinosa, Matias Gomez","Plot":"The dramatization of a motorcycle road trip Che Guevara went on in his youth that showed him his life's calling. In 1952, twenty-three year old medical student Ernesto Guevara de la Serna - Fuser to his friends and later better known as 'Ernesto Che Guevara' - one semester away from graduation, decides to postpone his last semester to accompany his twenty-nine year old biochemist friend 'Alberto Granado' - Mial to his friends - on his four month, 8,000 km long dream motorcycle trip throughout South America starting from their home in Buenos Aires. Their quest is to see things they've only read about in books about the continent on which they live, and to finish that quest on Alberto's thirtieth birthday on the other side of the continent in the Guajira Peninsula in Venezuela. Not all on this trip goes according to their rough plan due to a broken down motorbike, a continual lack of money (they often stretching the truth to gain the favor of a variety of strangers to help them), arguments between the two in their frequent isolation solely with each other, their raging libidos which sometimes get ... Written by Huggo","Genre":"Adventure, Biography, Drama","Keywords":"travel, motorcycle, friend, che guevara, diary","imdbRating":"7.8","imdbVotes":"81,370","Awards":"Won 1 Oscar. Another 34 wins & 43 nominations.","Metascore":"75","Released":"15 October 2004 (USA) ","Location":"Venezuela ","Actors":"Gael García Bernal, Rodrigo De la Serna, Mía Maestro ","Writer":"Ernesto 'Che' Guevara (book) (as Ernesto Guevara), Alberto Granado (book) | 1 more credit »","Running_time":"PT126M / 2h 6min","Description":"Directed by Walter Salles.  With Gael García Bernal, Rodrigo De la Serna, Mía Maestro, Mercedes Morán. The dramatization of a motorcycle road trip Che Guevara went on in his youth that showed him his life's calling.","Rated":"R"}