{"imdbID":"tt0361748","Title":"Inglourious Basterds","Year":"2009","Writer":"Quentin Tarantino","Taglines":"Once upon a time in Nazi occupied France... ","Country":"USA, Germany","Language":"English, German, French, Italian","Also_Known_As":"Inglorious Bastards ","Budget":"$75,000,000 (estimated)","Opening_Weekend":"£3,596,415 (UK) (21 August 2009)","Gross":"$120,523,073 (USA) (11 December 2009)","Production_Co":"Universal Pictures, Weinstein Company, The, A Band Apart ","":"Show detailed company contact information on IMDbPro »","Runtime":"153 min","Sound_Mix":"SDDS | Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"According to Eddie Murphy, he was in talks with Quentin Tarantino for a role in the film. See more »","Goofs":"When the British soldier Lt. Archie Hicox is introduced to his superiors, he is instructed to \"stand at ease\" which is still a formal position, but Hicox \"stands easy\", which allows him to relax arms and move the feet. See more »","Crazy_Credits":"Both the opening and closing credits change fonts numerous times, displaying typefaces seen in a variety of earlier Tarantino films. See more »","Cast":"Brad Pitt, Mélanie Laurent, Christoph Waltz, Eli Roth, Michael Fassbender, Diane Kruger, Daniel Brühl, Til Schweiger, Gedeon Burkhard, Jacky Ido, B.J. Novak, Omar Doom, August Diehl, Denis Ménochet, Sylvester Groth","Plot":"In Nazi-occupied France during World War II, a plan to assassinate Nazi leaders by a group of Jewish U.S. soldiers coincides with a theatre owner's vengeful plans for the same. In Nazi-occupied France, young Jewish refugee Shosanna Dreyfus witnesses the slaughter of her family by Colonel Hans Landa. Narrowly escaping with her life, she plots her revenge several years later when German war hero Fredrick Zoller takes a rapid interest in her and arranges an illustrious movie premiere at the theater she now runs. With the promise of every major Nazi officer in attendance, the event catches the attention of the \"Basterds\", a group of Jewish-American guerrilla soldiers led by the ruthless Lt. Aldo Raine. As the relentless executioners advance and the conspiring young girl's plans are set in motion, their paths will cross for a fateful evening that will shake the very annals of history. Written by The Massie Twins","Genre":"Adventure, Drama, War","Keywords":"german, france, scalping, nazis, racism","imdbRating":"8.3","imdbVotes":"843,315","Awards":"Won 1 Oscar. Another 117 wins & 143 nominations.","Metascore":"69","Released":"21 August 2009 (USA) ","Location":"Brasserie La Renaissance, 112 rue Championnet, Paris 18, Paris, France ","Actors":"Brad Pitt, Diane Kruger, Eli Roth ","Director":"Quentin Tarantino, Eli Roth (uncredited)","Running_time":"PT153M / 2h 33min","Description":"Directed by Quentin Tarantino, Eli Roth.  With Brad Pitt, Diane Kruger, Eli Roth, Mélanie Laurent. In Nazi-occupied France during World War II, a plan to assassinate Nazi leaders by a group of Jewish U.S. soldiers coincides with a theatre owner's vengeful plans for the same.","Rated":"R"}