{"imdbID":"tt0396171","Title":"Perfume: The Story of a Murderer","Year":"2006","Director":"Tom Tykwer","Taglines":"Obsession can cause the unthinkable. ","Country":"Germany, France, Spain, USA","Language":"English","Also_Known_As":"El perfume ","Budget":"€50,000,000 (estimated)","Opening_Weekend":"£485,200 (UK) (29 December 2006)","Gross":"$2,208,939 (USA) (23 February 2007)","Production_Co":"Constantin Film Produktion, VIP 4 Medienfonds, Nouvelles Éditions de Films (NEF) ","Runtime":"147 min","Sound_Mix":"Dolby Digital | DTS | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Other directors interested in making this film were Martin Scorsese, Milos Forman and Stanley Kubrick. In 1990 Roman Polanski gave an interview in which he said producer Claude Berri wanted him to direct. See more »","Goofs":"The method of enfleurage that Grenouille is first seen practicing is called cold enfleurage - placing live botanicals in a layer of lard or tallow set in a frame. However, this method of enfleurage was not developed until the 1800's. The movie is set in the mid 1700's. See more »","Cast":"Ben Whishaw, Francesc Albiol, Gonzalo Cunill, Roger Salvany, Andrés Herrera, Simon Chandler, David Calder, Richard Felix, Birgit Minichmayr, Reg Wilson, Catherine Boisgontier, Núria Casas, Carlos Gramaje, Sian Thomas, Michael Smiley","Plot":"Jean-Baptiste Grenouille, born with a superior olfactory sense, creates the world's finest perfume. His work, however, takes a dark turn as he searches for the ultimate scent. Jean-Baptiste Grenouille came into the world unwanted, expected to die, yet born with an unnerving sense of smell that created alienation as well as talent. Of all the smells around him, Grenouille is beckoned to the scent of a woman's soul, and spends the rest of his life attempting to smell her essence again by becoming a perfumer, and creating the essence of an innocence lost.","Genre":"Crime, Drama, Fantasy","Keywords":"18th century, smell, scent, perfume, sense of smell","imdbRating":"7.5","imdbVotes":"185,823","Awards":"15 wins & 17 nominations.","Metascore":"56","Released":"5 January 2007 (USA) ","Location":"Barcelona, Catalonia ","Actors":"Ben Whishaw, Dustin Hoffman, Alan Rickman ","Writer":"Andrew Birkin (screenplay), Bernd Eichinger (screenplay) | 2 more credits »","Running_time":"PT147M / 2h 27min","Description":"Directed by Tom Tykwer.  With Ben Whishaw, Dustin Hoffman, Alan Rickman, Francesc Albiol. Jean-Baptiste Grenouille, born with a superior olfactory sense, creates the world's finest perfume. His work, however, takes a dark turn as he searches for the ultimate scent.","Rated":"R"}