{"imdbID":"tt0395972","Title":"North Country","Year":"2005","Director":"Niki Caro","Country":"USA","Language":"English","Budget":"$35,000,000 (estimated)","Gross":"$502,980 (South Africa) (3 March 2006)","Production_Co":"Warner Bros., Industry Entertainment, Participant Media ","Runtime":"126 min","Cast":"Charlize Theron, Thomas Curtis, Elle Peterson, Frances McDormand, Sean Bean, Woody Harrelson, Jeremy Renner, Richard Jenkins, Sissy Spacek, James Cada, Rusty Schwimmer, Linda Emond, Michelle Monaghan, Brad William Henke, Jillian Armenante","Plot":"A fictionalized account of the first major successful sexual harassment case in the United States -- Jenson vs. Eveleth Mines, where a woman who endured a range of abuse while working as a miner filed and won the landmark 1984 lawsuit. 1989. Josey Aimes takes her two kids, Sammy and Karen, and leaves her abusive husband Wayne, to return to her northern Minnesota home town. On a chance meeting with her old friend Glory Dodge who works as a driver and union rep at the mine operated by Pearson Taconite and Steel, Josey decides to work at the mine as well, work that is dominated by men in number and in tone. She does so to be able to stand on her own two feet for the first time in her life, something she probably could not have done if she remained in a job washing hair at a beauty salon. Working at the mine does not sit well with her father, Hank Aimes, who also works at the mine and who, like the other male workers, believes she is taking a job away from a man. Hank has believed that all Josey's problems are of her own doing, ever since she, unmarried, had Sammy while she was still in high school. Josey has always stated that she does not know who Sammy's biological father is, which fosters Hank's attitude about her. ... Written by Huggo","Genre":"Drama","Keywords":"lawsuit, sexual harassment, innocence, based on true story, mine","imdbRating":"7.3","imdbVotes":"32,039","Awards":"Nominated for 2 Oscars. Another 6 wins & 17 nominations.","Metascore":"68","Released":"21 October 2005 (USA) ","Location":"Chisholm, Minnesota, USA ","Actors":"Charlize Theron, Jeremy Renner, Frances McDormand ","Writer":"Michael Seitzman (screenplay), Clara Bingham (book) | 1 more credit »","Running_time":"PT126M / 2h 6min","Description":"Directed by Niki Caro.  With Charlize Theron, Jeremy Renner, Frances McDormand, Thomas Curtis. A fictionalized account of the first major successful sexual harassment case in the United States -- Jenson vs. Eveleth Mines, where a woman who endured a range of abuse while working as a miner filed and won the landmark 1984 lawsuit.","Rated":"R"}