{"imdbID":"tt0317705","Title":"The Incredibles","Year":"2004","Director":"Brad Bird","Writer":"Brad Bird","Taglines":"Do hero, ek awaaz!! (Hindi-language version) ","Country":"USA","Language":"English, French","Also_Known_As":"The Fantastics ","Budget":"$92,000,000 (estimated)","Opening_Weekend":"$70,467,623 (USA) (5 November 2004)","Gross":"$261,437,578 (USA) (8 April 2005)","Production_Co":"Walt Disney Pictures, Pixar Animation Studios ","Runtime":"115 min","Sound_Mix":"DTS-ES | Dolby Digital EX | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Frank Thomas and Ollie Johnston, two of Walt Disney's Nine Old Men (his team of nine supervising master animators from the classic era of animation), provide voices for their own caricatures near the end of the film. They also appeared in and provided the voices for the train engineers in The Iron Giant (1999), which was also directed by Brad Bird. This is not the first time Pixar Animation Studios has included references to famous animators in its films (see the trivia for Monsters, Inc. (2001)). See more »","Goofs":"As the defeated robot topples into the water, the wall of ice is not visible in the wide shot, but appears a second later when the scene is viewed from above. See more »","Crazy_Credits":"The credits are shown interacting with the film's characters and in stylized renditions of the film's key scenes. See more »","Cast":"Craig T. Nelson, Holly Hunter, Samuel L. Jackson, Jason Lee, Dominique Louis, Teddy Newton, Jean Sincere, Eli Fucile, Maeve Andrews, Wallace Shawn, Spencer Fox, Lou Romano, Wayne Canney, Sarah Vowell, Michael Bird","Plot":"A family of undercover superheroes, while trying to live the quiet suburban life, are forced into action to save the world. Bob Parr (A.K.A. Mr. Incredible), and his wife Helen (A.K.A. Elastigirl), are the world's greatest famous crime-fighting superheroes in Metroville. Always saving lives and battling evil on a daily basis. But fifteen years later, they have been forced to adopt civilian identities and retreat to the suburbs where they have no choice but to retire as superheroes to live a \"normal life\" with their three children Violet, Dash and Jack-Jack (who were secretly born with superpowers). Itching to get back into action, Bob gets his chance when a mysterious communication summons him to a remote island for a top secret assignment. He soon discovers that it will take a super family effort to rescue the world from total destruction. Written by Anthony Pereyra {hypersonic91@yahoo.com}","Genre":"Animation, Action, Adventure","Keywords":"lawsuit, secret, superhero, hero, island","imdbRating":"8.0","imdbVotes":"458,815","Awards":"Won 2 Oscars. Another 59 wins & 52 nominations.","Metascore":"90","Released":"5 November 2004 (USA) ","Location":"Pixar Animation Studios - 1200 Park Avenue, Emeryville, California, USA ","Actors":"Craig T. Nelson, Samuel L. Jackson, Holly Hunter ","Running_time":"PT115M / 1h 55min","Description":"Directed by Brad Bird.  With Craig T. Nelson, Samuel L. Jackson, Holly Hunter, Jason Lee. A family of undercover superheroes, while trying to live the quiet suburban life, are forced into action to save the world.","Rated":"PG"}