{"imdbID":"tt0329575","Title":"Seabiscuit","Year":"2003","Director":"Gary Ross","Country":"USA","Language":"English","Budget":"$87,000,000 (estimated)","Gross":"$4,439,434 (Japan) (27 February 2004)","Production_Co":"Universal Pictures, DreamWorks SKG, Spyglass Entertainment ","Runtime":"140 min","Cast":"David McCullough, Jeff Bridges, Paul Vincent O'Connor, Chris Cooper, Michael Ensign, James Keane, Valerie Mahaffey, David Doty, Carl M. Craig, Michael O'Neill, Annie Corley, Michael Angarano, Cameron Bowen, Noah Luke, Mariah Bess","Plot":"True story of the undersized Depression-era racehorse whose victories lifted not only the spirits of the team behind it but also those of their nation. It's the Depression, and everyone needs to hold onto a dream to get them through the bad times. Car maker Charles Howard is no different, he who is trying to rebuild his life after the tragic death of his only child and the resulting end of his first marriage. With second wife Marcela at his side, Charles wants to get into horse racing and ends up with a team of underdogs who are also chasing their own dream. The first is trainer Tom Smith, who has a natural instinct to spot the capabilities of horses. The second is the horse Tom chooses for Charles, Seabiscuit, an unconventional choice as despite his pedigreed lineage, Seabiscuit is small at fifteen and a half hands tall with a slight limp. But Tom can see something in Seabiscuit's nature to make him a winner, if only Seabiscuit can be retrained from his inbred losing ways. And third is the jockey they decide to hire, Johnny \"Red\" Pollard, so nicknamed because of his hair color. Like Tom, Red has always shown a natural way with ... Written by Huggo","Genre":"Drama, History, Sport","Keywords":"seabiscuit, horse, jockey, horse racing, limp","imdbRating":"7.3","imdbVotes":"56,679","Awards":"Nominated for 7 Oscars. Another 6 wins & 34 nominations.","Metascore":"72","Released":"25 July 2003 (USA) ","Location":"New York City, New York, USA ","Actors":"Tobey Maguire, Jeff Bridges, Elizabeth Banks ","Writer":"Laura Hillenbrand (book), Gary Ross (screenplay)","Running_time":"PT140M / 2h 20min","Description":"Directed by Gary Ross.  With Tobey Maguire, Jeff Bridges, Elizabeth Banks, Chris Cooper. True story of the undersized Depression-era racehorse whose victories lifted not only the spirits of the team behind it but also those of their nation.","Rated":"PG-13"}