{"imdbID":"tt0361862","Title":"The Machinist","Year":"2004","Director":"Brad Anderson","Writer":"Scott Kosar","Taglines":"How do you wake up from a nightmare, if you're not asleep? ","Country":"Spain, USA","Language":"English, Spanish","Also_Known_As":"El maquinista ","Budget":"$5,000,000 (estimated)","Opening_Weekend":"$64,661 (USA) (22 October 2004)","Gross":"$1,082,044 (USA) (25 March 2005)","Production_Co":"Filmax Group, Castelao Producciones, Canal+ España ","Runtime":"101 min | 94 min (TV)","Sound_Mix":"Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Oddly enough, Christian Bale claimed that he actually enjoyed losing so much weight, oftentimes finding himself in a euphoric state due to the extreme condition he subjected himself to. As well he was able to deal with the very hot July and August temperatures in Barcelona much better than the rest of the crew. See more »","Goofs":"In the bathroom of The Boiler Room, Trevor knocks down the right soap dispenser. However, in the next shot it is up again. See more »","Cast":"Christian Bale, Jennifer Jason Leigh, Aitana Sánchez-Gijón, John Sharian, Michael Ironside, Lawrence Gilliard Jr., Reg E. Cathey, Anna Massey, Matthew Romero Moore, Robert Long, Colin Stinton, Craig Stevenson, Ferran Lahoz, Jeremy Xido, Norman Bell","Plot":"An industrial worker who hasn't slept in a year begins to doubt his own sanity. Trevor Reznik is a machinist in a factory. An extreme case of insomnia has led to him not sleeping in a year, and his body withering away to almost nothing. He has an obsessive compulsion to write himself reminder notes and keep track of his dwindling weight, both scribbled on yellow stickies in his apartment. The only person he lets into his life in an emotional sense is Stevie, a prostitute, although he has an infatuation with Maria, a single mother waitress working in an airport diner. His co-workers don't associate with and mistrust him because of not knowing what is going on in his life that has led to his emaciated physical appearance. A workplace incident further alienates him with his coworkers, and in conjunction with some unfamiliar pieces of paper he finds in his apartment, Trevor believes that someone or some people - probably one or some of his coworkers - are out to get him, using a phantom employee named Ivan as their front. As Trevor goes on a search for evidence as to... Written by Huggo","Genre":"Drama, Thriller","Keywords":"insomnia, urban gothic, alienation, paranoia, conscience","imdbRating":"7.7","imdbVotes":"272,936","Awards":"7 wins & 14 nominations.","Metascore":"61","Released":"3 December 2004 (USA) ","Location":"Hospital del Torax. Terrassa. Barcelona, Spain ","Actors":"Christian Bale, Jennifer Jason Leigh, Aitana Sánchez-Gijón ","Running_time":"PT101M / 1h 41min","Description":"Directed by Brad Anderson.  With Christian Bale, Jennifer Jason Leigh, Aitana Sánchez-Gijón, John Sharian. An industrial worker who hasn't slept in a year begins to doubt his own sanity.","Rated":"R"}