{"imdbID":"tt0387131","Title":"The Constant Gardener","Year":"2005","Director":"Fernando Meirelles","Taglines":"Love. At any cost.","Country":"UK, Germany, USA, China","Language":"English, Italian, Swahili, German","Also_Known_As":"El jardinero fiel ","Budget":"£15,000,000 (estimated)","Opening_Weekend":"$10,961,311 (USA) (2 September 2005)","Gross":"$359,387 (South Africa) (20 January 2006)","Production_Co":"Focus Features, UK Film Council, Potboiler Productions ","Runtime":"129 min","Sound_Mix":"DTS (as dts)| Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"\"Huruma\", the play which Tessa Quayle watches in the market place, was directed by Nick Reding who played Crick in the film. It was performed by the Kizingo Arts Troupe. See more »","Goofs":"When Justin's High Commission colleague is putting the tape on the cricket bat handle, he has taped different amounts on in the two shots (front and back) in which it is shown. See more »","Crazy_Credits":"END CREDITS DISCLAIMER: Nobody in this story, and no outfit or corporation, thank God, is based upon an actual person or outfit in the real world. But I can tell you this; as my journey through the pharmaceutical jungle progressed, I came to realize that, by comparison with the reality, my story was as tame as a holiday postcard. --John Le Carré See more »","Cast":"Ralph Fiennes, Rachel Weisz, Hubert Koundé, Danny Huston, Daniele Harford, Packson Ngugi, Damaris Itenyo Agweyu, Bernard Otieno Oduor, Bill Nighy, Keith Pearson, John Sibi-Okumu, Donald Sumpter, Archie Panjabi, Nick Reding, Gerard McSorley","Plot":"A widower is determined to get to the bottom of a potentially explosive secret involving his wife's murder, big business, and corporate corruption. In a remote area of Northern Kenya, activist Tessa Quayle is found brutally murdered. Tessa's companion, a doctor, appears to have fled the scene, and the evidence points to a crime of passion. Members of the British High Commission in Nairobi assume that Tessa's widower, their mild-mannered and unambitious colleague Justin Quayle, will leave the matter to them. They could not be more wrong. Haunted by remorse and jarred by rumors of his late wife's infidelities, Quayle surprises everyone by embarking on a personal odyssey that will take him across three continents. Using his privileged access to diplomatic secrets, he will risk his own life, stopping at nothing to uncover and expose the truth - a conspiracy more far-reaching and deadly than Quayle could ever have imagined. Written by focus features","Genre":"Drama, Mystery, Romance","Keywords":"kenya, doctor, death, diplomat, murder","imdbRating":"7.5","imdbVotes":"108,901","Awards":"Won 1 Oscar. Another 33 wins & 64 nominations.","Metascore":"82","Released":"31 August 2005 (USA) ","Location":"Berlin Hauptbahnhof, Berlin, Germany ","Actors":"Ralph Fiennes, Rachel Weisz, Hubert Koundé ","Writer":"Jeffrey Caine (screenplay), John le Carré (based on the novel by)","Running_time":"PT129M / 2h 9min","Description":"Directed by Fernando Meirelles.  With Ralph Fiennes, Rachel Weisz, Hubert Koundé, Danny Huston. A widower is determined to get to the bottom of a potentially explosive secret involving his wife's murder, big business, and corporate corruption.","Rated":"R"}