{"imdbID":"tt0335266","Title":"Lost in Translation","Year":"2003","Director":"Sofia Coppola","Writer":"Sofia Coppola","Country":"USA, Japan","Language":"English, Japanese, German, French","Budget":"$4,000,000 (estimated)","Gross":"£9,865,162 (UK) (26 March 2004)","Production_Co":"Focus Features, Tohokushinsha Film Corporation (TFC), American Zoetrope ","Runtime":"101 min","Cast":"Scarlett Johansson, Bill Murray, Akiko Takeshita, Kazuyoshi Minamimagoe, Kazuko Shibata, Take, Ryuichiro Baba, Akira Yamaguchi, Catherine Lambert, François du Bois, Tim Leffman, Gregory Pekar, Richard Allen, Giovanni Ribisi, Diamond Yukai","Plot":"A faded movie star and a neglected young woman form an unlikely bond after crossing paths in Tokyo. Middle-aged American movie star Bob Harris is in Tokyo to film a personal endorsement Suntory whiskey ad solely for the Japanese market. He is past his movie star prime, but his name and image still have enough cachet for him to have gotten this lucrative $2 million job. He has an unsatisfying home life where his wife Lydia follows him wherever he goes - in the form of messages and faxes - for him to deal with the minutiae of their everyday lives, while she stays at home to look after their kids. Staying at the same upscale hotel is fellow American, twenty-something recent Yale Philosophy graduate Charlotte, her husband John, an entertainment still photographer, who is on assignment in Japan. As such, she is largely left to her own devices in the city, especially when his job takes him out of Tokyo. Both Bob and Charlotte are feeling lost by their current situations, which are not helped by the cultural barriers they feel in Tokyo, those cultural barriers extending far beyond just not... Written by Huggo","Genre":"Drama, Romance","Keywords":"unlikely friendship, older man younger woman relationship, loneliness, fish out of water, photographer","imdbRating":"7.8","imdbVotes":"312,548","Awards":"Won 1 Oscar. Another 92 wins & 105 nominations.","Metascore":"89","Released":"3 October 2003 (USA) ","Location":"Omote-Sando, Tokyo, Japan ","Actors":"Bill Murray, Scarlett Johansson, Giovanni Ribisi ","Running_time":"PT101M / 1h 41min","Description":"Directed by Sofia Coppola.  With Bill Murray, Scarlett Johansson, Giovanni Ribisi, Anna Faris. A faded movie star and a neglected young woman form an unlikely bond after crossing paths in Tokyo.","Rated":"R"}