{"imdbID":"tt0358273","Title":"Walk the Line","Year":"2005","Director":"James Mangold","Country":"USA, Germany","Language":"English, Russian","Budget":"$28,000,000 (estimated)","Gross":"$119,518,352 (USA) (28 April 2006)","Production_Co":"Fox 2000 Pictures, Tree Line Film, Konrad Pictures ","Runtime":"136 min | 153 min (extended cut)","Cast":"Joaquin Phoenix, Reese Witherspoon, Ginnifer Goodwin, Robert Patrick, Dallas Roberts, Dan John Miller, Larry Bagby, Shelby Lynne, Tyler Hilton, Waylon Payne, Shooter Jennings, Sandra Ellis Lafferty, Dan Beene, Clay Steakley, Johnathan Rice","Plot":"A chronicle of country music legend Johnny Cash's life, from his early days on an Arkansas cotton farm to his rise to fame with Sun Records in Memphis, where he recorded alongside Elvis Presley, Jerry Lee Lewis, and Carl Perkins. While growing up in the Great Depression era, Johnny Cash takes an interest in music and eventually moves out of his Arkansas town to join the air force in Germany. While there, he buys his first guitar and writes his own music, and proposes to Vivian. When they got married, they settled in Tennessee and with a daughter, he supported the family by being a salesman. He discovers a man who can pursue his dreams and ends up getting a record with the boys. Shortly after that, he was on a short tour, promoting his songs, and meets the already famous and beautiful June Carter. Then as they get on the long-term tours with June, the boys, and Jerry Lee Lewis, they have this unspoken relationship that grows. But when June leaves the tour because of his behavior, he was a drug addict. His marriage was also falling apart, and when he sees June years later at an awards show, he forces June to tour with them again, promising June to support her two kids and herself. While the tour goes on, the ... Written by kayleigh","Genre":"Biography, Drama, Music","Keywords":"prison, concert, guitar, 1960s, accident","imdbRating":"7.9","imdbVotes":"184,745","Awards":"Won 1 Oscar. Another 44 wins & 41 nominations.","Metascore":"72","Released":"18 November 2005 (USA) ","Location":"Arkansas, USA ","Actors":"Joaquin Phoenix, Reese Witherspoon, Ginnifer Goodwin ","Writer":"Johnny Cash (book), Johnny Cash (book) | 2 more credits »","Running_time":"PT136M / 2h 16min","Description":"Directed by James Mangold.  With Joaquin Phoenix, Reese Witherspoon, Ginnifer Goodwin, Robert Patrick. A chronicle of country music legend Johnny Cash's life, from his early days on an Arkansas cotton farm to his rise to fame with Sun Records in Memphis, where he recorded alongside Elvis Presley, Jerry Lee Lewis, and Carl Perkins.","Rated":"PG-13"}