{"imdbID":"tt0364569","Title":"Oldeuboi","Year":"2003","Director":"Chan-wook Park","Taglines":"Imprisoned for 15 years... ...5 days to seek revenge ","Country":"South Korea","Language":"Korean","Also_Known_As":"Oldboy ","Budget":"$3,000,000 (estimated)","Opening_Weekend":"$44,465 (Hong Kong) (15 October 2004)","Gross":"$2,181,290 (USA) (20 December 2013)","Production_Co":"Egg Films, Show East ","":"Show detailed company contact information on IMDbPro »","Runtime":"120 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The restaurant that Mido works in is called \"Mediterranean\", which is the name of the restaurant in real life, but the director originally intended for it to be called \"Akira\" - not as a reference to the popular Manga, but to the Japanese director Akira Kurosawa. See more »","Goofs":"Despite having been imprisoned and isolated from the outside world for 15 years, Oh Dae-Su is shown to be familiar with the operation of a modern cell phone, something that would have been very rare (and completely different from the flip-top handset Dae-Su has) in South Korea when he was imprisoned in the late 80s. However, Dae-Su watched television for 15 years and it is highly likely that at some point he saw a modern cell phone being used. See more »","Cast":"Min-sik Choi, Ji-tae Yu, Hye-jeong Kang, Dae-han Ji, Dal-su Oh, Byeong-ok Kim, Seung-shin Lee, Jin-seo Yoon, Dae-yeon Lee, Kwang-rok Oh, Tae-kyung Oh, Yeon-suk Ahn, Il-han Oo, Su-hyeon Kim, Seung-jin Lee","Plot":"After being kidnapped and imprisoned for 15 years, Oh Dae-Su is released, only to find that he must find his captor in 5 days. An average man is kidnapped and imprisoned in a shabby cell for 15 years without explanation. He then is released, equipped with money, a cellphone and expensive clothes. As he strives to explain his imprisonment and get his revenge, Oh Dae-Su soon finds out that his kidnapper has a greater plan for him and is set onto a path of pain and suffering in an attempt to uncover the motive of his mysterious tormentor. Written by Jacksrevenge","Genre":"Drama, Mystery, Thriller","Keywords":"imprisonment, revenge, love, hypnosis, brother sister relationship","imdbRating":"8.4","imdbVotes":"340,399","Awards":"24 wins & 14 nominations.","Metascore":"74","Released":"21 November 2003 (South Korea) ","Location":"Songgye High School, Chinju, Kyongsangnam-Do, South Korea ","Actors":"Min-sik Choi, Ji-tae Yu, Hye-jeong Kang ","Writer":"Garon Tsuchiya (story), Nobuaki Minegishi (comic) | 4 more credits »","Running_time":"PT120M / 2h","Description":"Directed by Chan-wook Park.  With Min-sik Choi, Ji-tae Yu, Hye-jeong Kang, Dae-han Ji. After being kidnapped and imprisoned for 15 years, Oh Dae-Su is released, only to find that he must find his captor in 5 days.","Rated":"R"}