{"imdbID":"tt0376968","Title":"The Return","Year":"2003","Director":"Andrey Zvyagintsev","Certificate":"Unrated | See all certifications »","Country":"Russia","Language":"Russian","Also_Known_As":"The Return ","Opening_Weekend":"$19,795 (USA) (6 February 2004)","Gross":"£277,457 (UK) (19 January 2007)","Production_Co":"Ren Film ","Runtime":"105 min | 99 min (TV)","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Andrey Zvyagintsev's first feature as a director (he previously made 2 episodes of Chyornaya komnata (2000)). See more »","Goofs":"When Ivan is sitting in the car, the camera pans around the car (before we see him grab the binoculars and begin to use them) - as it pans past the triangular car window you can see the camera reflected in it. See more »","Crazy_Credits":"During the end credits, there are still photos. See more »","Cast":"Vladimir Garin, Ivan Dobronravov, Konstantin Lavronenko, Nataliya Vdovina, Galina Popova, Aleksey Suknovalov, Lazar Dubovik, Elizaveta Aleksandrova, Lyubov Kazakova, Andrey Sumin, Aleksey Proshchikin, Viktor Alenin, Stas Orlov, Arseniy Belousov, Sofya Bagdasarova","Plot":"In the Russian wilderness, two brothers face a range of new, conflicting emotions when their father - a man they know only through a single photograph - resurfaces. Two teenage Russian boys have their father return home suddenly after being absent for 12 years. The father takes the boys on a holiday to a remote island on a lake in the north of Russia that turns into a test of manhood of almost mythic proportions. Written by Sujit R. Varma","Genre":"Drama, Mystery, Thriller","Keywords":"boy, russian, wilderness, photograph, return","imdbRating":"8.0","imdbVotes":"30,802","Awards":"Nominated for 1 Golden Globe. Another 28 wins & 13 nominations.","Metascore":"82","Released":"25 June 2003 (Russia) ","Location":"Russia ","Actors":"Vladimir Garin, Ivan Dobronravov, Konstantin Lavronenko ","Writer":"Vladimir Moiseenko, Aleksandr Novototskiy-Vlasov (as Aleksandr Novototskiy)","Running_time":"PT105M / 1h 45min","Description":"Directed by Andrey Zvyagintsev.  With Vladimir Garin, Ivan Dobronravov, Konstantin Lavronenko, Nataliya Vdovina. In the Russian wilderness, two brothers face a range of new, conflicting emotions when their father - a man they know only through a single photograph - resurfaces.","Rated":"UNRATED"}