{"imdbID":"tt0347048","Title":"Head-On","Year":"2004","Director":"Fatih Akin","Writer":"Fatih Akin (book)","Country":"Germany, Turkey","Language":"German, Turkish, English","Also_Known_As":"Head-On ","Production_Co":"Arte, Bavaria Film International, Corazón International ","Runtime":"121 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"During filming, Birol Ünel was told by his doctor that he had to quit drinking alcohol, otherwise he could die. This accounts for Ünel's weight loss in the latter part of the film, though giving up the booze made him so ill at one point that filming had to be suspended. See more »","Goofs":"The psychiatrist at the beginning of the film tells Cahit about a song by the band The The containing the line \"If you can't change the world, change your world\". The actual quote (from the song \"Lonely Planet\", included in the album \"Dusk\") is \"If you can't change the world, change yourself\". See more »","Crazy_Credits":"When it comes to Special Thanks, there's a name: Arsen Lüpen. Arsène Lupin is a fictional character, created by the French writer Maurice Leblanc. See more »","Cast":"Birol Ünel, Güven Kiraç, Zarah Jane McKenzie, Stefan Gebelhoff, Catrin Striebeck, Francesco Fiannaca, Mona Mur, Sibel Kekilli, Ralph Misske, Philipp Baltus, Hermann Lause, Karin Niwiger, Demir Gökgöl, Cem Akin, Aysel Iscan","Plot":"In 'Gegen die Wand' Cahit, a 40-something male from Mersin in Turkey has removed everything Turkish from his life. He has become an alcoholic drug addict and at the start of the movie wants... See full summary » In 'Gegen die Wand' Cahit, a 40-something male from Mersin in Turkey has removed everything Turkish from his life. He has become an alcoholic drug addict and at the start of the movie wants to end it all. Sibel a 20-something female from Hamburg wishes to please her Turkish parents yet yearns for freedom. She has had her nose broken by her brother for being seen holding hands with a boy and yet she can not break her mother's heart and run away. She too attempts suicide and she first approaches Cahit there at the Hospital. Sibel asks Cahit to marry her, as she believes this to be the way out of her parent's house. She promises Cahit that their relationship will be like roommates, not like a married couple. The film follows Sibel and Cahit as they get married, become closer and eventually fall in love. Written by Serena P.","Genre":"Drama, Romance","Keywords":"turkish, roommate, love, hospital, alcoholic","imdbRating":"8.0","imdbVotes":"40,184","Awards":"25 wins & 13 nominations.","Metascore":"78","Released":"11 March 2004 (Germany) ","Location":"Fabrik, Altona, Hamburg, Germany ","Actors":"Birol Ünel, Sibel Kekilli, Güven Kiraç ","Running_time":"PT121M / 2h 1min","Description":"Directed by Fatih Akin.  With Birol Ünel, Sibel Kekilli, Güven Kiraç, Zarah Jane McKenzie. In 'Gegen die Wand' Cahit, a 40-something male from Mersin in Turkey has removed everything Turkish from his life. He has become an alcoholic drug addict and at the start of the movie wants to end it all. Sibel a 20-something female from Hamburg wishes to please her Turkish parents yet yearns for freedom. She has had her nose broken by her brother for being seen holding hands with a boy and yet ...","Rated":"R"}