{"imdbID":"tt0327137","Title":"Secondhand Lions","Year":"2003","Director":"Tim McCanlies","Writer":"Tim McCanlies","Country":"USA","Language":"English","Also_Known_As":"Afrikas hemligheter ","Budget":"$30,000,000 (estimated)","Opening_Weekend":"$12,139,832 (USA) (19 September 2003)","Gross":"$521,208 (Japan) (16 July 2004)","Production_Co":"New Line Cinema, David Kirschner Productions, Digital Domain ","Runtime":"111 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Deleted scenes (included on the DVD release) include actor Bo Brinkman. See more »","Goofs":"When Stan and Walter are talking about the money on the front porch, he puts his hand on his shoulder twice. See more »","Crazy_Credits":"During the end credits, the adult Walter's cartoons depict a variety of adventures. See more »","Cast":"Michael Caine, Robert Duvall, Haley Joel Osment, Kyra Sedgwick, Nicky Katt, Josh Lucas, Michael O'Neill, Deirdre O'Connell, Eric Balfour, Christian Kane, Kevin Haberer, Emmanuelle Vaugier, Adam Ozturk, Jennifer Stone, Mitchel Musso","Plot":"A coming-of-age story about a shy, young boy sent by his irresponsible mother to spend the summer with his wealthy, eccentric uncles in Texas. A boy named Walter is dropped by his mother Mae at his great-uncles' house. Later,Walter will find out his great-uncles' big secret. And rumors say that Hub & Garth, Walter's great uncles, have stolen much gold & money. (some say they stole it from Al Capone) Did they really steal that money or not? Written by Christina ^_^","Genre":"Comedy, Drama, Family","Keywords":"money, texas, veteran, eyeglasses, africa","imdbRating":"7.6","imdbVotes":"42,376","Awards":"5 nominations.","Metascore":"52","Released":"19 September 2003 (USA) ","Location":"Austin, Texas, USA ","Actors":"Haley Joel Osment, Michael Caine, Robert Duvall ","Running_time":"PT109M / 1h 49min","Description":"Directed by Tim McCanlies.  With Haley Joel Osment, Michael Caine, Robert Duvall, Kyra Sedgwick. A coming-of-age story about a shy, young boy sent by his irresponsible mother to spend the summer with his wealthy, eccentric uncles in Texas.","Rated":"PG"}