{"imdbID":"tt0388795","Title":"Brokeback Mountain","Year":"2005","Director":"Ang Lee","Country":"USA, Canada","Language":"English","Budget":"$14,000,000 (estimated)","Gross":"$83,025,853 (USA) (14 April 2006)","Production_Co":"Focus Features, River Road Entertainment, Alberta Film Entertainment ","Runtime":"134 min","Cast":"Heath Ledger, Jake Gyllenhaal, Randy Quaid, Valerie Planche, Dave Trimble, Victor Reyes, Lachlan Mackintosh, Michelle Williams, Larry Reese, Marty Antonini, Tom Carey, Dan McDougall, Don Bland, Steven Cree Molison, Anne Hathaway","Plot":"The story of a forbidden and secretive relationship between two cowboys, and their lives over the years. Two young men, Ennis Del Mar and Jack Twist, meet when they get a job as sheep herders on Brokeback Mountain. They are at first strangers, then they become friends. Throughout the weeks, they grow closer as they learn more about each other. One night, after some heavy drinking, they find a deeper connection. They then indulge in a blissful romance for the rest of the summer. Unable to deal with their feelings for each other, they part ways at the end of the summer. Four years go by, and they each settle down, Ennis in Wyoming with his wife and two girls, and Jack in Texas with his wife and son. Still longing for each other, they meet back up, and are faced with the fact that they need each other. They undeniably need each other, and unsure of what to do, they start a series of \"fishing trips\", in order to spend time together. The relationship struggles on for years until tragedy strikes. Written by maisie stewart","Genre":"Drama, Romance","Keywords":"gay relationship, homosexuality, mountain, ranch, rodeo","imdbRating":"7.7","imdbVotes":"253,131","Awards":"Won 3 Oscars. Another 125 wins & 117 nominations.","Metascore":"87","Released":"13 January 2006 (USA) ","Location":"Calgary, Alberta, Canada ","Actors":"Jake Gyllenhaal, Heath Ledger, Michelle Williams ","Writer":"Annie Proulx (short story), Larry McMurtry (screenplay) | 1 more credit »","Running_time":"PT134M / 2h 14min","Description":"Directed by Ang Lee.  With Jake Gyllenhaal, Heath Ledger, Michelle Williams, Randy Quaid. The story of a forbidden and secretive relationship between two cowboys, and their lives over the years.","Rated":"R"}