{"imdbID":"tt0381849","Title":"3:10 to Yuma","Year":"2007","Director":"James Mangold","Taglines":"Time waits for one man","Country":"USA","Language":"English, Chinese","Also_Known_As":"Three Ten to Yuma ","Budget":"$55,000,000 (estimated)","Opening_Weekend":"$14,035,033 (USA) (7 September 2007)","Gross":"$53,574,088 (USA) (2 November 2007)","Production_Co":"Lionsgate, Tree Line Film, Relativity Media ","Runtime":"122 min","Sound_Mix":"SDDS | Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Originally the marshal and his two deputies merely surrendered their weapons to the outlaws in Contention. Later, the filmmakers were left with the difficult plot point of deciding what their role would be in the rooftop chase. Unable to come to a satisfying answer, they decided to contradict the original script and had them shot dead after they surrendered their guns. See more »","Goofs":"In the shots at the train station you can clearly see all of the land in the background is covered in snow. There's even snow on the tracks. Not only is it evident that it's spring or summer time but there is a drought. Even though Contention is a distance away from Bisbee there would have never been a drought at one town while there's a blizzard at another. See more »","Crazy_Credits":"Russell Crowe's name is not used in the end credits when crediting his assistant, driver, stand-in, dialect coach, costumer, hair stylist and makeup artist; instead, his character's name, Ben Wade, is used. See more »","Cast":"Russell Crowe, Christian Bale, Logan Lerman, Dallas Roberts, Ben Foster, Peter Fonda, Vinessa Shaw, Alan Tudyk, Luce Rains, Gretchen Mol, Lennie Loftin, Rio Alexander, Johnny Whitworth, Shawn Howell, Pat Ricotti","Plot":"A small-time rancher agrees to hold a captured outlaw who's awaiting a train to go to court in Yuma. A battle of wills ensues as the outlaw tries to psych out the rancher. Rancher Dan Evans heads into Bisbee to clear up issues concerning the sale of his land when he witnesses the closing events of a stagecoach robbery led by famed outlaw Ben Wade. Shortly thereafter, Wade is captured by the law in Bisbee and Evans finds himself one of the escorts who will take Wade to the 3:10 to Yuma train in Contention for the reward of $200. Evans's effort to take Wade to the station is in part an effort to save his land but also part of an inner battle to determine whether he can be more than just a naive rancher in the eyes of his impetuous and gunslinging son William Evans. The transport to Contention is hazardous and filled with ambushes by Indians, pursuits by Wade's vengeful gang and Wade's own conniving and surreptitious demeanor that makes the ride all the more intense. Written by commanderblue","Genre":"Adventure, Crime, Drama","Keywords":"outlaw, rancher, small western town, homoeroticism, train","imdbRating":"7.8","imdbVotes":"232,278","Awards":"Nominated for 2 Oscars. Another 3 wins & 30 nominations.","Metascore":"76","Released":"7 September 2007 (USA) ","Location":"Clifton, Arizona, USA ","Actors":"Russell Crowe, Christian Bale, Ben Foster ","Writer":"Halsted Welles (screenplay), Michael Brandt (screenplay) | 2 more credits »","Running_time":"PT122M / 2h 2min","Description":"Directed by James Mangold.  With Russell Crowe, Christian Bale, Ben Foster, Logan Lerman. A small-time rancher agrees to hold a captured outlaw who's awaiting a train to go to court in Yuma. A battle of wills ensues as the outlaw tries to psych out the rancher.","Rated":"R"}