{"imdbID":"tt0379725","Title":"Capote","Year":"2005","Director":"Bennett Miller","Country":"Canada, USA","Language":"English","Budget":"$7,000,000 (estimated)","Gross":"$28,747,570 (USA) (21 April 2006)","Production_Co":"Sony Pictures Classics, A-Line Pictures, Cooper's Town Productions ","Runtime":"114 min | 110 min","Cast":"Allie Mickelson, Kelci Stephenson, Philip Seymour Hoffman, Craig Archibald, Bronwen Coleman, Kate Shindle, David Wilson Barnes, Michael J. Burg, Catherine Keener, Kwesi Ameyaw, Andrew Farago, Ken Krotowich, Chris Cooper, R.D. Reid, Rob McLaughlin","Plot":"In 1959, Truman Capote learns of the murder of a Kansas family and decides to write a book about the case. While researching for his novel In Cold Blood, Capote forms a relationship with one of the killers, Perry Smith, who is on death row. In 1959, Truman Capote, a popular writer for The New Yorker, learns about the horrific and senseless murder of a family of four in Holcomb, Kansas. Inspired by the story material, Capote and his partner, Harper Lee, travel to the town to research for an article. However, as Capote digs deeper into the story, he is inspired to expand the project into what would be his greatest work, In Cold Blood. To that end, he arranges extensive interviews with the prisoners, especially with Perry Smith, a quiet and articulate man with a troubled history. As he works on his book, Capote feels some compassion for Perry which in part prompts him to help the prisoners to some degree. However, that feeling deeply conflicts with his need for closure for his book which only an execution can provide. That conflict and the mixed motives for both interviewer and subject make for a troubling experience that would produce an literary account that would redefine modern non-fiction. Written by Kenneth Chisholm (kchishol@rogers.com)","Genre":"Biography, Crime, Drama","Keywords":"book, truman capote, kansas, killer, holcomb kansas","imdbRating":"7.4","imdbVotes":"97,631","Awards":"Won 1 Oscar. Another 57 wins & 83 nominations.","Metascore":"88","Released":"3 February 2006 (USA) ","Location":"Malibu, California, USA ","Actors":"Philip Seymour Hoffman, Clifton Collins Jr., Catherine Keener ","Writer":"Dan Futterman (screenplay), Gerald Clarke (book)","Running_time":"PT114M / 1h 54min","Description":"Directed by Bennett Miller.  With Philip Seymour Hoffman, Clifton Collins Jr., Catherine Keener, Allie Mickelson. In 1959, Truman Capote learns of the murder of a Kansas family and decides to write a book about the case. While researching for his novel In Cold Blood, Capote forms a relationship with one of the killers, Perry Smith, who is on death row.","Rated":"R"}