{"imdbID":"tt0381061","Title":"Casino Royale","Year":"2006","Director":"Martin Campbell","Taglines":"The new Bond. Living for Love. Dying for Thrills. ","Country":"UK, Czech Republic, USA, Germany, Bahamas","Language":"English, French","Also_Known_As":"Bond Begins ","Budget":"$150,000,000 (estimated)","Opening_Weekend":"£13,370,969 (UK) (17 November 2006)","Gross":"$167,007,184 (USA) (23 February 2007)","Production_Co":"Columbia Pictures, Eon Productions, Casino Royale Productions ","Runtime":"144 min","Sound_Mix":"Dolby Digital | SDDS | DTS","Color":"Black and White (opening sequence)| Color","Aspect_Ratio":"2.35 : 1","Trivia":"The inclusion of the scene at the Body Worlds exhibit means that this is the first Bond movie where actual corpses are shown on screen. See more »","Goofs":"When Dimitrios is trying to win his money back in the first poker game, he symbolically throws his car key into the pod as a symbol that he is betting his car. In the next shot, the keyring pendant lands in the casino chips - but with no keys attached, the keyring is empty. See more »","Crazy_Credits":"The opening MGM and Columbia logos are in black & white to coincide with the pre-title sequence. See more »","Cast":"Daniel Craig, Eva Green, Mads Mikkelsen, Judi Dench, Jeffrey Wright, Giancarlo Giannini, Caterina Murino, Simon Abkarian, Isaach De Bankolé, Jesper Christensen, Ivana Milicevic, Tobias Menzies, Claudio Santamaria, Sebastien Foucan, Malcolm Sinclair","Plot":"Armed with a licence to kill, Secret Agent James Bond sets out on his first mission as 007 and must defeat a weapons dealer in a high stakes game of poker at Casino Royale, but things are not what they seem. James Bond goes on his first ever mission as a 00. Le Chiffre is a banker to the world's terrorists. He is participating in a poker game at Montenegro, where he must win back his money, in order to stay safe among the terrorist market. The boss of MI6, known simply as M sends Bond, along with Vesper Lynd to attend this game and prevent Le Chiffre from winning. Bond, using help from Felix Leiter, Mathis and having Vesper pose as his partner, enters the most important poker game in his already dangerous career. But if Bond defeats Le Chiffre, will he and Vesper Lynd remain safe? Written by simon","Genre":"Action, Adventure, Thriller","Keywords":"free running, james bond, terrorist, money, montenegro","imdbRating":"8.0","imdbVotes":"454,516","Awards":"Won 1 BAFTA Film Award. Another 25 wins & 39 nominations.","Metascore":"80","Released":"17 November 2006 (USA) ","Location":"Palackého Street, Mladá Boleslav, Czech Republic ","Actors":"Daniel Craig, Eva Green, Judi Dench ","Writer":"Neal Purvis (screenplay), Robert Wade (screenplay) | 2 more credits »","Running_time":"PT144M / 2h 24min","Description":"Directed by Martin Campbell.  With Daniel Craig, Eva Green, Judi Dench, Jeffrey Wright. Armed with a licence to kill, Secret Agent James Bond sets out on his first mission as 007 and must defeat a weapons dealer in a high stakes game of poker at Casino Royale, but things are not what they seem.","Rated":"PG-13"}