{"imdbID":"tt0347149","Title":"Howl's Moving Castle","Year":"2004","Director":"Hayao Miyazaki","Country":"Japan","Language":"Japanese","Also_Known_As":"Howl's Moving Castle ","Budget":"$24,200,000 (estimated)","Opening_Weekend":"$3,474,751 (Japan) (19 November 2004)","Gross":"$82,187 (Chile) (2 June 2006)","Production_Co":"Buena Vista Home Entertainment, DENTSU Music And Entertainment, Mitsubishi ","":"Show detailed company contact information on IMDbPro »","Runtime":"119 min","Sound_Mix":"Dolby Digital EX | DTS-ES | SDDS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Hayao Miyazaki: [Flying] Howl flies in a birdlike form and Sophie uses a flying contraption to escape the castle. See more »","Goofs":"When Sophie leaves her bedroom, her dress has turned from green to blue. However, she couldn't have changed dresses because none of them would fit her after she was transformed (wider, much shorter, etc.). See more »","Cast":"Chieko Baishô, Takuya Kimura, Akihiro Miwa, Tatsuya Gashûin, Ryûnosuke Kamiki, Mitsunori Isaki, Yô Ôizumi, Akio Ôtsuka, Daijirô Harada, Haruko Katô, Jean Simmons, Christian Bale, Lauren Bacall, Blythe Danner, Emily Mortimer","Plot":"When an unconfident young woman is cursed with an old body by a spiteful witch, her only chance of breaking the spell lies with a self-indulgent yet insecure young wizard and his companions in his legged, walking castle. A love story between an 18-year-old girl named Sophie, cursed by a witch into an old woman's body, and a magician named Howl. Under the curse, Sophie sets out to seek her fortune, which takes her to Howl's strange moving castle. In the castle, Sophie meets Howl's fire demon, named Karishifâ. Seeing that she is under a curse, the demon makes a deal with Sophie--if she breaks the contract he is under with Howl, then Karushifâ will lift the curse that Sophie is under, and she will return to her 18-year-old shape. Written by Sophie Ball","Genre":"Animation, Adventure, Family","Keywords":"castle, witch, demon, spell, fire","imdbRating":"8.2","imdbVotes":"203,037","Awards":"Nominated for 1 Oscar. Another 16 wins & 17 nominations.","Metascore":"80","Released":"17 June 2005 (USA) ","Actors":"Chieko Baishô, Takuya Kimura, Tatsuya Gashûin ","Writer":"Hayao Miyazaki (screenplay), Diana Wynne Jones (novel) (as Daiana Win Jônzu)","Running_time":"PT119M / 1h 59min","Description":"Directed by Hayao Miyazaki.  With Chieko Baishô, Takuya Kimura, Tatsuya Gashûin, Akihiro Miwa. When an unconfident young woman is cursed with an old body by a spiteful witch, her only chance of breaking the spell lies with a self-indulgent yet insecure young wizard and his companions in his legged, walking castle.","Rated":"PG"}