{"imdbID":"tt0311113","Title":"Master and Commander: The Far Side of the World","Year":"2003","Director":"Peter Weir","Country":"USA","Language":"English, French, Portuguese","Budget":"$150,000,000 (estimated)","Gross":"$93,926,386 (USA) (7 May 2004)","Production_Co":"Twentieth Century Fox Film Corporation, Miramax, Universal Pictures ","Runtime":"138 min","Cast":"Russell Crowe, Paul Bettany, James D'Arcy, Edward Woodall, Chris Larkin, Max Pirkis, Jack Randall, Max Benitz, Lee Ingleby, Richard Pates, Robert Pugh, Richard McCabe, Ian Mercer, Tony Dolan, David Threlfall","Plot":"During the Napoleonic Wars, a brash British captain pushes his ship and crew to their limits in pursuit of a formidable French war vessel around South America. In April 1805 during the Napoleonic Wars, H.M.S. Surprise, a British frigate, is under the command of Captain Jack Aubrey. Aubrey and the Surprise's current orders are to track and capture or destroy a French privateer named Acheron. The Acheron is currently in the Atlantic off South America headed toward the Pacific in order to extend Napoleon's reach of the wars. This task will be a difficult one as Aubrey quickly learns in an initial battle with the Acheron that it is a bigger and faster ship than the Surprise, which puts the Surprise at a disadvantage. Aubrey's single-mindedness in this seemingly impossible pursuit puts him at odds with the Surprise's doctor and naturalist, Stephen Maturin, who is also Aubrey's most trusted advisor on board and closest friend. Facing other internal obstacles which have resulted in what they consider a string of bad luck, Aubrey ultimately uses Maturin's scientific exploits to figure out a way to achieve his and the ship's seemingly impossible goal. Written by Huggo","Genre":"Action, Adventure, Drama","Keywords":"ship, napoleonic wars, naturalist, royal navy, 19th century","imdbRating":"7.4","imdbVotes":"164,606","Awards":"Won 2 Oscars. Another 21 wins & 77 nominations.","Metascore":"81","Released":"14 November 2003 (USA) ","Location":"Fox Baja Studios, Rosarito, Baja California Norte, Mexico ","Actors":"Russell Crowe, Paul Bettany, Billy Boyd ","Writer":"Patrick O'Brian (novels), Peter Weir (screenplay) | 1 more credit »","Running_time":"PT138M / 2h 18min","Description":"Directed by Peter Weir.  With Russell Crowe, Paul Bettany, Billy Boyd, James D'Arcy. During the Napoleonic Wars, a brash British captain pushes his ship and crew to their limits in pursuit of a formidable French war vessel around South America.","Rated":"PG-13"}