{"imdbID":"tt0308644","Title":"Finding Neverland","Year":"2004","Director":"Marc Forster","Country":"USA, UK","Language":"English","Budget":"$25,000,000 (estimated)","Gross":"$51,676,606 (USA) (22 April 2005)","Production_Co":"Miramax, FilmColony ","Runtime":"106 min | 101 min (DVD) (Encore print)","Cast":"Johnny Depp, Kate Winslet, Julie Christie, Radha Mitchell, Dustin Hoffman, Freddie Highmore, Joe Prospero, Nick Roud, Luke Spill, Ian Hart, Kelly Macdonald, Mackenzie Crook, Eileen Essell, Jimmy Gardner, Oliver Fox","Plot":"The story of J.M. Barrie's friendship with a family who inspired him to create Peter Pan. 1903 London. Renowned playwright J.M. Barrie (James)'s latest effort has garnered less than positive reviews, something he knew would be the case even before the play's mounting. This failure places pressure on James to write another play quickly as impresario Charles Frohman needs another to replace the failure to keep his theater viable. Out for a walk with his dog in part to let his creative juices flow, James stumbles upon the Llewelyn Davies family: recently widowed Sylvia Llewelyn Davies (the daughter of now deceased author George L. Du Maurier) and her four adolescent sons. James and the family members become friends, largely based on he and the boys being able to foster in each other the imagination of children, James just being the biggest among them in this regard. Sylvia also welcomes James into their lives, he who becomes an important and integral part of it. Among the six of them, the only one who does not want to partake is Sylvia's third, Peter Llewelyn Davies, who is ... Written by Huggo","Genre":"Biography, Drama, Family","Keywords":"stage play, reference to peter pan, boy, inspiration, widow","imdbRating":"7.8","imdbVotes":"171,706","Awards":"Won 1 Oscar. Another 20 wins & 74 nominations.","Metascore":"67","Released":"17 December 2004 (USA) ","Location":"London, England, UK ","Actors":"Johnny Depp, Kate Winslet, Julie Christie ","Writer":"Allan Knee (play), David Magee (screenplay)","Running_time":"PT106M / 1h 46min","Description":"Directed by Marc Forster.  With Johnny Depp, Kate Winslet, Julie Christie, Radha Mitchell. The story of J.M. Barrie's friendship with a family who inspired him to create Peter Pan.","Rated":"PG"}