{"imdbID":"tt0325980","Title":"Pirates of the Caribbean: The Curse of the Black Pearl","Year":"2003","Director":"Gore Verbinski","Taglines":"Prepare to be blown out of the water. ","Country":"USA","Language":"English","Also_Known_As":"P.O.T.C. ","Budget":"$140,000,000 (estimated)","Opening_Weekend":"$46,630,690 (USA) (11 July 2003)","Gross":"$305,388,685 (USA) (26 December 2003)","Production_Co":"Walt Disney Pictures, Jerry Bruckheimer Films ","":"Show detailed company contact information on IMDbPro »","Runtime":"143 min","Sound_Mix":"Dolby Digital EX | SDDS | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"British metal band Bring Me The Horizon got their band name from one of the last lines in the film \"bring me that horizon\" See more »","Goofs":"When Elizabeth first meets Will and looks at his medallion, it is on a string around his neck, but when she turns to look at Norrington, the string is gone. See more »","Crazy_Credits":"The Walt Disney logo at the end is golden. See more »","Cast":"Johnny Depp, Geoffrey Rush, Orlando Bloom, Keira Knightley, Jack Davenport, Jonathan Pryce, Lee Arenberg, Mackenzie Crook, Damian O'Hare, Giles New, Angus Barnett, David Bailie, Michael Berry Jr., Isaac C. Singleton Jr., Kevin McNally","Plot":"Blacksmith Will Turner teams up with eccentric pirate \"Captain\" Jack Sparrow to save his love, the governor's daughter, from Jack's former pirate allies, who are now undead. This swash-buckling tale follows the quest of Captain Jack Sparrow, a savvy pirate, and Will Turner, a resourceful blacksmith, as they search for Elizabeth Swann. Elizabeth, the daughter of the governor and the love of Will's life, has been kidnapped by the feared Captain Barbossa. Little do they know, but the fierce and clever Barbossa has been cursed. He, along with his large crew, are under an ancient curse, doomed for eternity to neither live, nor die. That is, unless a blood sacrifice is made. Written by the lexster","Genre":"Action, Adventure, Fantasy","Keywords":"pirate, governor, curse, caribbean, undead","imdbRating":"8.1","imdbVotes":"778,972","Awards":"Nominated for 5 Oscars. Another 31 wins & 82 nominations.","Metascore":"63","Released":"9 July 2003 (USA) ","Location":"Bequia, St Vincent and the Grenadines ","Actors":"Johnny Depp, Geoffrey Rush, Orlando Bloom ","Writer":"Ted Elliott (screen story), Terry Rossio (screen story) | 4 more credits »","Running_time":"PT143M / 2h 23min","Description":"Directed by Gore Verbinski.  With Johnny Depp, Geoffrey Rush, Orlando Bloom, Keira Knightley. Blacksmith Will Turner teams up with eccentric pirate \"Captain\" Jack Sparrow to save his love, the governor's daughter, from Jack's former pirate allies, who are now undead.","Rated":"PG-13"}