{"imdbID":"tt0395169","Title":"Hotel Rwanda","Year":"2004","Director":"Terry George","Taglines":"A true story of a man who fought impossible odds to save everyone he could and created a place where hope survived. ","Country":"UK, USA, Italy, South Africa, Canada","Language":"English, French","Also_Known_As":"Hotel Ruanda ","Budget":"$17,500,000 (estimated)","Opening_Weekend":"$100,091 (USA) (24 December 2004)","Gross":"$77,125 (South Africa) (17 June 2005)","Production_Co":"United Artists, Lions Gate Films, Industrial Development Corporation of South Africa ","":"Show detailed company contact information on IMDbPro »","Runtime":"121 min","Sound_Mix":"DTS | Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Director Terry George had Don Cheadle in mind for the lead part from the beginning of his involvement. During pre-production, potential investors and interested studios wanted Denzel Washington, Wesley Snipes, Mekhi Phifer and even Will Smith because of their suggested bigger drawing capacity at the box office. But due to ultimately producing the film independently and coming up with the money himself, George was able to go back to his original choice. See more »","Goofs":"When Paul Rusesabagina is brought to the Hotel Diplomat (about 25-minutes into the film) to take the keys out of the safe, he also takes a stack of $100 USD bills with a post-1996 design. See more »","Crazy_Credits":"Part of the profits from this film shall go to The Rwandese Survivors Fund. See more »","Cast":"Xolani Mali, Don Cheadle, Desmond Dube, Hakeem Kae-Kazim, Tony Kgoroge, Rosie Motene, Neil McCarthy, Mabutho 'Kid' Sithole, Nick Nolte, Fana Mokoena, Jeremiah Ndlovu, Sophie Okonedo, Lebo Mashile, Antonio David Lyons, Leleti Khumalo","Plot":"The true story of Paul Rusesabagina, a hotel manager who housed over a thousand Tutsi refugees during their struggle against the Hutu militia in Rwanda. During the 1990s, some of the worst atrocities in the history of mankind took place in the country of Rwanda--and in an era of high-speed communication and round the clock news, the events went almost unnoticed by the rest of the world. In only three months, one million people were brutally murdered. In the face of these unspeakable actions, inspired by his love for his family, an ordinary man summons extraordinary courage to save the lives of over a thousand helpless refugees, by granting them shelter in the hotel he manages. Written by Sujit R. Varma","Genre":"Drama, History, War","Keywords":"refugee, hotel, tutsi, hutu, love","imdbRating":"8.1","imdbVotes":"255,520","Awards":"Nominated for 3 Oscars. Another 16 wins & 42 nominations.","Metascore":"79","Released":"4 February 2005 (USA) ","Location":"Rwanda ","Actors":"Don Cheadle, Sophie Okonedo, Joaquin Phoenix ","Writer":"Keir Pearson, Terry George","Running_time":"PT121M / 2h 1min","Description":"Directed by Terry George.  With Don Cheadle, Sophie Okonedo, Joaquin Phoenix, Xolani Mali. The true story of Paul Rusesabagina, a hotel manager who housed over a thousand Tutsi refugees during their struggle against the Hutu militia in Rwanda.","Rated":"PG-13"}