{"imdbID":"tt0374546","Title":"Spring, Summer, Fall, Winter... and Spring","Year":"2003","Director":"Ki-duk Kim","Writer":"Ki-duk Kim","Country":"South Korea, Germany","Language":"Korean","Also_Known_As":"Spring, Summer, Fall, Winter... and Spring ","Opening_Weekend":"$42,561 (USA) (2 April 2004)","Gross":"$2,380,788 (USA) (8 October 2004)","Production_Co":"Korea Pictures, LJ Film, Pandora Filmproduktion ","":"Show detailed company contact information on IMDbPro »","Runtime":"103 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The inscription on the floor is \"The Heart Sutra\", one of the most important Sutra of Mahayana Buddhism, written in literary Chinese. See more »","Goofs":"When the young monk finishes inscribing the Heart Sutra on the floor and falls down exhausted, the inscriptions below him change between shots (even though he is lying motionless). In one shot, the inscriptions he is lying on have been painted; and as he wakes up, the paint is gone. See more »","Cast":"Yeong-su Oh, Ki-duk Kim, Young-min Kim, Jae-kyeong Seo, Yeo-jin Ha, Jong-ho Kim, Jung-young Kim, Dae-han Ji, Min Choi, Ji-a Park, Min-Young Song","Plot":"On an isolated lake, an old monk lives on a small floating temple. The wise master has also a young boy with him who learns to become a monk. And we watch as seasons and years pass by. In the midst of the Korean wilderness, a Buddhist master patiently raises a young boy to grow up in wisdom and compassion, through experience and endless exercises. Once the pupil discovers his sexual lust, he seems lost to contemplative life and follows his first love, but soon fails to adapt to the modern world, gets in jail for a crime of passion and returns to the master in search of spiritual redemption and reconciliation with karma, at a high price of physical catharsis... Written by KGF Vissers","Genre":"Drama","Keywords":"monk, lust, buddhist, seclusion, isolation","imdbRating":"8.1","imdbVotes":"60,744","Awards":"13 wins & 7 nominations.","Metascore":"85","Released":"28 May 2004 (USA) ","Location":"Jusanji Pond, Cheongsong County, North Gyeongsang Province, South Korea","Actors":"Ki-duk Kim, Yeong-su Oh, Jong-ho Kim ","Running_time":"PT103M / 1h 43min","Description":"Directed by Ki-duk Kim.  With Ki-duk Kim, Yeong-su Oh, Jong-ho Kim, Young-min Kim. On an isolated lake, an old monk lives on a small floating temple. The wise master has also a young boy with him who learns to become a monk. And we watch as seasons and years pass by.","Rated":"R"}