{"imdbID":"tt0381681","Title":"Before Sunset","Year":"2004","Director":"Richard Linklater","Taglines":"What if you had a second chance with the one that got away?","Country":"USA","Language":"English, French","Also_Known_As":"Before Sunrise 2 ","Budget":"$2,700,000 (estimated)","Opening_Weekend":"$228,304 (Germany) (18 June 2004)","Gross":"$5,792,822 (USA) (22 October 2004)","Production_Co":"Warner Independent Pictures (WIP), Castle Rock Entertainment, Detour Filmproduction ","Runtime":"80 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Julie Delpy wrote and performed three songs for the soundtrack. See more »","Goofs":"When Celine and Jesse are entering Celine's apartment, she opens a \"right hand\" door, the next shot (from the inside) shows her opening a \"left hand\" door. It is not the same door. See more »","Cast":"Ethan Hawke, Julie Delpy, Vernon Dobtcheff, Louise Lemoine Torrès, Rodolphe Pauly, Mariane Plasteig, Diabolo, Denis Evrard, Albert Delpy, Marie Pillet","Plot":"Nine years after Jesse and Celine first met, they encounter each other again on the French leg of Jesse's book tour. Early thirty-something American Jesse Wallace is in a Paris bookstore, the last stop on a tour to promote his best selling book, This Time. Although he is vague to reporters about the source material for the book, it is about his chance encounter nine years earlier on June 15-16, 1994 with a Parisienne named Celine, and the memorable and romantic day and evening they spent together in Vienna. At the end of their encounter at the Vienna train station, which is also how the book ends, they, not providing contact information to the other, vowed to meet each other again in exactly six months at that very spot. As the media scrum at the bookstore nears its conclusion, Jesse spots Celine in the crowd, she who only found out about the book when she earlier saw his photograph promoting this public appearance. Much like their previous encounter, Jesse and Celine, who is now an environmental activist, decide to spend time together until he is supposed to catch his flight back to New York, this ... Written by Huggo","Genre":"Drama, Romance","Keywords":"simultaneity, book, train, bookstore, love","imdbRating":"8.0","imdbVotes":"162,059","Awards":"Nominated for 1 Oscar. Another 9 wins & 27 nominations.","Metascore":"90","Released":"30 July 2004 (USA) ","Location":"Seine River, Paris, France ","Actors":"Ethan Hawke, Julie Delpy, Vernon Dobtcheff ","Writer":"Richard Linklater (screenplay), Julie Delpy (screenplay) | 5 more credits »","Running_time":"PT80M / 1h 20min","Description":"Directed by Richard Linklater.  With Ethan Hawke, Julie Delpy, Vernon Dobtcheff, Louise Lemoine Torrès. Nine years after Jesse and Celine first met, they encounter each other again on the French leg of Jesse's book tour.","Rated":"R"}