{"imdbID":"tt0372784","Title":"Batman Begins","Year":"2005","Director":"Christopher Nolan","Taglines":"The legend begins.","Country":"USA, UK","Language":"English, Urdu, Mandarin","Also_Known_As":"Batman 5 ","Budget":"$150,000,000 (estimated)","Opening_Weekend":"£4,427,802 (UK) (17 June 2005)","Gross":"$205,343,774 (USA) (28 October 2005)","Production_Co":"Warner Bros., Syncopy, DC Comics ","":"Show detailed company contact information on IMDbPro »","Runtime":"140 min | 128 min (default)","Sound_Mix":"DTS | Dolby Digital | SDDS | Sonics-DDP (IMAX version)","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Guy Pearce was considered for the role of Henri Ducard, but was deemed too young. See more »","Goofs":"When Bruce is hit by the burning wood, it rolls off him to his feet as he falls back and hits the floor. As soon as he hits the floor and is unconscious, its placed as if it landed on his chest. See more »","Crazy_Credits":"In some countries, the film title is shown at the very end of the closing credits, whereas in most other countries it's seen at the beginning of the closing credits. See more »","Cast":"Christian Bale, Michael Caine, Liam Neeson, Katie Holmes, Gary Oldman, Cillian Murphy, Tom Wilkinson, Rutger Hauer, Ken Watanabe, Mark Boone Junior, Linus Roache, Morgan Freeman, Larry Holden, Gerard Murphy, Colin McFarlane","Plot":"After training with his mentor, Batman begins his war on crime to free the crime-ridden Gotham City from corruption that the Scarecrow and the League of Shadows have cast upon it. When his parents were killed, billionaire playboy Bruce Wayne relocates to Asia when he is mentored by Henri Ducard and Ra's Al Ghul in how to fight evil. When learning about the plan to wipe out evil in Gotham City by Ducard, Bruce prevents this plan from getting any further and heads back to his home. Back in his original surroundings, Bruce adopts the image of a bat to strike fear into the criminals and the corrupt as the icon known as 'Batman'. But it doesn't stay quiet for long. Written by FilmFanUk","Genre":"Action, Adventure","Keywords":"gotham, social decay, armored car, gangster, mixed martial arts","imdbRating":"8.3","imdbVotes":"931,115","Awards":"Nominated for 1 Oscar. Another 15 wins & 64 nominations.","Metascore":"70","Released":"15 June 2005 (USA) ","Location":"Coalhouse Fort, East Tilbury, Essex, England, UK ","Actors":"Christian Bale, Michael Caine, Ken Watanabe ","Writer":"Bob Kane (characters), David S. Goyer (story) | 2 more credits »","Running_time":"PT140M / 2h 20min","Description":"Directed by Christopher Nolan.  With Christian Bale, Michael Caine, Ken Watanabe, Liam Neeson. After training with his mentor, Batman begins his war on crime to free the crime-ridden Gotham City from corruption that the Scarecrow and the League of Shadows have cast upon it.","Rated":"PG-13"}