{"imdbID":"tt0369339","Title":"Collateral","Year":"2004","Director":"Michael Mann","Writer":"Stuart Beattie","Taglines":"It started like any other night","Country":"USA","Language":"English, Spanish","Also_Known_As":"Untitled Michael Mann Project ","Budget":"$65,000,000 (estimated)","Opening_Weekend":"$24,701,458 (USA) (6 August 2004)","Gross":"$7,648,801 (Japan) (10 December 2004)","Production_Co":"Paramount Pictures, DreamWorks SKG, Parkes+MacDonald Image Nation ","Runtime":"120 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Russell Crowe came close to playing the role of Vincent, but couldn't commit to the picture because he was busy preparing for \"Eucalyptus\", the doomed Australian film project co-starring Nicole Kidman. See more »","Goofs":"After the final taxi crash when the cop is trying to put the handcuffs on Max you hear the locking sound effect of the first handcuff going on, but the cop never gets the first handcuff on. See more »","Crazy_Credits":"There is no sound during the opening DreamWorks logo sequence but the sound of a jet landing are heard during the Paramount logo sequence. In the non-US versions, the studio logos order is reversed, so there is no sound on Paramount's and a jet landing is heard over Dreamworks'. See more »","Cast":"Tom Cruise, Jamie Foxx, Jada Pinkett Smith, Mark Ruffalo, Peter Berg, Bruce McGill, Irma P. Hall, Barry Shabaka Henley, Richard T. Jones, Klea Scott, Bodhi Elfman, Debi Mazar, Javier Bardem, Emilio Rivera, Jamie McBride","Plot":"A cab driver finds himself the hostage of an engaging contract killer as he makes his rounds from hit to hit during one night in Los Angeles. He must find a way to save both himself and one last victim. LA cabbie Max Durocher is the type of person who can wax poetic about other people's lives, which impresses U.S. Justice Department prosecutor Annie Farrell, one of his fares, so much that she gives him her telephone number at the end of her ride. Although a dedicated man as seen through the efficiency in which he does his work, he can't or won't translate that eloquence into a better life for himself. He deludes himself into believing that his now twelve year cabbie job is temporary and that someday he will own his own limousine service. He even lies to his hospitalized mother that he already owns one, with a further lie that he tells her as such primarily to make her happy, rather than the truth which is that he won't do anything to achieve that dream. One night, Max picks up a well dressed man named Vincent, who asks Max to be his only fare for the evening. For a flat fee of $600, plus an extra $100 if he gets to the airport on time - Vincent wants Max to drive him to five stops ... Written by Huggo","Genre":"Crime, Drama, Thriller","Keywords":"driving at night, taxi, neo noir, los angeles california, taxi driver","imdbRating":"7.6","imdbVotes":"287,227","Awards":"Nominated for 2 Oscars. Another 22 wins & 61 nominations.","Metascore":"71","Released":"6 August 2004 (USA) ","Location":"1912 N Cahuenga Boulevard, Los Angeles, USA ","Actors":"Tom Cruise, Jamie Foxx, Jada Pinkett Smith ","Running_time":"PT120M / 2h","Description":"Directed by Michael Mann.  With Tom Cruise, Jamie Foxx, Jada Pinkett Smith, Mark Ruffalo. A cab driver finds himself the hostage of an engaging contract killer as he makes his rounds from hit to hit during one night in Los Angeles. He must find a way to save both himself and one last victim.","Rated":"R"}