{"imdbID":"tt0338564","Title":"Infernal Affairs","Year":"2002","Taglines":"Loyalty. Honor. Betrayal. ","Country":"Hong Kong","Language":"Cantonese, English, Thai","Also_Known_As":"Infernal Affairs ","Budget":"$6,428,966 (estimated)","Opening_Weekend":"$179,789 (Japan) (24 October 2003)","Gross":"$89,594 (USA) (15 October 2004)","Production_Co":"Media Asia Films, Basic Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"101 min | 97 min (director's cut)","Sound_Mix":"Dolby Digital","Color":"Black and White | Color","Aspect_Ratio":"2.35 : 1","Trivia":"The psychiatrist's name, \"Lee Sum Yee\", is a homophone (in Cantonese) for \"your psychiatrist\". See more »","Goofs":"Near the climax, when the lift door opens, the cops handling the pistols don't have their fingers on the trigger - but are just holding the gun. See more »","Cast":"Andy Lau, Tony Chiu Wai Leung, Anthony Chau-Sang Wong, Eric Tsang, Kelly Chen, Sammi Cheng, Edison Chen, Shawn Yue, Elva Hsiao, Chapman To, Ka Tung Lam, Ting Yip Ng, Dion Lam, Chi Keung Wan, Hui Kam Fung","Plot":"A story between a mole in the police department and an undercover cop. Their objectives are the same: to find out who is the mole, and who is the cop. Chan Wing Yan, a young police officer, has been sent undercover as a mole in the local mafia. Lau Kin Ming, a young mafia member, infiltrates the police force. Years later, their older counterparts, Chen Wing Yan and Inspector Lau Kin Ming, respectively, race against time to expose the mole within their midst. Written by Aya","Genre":"Crime, Mystery, Thriller","Keywords":"mole, police, triad, undercover, hong kong","imdbRating":"8.1","imdbVotes":"88,527","Awards":"23 wins & 21 nominations.","Metascore":"75","Released":"12 December 2002 (Hong Kong) ","Actors":"Andy Lau, Tony Chiu Wai Leung, Anthony Chau-Sang Wong ","Director":"Wai-Keung Lau (as Andrew Lau), Alan Mak","Writer":"Alan Mak, Felix Chong","Running_time":"PT101M / 1h 41min","Description":"Directed by Wai-Keung Lau, Alan Mak.  With Andy Lau, Tony Chiu Wai Leung, Anthony Chau-Sang Wong, Eric Tsang. A story between a mole in the police department and an undercover cop. Their objectives are the same: to find out who is the mole, and who is the cop.","Rated":"R"}