{"imdbID":"tt0451094","Title":"Sympathy for Lady Vengeance","Year":"2005","Director":"Chan-wook Park","Taglines":"Lee Geum-Ja, have mercy on us... ","Country":"South Korea","Language":"Korean, English, Japanese","Also_Known_As":"Sympathy for Lady Vengeance ","Budget":"KRW 4,200,000,000 (estimated)","Opening_Weekend":"$138,663 (Hong Kong) (14 October 2005)","Gross":"$211,667 (USA) (29 September 2006)","Production_Co":"CJ Capital Investment, Centurion Investment, Ilshin Capital Investments ","Runtime":"112 min | 112 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The bakery that Geumja works in is called \"Naruse\", which is the name of the Japanese director Mikio Naruse. See more »","Cast":"Yeong-ae Lee, Min-sik Choi, Shi-hoo Kim, Yea-young Kwon, Tony Barry, Anne Cordiner, Su-hee Go, Hye-jeong Kang, Bu-seon Kim, Byeong-ok Kim, Dae-yeon Lee, Seung-shin Lee, Su-gyeong Lim, Il-woo Nam, Dal-su Oh","Plot":"After a thirteen-year imprisonment for the kidnap and murder of a six-year-old boy, Guem-Ja Lee seeks vengeance on the man truly responsible for the boy's death. With the help of fellow ... See full summary » After a thirteen-year imprisonment for the kidnap and murder of a six-year-old boy, Guem-Ja Lee seeks vengeance on the man truly responsible for the boy's death. With the help of fellow inmates and reunited with her daughter, she gets closer and closer to her goal. Written by Spekkie Big","Genre":"Crime, Drama, Horror","Keywords":"christian, cake, lesbian sex, pregnant schoolgirl, oral sex","imdbRating":"7.7","imdbVotes":"51,774","Awards":"11 wins & 10 nominations.","Metascore":"75","Released":"29 July 2005 (South Korea) ","Actors":"Yeong-ae Lee, Min-sik Choi, Shi-hoo Kim ","Writer":"Seo-Gyeong Jeong, Chan-wook Park","Running_time":"PT112M / 1h 52min","Description":"Directed by Chan-wook Park.  With Yeong-ae Lee, Min-sik Choi, Shi-hoo Kim, Yea-young Kwon. After a thirteen-year imprisonment for the kidnap and murder of a six-year-old boy, Guem-Ja Lee seeks vengeance on the man truly responsible for the boy's death. With the help of fellow inmates and reunited with her daughter, she gets closer and closer to her goal.","Rated":"R"}