{"imdbID":"tt0404203","Title":"Little Children","Year":"2006","Director":"Todd Field","Country":"USA","Language":"English","Budget":"$26,000,000 (estimated)","Gross":"$5,459,824 (USA) (6 April 2007)","Production_Co":"New Line Cinema, Bona Fide Productions, Standard Film Company ","Runtime":"136 min | 137 min (DVD)","Cast":"Kate Winslet, Jennifer Connelly, Patrick Wilson, Jackie Earle Haley, Noah Emmerich, Gregg Edelman, Phyllis Somerville, Raymond J. Barry, Jane Adams, Ty Simpkins, Sadie Goldstein, Helen Carey, Sarah Buxton, Mary B. McCann, Trini Alvarado","Plot":"The lives of two lovelorn spouses from separate marriages, a registered sex offender, and a disgraced ex-police officer intersect as they struggle to resist their vulnerabilities and temptations in suburban Connecticut. Echoes of \"Madame Bovary\" in the American suburbs. Sarah's in a loveless marriage to an advertising executive, long days with her young daughter at the park and the pool, wanting more. Brad is an immature househusband, married to a flinty documentary filmmaker. Ronnie is just out of prison - two years for indecent exposure to a minor - living with his elderly mother, May; Larry is a retired cop, fixated on driving Ronnie away. Sarah and Brad connect, a respite of adult companionship at the pool. Ronnie and Larry have their demons. Brad should be studying for the bar; Larry misses his job; Ronnie's mom thinks he needs a girlfriend. Sarah longs to refuse to be trapped in an unhappy life. Where can these tangled paths lead? Written by <jhailey@hotmail.com>","Genre":"Drama, Romance","Keywords":"adulterous wife, sex offender, bar, suburb, dysfunctional marriage","imdbRating":"7.6","imdbVotes":"91,409","Awards":"Nominated for 3 Oscars. Another 18 wins & 54 nominations.","Metascore":"75","Released":"9 February 2007 (USA) ","Location":"Boothbay Harbor, Maine, USA ","Actors":"Kate Winslet, Jennifer Connelly, Patrick Wilson ","Writer":"Todd Field (screenplay), Tom Perrotta (screenplay) | 1 more credit »","Running_time":"PT136M / 2h 16min","Description":"Directed by Todd Field.  With Kate Winslet, Jennifer Connelly, Patrick Wilson, Jackie Earle Haley. The lives of two lovelorn spouses from separate marriages, a registered sex offender, and a disgraced ex-police officer intersect as they struggle to resist their vulnerabilities and temptations in suburban Connecticut.","Rated":"R"}