{"imdbID":"tt0468569","Title":"The Dark Knight","Year":"2008","Director":"Christopher Nolan","Taglines":"Welcome to a world without rules. ","Certificate":"UA | See all certifications »","Country":"USA, UK","Language":"English, Mandarin","Also_Known_As":"Iravu Kavalan ","Budget":"$185,000,000 (estimated)","Opening_Weekend":"$158,411,483 (USA) (18 July 2008)","Gross":"$533,316,061 (USA) (27 February 2009)","Production_Co":"Warner Bros., Legendary Pictures, Syncopy ","":"Show detailed company contact information on IMDbPro »","Runtime":"152 min","Sound_Mix":"Dolby Digital | SDDS | DTS","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"In the Italian version of Batman (1989), Jack Nicholson's voice was dubbed by actor Giancarlo Giannini. In this movie, Heath Ledger was voiced by Giannini's son Adriano Giannini, with the result that Italian audience felt a connection between the two Jokers since the voices are very similar. Giancarlo Giannini, however, makes a \"cameo by dubbing in Italian one of the Mafia bosses. See more »","Goofs":"In a scene where The Joker is telling Rachel the story of how he got the scars. The Joker's philtrum (a space between the nose and upper lip) is clean but in the dialogue \"She can't stand the sight of me\" you can see a blood or some sort of dark colored liquid on it. In the next frame it's gone. See more »","Crazy_Credits":"The DC logo contains two comic-book images: a shot of the Riddler, and picture of Batman punching him out. See more »","Cast":"Christian Bale, Heath Ledger, Aaron Eckhart, Michael Caine, Maggie Gyllenhaal, Gary Oldman, Morgan Freeman, Monique Gabriela Curnen, Ron Dean, Cillian Murphy, Chin Han, Nestor Carbonell, Eric Roberts, Ritchie Coster, Anthony Michael Hall","Plot":"When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, the caped crusader must come to terms with one of the greatest psychological tests of his ability to fight injustice. Set within a year after the events of Batman Begins, Batman, Lieutenant James Gordon, and new district attorney Harvey Dent successfully begin to round up the criminals that plague Gotham City until a mysterious and sadistic criminal mastermind known only as the Joker appears in Gotham, creating a new wave of chaos. Batman's struggle against the Joker becomes amazing and kill rachel Written by Peteagassi","Genre":"Action, Crime, Drama","Keywords":"dc comics, based on comic book, organized crime, costumed hero, evil clown","imdbRating":"9.0","imdbVotes":"1,599,442","Awards":"Won 2 Oscars. Another 142 wins & 126 nominations.","Metascore":"82","Released":"18 July 2008 (India) ","Location":"Times Square, Causeway Bay, Hong Kong ","Actors":"Christian Bale, Heath Ledger, Aaron Eckhart ","Writer":"Jonathan Nolan (screenplay), Christopher Nolan (screenplay) | 3 more credits »","Running_time":"PT152M / 2h 32min","Description":"Directed by Christopher Nolan.  With Christian Bale, Heath Ledger, Aaron Eckhart, Michael Caine. When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, the caped crusader must come to terms with one of the greatest psychological tests of his ability to fight injustice.","Rated":"UA"}