{"imdbID":"tt0452623","Title":"Gone Baby Gone","Year":"2007","Director":"Ben Affleck","Taglines":"Hope begins where the secrets end. ","Country":"USA","Language":"English","Also_Known_As":"Desapareció una noche ","Budget":"$19,000,000 (estimated)","Opening_Weekend":"$5,501,406 (USA) (19 October 2007)","Gross":"£1,694,405 (UK) (11 July 2008)","Production_Co":"LivePlanet, Miramax, Ladd Company, The ","Runtime":"114 min","Sound_Mix":"DTS | SDDS | Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Ed Harris and Amy Madigan are husband and wife in real life. See more »","Goofs":"While Dottie talks to the press, she uses the word \"visual\" when she means \"vigil.\" This was because her lines were being fed to her by director Ben Affleck and she misheard this particular word. Affleck noticed her mistake but thought it sounded natural, and thus left it alone. See more »","Crazy_Credits":"In the credits, Ben Affleck gives special thanks to Manny Ramirez and David Ortiz, both members of the Boston Red Sox World Series championship teams of 2004 and 2007. See more »","Cast":"Casey Affleck, Michelle Monaghan, Morgan Freeman, Ed Harris, John Ashton, Amy Ryan, Amy Madigan, Titus Welliver, Michael Kenneth Williams, Edi Gathegi, Mark Margolis, Madeline O'Brien, Slaine, Trudi Goodman, Matthew Maher","Plot":"Two Boston area detectives investigate a little girl's kidnapping, which ultimately turns into a crisis both professionally and personally. When 4 year old Amanda McCready disappears from her home and the police make little headway in solving the case, the girl's aunt Beatrice McCready hires two private detectives Patrick Kenzie and Angie Gennaro. The detectives freely admit that they have little experience with this type of case, but the family wants them for two reasons - they're not cops and they know the tough Boston neighborhood in which they all live. As the case progresses, Kenzie and Gennaro face drug dealers, gangs and pedophiles. When they are about to solve their case, they are faced with a moral dilemma that could tear them apart. Written by garykmcd","Genre":"Crime, Drama, Mystery","Keywords":"neighborhood, investigation, private detective, moral dilemma, single mother","imdbRating":"7.7","imdbVotes":"186,844","Awards":"Nominated for 1 Oscar. Another 32 wins & 28 nominations.","Metascore":"72","Released":"19 October 2007 (USA) ","Location":"Boston, Massachusetts, USA ","Actors":"Morgan Freeman, Ed Harris, Casey Affleck ","Writer":"Ben Affleck (screenplay), Aaron Stockard (screenplay) | 1 more credit »","Running_time":"PT114M / 1h 54min","Description":"Directed by Ben Affleck.  With Morgan Freeman, Ed Harris, Casey Affleck, Michelle Monaghan. Two Boston area detectives investigate a little girl's kidnapping, which ultimately turns into a crisis both professionally and personally.","Rated":"R"}