{"imdbID":"tt0485947","Title":"Mr. Nobody","Year":"2009","Director":"Jaco Van Dormael","Writer":"Jaco Van Dormael","Taglines":"Nothing is real, everything is possible. ","Country":"Belgium, Germany, Canada, France","Language":"English, Mohawk","Also_Known_As":"Gospodin Niko ","Budget":"$47,000,000 (estimated)","Opening_Weekend":"$1,612 (USA) (1 November 2013)","Gross":"$3,600 (USA) (29 November 2013)","Production_Co":"Pan Européenne, Virtual Films, Christal Films ","Runtime":"141 min | 138 min | 157 min (Director's Cut)","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Jaco Van Dormael: The Brazilian man. See more »","Goofs":"When Nemo drowns in his car, it would actually have been rather easy to escape, because once the car filled with water the pressure would have equalized, making opening the door no more difficult than usual. See more »","Cast":"Jared Leto, Sarah Polley, Diane Kruger, Linh Dan Pham, Rhys Ifans, Natasha Little, Toby Regbo, Juno Temple, Clare Stone, Thomas Byrne, Audrey Giacomini, Laura Brumagne, Allan Corduner, Daniel Mays, Michael Riley","Plot":"A boy stands on a station platform as a train is about to leave. Should he go with his mother or stay with his father? Infinite possibilities arise from this decision. As long as he doesn't choose, anything is possible. In the year 2092, one hundred eighteen year old Nemo is recounting his life story to a reporter. He is less than clear, often times thinking that he is only thirty-four years of age. But his story becomes more confusing after he does focus on the fact of his current real age. He tells of his life at three primary points in his life: at age nine (when his parents divorced), age sixteen and age thirty-four. The confusing aspect of the story is that he tells of alternate life paths, often changing course with the flick of a decision at each of those ages. One life path has him ultimately married to Elise, a depressed woman who never got over the unrequited love she had for a guy named Stefano when she was a teenager and who asked Nemo to swear that when she died he would sprinkle her ashes on Mars. A second life path has him married to Jean. Their life is one of luxury but one also of utter boredom. And a third life path has him in a torrid romance with his step-sister Anna, the two who,... Written by Huggo","Genre":"Drama, Fantasy, Romance","Keywords":"multiple outcomes, time, future, borderline personality disorder, last words","imdbRating":"7.9","imdbVotes":"138,424","Awards":"11 wins & 4 nominations.","Metascore":"63","Released":"26 September 2013 (USA) ","Location":"Japanese Garden, Hasselt, Belgium ","Actors":"Jared Leto, Sarah Polley, Diane Kruger ","Running_time":"PT141M / 2h 21min","Description":"Directed by Jaco Van Dormael.  With Jared Leto, Sarah Polley, Diane Kruger, Linh Dan Pham. A boy stands on a station platform as a train is about to leave. Should he go with his mother or stay with his father? Infinite possibilities arise from this decision. As long as he doesn't choose, anything is possible.","Rated":"R"}