{"imdbID":"tt0482571","Title":"The Prestige","Year":"2006","Director":"Christopher Nolan","Taglines":"Are You Watching Closely? ","Country":"USA, UK","Language":"English","Also_Known_As":"El gran truco ","Budget":"$40,000,000 (estimated)","Opening_Weekend":"$14,801,808 (USA) (20 October 2006)","Gross":"$53,082,743 (USA) (2 February 2007)","Production_Co":"Touchstone Pictures, Warner Bros., Newmarket Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"130 min","Sound_Mix":"SDDS | Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The Prestige is one of three 2006 films to feature both the topic of magic and magicians as main characters. The other two are The Illusionist (2006) and Scoop (2006), the second of which also stars Hugh Jackman and Scarlett Johansson. See more »","Goofs":"The spider web shaped cracks that appear in the glass boxes when characters attempt to smash them indicate they are made of laminated safety glass, a material held intact by a thin layer of flexible vinyl sandwiched between two sheets of glass. Laminated safety glass was discovered by accident in 1903 and patented in 1909, well after the time line of the movie. See more »","Cast":"Hugh Jackman, Christian Bale, Michael Caine, Piper Perabo, Rebecca Hall, Scarlett Johansson, Samantha Mahurin, David Bowie, Andy Serkis, Daniel Davis, Jim Piddock, Christopher Neame, Mark Ryan, Roger Rees, Jamie Harris","Plot":"Two stage magicians engage in competitive one-upmanship in an attempt to create the ultimate stage illusion. In the end of the Nineteenth Century, in London, Robert Angier, his beloved wife Julia McCullough and Alfred Borden are friends and assistants of a magician. When Julia accidentally dies during a performance, Robert blames Alfred for her death and they become enemies. Both become famous and rival magicians, sabotaging the performance of the other on the stage. When Alfred performs a successful trick, Robert becomes obsessed trying to disclose the secret of his competitor with tragic consequences. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Drama, Mystery, Sci-Fi","Keywords":"rivalry, illusion, magician, secret, obsession","imdbRating":"8.5","imdbVotes":"805,790","Awards":"Nominated for 2 Oscars. Another 6 wins & 31 nominations.","Metascore":"66","Released":"20 October 2006 (USA) ","Location":"Spring Street Towers - 650 S. Spring Street, Downtown, Los Angeles, California, USA ","Actors":"Christian Bale, Hugh Jackman, Scarlett Johansson ","Writer":"Jonathan Nolan (screenplay), Christopher Nolan (screenplay) | 1 more credit »","Running_time":"PT130M / 2h 10min","Description":"Directed by Christopher Nolan.  With Christian Bale, Hugh Jackman, Scarlett Johansson, Michael Caine. Two stage magicians engage in competitive one-upmanship in an attempt to create the ultimate stage illusion.","Rated":"PG-13"}