{"imdbID":"tt0413015","Title":"Mrs Henderson Presents","Year":"2005","Director":"Stephen Frears","Country":"UK, USA","Language":"English","Budget":"$20,000,000 (estimated)","Gross":"$846,112 (New Zealand) (26 May 2006)","Production_Co":"Pathé Pictures, BBC Films, Future Films ","Runtime":"103 min","Cast":"Judi Dench, Bob Hoskins, Will Young, Christopher Guest, Kelly Reilly, Thelma Barlow, Anna Brewster, Rosalind Halstead, Sarah Solemani, Natalia Tena, Thomas Allen, Richard Syms, Ralph Nossek, Camille O'Sullivan, Doraly Rosen","Plot":"Laura Henderson buys an old London theater and opens it up as the Windmill, a performance hall which goes down in history for, among other things, its all-nude revues. Recently widowed well-to-do Laura Henderson is at a bit of a loose end in inter-war London. On a whim she buys the derelict Windmill theatre in the West End and persuades impresario Vivian Van Damm to run it, despite the fact the two don't seem to get on at all. Although their idea of a non-stop revue is at first a success, other theatres copy it and disaster looms. Laura suggests they put nudes in the show, but Van Damm points out that the Lord Chamberlain, who licenses live shows in Britain, is likely to have something to say about this. Luckily Mrs Henderson is friends with him. Written by Jeremy Perkins {J-26}","Genre":"Comedy, Drama, Music","Keywords":"anti semitism, theatre, chamberlain, friend, breasts","imdbRating":"7.1","imdbVotes":"13,360","Awards":"Nominated for 2 Oscars. Another 6 wins & 31 nominations.","Metascore":"71","Released":"17 February 2006 (USA) ","Location":"Chester Terrace, Regent's Park, London, England, UK ","Actors":"Judi Dench, Bob Hoskins, Christopher Guest ","Writer":"David Rose (idea), Kathy Rose (idea) | 2 more credits »","Running_time":"PT103M / 1h 43min","Description":"Directed by Stephen Frears.  With Judi Dench, Bob Hoskins, Christopher Guest, Will Young. Laura Henderson buys an old London theater and opens it up as the Windmill, a performance hall which goes down in history for, among other things, its all-nude revues.","Rated":"R"}