{"imdbID":"tt0401792","Title":"Sin City","Year":"2005","Writer":"Frank Miller (graphic novels)","Taglines":"Do I take this cop down and risk it all? ","Country":"USA","Language":"English","Also_Known_As":"Frank Miller's Sin City ","Budget":"$40,000,000 (estimated)","Opening_Weekend":"$29,120,273 (USA) (1 April 2005)","Gross":"$2,351,101 (Brazil) (26 August 2005)","Production_Co":"Dimension Films, Troublemaker Studios ","":"Show detailed company contact information on IMDbPro »","Runtime":"124 min | 147 min (unrated, recut)","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Black and White | Color","Aspect_Ratio":"1.85 : 1","Trivia":"The signature white blood proved hard to achieve on screen. Regular movie blood couldn't provide the stark look. The crew had to use fluorescent red liquid and bathe it in black light. In post-production, the liquid was turned white. See more »","Goofs":"Gail's earrings, although supposedly the same pair through the entire movie, are two different pairs. One pair is a clip-on which she wears backwards, with the ear pad in the front instead of the back. These are worn high on her earlobes so you can see her pierced hole beneath them. Later, after she is kidnapped by Manute, the earrings are pierced with fishhook posts. After the girls take down the mob, she is back to wearing the reverse clip-on pair. The earrings were very long and dangly and would have been a potential hazard in an action scene. To avoid tearing the actress's lobes the two pairs were used. See more »","Crazy_Credits":"There is no screen writing credit. See more »","Cast":"Jessica Alba, Devon Aoki, Alexis Bledel, Powers Boothe, Cara D. Briggs, Jude Ciccolella, Jeffrey J. Dashnaw, Rosario Dawson, Jesse De Luna, Benicio Del Toro, Jason Douglas, Michael Clarke Duncan, Tommy Flanagan, Christina Frankenfield, Rick Gomez","Plot":"A film that explores the dark and miserable town, Basin City, and tells the story of three different people, all caught up in violent corruption. Four tales of crime adapted from Frank Miller's popular comics, focusing around a muscular brute who's looking for the person responsible for the death of his beloved Goldie, a man fed up with Sin City's corrupt law enforcement who takes the law into his own hands after a horrible mistake, a cop who risks his life to protect a girl from a deformed pedophile, and a hitman looking to make a little cash. Written by Tom Benton","Genre":"Crime, Thriller","Keywords":"neo noir, night, hearing characters thoughts, yellow skin, doing the right thing","imdbRating":"8.1","imdbVotes":"637,640","Awards":"29 wins & 45 nominations.","Metascore":"74","Released":"1 April 2005 (USA) ","Location":"Austin, Texas, USA","Actors":"Mickey Rourke, Clive Owen, Bruce Willis ","Director":"Frank Miller, Robert Rodriguez | 1 more credit »","Running_time":"PT124M / 2h 4min","Description":"Directed by Frank Miller, Robert Rodriguez, Quentin Tarantino.  With Mickey Rourke, Clive Owen, Bruce Willis, Jessica Alba. A film that explores the dark and miserable town, Basin City, and tells the story of three different people, all caught up in violent corruption.","Rated":"R"}