{"imdbID":"tt0440963","Title":"The Bourne Ultimatum","Year":"2007","Director":"Paul Greengrass","Taglines":"This Summer Jason Bourne Comes Home ","Country":"USA, Germany","Language":"English, French, Arabic, Russian, Spanish","Also_Known_As":"Bourne: El ultimátum ","Budget":"$110,000,000 (estimated)","Opening_Weekend":"$69,283,690 (USA) (3 August 2007)","Gross":"$227,137,090 (USA) (22 November 2007)","Production_Co":"Universal Pictures, Motion Picture BETA Produktionsgesellschaft, Kennedy/Marshall Company, The ","":"Show detailed company contact information on IMDbPro »","Runtime":"115 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color (Technicolor)","Aspect_Ratio":"2.35 : 1","Trivia":"Co-stars Scott Glenn and David Strathairn share a birthday 26th January. See more »","Goofs":"When Jason Bourne hot-wires the Audi on the parking garage rooftop, he puts it in drive and slams into a parked SUV pushing it forward. He then puts it in reverse to escape other agents. As the camera shows the full screen shot of the Audi, the front of the car is completely undamaged - like new. See more »","Cast":"Matt Damon, Julia Stiles, David Strathairn, Scott Glenn, Paddy Considine, Edgar Ramirez, Albert Finney, Joan Allen, Tom Gallop, Corey Johnson, Daniel Brühl, Joey Ansah, Colin Stinton, Dan Fredenburgh, Lucy Liemann","Plot":"Jason Bourne dodges a ruthless CIA official and his agents from a new assassination program while searching for the origins of his life as a trained killer. Bourne is once again brought out of hiding, this time inadvertently by London-based reporter Simon Ross who is trying to unveil Operation Blackbriar--an upgrade to Project Treadstone--in a series of newspaper columns. Bourne sets up a meeting with Ross and realizes instantly they're being scanned. Information from the reporter stirs a new set of memories, and Bourne must finally, ultimately, uncover his dark past whilst dodging The Company's best efforts in trying to eradicate him. Written by Corey Hatch","Genre":"Action, Thriller","Keywords":"cia, memory, assassin, dark past, newspaper","imdbRating":"8.1","imdbVotes":"469,215","Awards":"Won 3 Oscars. Another 25 wins & 38 nominations.","Metascore":"85","Released":"3 August 2007 (USA) ","Location":"Germany ","Actors":"Matt Damon, Edgar Ramirez, Joan Allen ","Writer":"Tony Gilroy (screenplay), Scott Z. Burns (screenplay) | 3 more credits »","Running_time":"PT115M / 1h 55min","Description":"Directed by Paul Greengrass.  With Matt Damon, Edgar Ramirez, Joan Allen, Julia Stiles. Jason Bourne dodges a ruthless CIA official and his agents from a new assassination program while searching for the origins of his life as a trained killer.","Rated":"PG-13"}