{"imdbID":"tt0499549","Title":"Avatar","Year":"2009","Director":"James Cameron","Writer":"James Cameron","Country":"USA, UK","Language":"English, Spanish","Budget":"$237,000,000 (estimated)","Gross":"$760,505,847 (USA) (12 November 2010)","Production_Co":"Twentieth Century Fox Film Corporation, Dune Entertainment, Ingenious Film Partners ","Runtime":"162 min | 171 min (special edition) | 178 min (extended cut)","Cast":"Sam Worthington, Zoe Saldana, Sigourney Weaver, Stephen Lang, Michelle Rodriguez, Giovanni Ribisi, Joel David Moore, CCH Pounder, Wes Studi, Laz Alonso, Dileep Rao, Matt Gerald, Sean Anthony Moran, Jason Whyte, Scott Lawrence","Plot":"A paraplegic marine dispatched to the moon Pandora on a unique mission becomes torn between following his orders and protecting the world he feels is his home. When his brother is killed in a robbery, paraplegic Marine Jake Sully decides to take his place in a mission on the distant world of Pandora. There he learns of greedy corporate figurehead Parker Selfridge's intentions of driving off the native humanoid \"Na'vi\" in order to mine for the precious material scattered throughout their rich woodland. In exchange for the spinal surgery that will fix his legs, Jake gathers intel for the cooperating military unit spearheaded by gung-ho Colonel Quaritch, while simultaneously attempting to infiltrate the Na'vi people with the use of an \"avatar\" identity. While Jake begins to bond with the native tribe and quickly falls in love with the beautiful alien Neytiri, the restless Colonel moves forward with his ruthless extermination tactics, forcing the soldier to take a stand - and fight back in an epic battle for the fate of Pandora. Written by The Massie Twins","Genre":"Action, Adventure, Fantasy","Keywords":"paraplegic, spiritualism, native, marine, colonel","imdbRating":"7.9","imdbVotes":"858,269","Awards":"Won 3 Oscars. Another 76 wins & 114 nominations.","Metascore":"83","Released":"18 December 2009 (USA) ","Location":"Hamakua Coast, Hawaii, USA ","Actors":"Sam Worthington, Zoe Saldana, Sigourney Weaver ","Running_time":"PT162M / 2h 42min","Description":"Directed by James Cameron.  With Sam Worthington, Zoe Saldana, Sigourney Weaver, Michelle Rodriguez. A paraplegic marine dispatched to the moon Pandora on a unique mission becomes torn between following his orders and protecting the world he feels is his home.","Rated":"PG-13"}