{"imdbID":"tt0419677","Title":"Dead Man's Shoes","Year":"2004","Director":"Shane Meadows","Taglines":"He's in all of us.","Certificate":"See all certifications »","Country":"UK","Language":"English","Also_Known_As":"Vingança Redentora ","Budget":"£695,393 (estimated)","Opening_Weekend":"$1,825 (USA) (12 May 2006)","Gross":"$6,013 (USA) (26 May 2006)","Production_Co":"Warp Films, Big Arty Productions, EM Media ","Runtime":"90 min","Sound_Mix":"Dolby Digital","Color":"Black and White (flashback scenes)| Color","Aspect_Ratio":"1.85 : 1","Trivia":"The music system Sonny has in his living room is the Sony MHC-S5. See more »","Goofs":"Before the drug scene when Richard is putting the drugs in the kettle you can clearly see under the gas mask Richard has long(ish) hair. While in every other scene he has very short hair. See more »","Crazy_Credits":"Before the credits roll, the film is dedicated to the memory of Paddy Considine's father. See more »","Cast":"Paddy Considine, Gary Stretch, Toby Kebbell, Stuart Wolfenden, Neil Bell, Paul Sadot, Seamus O'Neill, Jo Hartley, Paul Hurstfield, Emily Aston, George Newton, Craig Considine, Matt Considine, Andrew Shim, Arthur Meadows","Plot":"A disaffected soldier returns to his hometown to get even with the thugs who brutalized his mentally-challenged brother years ago. Richard returns home from military service to a small town in the Midlands. He has one thing on his mind: revenge. Payback for the local bullies who did some very bad things to his brother. At first his campaign employs guerrilla tactics, designed to frighten the men and put them ill at ease. But then he steps up his operation, and one by one these local tough guys are picked off by the terrifying angel of vengeance that Richard has become. Written by Mr_John_Barrymore","Genre":"Crime, Drama, Thriller","Keywords":"revenge, army veteran, anger, independent film, sex scene","imdbRating":"7.7","imdbVotes":"39,043","Awards":"4 wins & 13 nominations.","Metascore":"52","Released":"1 October 2004 (UK) ","Location":"Bonsall, Matlock Bath, Derbyshire, England, UK ","Actors":"Paddy Considine, Gary Stretch, Toby Kebbell ","Writer":"Paddy Considine, Shane Meadows | 1 more credit »","Running_time":"PT90M / 1h 30min","Description":"Directed by Shane Meadows.  With Paddy Considine, Gary Stretch, Toby Kebbell, Stuart Wolfenden. A disaffected soldier returns to his hometown to get even with the thugs who brutalized his mentally-challenged brother years ago.","Rated":"N/A"}