{"imdbID":"tt0464141","Title":"The Orphanage","Year":"2007","Director":"J.A. Bayona","Writer":"Sergio G. Sánchez (screenplay)","Taglines":"Un cuento de amor. Una historia de terror (A tale of love. A story of horror) ","Country":"Spain","Language":"Spanish","Also_Known_As":"The Orphanage ","Budget":"€3,400,000 (estimated)","Opening_Weekend":"$338,024 (USA) (28 December 2007)","Gross":"£1,480,257 (UK) (11 April 2008)","Production_Co":"Esta Vivo! Laboratorio de Nuevos Talentos, Grupo Rodar, Rodar y Rodar Cine y Televisión ","Runtime":"105 min","Sound_Mix":"Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"When the writer told the little girl who plays the blind orphan that she had pretty eyes, she replied, \"Oh, do you like them? I picked them out myself!\" What he didn't know: She was diagnosed at a very young age with a degenerative eye disease that was going to leave her blind. One of the last things her parents did while she could still see was let her see a big selection of glass eyes and choose the ones she wanted. See more »","Goofs":"Simon enters the basement from the same door as his mother, without using the door handle. He doesn't even rip the wallpaper. When his mother enters everything is untouched. See more »","Crazy_Credits":"Pieces of wallpaper are peeled off to reveal each of the opening credits. See more »","Cast":"Belén Rueda, Fernando Cayo, Roger Príncep, Mabel Rivera, Montserrat Carulla, Andrés Gertrúdix, Edgar Vivar, Óscar Casas, Mireia Renau, Georgina Avellaneda, Carla Gordillo, Alejandro Camps, Carmen López, Óscar Lara, Geraldine Chaplin","Plot":"A woman brings her family back to her childhood home, which used to be an orphanage for handicapped children. Before long, her son starts to communicate with an invisible new friend. Laura, a former orphan, raises her adopted son Simón together with her husband Carlos in an old house and former orphanage where she was raised. While at the orphanage Simón tells Laura that he has five invisible friends which she believes are a product of his active imagination. Laura decides to reopen the orphanage to cater for disabled children and throws a party. During the party Simón tries to persuade Laura to go and take a look at his friends cabin but she's too busy. Later on she sees a mysterious masked boy and realizes that Simón has also disappeared. Laura feels the presence of other people in the house and months later Laura invites a team of parapsychologists to try to unravel the mystery. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Drama, Mystery, Thriller","Keywords":"orphanage, orphan, dead children, ghost, missing child","imdbRating":"7.5","imdbVotes":"117,426","Awards":"32 wins & 40 nominations.","Metascore":"74","Released":"11 January 2008 (USA) ","Location":"Barcelona, Catalonia, Spain ","Actors":"Belén Rueda, Fernando Cayo, Roger Príncep ","Running_time":"PT105M / 1h 45min","Description":"Directed by J.A. Bayona.  With Belén Rueda, Fernando Cayo, Roger Príncep, Mabel Rivera. A woman brings her family back to her childhood home, which used to be an orphanage for handicapped children. Before long, her son starts to communicate with an invisible new friend.","Rated":"R"}