{"imdbID":"tt0446755","Title":"The Painted Veil","Year":"2006","Director":"John Curran","Taglines":"Sometimes the greatest journey is the distance between two people ","Country":"China, USA, Canada","Language":"Mandarin, English, French","Also_Known_As":"Al otro lado del mundo ","Budget":"$19,400,000 (estimated)","Opening_Weekend":"$71,814 (USA) (22 December 2006)","Gross":"£1,381,143 (UK) (25 May 2007)","Production_Co":"WIP, Stratus Film Co., Bob Yari Productions ","Runtime":"125 min","Sound_Mix":"SDDS | Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Edward Norton personally recruited Naomi Watts for her role in the film. See more »","Goofs":"In the scene in the orphanage where Walter kisses Kitty goodbye before he leaves for the camp, Kitty is sleeping with a child in her arms. The child is lying on his side as Walter kisses her, then a wider angle is shown and the child is all of a sudden sleeping on his back. See more »","Cast":"Catherine An, Bin Li, Bin Wu, Alan David, Marie-Laure Descoureaux, Sally Hawkins, Juliet Howland, Toby Jones, Lorraine Laurence, Gwing-Gai Lee, Li Feng, Gesang Meiduo, Edward Norton, Yin Qing, Ian Renwick","Plot":"A British medical doctor fights a cholera epidemic in a small Chinese village, while being trapped at home in a loveless marriage to an unfaithful wife. This love story has Kitty meeting young, intelligent, shy and somewhat dull Dr. Walter Fane, whose forte is the study of infectious diseases, and the convenient marriage that she finds herself committed to. It is in this web of intrigue that they head for China, only after Walter discovers Kitty's infidelity with one dashing and witty diplomat Charlie Townsend. So much as to hide her from herself and to help thwart a cholera outbreak, this is a marriage more than on the rocks. This is a cold, indifferent and loveless partnership in a vast unknown and deadly environment that will test both these flightless lovebirds and with the hardships and tolerances more than any had ever anticipated. A visual delight amid the pain and suffering of a dying people and failing marriage. Will a cure be found for both, before it's too late? Written by Cinema_Fan","Genre":"Drama, Romance","Keywords":"marriage, love, china, epidemic, cholera","imdbRating":"7.5","imdbVotes":"75,843","Awards":"Won 1 Golden Globe. Another 8 wins & 10 nominations.","Metascore":"69","Released":"19 January 2007 (USA) ","Location":"Beijing Film Studio, Beijing, China ","Actors":"Naomi Watts, Edward Norton, Liev Schreiber ","Writer":"Ron Nyswaner (screenplay), W. Somerset Maugham (novel)","Running_time":"PT125M / 2h 5min","Description":"Directed by John Curran.  With Naomi Watts, Edward Norton, Liev Schreiber, Catherine An. A British medical doctor fights a cholera epidemic in a small Chinese village, while being trapped at home in a loveless marriage to an unfaithful wife.","Rated":"PG-13"}