{"imdbID":"tt0434409","Title":"V for Vendetta","Year":"2005","Director":"James McTeigue","Taglines":"Freedom! Forever! ","Country":"USA, UK, Germany","Language":"English","Also_Known_As":"V for Vendetta: The IMAX Experience ","Budget":"$54,000,000 (estimated)","Opening_Weekend":"£1,188,058 (UK) (17 March 2006)","Gross":"$70,496,802 (USA) (23 June 2006)","Production_Co":"Warner Bros., Virtual Studios, Silver Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"132 min","Sound_Mix":"DTS | Dolby Digital | SDDS | Sonics-DDP (IMAX version)","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Just to the left of the jukebox is the painting \"Giovanni Arnolfini and His Bride\" (1434) by Jan Van Eyck. See more »","Goofs":"When V goes to rip off the suit of armor's helm, while play-fighting, you can briefly see the metal rod that pops up to take off the head. See more »","Crazy_Credits":"Dedicated in memory of Adrian Biddle (1951-2005). See more »","Cast":"Natalie Portman, Hugo Weaving, Stephen Rea, Stephen Fry, John Hurt, Tim Pigott-Smith, Rupert Graves, Roger Allam, Ben Miles, Sinéad Cusack, Natasha Wightman, John Standing, Eddie Marsan, Clive Ashborn, Emma Field-Rayner","Plot":"In a future British tyranny, a shadowy freedom fighter, known only by the alias of \"V\", plots to overthrow it with the help of a young woman. Tells the story of Evey Hammond and her unlikely but instrumental part in bringing down the fascist government that has taken control of a futuristic Great Britain. Saved from a life-and-death situation by a man in a Guy Fawkes mask who calls himself V, she learns a general summary of V's past and, after a time, decides to help him bring down those who committed the atrocities that led to Britain being in the shape that it is in. Written by ameelmore","Genre":"Action, Drama, Thriller","Keywords":"dystopia, government, terrorist, revolution, gunpowder plot","imdbRating":"8.2","imdbVotes":"760,905","Awards":"7 wins & 27 nominations.","Metascore":"62","Released":"17 March 2006 (USA) ","Location":"Güterfelde, Stahnsdorf, Brandenburg, Germany ","Actors":"Hugo Weaving, Natalie Portman, Rupert Graves ","Writer":"Lilly Wachowski (screenplay) (as The Wachowski Brothers), Lana Wachowski (screenplay) (as The Wachowski Brothers) | 1 more credit »","Running_time":"PT132M / 2h 12min","Description":"Directed by James McTeigue.  With Hugo Weaving, Natalie Portman, Rupert Graves, Stephen Rea. In a future British tyranny, a shadowy freedom fighter, known only by the alias of \"V\", plots to overthrow it with the help of a young woman.","Rated":"R"}