{"imdbID":"tt0457430","Title":"Pan's Labyrinth","Year":"2006","Director":"Guillermo del Toro","Writer":"Guillermo del Toro","Taglines":"An imaginative gothic fairytale for adults set in Spain during World War II ","Country":"Spain, Mexico, USA","Language":"Spanish","Also_Known_As":"Pan's Labyrinth ","Budget":"€13,500,000 (estimated)","Opening_Weekend":"$501,691 (Mexico) (3 November 2006)","Gross":"$37,623,143 (USA) (8 June 2007)","Production_Co":"Estudios Picasso, Tequila Gang, Esperanto Filmoj ","":"Show detailed company contact information on IMDbPro »","Runtime":"118 min | 112 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Björk was so affected by this film that after seeing it, she went home and wrote the song \"Pneumonia\". See more »","Goofs":"When Ofelia bites her finger under her mother's bed, you can see the tube she is squeezing the blood out of. See more »","Crazy_Credits":"The two \"Stick Insects\" are credited as Cheech and Chong, after which it says \"MAY THEY REST IN PEACE\". See more »","Cast":"Ivana Baquero, Sergi López, Maribel Verdú, Doug Jones, Ariadna Gil, Álex Angulo, Manolo Solo, César Vea, Roger Casamajor, Ivan Massagué, Gonzalo Uriarte, Eusebio Lázaro, Francisco Vidal, Juanjo Cucalón, Lina Mira","Plot":"In the falangist Spain of 1944, the bookish young stepdaughter of a sadistic army officer escapes into an eerie but captivating fantasy world. In 1944 falangist Spain, a girl, fascinated with fairy-tales, is sent along with her pregnant mother to live with her new stepfather, a ruthless captain of the Spanish army. During the night, she meets a fairy who takes her to an old faun in the center of the labyrinth. He tells her she's a princess, but must prove her royalty by surviving three gruesome tasks. If she fails, she will never prove herself to be the the true princess and will never see her real father, the king, again. Written by Tim","Genre":"Drama, Fantasy, War","Keywords":"spain, fairy, princess, faun, fairy tale","imdbRating":"8.2","imdbVotes":"450,271","Awards":"Won 3 Oscars. Another 92 wins & 94 nominations.","Metascore":"98","Released":"19 January 2007 (USA) ","Location":"Spain ","Actors":"Ivana Baquero, Ariadna Gil, Sergi López ","Running_time":"PT118M / 1h 58min","Description":"Directed by Guillermo del Toro.  With Ivana Baquero, Ariadna Gil, Sergi López, Maribel Verdú. In the falangist Spain of 1944, the bookish young stepdaughter of a sadistic army officer escapes into an eerie but captivating fantasy world.","Rated":"R"}