{"imdbID":"tt0454921","Title":"The Pursuit of Happyness","Year":"2006","Director":"Gabriele Muccino","Writer":"Steve Conrad (as Steven Conrad)","Country":"USA","Language":"English, Cantonese","Budget":"$55,000,000 (estimated)","Gross":"$162,586,036 (USA) (23 February 2007)","Production_Co":"Columbia Pictures Corporation, Relativity Media, Overbrook Entertainment ","Runtime":"117 min","Cast":"Will Smith, Jaden Smith, Thandie Newton, Brian Howe, James Karen, Dan Castellaneta, Kurt Fuller, Takayo Fischer, Kevin West, George Cheung, David Michael Silverman, Domenic Bove, Geoff Callan, Joyful Raven, Scott Klace","Plot":"A struggling salesman takes custody of his son as he's poised to begin a life-changing professional endeavor. Based on a true story about a man named Christopher Gardner. Gardner has invested heavily in a device known as a \"Bone Density scanner\". He feels like he has made these devices. However, they do not sell as they are marginally better than the current technology at a much higher price. As Gardner tries to figure out how to sell them, his wife leaves him, he loses his house, his bank account, and credit cards. Forced to live out in the streets with his son, Gardner is now desperate to find a steady job; he takes on a job as a stockbroker, but before he can receive pay, he needs to go through 6 months of training, and to sell his devices. Written by John Wiggins","Genre":"Biography, Drama","Keywords":"internship, stockbroker, salesman, intern, bus","imdbRating":"7.9","imdbVotes":"325,887","Awards":"Nominated for 1 Oscar. Another 11 wins & 23 nominations.","Metascore":"64","Released":"15 December 2006 (USA) ","Location":"Alameda, California, USA ","Actors":"Will Smith, Thandie Newton, Jaden Smith ","Running_time":"PT117M / 1h 57min","Description":"Directed by Gabriele Muccino.  With Will Smith, Thandie Newton, Jaden Smith, Brian Howe. A struggling salesman takes custody of his son as he's poised to begin a life-changing professional endeavor.","Rated":"PG-13"}