{"imdbID":"tt0443272","Title":"Lincoln","Year":"2012","Director":"Steven Spielberg","Country":"USA, India","Language":"English","Budget":"$65,000,000 (estimated)","Gross":"$182,204,440 (USA) (19 April 2013)","Production_Co":"DreamWorks SKG, Twentieth Century Fox Film Corporation, Reliance Entertainment ","Runtime":"150 min","Cast":"Daniel Day-Lewis, Sally Field, David Strathairn, Joseph Gordon-Levitt, James Spader, Hal Holbrook, Tommy Lee Jones, John Hawkes, Jackie Earle Haley, Bruce McGill, Tim Blake Nelson, Joseph Cross, Jared Harris, Lee Pace, Peter McRobbie","Plot":"As the Civil War continues to rage, America's president struggles with continuing carnage on the battlefield as he fights with many inside his own cabinet on the decision to emancipate the slaves. In 1865, as the American Civil War winds inexorably toward conclusion, U.S. president Abraham Lincoln endeavors to achieve passage of the landmark constitutional amendment which will forever ban slavery from the United States. However, his task is a race against time, for peace may come at any time, and if it comes before the amendment is passed, the returning southern states will stop it before it can become law. Lincoln must, by almost any means possible, obtain enough votes from a recalcitrant Congress before peace arrives and it is too late. Yet the president is torn, as an early peace would save thousands of lives. As the nation confronts its conscience over the freedom of its entire population, Lincoln faces his own crisis of conscience -- end slavery or end the war. Written by Jim Beaver <jumblejim@prodigy.net>","Genre":"Biography, Drama, History","Keywords":"politics, slavery, president, u.s. president, civil war","imdbRating":"7.4","imdbVotes":"191,905","Awards":"Won 2 Oscars. Another 105 wins & 223 nominations.","Metascore":"86","Released":"16 November 2012 (USA) ","Location":"State Farm, Powhatan, Virginia, USA ","Actors":"Daniel Day-Lewis, Sally Field, David Strathairn ","Writer":"Tony Kushner (screenplay), Doris Kearns Goodwin (book)","Running_time":"PT150M / 2h 30min","Description":"Directed by Steven Spielberg.  With Daniel Day-Lewis, Sally Field, David Strathairn, Joseph Gordon-Levitt. As the Civil War continues to rage, America's president struggles with continuing carnage on the battlefield as he fights with many inside his own cabinet on the decision to emancipate the slaves.","Rated":"PG-13"}