{"imdbID":"tt0498380","Title":"Letters from Iwo Jima","Year":"2006","Director":"Clint Eastwood","Country":"USA","Language":"Japanese, English","Budget":"$19,000,000 (estimated)","Gross":"$13,753,931 (USA) (20 April 2007)","Production_Co":"DreamWorks SKG, Warner Bros., Malpaso Productions ","Runtime":"141 min","Cast":"Ken Watanabe, Kazunari Ninomiya, Tsuyoshi Ihara, Ryô Kase, Shidô Nakamura, Hiroshi Watanabe, Takumi Bando, Yuki Matsuzaki, Takashi Yamaguchi, Eijiro Ozaki, Nae, Nobumasa Sakagami, Lucas Elliot Eberl, Sonny Saito, Steve Santa Sekiyoshi","Plot":"The story of the battle of Iwo Jima between the United States and Imperial Japan during World War II, as told from the perspective of the Japanese who fought it. The island of Iwo Jima stands between the American military force and the home islands of Japan. Therefore the Imperial Japanese Army is desperate to prevent it from falling into American hands and providing a launching point for an invasion of Japan. General Tadamichi Kuribayashi is given command of the forces on the island and sets out to prepare for the imminent attack. General Kuribayashi, however, does not favor the rigid traditional approach recommended by his subordinates, and resentment and resistance fester among his staff. In the lower echelons, a young soldier, Saigo, a poor baker in civilian life, strives with his friends to survive the harsh regime of the Japanese army itself, all the while knowing that a fierce battle looms. When the American invasion begins, both Kuribayashi and Saigo find strength, honor, courage, and horrors beyond imagination. Written by Jim Beaver <jumblejim@prodigy.net>","Genre":"Drama, History, War","Keywords":"blood splatter, world war two, japan, island, general","imdbRating":"7.9","imdbVotes":"129,767","Awards":"Won 1 Oscar. Another 22 wins & 33 nominations.","Metascore":"89","Released":"2 February 2007 (USA) ","Location":"Iceland ","Actors":"Ken Watanabe, Kazunari Ninomiya, Tsuyoshi Ihara ","Writer":"Iris Yamashita (screenplay), Iris Yamashita (story) | 3 more credits »","Running_time":"PT141M / 2h 21min","Description":"Directed by Clint Eastwood.  With Ken Watanabe, Kazunari Ninomiya, Tsuyoshi Ihara, Ryô Kase. The story of the battle of Iwo Jima between the United States and Imperial Japan during World War II, as told from the perspective of the Japanese who fought it.","Rated":"R"}