{"imdbID":"tt0414055","Title":"Elizabeth: The Golden Age","Year":"2007","Director":"Shekhar Kapur","Country":"UK, France, Germany, USA","Language":"English, Spanish, Swedish","Budget":"$55,000,000 (estimated)","Gross":"£4,856,733 (UK) (30 November 2007)","Production_Co":"Universal Pictures, StudioCanal, Working Title Films ","Runtime":"114 min","Cast":"Jordi Mollà, Aimee King, Cate Blanchett, Laurence Fox, John Shrapnel, Geoffrey Rush, Susan Lynch, Elise McCave, Samantha Morton, Abbie Cornish, Penelope McGhie, Rhys Ifans, Eddie Redmayne, Stuart McLoughlin, Clive Owen","Plot":"A mature Queen Elizabeth endures multiple crises late in her reign including court intrigues, an assassination plot, the Spanish Armada, and romantic disappointments. Two faiths, two empires, two rulers - colliding in 1588. Papist Spain wants to bring down the heretic Elizabeth. Philip is building an armada but needs a rationale to attack. With covert intrigue, Spain sets a trap for the Queen and her principal secretary, Walsingham, using as a pawn Elizabeth's cousin Mary Stuart, who's under house arrest in the North. The trap springs, and the armada sets sail, to rendezvous with French ground forces and to attack. During these months, the Virgin Queen falls in love with Walter Raleigh, keeping him close to court and away from the sea and America. Is treachery or heroism at his heart? Does loneliness await her passionate majesty? Written by <jhailey@hotmail.com>","Genre":"Biography, Drama, History","Keywords":"queen, spain, intrigue, court, virgin","imdbRating":"6.9","imdbVotes":"53,461","Awards":"Won 1 Oscar. Another 5 wins & 29 nominations.","Metascore":"45","Released":"12 October 2007 (USA) ","Location":"Baddesley Clinton, Warwickshire, England, UK ","Actors":"Cate Blanchett, Clive Owen, Geoffrey Rush ","Writer":"William Nicholson, Michael Hirst","Running_time":"PT114M / 1h 54min","Description":"Directed by Shekhar Kapur.  With Cate Blanchett, Clive Owen, Geoffrey Rush, Jordi Mollà. A mature Queen Elizabeth endures multiple crises late in her reign including court intrigues, an assassination plot, the Spanish Armada, and romantic disappointments.","Rated":"PG-13"}