{"imdbID":"tt0460791","Title":"The Fall","Year":"2006","Director":"Tarsem Singh (as Tarsem)","Taglines":"A Little Blessing In Disguise.","Country":"USA, India","Language":"English, Romanian, Latin","Also_Known_As":"Pad ","Opening_Weekend":"$79,611 (USA) (9 May 2008)","Gross":"$2,280,348 (USA) (1 January 2010)","Production_Co":"Googly Films, Absolute Entertainment (II), Deep Films ","Runtime":"117 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Black and White | Color","Aspect_Ratio":"1.85 : 1","Trivia":"For the scenes of Alexander the Great that were shot in Rome, a production assistant is doubling for Kim Uylenbroek. See more »","Goofs":"When Alexandria brings Roy the communion wafer she takes a big bite leaving nothing but a sliver left but in the next shot she offers the rest to Ron and it is much bigger than it was when she took a bite. See more »","Cast":"Catinca Untaru, Justine Waddell, Lee Pace, Kim Uylenbroek, Aiden Lithgow, Sean Gilder, Ronald France, Andrew Roussouw, Michael Huff, Grant Swanby, Emil Hostina, Robin Smith, Jeetu Verma, Leo Bill, Marcus Wesley","Plot":"In a hospital on the outskirts of 1920s Los Angeles, an injured stuntman begins to tell a fellow patient, a little girl with a broken arm, a fantastic story of five mythical heroes. Thanks to his fractured state of mind and her vivid imagination, the line between fiction and reality blurs as the tale advances. At a Los Angeles hospital in the 1920s, Alexandria is a child recovering from a broken arm. She befriends Roy Walker, a movie stunt man with legs paralyzed after a fall. At her request, Roy tells her an elaborate story about six men of widely varied backgrounds who are on a quest to kill a corrupt provincial governor. Between chapters of the story, Roy inveigles Alexandria to scout the hospital's pharmacy for morphine. As Roy's fantastic tale nears its end, Death seems close at hand. Written by <jhailey@hotmail.com>","Genre":"Adventure, Drama, Fantasy","Keywords":"hospital, girl, governor, indian, bandit","imdbRating":"7.9","imdbVotes":"86,474","Awards":"3 wins & 9 nominations.","Metascore":"64","Released":"30 May 2008 (USA) ","Location":"Taj Lake Palace, Lake Pichola, Udaipur, Rajasthan, India ","Actors":"Lee Pace, Catinca Untaru, Justine Waddell ","Writer":"Dan Gilroy (screenplay), Nico Soultanakis (screenplay) | 2 more credits »","Running_time":"PT117M / 1h 57min","Description":"Directed by Tarsem Singh.  With Lee Pace, Catinca Untaru, Justine Waddell, Kim Uylenbroek. In a hospital on the outskirts of 1920s Los Angeles, an injured stuntman begins to tell a fellow patient, a little girl with a broken arm, a fantastic story of five mythical heroes. Thanks to his fractured state of mind and her vivid imagination, the line between fiction and reality blurs as the tale advances.","Rated":"R"}