{"imdbID":"tt0408306","Title":"Munich","Year":"2005","Director":"Steven Spielberg","Country":"France, Canada, USA","Language":"English, German, French, Hebrew, Arabic, Italian, Greek, Russian","Budget":"$70,000,000 (estimated)","Gross":"$47,379,090 (USA) (24 March 2006)","Production_Co":"DreamWorks SKG, Universal Pictures, Amblin Entertainment ","Runtime":"164 min | 163 min (cut)","Cast":"Eric Bana, Daniel Craig, Ciarán Hinds, Mathieu Kassovitz, Hanns Zischler, Ayelet Zurer, Geoffrey Rush, Gila Almagor, Michael Lonsdale, Mathieu Amalric, Moritz Bleibtreu, Valeria Bruni Tedeschi, Meret Becker, Marie-Josée Croze, Yvan Attal","Plot":"Based on the true story of the Black September aftermath, about the five men chosen to eliminate the ones responsible for that fateful day. After Black September's assassination of Israeli athletes at the Munich Olympics in 1972, Prime Minister Golda Meir okays a black-box operation to hunt down and kill all involved. A team of five gathers in Switzerland led by Avner, a low-level Mossad techie whose father was a war hero and whose wife is pregnant. It's an expendable team, but relying on paid informants, they track and kill several in Europe and Lebanon. They must constantly look over their shoulders for the CIA, KGB, PLO, and their own sources. As the body count mounts -- with retribution following retribution -- so do questions, doubts, and sleepless nights. Loyalties blur. What does it mean to be a Jew? Written by <jhailey@hotmail.com>","Genre":"Drama, History, Thriller","Keywords":"black september, arab, munich olympics, jew, bangladesh","imdbRating":"7.6","imdbVotes":"173,116","Awards":"Nominated for 5 Oscars. Another 12 wins & 57 nominations.","Metascore":"74","Released":"6 January 2006 (USA) ","Location":"Aulich Street, Budapest, Hungary ","Actors":"Eric Bana, Daniel Craig, Marie-Josée Croze ","Writer":"Tony Kushner (screenplay), Eric Roth (screenplay) | 1 more credit »","Running_time":"PT164M / 2h 44min","Description":"Directed by Steven Spielberg.  With Eric Bana, Daniel Craig, Marie-Josée Croze, Ciarán Hinds. Based on the true story of the Black September aftermath, about the five men chosen to eliminate the ones responsible for that fateful day.","Rated":"R"}