{"imdbID":"tt0449467","Title":"Babel","Year":"2006","Director":"Alejandro González Iñárritu","Country":"France, USA, Mexico","Language":"English, Arabic, Spanish, Japanese, Berber languages, French, Russian, Japanese Sign Language","Budget":"$25,000,000 (estimated)","Gross":"$34,300,771 (USA) (23 March 2007)","Production_Co":"Paramount Pictures, Paramount Vantage, Anonymous Content ","Runtime":"143 min","Cast":"Brad Pitt, Cate Blanchett, Mohamed Akhzam, Peter Wight, Harriet Walter, Trevor Martin, Matyelok Gibbs, Georges Bousquet, Claudine Acs, André Oumansky, Michael Maloney, Dermot Crowley, Wendy Nottingham, Henry Maratray, Linda Broughton","Plot":"Tragedy strikes a married couple on vacation in the Moroccan desert, touching off an interlocking story involving four different families. 4 interlocking stories all connected by a single gun all converge at the end and reveal a complex and tragic story of the lives of humanity around the world and how we truly aren't all that different. In Morocco, a troubled married couple are on vacation trying to work out their differences. Meanwhile, a Moroccan herder buys a rifle for his sons so they can keep the jackals away from his herd. A girl in Japan dealing with rejection, the death of her mother, the emotional distance of her father, her own self-consciousness, and a disability among many other issues, deals with modern life in the enormous metropolis of Tokyo, Japan. Then, on the opposite side of the world the married couple's Mexican nanny takes the couple's 2 children with her to her son's wedding in Mexico, only to come into trouble on the return trip. Combined, it provides a powerful story and an equally powerful looking glass into the lives of seemingly random people around the world and it shows just how connected we... Written by Mac","Genre":"Drama","Keywords":"american, mexican border, destiny, multiple perspectives, muslim","imdbRating":"7.5","imdbVotes":"238,531","Awards":"Won 1 Oscar. Another 41 wins & 124 nominations.","Metascore":"69","Released":"10 November 2006 (USA) ","Location":"Shibuya-ku, Tokyo, Japan ","Actors":"Brad Pitt, Cate Blanchett, Gael García Bernal ","Writer":"Guillermo Arriaga, Guillermo Arriaga (idea) | 1 more credit »","Running_time":"PT143M / 2h 23min","Description":"Directed by Alejandro González Iñárritu.  With Brad Pitt, Cate Blanchett, Gael García Bernal, Mohamed Akhzam. Tragedy strikes a married couple on vacation in the Moroccan desert, touching off an interlocking story involving four different families.","Rated":"R"}