{"imdbID":"tt0469494","Title":"There Will Be Blood","Year":"2007","Director":"Paul Thomas Anderson","Taglines":"There Will Be Greed. There Will Be Vengeance. ","Country":"USA","Language":"English, American Sign Language","Also_Known_As":"Oil! ","Budget":"$25,000,000 (estimated)","Opening_Weekend":"$302,845 (USA) (28 December 2007)","Gross":"$40,218,903 (USA) (25 April 2008)","Production_Co":"Paramount Vantage, Miramax, Ghoulardi Film Company ","":"Show detailed company contact information on IMDbPro »","Runtime":"158 min","Sound_Mix":"SDDS | Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Paul F Tompkin's line \"We gain nothing by losing our heads.\" was improvised. See more »","Goofs":"When Eli enters Daniel's office to ask about the blessing, as he starts to sit down his hands are starting to tent together, but when the camera changes his hands are at his side and when only after he sits down does he tent his fingers. See more »","Crazy_Credits":"There are no opening credits, except for the title See more »","Cast":"Daniel Day-Lewis, Martin Stringer, Matthew Braden Stringer, Jacob Stringer, Joseph Mussey, Barry Del Sherman, Harrison Taylor, Stockton Taylor, Paul F. Tompkins, Dillon Freasier, Kevin Breznahan, Jim Meskimen, Erica Sullivan, Randall Carver, Coco Leigh","Plot":"A story of family, religion, hatred, oil and madness, focusing on a turn-of-the-century prospector in the early days of the business. The intersecting life stories of Daniel Plainview and Eli Sunday in early twentieth century California presents miner-turned-oilman Daniel Plainview, a driven man who will do whatever it takes to achieve his goals. He works hard but also takes advantage of those around him at their expense if need be. His business partner/son (H.W.) is, in reality, an \"acquired\" child whose true biological single-parent father (working on one of Daniel's rigs) died in a workplace accident. Daniel is deeply protective of H.W. if only for what H.W. brings to the partnership. Eli Sunday is one in a pair of twins whose family farm Daniel purchases for the major oil deposit located on it. Eli, a local preacher and a self-proclaimed faith healer, wants the money from the sale of the property to finance his own church. The lives of the two competitive men often clash as Daniel pumps oil off the property and tries to acquire all the surrounding land at bargain prices to be able to build a pipeline to the ... Written by Huggo / edited by statmanjeff","Genre":"Drama","Keywords":"oil, alcoholic, alcoholism, turn of the century, building collapse","imdbRating":"8.1","imdbVotes":"358,587","Awards":"Won 2 Oscars. Another 105 wins & 130 nominations.","Metascore":"92","Released":"25 January 2008 (USA) ","Location":"Shafter, Texas, USA ","Actors":"Daniel Day-Lewis, Paul Dano, Ciarán Hinds ","Writer":"Paul Thomas Anderson (screenplay), Upton Sinclair (novel)","Running_time":"PT158M / 2h 38min","Description":"Directed by Paul Thomas Anderson.  With Daniel Day-Lewis, Paul Dano, Ciarán Hinds, Martin Stringer. A story of family, religion, hatred, oil and madness, focusing on a turn-of-the-century prospector in the early days of the business.","Rated":"R"}