{"imdbID":"tt0443543","Title":"The Illusionist","Year":"2006","Director":"Neil Burger","Taglines":"Nothing is what it seems","Country":"USA, Czech Republic","Language":"English","Also_Known_As":"El ilusionista ","Budget":"$16,000,000 (estimated)","Opening_Weekend":"$927,956 (USA) (18 August 2006)","Gross":"£161,900 (UK) (20 August 2010)","Production_Co":"Bull's Eye Entertainment, Bob Yari Productions, Contagious Entertainment ","Runtime":"110 min","Sound_Mix":"SDDS | Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Although the story is fictional, some of the details are based on the life of Austrian Crown Prince Rudolf, only son of Emperor Franz Josef. The painting of the emperor which Eisenheim creates is an actual portrait of Franz Josef. The bodies of Rudolf and his mistress, the Baroness Mary Vetsera, were found at his hunting lodge Mayerling on January 30, 1889 in what is now known as the \"Mayerling Incident\". This was initially covered up by the Imperial Family, creating controversy and mystery. See more »","Goofs":"When Norton's character gives the coins to the street urchins, the first coin is visible in his hand before the trick. See more »","Cast":"Edward Norton, Paul Giamatti, Jessica Biel, Rufus Sewell, Eddie Marsan, Jake Wood, Tom Fisher, Aaron Taylor-Johnson, Eleanor Tomlinson, Karl Johnson, Vincent Franklin, Nicholas Blane, Philip McGough, Erich Redman, Michael Carter","Plot":"In turn-of-the-century Vienna, a magician uses his abilities to secure the love of a woman far above his social standing. In late nineteenth century Vienna, renowned illusionist Eisenheim is reunited with the Duchess von Teschen when she is volunteered from the audience to participate in an illusion during one of his performances. Despite having not seen each other in fifteen years when they were teenagers, they almost immediately recognize each other as Eduard Abramovich and Sophie von Teschen, they who had a doomed romance at that time due to their class differences. The Duchess is soon to be wed to the Crown Prince Leopold in what would be for him a marriage solely in pursuit of power: overthrowing his father, the Emperor Leopold, as well as overtaking the Hungarian side of the empire. The Crown Prince is known to use violence against women if it suits his needs or purposes. As such, the Duchess, who realizes that she still loves Eisenheim and he her, can never leave the Crown Prince without it jeopardizing her life. After Eisenheim humiliates the Crown Prince at a private show which results in an ... Written by Huggo","Genre":"Drama, Mystery, Romance","Keywords":"magician, prince, duchess, love, supernatural power","imdbRating":"7.6","imdbVotes":"285,699","Awards":"Nominated for 1 Oscar. Another 10 wins & 8 nominations.","Metascore":"68","Released":"1 September 2006 (USA) ","Location":"Prague Castle, Hradcany, Prague, Czech Republic ","Actors":"Edward Norton, Jessica Biel, Paul Giamatti ","Writer":"Neil Burger (screenplay), Steven Millhauser (short story \"Eisenheim the Illusionist\")","Running_time":"PT110M / 1h 50min","Description":"Directed by Neil Burger.  With Edward Norton, Jessica Biel, Paul Giamatti, Rufus Sewell. In turn-of-the-century Vienna, a magician uses his abilities to secure the love of a woman far above his social standing.","Rated":"PG-13"}