{"imdbID":"tt0446059","Title":"Fearless","Year":"2006","Director":"Ronny Yu","Taglines":"Fate Made Him A Warrior, Courage Made Him A Hero ","Country":"China, Hong Kong","Language":"English, Mandarin","Also_Known_As":"Fearless ","Opening_Weekend":"$877,607 (Hong Kong) (3 February 2006)","Gross":"$24,623,719 (USA) (10 November 2006)","Production_Co":"Beijing Film Studio, China Film Co-Production Corporation, China Film Group ","Runtime":"104 min | 141 min (Director's cut)","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The character played by Brandon Rhea in the film, was based upon a German military attaché who was based in China at the turn of the 20th Century and had a background in German fencing and weapons techniques. See more »","Goofs":"Though the film takes place in 1910 and before, the western fencer Li faces in the beginning of the film uses a cavalry sword designed by George S. Patton in 1913. While very similar in design to earlier British cavalry swords, the Patton saber is readily recognizable by the lack painted hilt. See more »","Cast":"Jet Li, Li Sun, Yong Dong, Yun Qu, Ailing Xu, Collin Chou, Hee Ching Paw, Nathan Jones, Shidô Nakamura, Brandon Rhea, Anthony De Longis, Jean Claude Leuyer, Zhi-Hui Chen, Jacky Heung, Zhigang Zhao","Plot":"A biography of Chinese Martial Arts Master Huo Yuanjia, who is the founder and spiritual guru of the Jin Wu Sports Federation. Martial arts legend Huo Yuanjia became the most famous fighter in all of China at the turn of the 20th Century. Huo faced personal tragedy but ultimately fought his way out of darkness and into history, defining the true spirit of martial arts. His self-discovery, and the choices he made, inspired his nation. The son of a great fighter who did not wish for his child to follow in his footsteps, the bullied Huo Yuanjia resolves to teach himself how to fight - and win. Years of training enable him to ace match after match in his home region of Tianjin. But as his fame as a martial arts master grows, so does his pride. After an ill-advised fight leads to another master's death, members of Huo's family are slain in revenge. Grieving and ashamed, Huo wanders the country in shock. Near death, he is rescued by women from an idyllic village, and is offered simple kindness and generosity that help him heal and regain his equilibrium over a period of several years. Huo realizes that the future ... Written by Rogue Pictures","Genre":"Action, Biography, Drama","Keywords":"fight, martial arts master, fighting, martial artist, redemption","imdbRating":"7.7","imdbVotes":"61,073","Awards":"5 wins & 12 nominations.","Metascore":"70","Released":"22 September 2006 (USA) ","Location":"Shanghai, China","Actors":"Jet Li, Li Sun, Yong Dong ","Writer":"Chris Chow, Richard Epcar (dubbed version) | 1 more credit »","Running_time":"PT104M / 1h 44min","Description":"Directed by Ronny Yu.  With Jet Li, Li Sun, Yong Dong, Yun Qu. A biography of Chinese Martial Arts Master Huo Yuanjia, who is the founder and spiritual guru of the Jin Wu Sports Federation.","Rated":"PG-13"}