{"imdbID":"tt0405159","Title":"Million Dollar Baby","Year":"2004","Director":"Clint Eastwood","Taglines":"Beyond his silence, there is a past. Beyond her dreams, there is a feeling. Beyond hope, there is a memory. Beyond their journey, there is a love.","Country":"USA","Language":"English, Irish","Also_Known_As":"Rope Burns ","Budget":"$30,000,000 (estimated)","Opening_Weekend":"$179,953 (USA) (17 December 2004)","Gross":"$100,422,786 (USA) (3 June 2005)","Production_Co":"Warner Bros., Lakeshore Entertainment, Malpaso Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"132 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Anjelica Huston originally brought the book \"Rope Burns\" to producer Albert S. Ruddy's attention, hoping that he would ask her to direct the film. (She guaranteed that he would cry after reading the \"Million Dollar Baby\" story, and he admits that he did.) However, by the time Ruddy acquired the rights, Huston was busy on another project. See more »","Goofs":"When Maggie is taking her mother to the new home she just bought her, there are palm trees around the other houses in the neighborhood. This scene is supposed to be in a small town in Missouri, where palm trees do not grow. See more »","Crazy_Credits":"The Warner Brothers logo is the classic shield version, shown in a color palette (mainly black and white, with a dark green tint) matching the \"feel\" of the movie, and is static instead of the modern 3D animated sequence. See more »","Cast":"Clint Eastwood, Hilary Swank, Morgan Freeman, Jay Baruchel, Mike Colter, Lucia Rijker, Brían F. O'Byrne, Anthony Mackie, Margo Martindale, Riki Lindhome, Michael Peña, Benito Martinez, Bruce MacVittie, David Powledge, Joe D'Angerio","Plot":"A determined woman works with a hardened boxing trainer to become a professional. Wanting to learn from the best, aspiring boxer Maggie Fitzgerald wants Frankie Dunn to train her. At the outset he flatly refuses saying he has no interest in training a girl. Frankie leads a lonely existence, alienated from his only daughter and having few friends. She's rough around the edges but shows a lot of grit in the ring and he eventually relents. Maggie not only proves to be the boxer he always dreamed of having under his wing but a friend who fills the great void he's had in his life. Maggie's career skyrockets but an accident in the ring leads her to ask Frankie for one last favor. Written by garykmcd","Genre":"Drama, Sport","Keywords":"boxing, boxing trainer, women boxing, death, suicide attempt","imdbRating":"8.1","imdbVotes":"463,940","Awards":"Won 4 Oscars. Another 60 wins & 77 nominations.","Metascore":"86","Released":"28 January 2005 (USA) ","Location":"Hollywood Athletic Club - 6525 W. Sunset Blvd., Hollywood, Los Angeles, California, USA ","Actors":"Hilary Swank, Clint Eastwood, Morgan Freeman ","Writer":"Paul Haggis (screenplay), F.X. Toole (stories)","Running_time":"PT132M / 2h 12min","Description":"Directed by Clint Eastwood.  With Hilary Swank, Clint Eastwood, Morgan Freeman, Jay Baruchel. A determined woman works with a hardened boxing trainer to become a professional.","Rated":"PG-13"}