{"imdbID":"tt0470752","Title":"Ex Machina","Year":"2015","Director":"Alex Garland","Writer":"Alex Garland","Taglines":"To erase the line between man and machine is to obscure the line between men and gods ","Country":"UK","Language":"English","Also_Known_As":"Eks mašina ","Budget":"$15,000,000 (estimated)","Opening_Weekend":"$250,000 (USA) (10 April 2015)","Gross":"$25,440,971 (USA) (28 August 2015)","Production_Co":"DNA Films, Film4, Universal Pictures ","Runtime":"108 min","Sound_Mix":"Dolby Digital | SDDS | Datasat","Color":"Black and White (some shots)| Color","Aspect_Ratio":"2.35 : 1","Trivia":"Even though the movie stars famous Swedish actress Alicia Vikander, the movie was never shown in regular Swedish cinemas. The cause of this was said to be a lack of quality and not enough potential for screenings. See more »","Goofs":"Nathan repeats thrice the Bhagavad Gita quote \"In sleep, in confusion, in the depths of shame, the good deeds a man has done before defend him\". On the second and third recitement, however, he says 'defends' instead of 'defend'. As the sentence subject is the plural 'good deeds', this creates a case of subject-verb disagreement. This may, arguably, be an intentional mistake by an intoxicated character. See more »","Cast":"Domhnall Gleeson, Corey Johnson, Oscar Isaac, Alicia Vikander, Sonoya Mizuno, Claire Selby, Symara A. Templeman, Gana Bayarsaikhan, Tiffany Pisani, Elina Alminas","Plot":"A young programmer is selected to participate in a ground-breaking experiment in synthetic intelligence by evaluating the human qualities of a breath-taking humanoid A.I. Caleb, a 26 year old coder at the world's largest internet company, wins a competition to spend a week at a private mountain retreat belonging to Nathan, the reclusive CEO of the company. But when Caleb arrives at the remote location he finds that he will have to participate in a strange and fascinating experiment in which he must interact with the world's first true artificial intelligence, housed in the body of a beautiful robot girl. Written by DNA FILMS","Genre":"Drama, Mystery, Sci-Fi","Keywords":"artificial intelligence, robot human relationship, robot, turing test, video surveillance","imdbRating":"7.7","imdbVotes":"252,852","Awards":"Won 1 Oscar. Another 57 wins & 124 nominations.","Metascore":"78","Released":"24 April 2015 (USA) ","Location":"Pinewood Studios, Iver Heath, Buckinghamshire, England, UK ","Actors":"Alicia Vikander, Domhnall Gleeson, Oscar Isaac ","Running_time":"PT108M / 1h 48min","Description":"Directed by Alex Garland.  With Alicia Vikander, Domhnall Gleeson, Oscar Isaac, Sonoya Mizuno. A young programmer is selected to participate in a ground-breaking experiment in synthetic intelligence by evaluating the human qualities of a breath-taking humanoid A.I.","Rated":"R"}