{"imdbID":"tt0491747","Title":"Away from Her","Year":"2006","Director":"Sarah Polley","Country":"Canada, UK, USA","Language":"English","Budget":"CAD 4,000,000 (estimated)","Gross":"$15,830,046 (USA) (13 July 2007)","Production_Co":"Foundry Films, Capri Releasing, HanWay Films ","Runtime":"110 min","Cast":"Gordon Pinsent, Stacey LaBerge, Julie Christie, Olympia Dukakis, Deanna Dezmari, Clare Coulter, Thomas Hauff, Alberta Watson, Grace Lynn Kung, Lili Francks, Andrew Moodie, Wendy Crewson, Judy Sinclair, Tom Harvey, Carolyn Hetherington","Plot":"A man coping with the institutionalization of his wife because of Alzheimer's disease faces an epiphany when she transfers her affections to another man, Aubrey, a wheelchair-bound mute who also is a patient at the nursing home. Grant and Fiona Anderson have been married for forty-four years. Their marriage has been a generally happy and loving one although not perfect due to some indiscretions when Grant was working as a college professor. Fiona has just been admitted to Meadowlake, a long term care facility near their country home in southwestern Ontario, because her recent lapses of memory have been diagnosed as a probable case of Alzheimer's disease. She and Grant made this decision together, although a still lucid Fiona seems to have made peace with the decision and her diagnosis more so than Grant. With respect to the facility, what Grant has the most difficulty with are what he sees as the sadness associated with the facility's second floor - where the more advanced cases are housed - but most specifically the facility's policy of no visitors within the first thirty days of admission to allow the patient to adjust more easily to their new life there. Based on what he sees when he is finally able to ... Written by Huggo","Genre":"Drama","Keywords":"nursing home, alzheimer's disease, wheelchair, love, lost","imdbRating":"7.6","imdbVotes":"18,740","Awards":"Nominated for 2 Oscars. Another 63 wins & 37 nominations.","Metascore":"88","Released":"25 May 2007 (USA) ","Location":"Freeport Health Centre, Kitchener, Ontario, Canada ","Actors":"Julie Christie, Michael Murphy, Gordon Pinsent ","Writer":"Sarah Polley, Alice Munro (short story \"The Bear Came Over the Mountain\")","Running_time":"PT110M / 1h 50min","Description":"Directed by Sarah Polley.  With Julie Christie, Michael Murphy, Gordon Pinsent, Stacey LaBerge. A man coping with the institutionalization of his wife because of Alzheimer's disease faces an epiphany when she transfers her affections to another man, Aubrey, a wheelchair-bound mute who also is a patient at the nursing home.","Rated":"PG-13"}