{"imdbID":"tt0401383","Title":"The Diving Bell and the Butterfly","Year":"2007","Director":"Julian Schnabel","Taglines":"Let your imagination set you free","Country":"France, USA","Language":"French","Also_Known_As":"The Diving Bell and the Butterfly ","Opening_Weekend":"$75,721 (USA) (30 November 2007)","Gross":"$5,990,075 (USA) (4 April 2008)","Production_Co":"Pathé Renn Productions, France 3 Cinéma, Kennedy/Marshall Company, The ","":"Show detailed company contact information on IMDbPro »","Runtime":"112 min","Sound_Mix":"DTS | Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The script was originally in English and Johnny Depp was cast to play Jean-Dominique Bauby. He dropped out because it conflicted with filming of \"Pirates of the Caribbean: At World's End.\" Gary Oldman was also in consideration. But eventually, director Julian Schnabel convinced the studio (Pathé, a French studio founded in Paris) to change the language to French to stay true to Bauby's life and story. See more »","Goofs":"Jean-Dominique shaves his father's mustache, removing the shaving cream. In the next shot, his mustache is covered with shaving cream again. In the following shot, the shaving cream is gone again. See more »","Cast":"Mathieu Amalric, Emmanuelle Seigner, Marie-Josée Croze, Anne Consigny, Patrick Chesnais, Niels Arestrup, Olatz López Garmendia, Jean-Pierre Cassel, Marina Hands, Max von Sydow, Gérard Watkins, Théo Sampaio, Fiorella Campanella, Talina Boyaci, Isaach De Bankolé","Plot":"The true story of Elle editor Jean-Dominique Bauby who suffers a stroke and has to live with an almost totally paralyzed body; only his left eye isn't paralyzed. Forty-three year old Elle magazine editor Jean-Dominique Bauby - Jean-Do to his friends - awakens not knowing where he is. He is in a Berck-sur-Mer hospital, where he has been for the past several weeks in a coma after suffering a massive stroke. Although his cognitive facilities are in tact, he quickly learns that he has what is called locked-in syndrome which has resulted in him being almost completely paralyzed, including not being able to speak. One of his few functioning muscles is his left eye. His physical situation and hospitalization uncomfortably bring together the many people in his life, including: Céline Desmoulins, his ex-lover and mother of his children; Inès, his current lover; and his aged father who he calls Papinou. Among his compassionate recuperative team are his physical therapist Marie, and his speech therapist Henriette. Henriette eventually teaches him to communicate using a system where he spells out words: she reads out the letters of the alphabet in ... Written by Huggo","Genre":"Biography, Drama","Keywords":"male frontal nudity, eye, editor, stroke, book","imdbRating":"8.0","imdbVotes":"88,207","Awards":"Nominated for 4 Oscars. Another 65 wins & 90 nominations.","Metascore":"92","Released":"1 February 2008 (USA) ","Location":"France ","Actors":"Mathieu Amalric, Emmanuelle Seigner, Marie-Josée Croze ","Writer":"Ronald Harwood (screenplay), Jean-Dominique Bauby (book)","Running_time":"PT112M / 1h 52min","Description":"Directed by Julian Schnabel.  With Mathieu Amalric, Emmanuelle Seigner, Marie-Josée Croze, Anne Consigny. The true story of Elle editor Jean-Dominique Bauby who suffers a stroke and has to live with an almost totally paralyzed body; only his left eye isn't paralyzed.","Rated":"PG-13"}