{"imdbID":"tt0425210","Title":"Lucky Number Slevin","Year":"2006","Director":"Paul McGuigan","Writer":"Jason Smilovic","Taglines":"Your Numbers up, February 06 ","Country":"Germany, USA","Language":"English","Also_Known_As":"Lucky # Slevin ","Opening_Weekend":"£1,074,550 (UK) (24 February 2006)","Gross":"$871,360 (Australia) (17 November 2006)","Production_Co":"Weinstein Company, The, Ascendant Pictures, FilmEngine ","Runtime":"110 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"On promotional material for the film, Ben Kingsley's credit included his knighthood. At first, the actor was singled out for some criticism as such things are usually omitted from professional credits. It transpired that this was a mistake by a studio executive, who was unfamiliar with the British honours system. See more »","Goofs":"When Max and his son are in the car discussing their cover story, Henry mentions that one of the players was Jesse Gonder. This flashback takes place in 1979, but Gonder played his last MLB game in 1967. See more »","Cast":"Josh Hartnett, Bruce Willis, Lucy Liu, Morgan Freeman, Ben Kingsley, Michael Rubenfeld, Peter Outerbridge, Stanley Tucci, Kevin Chamberlin, Dorian Missick, Mykelti Williamson, Scott Gibson, Daniel Kash, Dmitry Chepovetsky, Sam Jaeger","Plot":"A case of mistaken identity lands Slevin into the middle of a war being plotted by two of the city's most rival crime bosses: The Rabbi and The Boss. Slevin is under constant surveillance by relentless Detective Brikowski as well as the infamous assassin Goodkat and finds himself having to hatch his own ingenious plot to get them before they get him. In an airport waiting room, a man in a wheelchair tells a stranger a story about a fixed horse race in 1979 that resulted in a family's deaths. In Manhattan, two bookies and the son of a Mob boss die. A young man just out of the shower answers the door to a neighbor woman and explains that he's visiting, has had a bad week, including being mugged, and doesn't know where his pal, who lives there, is. The neighbor is chatty; she's a coroner. Two thugs arrive and, believing the visitor to be the guy who lives there, take him to see the boss with the dead son, who tells him to kill the son of his Mob rival. Mistaken identity? What connects the threads? Cops are watching. Written by <jhailey@hotmail.com>","Genre":"Crime, Drama, Mystery","Keywords":"mistaken identity, death, coroner, love, gay son","imdbRating":"7.8","imdbVotes":"256,707","Awards":"5 wins & 4 nominations.","Metascore":"53","Released":"7 April 2006 (USA) ","Location":"Abingdon Square Park, Manhattan, New York City, New York, USA ","Actors":"Josh Hartnett, Ben Kingsley, Morgan Freeman ","Running_time":"PT110M / 1h 50min","Description":"Directed by Paul McGuigan.  With Josh Hartnett, Ben Kingsley, Morgan Freeman, Lucy Liu. A case of mistaken identity lands Slevin into the middle of a war being plotted by two of the city's most rival crime bosses: The Rabbi and The Boss. Slevin is under constant surveillance by relentless Detective Brikowski as well as the infamous assassin Goodkat and finds himself having to hatch his own ingenious plot to get them before they get him.","Rated":"R"}