{"imdbID":"tt0478134","Title":"In the Valley of Elah","Year":"2007","Director":"Paul Haggis","Country":"USA","Language":"English","Gross":"$6,777,589 (USA) (15 February 2008)","Production_Co":"Warner Independent Pictures (WIP), NALA Films, Summit Entertainment ","Runtime":"121 min","Cast":"Tommy Lee Jones, Charlize Theron, Jason Patric, Susan Sarandon, James Franco, Barry Corbin, Josh Brolin, Frances Fisher, Wes Chatham, Jake McLaughlin, Mehcad Brooks, Jonathan Tucker, Wayne Duvall, Roman Arabia, Brent Briscoe","Plot":"A retired military investigator works with a police detective to uncover the truth behind his son's disappearance following his return from a tour of duty in Iraq. In Monroe, Tennessee, Hank Deerfield, an aging warrior, gets a call that his son, just back from 18 months' fighting in Iraq, is missing from his base. Hank drives to Fort Rudd, New Mexico, to search. Within a day, the charred and dismembered body of his son is found on the outskirts of town. Deerfield pushes himself into the investigation, marked by jurisdictional antagonism between the Army and local police. Working mostly with a new detective, Emily Sanders, Hank seems to close in on what happened. Major smuggling? A drug deal gone awry? Credit card slips, some photographs, and video clips from Iraq may hold the key. If Hank gets to the truth, what will it tell him? Written by <jhailey@hotmail.com>","Genre":"Crime, Drama, Mystery","Keywords":"murder investigation, iraq, military, police, detective","imdbRating":"7.2","imdbVotes":"59,012","Awards":"Nominated for 1 Oscar. Another 2 wins & 14 nominations.","Metascore":"65","Released":"28 September 2007 (USA) ","Location":"USA ","Actors":"Tommy Lee Jones, Charlize Theron, Jonathan Tucker ","Writer":"Paul Haggis (screenplay), Mark Boal (story) | 1 more credit »","Running_time":"PT121M / 2h 1min","Description":"Directed by Paul Haggis.  With Tommy Lee Jones, Charlize Theron, Jonathan Tucker, Jason Patric. A retired military investigator works with a police detective to uncover the truth behind his son's disappearance following his return from a tour of duty in Iraq.","Rated":"R"}