{"imdbID":"tt0454876","Title":"Life of Pi","Year":"2012","Director":"Ang Lee","Country":"USA, Taiwan, UK","Language":"English, Tamil, French, Japanese, Hindi, Chinese","Also_Known_As":"Una aventura extraordinaria ","Budget":"$120,000,000 (estimated)","Opening_Weekend":"$22,451,514 (USA) (21 November 2012)","Gross":"$124,976,634 (USA) (5 July 2013)","Production_Co":"Fox 2000 Pictures, Dune Entertainment, Ingenious Media ","":"Show detailed company contact information on IMDbPro »","Runtime":"127 min","Sound_Mix":"Dolby Digital | Datasat | SDDS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Life of Pi (2012) became the first family film to win the Academy Award for Best Director (Ang Lee) since Carol Reed for Oliver! (1968) at the 41st Academy Awards in 1969, though others have been nominated: Norman Jewison for Fiddler on the Roof (1971), George Lucas for Star Wars: Episode IV - A New Hope (1977), Steven Spielberg for Raiders of the Lost Ark (1981) and E.T. the Extra-Terrestrial (1982), and Martin Scorsese for Hugo (2011). See more »","Goofs":"When standing in French class talking about his name, Pi writes the number pi to nine digits after the decimal point. According to mathematical rounding rules the ninth digit should be 4, not 3 (pi = 3.14159 26535 89793 ... ). See more »","Crazy_Credits":"The making and legal distribution of this film supported over 14,000 jobs and involved over 600,000 work hours. See more »","Cast":"Suraj Sharma, Irrfan Khan, Ayush Tandon, Gautam Belur, Adil Hussain, Tabu, Ayaan Khan, Mohd. Abbas Khaleeli, Vibish Sivakumar, Rafe Spall, Gérard Depardieu, James Saito, Jun Naito, Andrea Di Stefano, Shravanthi Sainath","Plot":"A young man who survives a disaster at sea is hurtled into an epic journey of adventure and discovery. While cast away, he forms an unexpected connection with another survivor: a fearsome Bengal tiger. In Canada, a writer visits the Indian storyteller Pi Patel and asks him to tell his life story. Pi tells the story of his childhood in Pondicherry, India, and the origin of his nickname. One day, his father, a zoo owner, explains that the municipality is no longer supporting the zoo and he has hence decided to move to Canada, where the animals the family owns would also be sold. They board on a Japanese cargo ship with the animals and out of the blue, there is a storm, followed by a shipwrecking. Pi survives in a lifeboat with a zebra, an orangutan, a hyena and a male Bengal tiger nicknamed Richard Parker. They are adrift in the Pacific Ocean, with aggressive hyena and Richard Parker getting hungry. Pi needs to find a way to survive. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Adventure, Drama, Fantasy","Keywords":"canadian, pi, tiger, zoo, india","imdbRating":"8.0","imdbVotes":"420,895","Awards":"Won 4 Oscars. Another 74 wins & 118 nominations.","Metascore":"79","Released":"21 November 2012 (USA) ","Location":"Montréal, Québec, Canada ","Actors":"Suraj Sharma, Irrfan Khan, Adil Hussain ","Writer":"Yann Martel (novel), David Magee (screenplay)","Running_time":"PT127M / 2h 7min","Description":"Directed by Ang Lee.  With Suraj Sharma, Irrfan Khan, Adil Hussain, Tabu. A young man who survives a disaster at sea is hurtled into an epic journey of adventure and discovery. While cast away, he forms an unexpected connection with another survivor: a fearsome Bengal tiger.","Rated":"PG"}