{"imdbID":"tt0477348","Title":"No Country for Old Men","Year":"2007","Taglines":"One discovery can change your life. One mistake can destroy it. ","Country":"USA","Language":"English, Spanish","Also_Known_As":"Sin lugar para los débiles ","Budget":"$25,000,000 (estimated)","Opening_Weekend":"$1,226,333 (USA) (2 November 2007)","Gross":"$74,273,505 (USA) (4 April 2008)","Production_Co":"Paramount Vantage, Miramax, Scott Rudin Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"122 min","Sound_Mix":"SDDS | Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"After he blows up the car, Chigurh enters the Mike Zoss Pharmacy. It's a reference to Mike Zoss Drugs, a Minneapolis pharmacy where the Coen Brothers spent time in their youth. The Coen Brothers also named their production company Mike Zoss Productions. See more »","Goofs":"The opening scene of the police car features a 1990 Chevrolet Caprice and not a 1980 (or earlier). This is evident from the front door mounted seat belt mechanism, which was only used on the 1990 square-body models before the car was totally redesigned in 1991. There are also numerous mid-late 80's Caprices in the film - all too new for the setting of 1980. These cars are easily identifiable by taillight and grille design to differentiate them from a 1980-84ish car. See more »","Cast":"Tommy Lee Jones, Javier Bardem, Josh Brolin, Woody Harrelson, Kelly Macdonald, Garret Dillahunt, Tess Harper, Barry Corbin, Stephen Root, Rodger Boyce, Beth Grant, Ana Reeder, Kit Gwin, Zach Hopkins, Chip Love","Plot":"Violence and mayhem ensue after a hunter stumbles upon a drug deal gone wrong and more than two million dollars in cash near the Rio Grande. In rural Texas, welder and hunter Llewelyn Moss discovers the remains of several drug runners who have all killed each other in an exchange gone violently wrong. Rather than report the discovery to the police, Moss decides to simply take the two million dollars present for himself. This puts the psychopathic killer, Anton Chigurh, on his trail as he dispassionately murders nearly every rival, bystander and even employer in his pursuit of his quarry and the money. As Moss desperately attempts to keep one step ahead, the blood from this hunt begins to flow behind him with relentlessly growing intensity as Chigurh closes in. Meanwhile, the laconic Sherrif Ed Tom Bell blithely oversees the investigation even as he struggles to face the sheer enormity of the crimes he is attempting to thwart. Written by Kenneth Chisholm (kchishol@rogers.com)","Genre":"Crime, Drama, Thriller","Keywords":"sheriff, desert, texas, tracking device, coin toss","imdbRating":"8.1","imdbVotes":"588,064","Awards":"Won 4 Oscars. Another 155 wins & 128 nominations.","Metascore":"91","Released":"21 November 2007 (USA) ","Location":"Santa Fe, New Mexico, USA ","Actors":"Tommy Lee Jones, Javier Bardem, Josh Brolin ","Director":"Ethan Coen, Joel Coen","Writer":"Joel Coen (screenplay), Ethan Coen (screenplay) | 1 more credit »","Running_time":"PT122M / 2h 2min","Description":"Directed by Ethan Coen, Joel Coen.  With Tommy Lee Jones, Javier Bardem, Josh Brolin, Woody Harrelson. Violence and mayhem ensue after a hunter stumbles upon a drug deal gone wrong and more than two million dollars in cash near the Rio Grande.","Rated":"R"}