{"imdbID":"tt0435761","Title":"Toy Story 3","Year":"2010","Director":"Lee Unkrich","Taglines":"The great escape ","Certificate":"U | See all certifications »","Country":"USA","Language":"English, Spanish","Also_Known_As":"Priča o igračkama 3 ","Budget":"$200,000,000 (estimated)","Opening_Weekend":"$109,000,000 (USA) (18 June 2010)","Gross":"$414,984,497 (USA) (26 November 2010)","Production_Co":"Walt Disney Pictures, Pixar Animation Studios ","":"Show detailed company contact information on IMDbPro »","Runtime":"103 min","Sound_Mix":"DTS | Dolby Digital EX | SDDS | Sonics-DDP (IMAX version)| Dolby (Dolby 7.1 Surround Sound)","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"One of three animated films to be nominated for Best Picture with the first two being Up (2009) and Beauty and the Beast (1991). It is however the first animated sequel to receive the nomination. See more »","Goofs":"When \"demo\" Buzz escapes from under Rex and Hamm, and is running to get away from the toys, he opens his left arm to call out to Star Command, saying he is being held captive by his own prisoners. When Buzz thought he was the real Buzz Lightyear (in Toy Story), he always pressed the red button on the right side of his chest to call for Star Command. See more »","Crazy_Credits":"During the beginning of the ending credits, it is shown what becomes of Sunnyside and Andy's toys. Jessie turns on a Spanish version of \"You've a Friend in Me\" and dances a paso doble with Buzz. See more »","Cast":"Tom Hanks, Tim Allen, Joan Cusack, Ned Beatty, Don Rickles, Michael Keaton, Wallace Shawn, John Ratzenberger, Estelle Harris, John Morris, Jodi Benson, Emily Hahn, Laurie Metcalf, Blake Clark, Teddy Newton","Plot":"The toys are mistakenly delivered to a day-care center instead of the attic right before Andy leaves for college, and it's up to Woody to convince the other toys that they weren't abandoned and to return home. Woody, Buzz and the whole gang are back. As their owner Andy prepares to depart for college, his loyal toys find themselves in daycare where untamed tots with their sticky little fingers do not play nice. So, it's all for one and one for all as they join Barbie's counterpart Ken, a thespian hedgehog named Mr. Pricklepants and a pink, strawberry-scented teddy bear called Lots-o'-Huggin' Bear to plan their great escape. Written by Walt Disney Studios","Genre":"Animation, Adventure, Comedy","Keywords":"toy, college, escape, day care, teddy bear","imdbRating":"8.4","imdbVotes":"518,582","Awards":"Won 2 Oscars. Another 56 wins & 85 nominations.","Metascore":"92","Released":"25 June 2010 (India) ","Location":"Pixar Animation Studios - 1200 Park Avenue, Emeryville, California, USA ","Actors":"Tom Hanks, Tim Allen, Joan Cusack ","Writer":"John Lasseter (story), Andrew Stanton (story) | 2 more credits »","Running_time":"PT103M / 1h 43min","Description":"Directed by Lee Unkrich.  With Tom Hanks, Tim Allen, Joan Cusack, Ned Beatty. The toys are mistakenly delivered to a day-care center instead of the attic right before Andy leaves for college, and it's up to Woody to convince the other toys that they weren't abandoned and to return home.","Rated":"U"}