{"imdbID":"tt0468489","Title":"Half Nelson","Year":"2006","Director":"Ryan Fleck","Country":"USA","Language":"English","Budget":"$700,000 (estimated)","Gross":"$2,694,973 (USA) (8 December 2006)","Production_Co":"Hunting Lane Films, Journeyman Pictures, Silverwood Films ","Runtime":"106 min","Cast":"Ryan Gosling, Jeff Lima, Shareeka Epps, Nathan Corbett, Tyra Kwao-Vovo, Rosemary Ledee, Tristan Wilds, Bryce Silver, Kaela C. Pabon, Erica Rivera, Stephanie Bast, Eleanor Hutchins, Sebastian Sozzi, Tina Holmes, Karen Chilton","Plot":"An inner-city junior high school teacher with a drug habit forms an unlikely friendship with one of his students after she discovers his secret. Young Caucasian Dan Dunne teaches history and coaches the girls basketball team at a Brooklyn high school populated primarily by black and Hispanic students. To the chagrin of his superiors, Dan bucks the outlined curriculum of historical facts in favor of the philosophy of historical events, generally discussing the concept of dialectics. As such, he captures the imagination of his students, at least in the classroom. Outside of the classroom, Dan's life is in shambles. He has a distant but cordial relationship with his family. He uses illicit drugs rampantly. Although his former girlfriend Rachel was able to clean up her drug habit, Dan believes that rehab will not work for him. Due to a combination of these issues, he treats women poorly. Thirteen year old Drey is a student in his class and a player on his basketball team. Drey has her own problems. Her parents are divorced, with her father a virtually non-existent figure in her life and her EMT mother generally absent as she is ... Written by Huggo","Genre":"Drama","Keywords":"student, drugs, classroom, dialectics, bathroom","imdbRating":"7.3","imdbVotes":"69,340","Awards":"Nominated for 1 Oscar. Another 27 wins & 45 nominations.","Metascore":"85","Released":"22 September 2006 (USA) ","Location":"Brooklyn, New York City, New York, USA ","Actors":"Ryan Gosling, Anthony Mackie, Shareeka Epps ","Writer":"Ryan Fleck, Anna Boden","Running_time":"PT106M / 1h 46min","Description":"Directed by Ryan Fleck.  With Ryan Gosling, Anthony Mackie, Shareeka Epps, Jeff Lima. An inner-city junior high school teacher with a drug habit forms an unlikely friendship with one of his students after she discovers his secret.","Rated":"R"}