{"imdbID":"tt0421715","Title":"The Curious Case of Benjamin Button","Year":"2008","Director":"David Fincher","Country":"USA","Language":"English, Russian, French","Budget":"$150,000,000 (estimated)","Gross":"$127,490,802 (USA) (17 April 2009)","Production_Co":"Warner Bros., Paramount Pictures, Kennedy/Marshall Company, The ","Runtime":"166 min","Cast":"Cate Blanchett, Brad Pitt, Julia Ormond, Faune Chambers Watkins, Elias Koteas, Donna Duplantier, Jacob Tolano, Earl Maddox, Ed Metzger, Jason Flemyng, Danny Vinson, David Jensen, Johanna Roxanne, Taraji P. Henson, Mahershala Ali","Plot":"Tells the story of Benjamin Button, a man who starts aging backwards with bizarre consequences. On the day that Hurricane Katrina hits New Orleans, elderly Daisy Williams (nee Fuller) is on her deathbed in a New Orleans hospital. At her side is her adult daughter, Caroline. Daisy asks Caroline to read to her aloud the diary of Daisy's lifelong friend, Benjamin Button. Benjamin's diary recounts his entire extraordinary life, the primary unusual aspect of which was his aging backwards, being diagnosed with several aging diseases at birth and thus given little chance of survival, but who does survive and gets younger with time. Abandoned by his biological father, Thomas Button, after Benjamin's biological mother died in childbirth, Benjamin was raised by Queenie, a black woman and caregiver at a seniors home. Daisy's grandmother was a resident at that home, which is where she first met Benjamin. Although separated through the years, Daisy and Benjamin remain in contact throughout their lives, reconnecting in their forties when in age they finally match up. Some of the revelations ... Written by Huggo","Genre":"Drama, Fantasy, Romance","Keywords":"premature aging, deformed baby, lingerie slip, older man younger woman relationship, diary","imdbRating":"7.8","imdbVotes":"445,488","Awards":"Won 3 Oscars. Another 67 wins & 133 nominations.","Metascore":"70","Released":"25 December 2008 (USA) ","Location":"Burbank, California, USA ","Actors":"Brad Pitt, Cate Blanchett, Tilda Swinton ","Writer":"Eric Roth (screenplay), Eric Roth (story) | 2 more credits »","Running_time":"PT166M / 2h 46min","Description":"Directed by David Fincher.  With Brad Pitt, Cate Blanchett, Tilda Swinton, Julia Ormond. Tells the story of Benjamin Button, a man who starts aging backwards with bizarre consequences.","Rated":"PG-13"}