{"imdbID":"tt0455590","Title":"The Last King of Scotland","Year":"2006","Director":"Kevin Macdonald","Country":"UK, Germany","Language":"English, French, German, Swahili","Budget":"$6,000,000 (estimated)","Gross":"$17,605,861 (USA) (18 May 2007)","Production_Co":"Fox Searchlight Pictures, DNA Films, FilmFour ","Runtime":"121 min | 121 min","Cast":"Forest Whitaker, James McAvoy, Kerry Washington, Gillian Anderson, Simon McBurney, David Oyelowo, Stephen Rwangyezi, Abby Mukiibi Nkaaga, Adam Kotz, Sam Okelo, Sarah Nagayi, Chris Wilson, Dick Stockley, Barbara Rafferty, David Ashton","Plot":"Based on the events of the brutal Ugandan dictator Idi Amin's regime as seen by his personal physician during the 1970s In the early 1970s, Nicholas Garrigan, a young semi-idealistic Scottish doctor, comes to Uganda to assist in a rural hospital. Once there, he soon meets up with the new President, Idi Amin, who promises a golden age for the African nation. Garrigan hits it off immediately with the rabid Scotland fan, who soon offers him a senior position in the national health department and becomes one of Amin's closest advisers. However as the years pass, Garrigan cannot help but notice Amin's increasingly erratic behavior that grows beyond a legitimate fear of assassination into a murderous insanity that is driving Uganda into bloody ruin. Realizing his dire situation with the lunatic leader unwilling to let him go home, Garrigan must make some crucial decisions that could mean his death if the despot finds out. Written by Kenneth Chisholm (kchishol@rogers.com)","Genre":"Biography, Drama, History","Keywords":"uganda, 1970s, hospital, scottish, scotland","imdbRating":"7.7","imdbVotes":"141,744","Awards":"Won 1 Oscar. Another 46 wins & 29 nominations.","Metascore":"74","Released":"19 January 2007 (USA) ","Location":"Kampala, Uganda ","Actors":"James McAvoy, Forest Whitaker, Gillian Anderson ","Writer":"Peter Morgan (screenplay), Jeremy Brock (screenplay) | 1 more credit »","Running_time":"PT123M / 2h 3min","Description":"Directed by Kevin Macdonald.  With James McAvoy, Forest Whitaker, Gillian Anderson, Kerry Washington. Based on the events of the brutal Ugandan dictator Idi Amin's regime as seen by his personal physician during the 1970s","Rated":"R"}