{"imdbID":"tt0407887","Title":"The Departed","Year":"2006","Director":"Martin Scorsese","Taglines":"Undercover ","Certificate":"A | See all certifications »","Country":"USA, Hong Kong","Language":"English, Cantonese","Also_Known_As":"Los infiltrados ","Budget":"$90,000,000 (estimated)","Opening_Weekend":"£2,298,313 (UK) (6 October 2006)","Gross":"$132,373,442 (USA) (16 March 2007)","Production_Co":"Warner Bros., Plan B Entertainment, Initial Entertainment Group (IEG) ","":"Show detailed company contact information on IMDbPro »","Runtime":"151 min","Sound_Mix":"Dolby Digital | SDDS | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Originally, Jack Nicholson turned down his role in the movie, but after a meeting with Martin Scorsese, William Monahan and Leonardo DiCaprio, he was finally convinced to play the role of Frank Costello. The main reason he joined the production was because he had previously done a few comedies, and wanted to play a villain again, and he considered the character of Costello to be the ultimate incarnation of evil. See more »","Goofs":"When Billy is talking with Madolyn for the first time in her office, the position of the tissue sticking out of the top of the tissue box on Madolyn's desk changes a few times. See more »","Crazy_Credits":"The title doesn't appear on screen until nearly 20 minutes into the movie. See more »","Cast":"Leonardo DiCaprio, Matt Damon, Jack Nicholson, Mark Wahlberg, Martin Sheen, Ray Winstone, Vera Farmiga, Anthony Anderson, Alec Baldwin, Kevin Corrigan, James Badge Dale, David O'Hara, Mark Rolston, Robert Wahlberg, Kristen Dalton","Plot":"An undercover cop and a mole in the police attempt to identify each other while infiltrating an Irish gang in South Boston. In South Boston, the state police force is waging war on Irish-American organized crime. Young undercover cop Billy Costigan (Leonardo DiCaprio) is assigned to infiltrate the mob syndicate run by gangland chief Frank Costello (Jack Nicholson). While Billy quickly gains Costello's confidence, Colin Sullivan (Matt Damon), a hardened young criminal who has infiltrated the state police as an informer for the syndicate is rising to a position of power in the Special Investigation Unit. Each man becomes deeply consumed by their double lives, gathering information about the plans and counter-plans of the operations they have penetrated. But when it becomes clear to both the mob and the police that there is a mole in their midst, Billy and Colin are suddenly in danger of being caught and exposed to the enemy - and each must race to uncover the identity of the other man in time to save themselves. But is either willing to turn on their friends and comrades they've made during their long stints... Written by Anonymous","Genre":"Crime, Drama, Thriller","Keywords":"boston, police, mole, undercover, undercover cop","imdbRating":"8.5","imdbVotes":"837,049","Awards":"Won 4 Oscars. Another 87 wins & 116 nominations.","Metascore":"86","Released":"6 October 2006 (USA) ","Location":"Fore River Ship Yard, Quincy, Massachusetts, USA ","Actors":"Leonardo DiCaprio, Matt Damon, Jack Nicholson ","Writer":"William Monahan (screenplay), Alan Mak | 1 more credit »","Running_time":"PT151M / 2h 31min","Description":"Directed by Martin Scorsese.  With Leonardo DiCaprio, Matt Damon, Jack Nicholson, Mark Wahlberg. An undercover cop and a mole in the police attempt to identify each other while infiltrating an Irish gang in South Boston.","Rated":"A"}