{"imdbID":"tt0796366","Title":"Star Trek","Year":"2009","Director":"J.J. Abrams","Taglines":"The future begins.","Country":"USA, Germany","Language":"English","Also_Known_As":"Corporate HQ ","Budget":"$140,000,000 (estimated)","Opening_Weekend":"£5,950,203 (UK) (8 May 2009)","Gross":"$257,704,099 (USA) (25 September 2009)","Production_Co":"Paramount Pictures, Spyglass Entertainment, Bad Robot ","":"Show detailed company contact information on IMDbPro »","Runtime":"127 min","Sound_Mix":"DTS | SDDS | Dolby Digital | Sonics-DDP (IMAX version)","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Karl Urban was cast at his first audition, which was two months after his initial meeting with J.J. Abrams. He said he was happy to play a role with lots of comedy, something he had not done since The Price of Milk (2000), because he was fed-up of action-oriented roles. See more »","Goofs":"In the fight on the drill's platform, which is at an extremely high altitude, Kirk and Sulu remove their helmets. On Earth, humans would find it very difficult to breathe at that height without supplemental oxygen; in Trek mythology, Vulcan's atmosphere is thinner than Earth's. It was an acceptable practice, when visiting or residing on Vulcan, to receive an injection of a Tri-ox compound to assist in breathing (Star Trek: Amok Time). Knowing that they would be fighting on Vulcan at a high altitude, it seems logical that the away team would be given a similar injection (considering McCoy's penchant for injecting Kirk on the fly), though it was not shown on screen. See more »","Crazy_Credits":"After the closing credits, the sound of the Enterprise is heard one more time. See more »","Cast":"Chris Pine, Zachary Quinto, Leonard Nimoy, Eric Bana, Bruce Greenwood, Karl Urban, Zoe Saldana, Simon Pegg, John Cho, Anton Yelchin, Ben Cross, Winona Ryder, Chris Hemsworth, Jennifer Morrison, Rachel Nichols","Plot":"The brash James T. Kirk tries to live up to his father's legacy with Mr. Spock keeping him in check as a vengeful, time-traveling Romulan creates black holes to destroy the Federation one planet at a time. On the day of James Kirk's birth, his father dies on his ship in a last stand against a mysterious alien time-traveling vessel looking for Ambassador Spock, who, in this time, is also a child on Vulcan disdained by his neighbors for his half-human heritage. Twenty-five years later, Kirk has grown into a young troublemaker. Challenged by Captain Christopher Pike to realize his potential in Starfleet, he comes to annoy instructors like young Commander Spock. Suddenly, there is an emergency at Vulcan and the newly commissioned USS Enterprise is crewed with promising cadets like Nyota Uhura, Hikaru Sulu, Pavel Chekov and even Kirk himself, thanks to Leonard McCoy's medical trickery. Together, this crew will have an adventure in the final frontier where the old legend is altered forever as a new version of it begins. Written by Kenneth Chisholm (kchishol@rogers.com)","Genre":"Action, Adventure, Sci-Fi","Keywords":"star trek, reboot of series, vulcan, based on tv series, box office hit","imdbRating":"8.0","imdbVotes":"489,235","Awards":"Won 1 Oscar. Another 22 wins & 78 nominations.","Metascore":"82","Released":"8 May 2009 (USA) ","Location":"Alaska, USA ","Actors":"Chris Pine, Zachary Quinto, Simon Pegg ","Writer":"Roberto Orci, Alex Kurtzman | 1 more credit »","Running_time":"PT127M / 2h 7min","Description":"Directed by J.J. Abrams.  With Chris Pine, Zachary Quinto, Simon Pegg, Leonard Nimoy. The brash James T. Kirk tries to live up to his father's legacy with Mr. Spock keeping him in check as a vengeful, time-traveling Romulan creates black holes to destroy the Federation one planet at a time.","Rated":"PG-13"}