{"imdbID":"tt0756683","Title":"The Man from Earth","Year":"2007","Director":"Richard Schenkman","Writer":"Jerome Bixby","Taglines":"From one of the acclaimed writers of Star Trek and The Twilight Zone comes a story that transcends both time and space...","Certificate":"Not Rated | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Jerome Bixby's The Man from Earth ","Budget":"$200,000 (estimated)","Production_Co":"Falling Sky Entertainment ","Runtime":"87 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The director, Richard Schenkman, has always appeared in a cameo in his previous movies. He wanted to appear as a mover but due to the need to choreograph the cast for the moving scene, he reluctantly decided to fore-go his cameo and instead hired another person to be the 2nd mover. See more »","Goofs":"It the very beginning of the movie, Edith (Ellen Crawford) notices a painting on the ground by the truck and asks about the artist. The dialogue makes it clear she saw the painted surface of the canvas but she wouldn't have been able to see it from it's angle and from where she was standing. See more »","Cast":"David Lee Smith, Tony Todd, John Billingsley, Ellen Crawford, Annika Peterson, William Katt, Alexis Thorpe, Richard Riehle, Steven Littles, Chase Sprague, Robbie Bryan","Plot":"An impromptu goodbye party for Professor John Oldman becomes a mysterious interrogation after the retiring scholar reveals to his colleagues he has a longer and stranger past than they can imagine. An impromptu goodbye party for Professor John Oldman becomes a mysterious interrogation after the retiring scholar reveals to his colleagues he has a longer and stranger past than they can imagine.","Genre":"Drama, Sci-Fi","Keywords":"dialogue driven storyline, single setting, storytelling, cro magnon, single set production","imdbRating":"8.0","imdbVotes":"123,931","Awards":"4 wins & 1 nomination.","Metascore":"","Released":"13 November 2007 (USA) ","Location":"Agua Dulce Movie Ranch - 34855 Petersen Road, Agua Dulce, California, USA","Actors":"David Lee Smith, Tony Todd, John Billingsley ","Running_time":"PT87M / 1h 27min","Description":"Directed by Richard Schenkman.  With David Lee Smith, Tony Todd, John Billingsley, Ellen Crawford. An impromptu goodbye party for Professor John Oldman becomes a mysterious interrogation after the retiring scholar reveals to his colleagues he has a longer and stranger past than they can imagine.","Rated":"NOT RATED"}