{"imdbID":"tt0780536","Title":"In Bruges","Year":"2008","Director":"Martin McDonagh","Writer":"Martin McDonagh","Taglines":"Shoot first. Sightsee later.","Country":"UK, USA","Language":"English","Also_Known_As":"Escondidos en Brujas ","Budget":"$15,000,000 (estimated)","Opening_Weekend":"$457,227 (USA) (8 February 2008)","Gross":"$7,757,130 (USA) (13 June 2008)","Production_Co":"Blueprint Pictures, Focus Features, Scion Films ","Runtime":"107 min","Sound_Mix":"Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"According to Brendan Gleeson, it took 12 weeks to shoot the entire film, he mentioned on Late Night with Seth Meyers. Seth Meyers himself is admittedly a huge fan of the film. See more »","Goofs":"When Ray is preparing for his date with Chloe and is checking himself in the mirror, he is trying to decide whether to leave his top button open or button it. He decides to button it, then turns to Ken for approval and the camera cuts to a different angle. You can see in his reflection in the mirror that his top button is open. When he faces the mirror again and the screen cuts back, it is buttoned again. See more »","Crazy_Credits":"In the on-screen credits, Kathy Heaser is listed twice as Graphic Designer. See more »","Cast":"Elizabeth Berrington, Rudy Blomme, Olivier Bonjour, Mark Donovan, Ann Elsley, Colin Farrell, Jean-Marc Favorin, Ralph Fiennes, Brendan Gleeson, Eric Godon, Zeljko Ivanek, Sachi Kimura, Anna Madeley, Louis Nummy, Clémence Poésy","Plot":"Guilt-stricken after a job gone wrong, hitman Ray and his partner await orders from their ruthless boss in Bruges, Belgium, the last place in the world Ray wants to be. London based hit men Ray and Ken are told by their boss Harry Waters to lie low in Bruges, Belgium for up to two weeks following their latest hit, which resulted in the death of an innocent bystander. Harry will be in touch with further instructions. While they wait for Harry's call, Ken, following Harry's advice, takes in the sights of the medieval city with great appreciation. But the charms of Bruges are lost on the simpler Ray, who is already despondent over the innocent death, especially as it was his first job. Things change for Ray when he meets Chloe, part of a film crew shooting a movie starring an American dwarf named Jimmy. When Harry's instructions arrive, Ken, for whom the job is directed, isn't sure if he can carry out the new job, especially as he has gained a new appreciation of life from his stay in the fairytale Bruges. While Ken waits for the inevitable arrival into Bruges of an angry Harry, who feels he must clean up matters on his own, Ray is dealing with his own ... Written by Huggo","Genre":"Comedy, Crime, Drama","Keywords":"cigarette, cigarette smoke, bruges, belgium, instruction","imdbRating":"8.0","imdbVotes":"298,610","Awards":"Nominated for 1 Oscar. Another 21 wins & 49 nominations.","Metascore":"67","Released":"29 February 2008 (USA) ","Location":"Gruuthuse Museum, Bruges, West-Vlaanderen, Belgium ","Actors":"Colin Farrell, Brendan Gleeson, Ciarán Hinds ","Running_time":"PT107M / 1h 47min","Description":"Directed by Martin McDonagh.  With Colin Farrell, Brendan Gleeson, Ciarán Hinds, Elizabeth Berrington. Guilt-stricken after a job gone wrong, hitman Ray and his partner await orders from their ruthless boss in Bruges, Belgium, the last place in the world Ray wants to be.","Rated":"R"}