{"imdbID":"tt0783233","Title":"Atonement","Year":"2007","Director":"Joe Wright","Country":"UK, France, USA","Language":"English, French","Budget":"$30,000,000 (estimated)","Gross":"$50,921,738 (USA) (4 April 2008)","Production_Co":"Universal Pictures, StudioCanal, Relativity Media ","Runtime":"123 min","Cast":"Saoirse Ronan, Ailidh Mackay, Brenda Blethyn, Julia West, James McAvoy, Harriet Walter, Keira Knightley, Juno Temple, Felix von Simson, Charlie von Simson, Alfie Allen, Patrick Kennedy, Benedict Cumberbatch, Peter Wight, Leander Deeny","Plot":"Fledgling writer Briony Tallis, as a thirteen-year-old, irrevocably changes the course of several lives when she accuses her older sister's lover of a crime he did not commit. SPOILER: When Briony Tallis, 13 years old and an aspiring writer, sees her older sister Cecilia and Robbie Turner at the fountain in front of the family estate she misinterprets what is happening thus setting into motion a series of misunderstandings and a childish pique that will have lasting repercussions for all of them. Robbie is the son of a family servant toward whom the family has always been kind. They paid for his time at Cambridge and now he plans on going to medical school. After the fountain incident, Briony reads a letter intended for Cecilia and concludes that Robbie is a deviant. When her cousin Lola is raped, she tells the police that it was Robbie she saw committing the deed. Written by garykmcd","Genre":"Drama, Mystery, Romance","Keywords":"sex, loss of virginity, septicemia, death of sister, dying","imdbRating":"7.8","imdbVotes":"187,443","Awards":"Won 1 Oscar. Another 48 wins & 144 nominations.","Metascore":"85","Released":"11 January 2008 (USA) ","Location":"British Steel works, now Tata Steel works, Redcar, England, UK ","Actors":"Keira Knightley, James McAvoy, Brenda Blethyn ","Writer":"Ian McEwan (novel), Christopher Hampton (screenplay)","Running_time":"PT123M / 2h 3min","Description":"Directed by Joe Wright.  With Keira Knightley, James McAvoy, Brenda Blethyn, Saoirse Ronan. Fledgling writer Briony Tallis, as a thirteen-year-old, irrevocably changes the course of several lives when she accuses her older sister's lover of a crime he did not commit.","Rated":"R"}