{"imdbID":"tt0790636","Title":"Dallas Buyers Club","Year":"2013","Director":"Jean-Marc Vallée","Country":"USA","Language":"English, Japanese","Budget":"$5,000,000 (estimated)","Gross":"$27,296,514 (USA) (25 April 2014)","Production_Co":"Truth Entertainment (II), Voltage Pictures, r2 films ","Runtime":"117 min","Cast":"Matthew McConaughey, Jennifer Garner, Jared Leto, Denis O'Hare, Steve Zahn, Michael O'Neill, Dallas Roberts, Griffin Dunne, Kevin Rankin, Donna Duplantier, Deneen Tyler, J.D. Evermore, Ian Casselberry, Noelle Wilcox, Bradford Cox","Plot":"In 1985 Dallas, electrician and hustler Ron Woodroof works around the system to help AIDS patients get the medication they need after he is diagnosed with the disease. Dallas 1985. Electrician and sometimes rodeo bull rider Ron Woodroof lives hard, which includes heavy smoking, drinking, drug use (primarily cocaine) and casual sex. He is racist and homophobic. While in the hospital on a work related injury, the doctors discover and inform him that he is HIV+, and that he will most-likely die within thirty days. Ron is initially in angry denial that he would have a disease that only \"faggots\" have, but upon quick reflection comes to the realization that the diagnosis is probably true. He begins to read whatever research is available about the disease, which at this time seems to be most effectively treated by the drug AZT. AZT, however, is only in the clinical trials stage within the US. Incredulous that he, as a dying man, cannot pay for any drug which may save or at least prolong his life, he goes searching for it by whatever means possible. It eventually leads him to Mexico and a \"Dr.\" Vass, an American physician whose license was revoked in the ... Written by Huggo","Genre":"Biography, Drama","Keywords":"hiv, gay community, homophobia, drugs, hiv positive","imdbRating":"8.0","imdbVotes":"312,285","Awards":"Won 3 Oscars. Another 79 wins & 77 nominations.","Metascore":"84","Released":"22 November 2013 (USA) ","Location":"New Orleans, Louisiana, USA","Actors":"Matthew McConaughey, Jennifer Garner, Jared Leto ","Writer":"Craig Borten, Melisa Wallack","Running_time":"PT117M / 1h 57min","Description":"Directed by Jean-Marc Vallée.  With Matthew McConaughey, Jennifer Garner, Jared Leto, Steve Zahn. In 1985 Dallas, electrician and hustler Ron Woodroof works around the system to help AIDS patients get the medication they need after he is diagnosed with the disease.","Rated":"R"}