{"imdbID":"tt0775489","Title":"The Illusionist","Year":"2010","Director":"Sylvain Chomet","Country":"France, UK","Language":"English, French, Scottish Gaelic","Also_Known_As":"Illusionisten ","Budget":"£11,000,000 (estimated)","Opening_Weekend":"$38,594 (USA) (24 December 2010)","Gross":"$2,231,024 (USA) (6 May 2011)","Production_Co":"Pathé, Django Films, Ciné B ","Sound_Mix":"DTS | Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"When the Illusionist is performing at the Scottish pub, one of the patrons in the foreground, near the middle of the frame, is the famous \"Young Girl and Old Woman\" optical illusion. See more »","Goofs":"Despite being set in 1959/1960, the Scottish Police motorcycles have 'American-style' sirens, which were not introduced until the 1980s. See more »","Crazy_Credits":"At the end of the final credits, there's a short bonus scene. See more »","Cast":"Jean-Claude Donda, Eilidh Rankin, Duncan MacNeil, Raymond Mearns, James T. Muir, Tom Urie, Paul Bandey","Plot":"A French illusionist finds himself out of work and travels to Scotland, where he meets a young woman. Their ensuing adventure changes both their lives forever. Details the story of a dying breed of stage entertainer whose thunder is being stolen by emerging rock stars. Forced to accept increasingly obscure assignments in fringe theaters, garden parties and bars, he meets a young fan who changes his life forever. Written by Anonymous","Genre":"Animation, Drama","Keywords":"very little dialogue, theater, french, stage, scene after end credits","imdbRating":"7.5","imdbVotes":"27,714","Awards":"Nominated for 1 Oscar. Another 6 wins & 29 nominations.","Metascore":"82","Released":"11 February 2011 (USA) ","Location":"Edinburgh, Scotland, UK","Actors":"Jean-Claude Donda, Eilidh Rankin, Duncan MacNeil ","Writer":"Sylvain Chomet (adaptation), Jacques Tati (original screenplay)","Running_time":"PT80M / 1h 20min","Description":"Directed by Sylvain Chomet.  With Jean-Claude Donda, Eilidh Rankin, Duncan MacNeil, Raymond Mearns. A French illusionist finds himself out of work and travels to Scotland, where he meets a young woman. Their ensuing adventure changes both their lives forever.","Rated":"PG"}