{"imdbID":"tt0775529","Title":"The Savages","Year":"2007","Director":"Tamara Jenkins","Writer":"Tamara Jenkins","Country":"USA","Language":"English, German, Cantonese","Gross":"$6,610,326 (USA) (25 April 2008)","Production_Co":"Fox Searchlight Pictures, Lone Star Film Group, This Is That Productions ","Runtime":"114 min","Cast":"Laura Linney, Philip Seymour Hoffman, Philip Bosco, Peter Friedman, David Zayas, Gbenga Akinnagbe, Cara Seymour, Tonye Patano, Guy Boyd, Debra Monk, Rosemary Murphy, Hal Blankenship, Joan Jaffe, Sage Kirkpatrick, Salem Ludwig","Plot":"A sister and brother face the realities of familial responsibility as they begin to care for their ailing father. Jon and Wendy Savage are two siblings who have spent their adult years trying to recover from the abuse of their abusive father, Lenny Savage. Suddenly, a call comes in that his girlfriend has died, he cannot care for himself with his dementia and her family is dumping him on his children. Despite the fact Jon and Wendy have not spoken to Lenny for twenty years and he is even more loathsome than ever, the Savage siblings feel obliged to take care of him. Now together, brother and sister must come to terms with the new and painful responsibilities with their father now affecting their lives even as they struggle with their own personal demons Lenny helped create. Written by Kenneth Chisholm (kchishol@rogers.com)","Genre":"Comedy, Drama","Keywords":"dementia, writing, sun city arizona, arizona, married man","imdbRating":"7.2","imdbVotes":"31,823","Awards":"Nominated for 2 Oscars. Another 16 wins & 30 nominations.","Metascore":"85","Released":"1 February 2008 (USA) ","Location":"Buffalo, New York, USA ","Actors":"Laura Linney, Philip Seymour Hoffman, Philip Bosco ","Running_time":"PT113M / 1h 53min","Description":"Directed by Tamara Jenkins.  With Laura Linney, Philip Seymour Hoffman, Philip Bosco, Peter Friedman. A sister and brother face the realities of familial responsibility as they begin to care for their ailing father.","Rated":"R"}