{"imdbID":"tt0758758","Title":"Into the Wild","Year":"2007","Director":"Sean Penn","Taglines":"Your large adventure on Alaska ","Country":"USA","Language":"English, Danish","Also_Known_As":"Hacia rutas salvajes ","Budget":"$15,000,000 (estimated)","Opening_Weekend":"$212,440 (USA) (21 September 2007)","Gross":"$18,352,454 (USA) (21 March 2008)","Production_Co":"Paramount Vantage, Art Linson Productions, Into the Wild ","":"Show detailed company contact information on IMDbPro »","Runtime":"148 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"When Sean Penn asked Eddie Vedder to do the soundtrack, he agreed on the spot, before he knew anything about the film. See more »","Goofs":"While Chris is learning how to run a combine, he is harvesting wheat. In a subsequent shot, the combine is being unloaded of corn. See more »","Crazy_Credits":"The opening title is shown as part of Chris's journal's writings. See more »","Cast":"Emile Hirsch, Marcia Gay Harden, William Hurt, Jena Malone, Brian H. Dierker, Catherine Keener, Vince Vaughn, Kristen Stewart, Hal Holbrook, Jim Gallien, James O'Neill, Malinda McCollum, Paul Knauls, Zach Galifianakis, Craig Mutsch","Plot":"After graduating from Emory University, top student and athlete Christopher McCandless abandons his possessions, gives his entire $24,000 savings account to charity and hitchhikes to Alaska to live in the wilderness. Along the way, Christopher encounters a series of characters that shape his life. Based on a true story. After graduating from Emory University, top student and athlete Christopher McCandless abandoned his possessions, gave his entire $24,000 savings account to charity and hitchhiked to Alaska to live in the wilderness. Along the way, Christopher encounters a series of characters who shape his life. Written by Lisa Kelley","Genre":"Adventure, Biography, Drama","Keywords":"wilderness, alaska, male nudity, based on true story, journey","imdbRating":"8.2","imdbVotes":"408,440","Awards":"Nominated for 2 Oscars. Another 23 wins & 99 nominations.","Metascore":"73","Released":"19 October 2007 (USA) ","Location":"Anchorage, Alaska, USA ","Actors":"Emile Hirsch, Vince Vaughn, Catherine Keener ","Writer":"Sean Penn (screenplay), Jon Krakauer (book)","Running_time":"PT148M / 2h 28min","Description":"Directed by Sean Penn.  With Emile Hirsch, Vince Vaughn, Catherine Keener, Marcia Gay Harden. After graduating from Emory University, top student and athlete Christopher McCandless abandons his possessions, gives his entire $24,000 savings account to charity and hitchhikes to Alaska to live in the wilderness. Along the way, Christopher encounters a series of characters that shape his life.","Rated":"R"}