{"imdbID":"tt0840361","Title":"The Town","Year":"2010","Director":"Ben Affleck","Taglines":"Welcome to the bank robbery capital of America.","Country":"USA","Language":"English","Also_Known_As":"Prince of Thieves ","Budget":"$37,000,000 (estimated)","Opening_Weekend":"$23,808,032 (USA) (17 September 2010)","Gross":"$92,173,235 (USA) (31 December 2010)","Production_Co":"Warner Bros., Legendary Pictures, GK Films ","Runtime":"125 min | 150 min (DVD extended cut)","Sound_Mix":"Dolby Digital | SDDS | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Chris Cooper's scene was shot on location at MCI-Cedar Junction, a maximum security prison in Massachusetts. It was the first time anything was filmed there. See more »","Goofs":"When Kris and Doug are at the bar talking, Kris' drink goes from being almost empty to half full. See more »","Crazy_Credits":"The opening production logos have been darkened and slightly desaturated. See more »","Cast":"Ben Affleck, Rebecca Hall, Jon Hamm, Jeremy Renner, Blake Lively, Slaine, Owen Burke, Titus Welliver, Pete Postlethwaite, Chris Cooper, Dennis McLaughlin, Corena Chase, Brian Scannell, Kerri Dunbar, Tony V.","Plot":"As he plans his next job, a longtime thief tries to balance his feelings for a bank manager connected to one of his earlier heists, as well as the FBI agent looking to bring him and his crew down. The Charlestown neighborhood of Boston is renowned for churning out a high number of armed robbers, generation after generation. These robbers never leave their Charlestown life on their own volition, the neighborhood where there is an unwritten code to protect that lifestyle. Such robbers include friends Doug MacRay, James Coughlin, Albert 'Gloansy' Magloan and Desmond Elden. Doug and James in particular treat each other like family, as the Coughlins have realistically been as such to Doug since Doug's mother ran off and Doug's father, Stephen MacRay, was sent to prison. James' single mother sister, the drugged out Krista Coughlin, and Doug have a casual sexual relationship. The foursome carry out a mostly successful bank robbery, but due to circumstances take the bank manager, Claire Keesey, hostage for a short period before releasing her physically unharmed. They find out that Claire lives in Charlestown, so they want to ensure that she did not see anything that could incriminate ... Written by Huggo","Genre":"Crime, Drama, Thriller","Keywords":"bank robbery, criminal gang, heist, bank manager, prison","imdbRating":"7.6","imdbVotes":"272,413","Awards":"Nominated for 1 Oscar. Another 9 wins & 44 nominations.","Metascore":"74","Released":"17 September 2010 (USA) ","Location":"Boston, Massachusetts, USA ","Actors":"Ben Affleck, Rebecca Hall, Jon Hamm ","Writer":"Peter Craig (screenplay), Ben Affleck (screenplay) | 2 more credits »","Running_time":"PT125M / 2h 5min","Description":"Directed by Ben Affleck.  With Ben Affleck, Rebecca Hall, Jon Hamm, Jeremy Renner. As he plans his next job, a longtime thief tries to balance his feelings for a bank manager connected to one of his earlier heists, as well as the FBI agent looking to bring him and his crew down.","Rated":"R"}