{"imdbID":"tt0816692","Title":"Interstellar","Year":"2014","Director":"Christopher Nolan","Taglines":"The end of Earth will not be the end of us. ","Country":"USA, UK","Language":"English","Also_Known_As":"Flora's Letter ","Budget":"$165,000,000 (estimated)","Opening_Weekend":"$47,510,360 (USA) (7 November 2014)","Gross":"$187,991,439 (USA) (13 March 2015)","Production_Co":"Paramount Pictures, Warner Bros., Legendary Pictures ","Runtime":"169 min","Sound_Mix":"Datasat | Dolby Digital | IMAX 6-Track","Color":"Color (FotoKem)","Aspect_Ratio":"2.35 : 1","Trivia":"The library tesseract set is visually reminiscent of the interior of the HAL9000 computer's memory core in_ 2001: A Space Odyssey (1968)_. See more »","Goofs":"When Dr. Mann attempts to open the airlock of the Ranger he is on while attempting to enter into the Endurance, there would be basic mechanical, electrical and electronic interlocks preventing him from opening the outer hatch of the airlock while there is still atmosphere in the airlock and there is an imperfect mating of the docking mechanisms. This basic component of airlocks became standard in the 20th century. See more »","Crazy_Credits":"There are no opening credits, except for the title. See more »","Cast":"Ellen Burstyn, Matthew McConaughey, Mackenzie Foy, John Lithgow, Timothée Chalamet, David Oyelowo, Collette Wolfe, Francis X. McCarthy, Bill Irwin, Anne Hathaway, Andrew Borba, Wes Bentley, William Devane, Michael Caine, David Gyasi","Plot":"A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival. In the near future, Earth has been devastated by drought and famine, causing a scarcity in food and extreme changes in climate. When humanity is facing extinction, a mysterious rip in the space-time continuum is discovered, giving mankind the opportunity to widen its lifespan. A group of explorers must travel beyond our solar system in search of a planet that can sustain life. The crew of the Endurance are required to think bigger and go further than any human in history as they embark on an interstellar voyage into the unknown. Coop, the pilot of the Endurance, must decide between seeing his children again and the future of the human race. Written by Warren D'Souza","Genre":"Adventure, Drama, Sci-Fi","Keywords":"wormhole, father daughter relationship, space travel, black hole, saving the world","imdbRating":"8.6","imdbVotes":"860,917","Awards":"Won 1 Oscar. Another 36 wins & 122 nominations.","Metascore":"74","Released":"7 November 2014 (USA) ","Location":"Okotoks, Alberta, Canada ","Actors":"Matthew McConaughey, Anne Hathaway, Jessica Chastain ","Writer":"Jonathan Nolan, Christopher Nolan","Running_time":"PT169M / 2h 49min","Description":"Directed by Christopher Nolan.  With Matthew McConaughey, Anne Hathaway, Jessica Chastain, Mackenzie Foy. A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.","Rated":"PG-13"}