{"imdbID":"tt0808417","Title":"Persepolis","Year":"2007","Country":"France, USA","Language":"French, English, Persian, German","Also_Known_As":"Persépolis ","Budget":"$7,300,000 (estimated)","Opening_Weekend":"$37,118 (USA) (21 December 2007)","Gross":"£778,834 (UK) (30 May 2008)","Production_Co":"2.4.7. Films, France 3 Cinéma, Kennedy/Marshall Company, The ","Runtime":"96 min | 89 min (TV)","Sound_Mix":"Dolby Digital","Color":"Color | Black and White","Aspect_Ratio":"1.85 : 1","Trivia":"France's official submission for the Best Foreign-Language Film category at The 80th Annual Academy Awards (2008). See more »","Goofs":"The departures board at Paris Orly at the beginning has Cincinnati misspelled as \"Cincinatti\". See more »","Cast":"Chiara Mastroianni, Danielle Darrieux, Catherine Deneuve, Simon Abkarian, Gabrielle Lopes Benites, François Jerosme, Tilly Mandelbrot, Sophie Arthuys, Arié Elmaleh, Mathias Mlekuz, Lexie Kendrick, Sean Penn, Gena Rowlands","Plot":"A precocious and outspoken Iranian girl grows up during the Islamic Revolution. In 1970s Iran, Marjane 'Marji' Statrapi watches events through her young eyes and her idealistic family of a long dream being fulfilled of the hated Shah's defeat in the Iranian Revolution of 1979. However as Marji grows up, she witnesses first hand how the new Iran, now ruled by Islamic fundamentalists, has become a repressive tyranny on its own. With Marji dangerously refusing to remain silent at this injustice, her parents send her abroad to Vienna to study for a better life. However, this change proves an equally difficult trial with the young woman finding herself in a different culture loaded with abrasive characters and profound disappointments that deeply trouble her. Even when she returns home, Marji finds that both she and homeland have changed too much and the young woman and her loving family must decide where she truly belongs. Written by Kenneth Chisholm (kchishol@rogers.com)","Genre":"Animation, Biography, Drama","Keywords":"revolution, iran, girl, dream, islamic revolution","imdbRating":"8.0","imdbVotes":"68,071","Awards":"Nominated for 1 Oscar. Another 27 wins & 54 nominations.","Metascore":"90","Released":"22 February 2008 (USA) ","Actors":"Chiara Mastroianni, Catherine Deneuve, Gena Rowlands ","Director":"Vincent Paronnaud, Marjane Satrapi","Writer":"Marjane Satrapi (comic), Vincent Paronnaud (scenario)","Running_time":"PT96M / 1h 36min","Description":"Directed by Vincent Paronnaud, Marjane Satrapi.  With Chiara Mastroianni, Catherine Deneuve, Gena Rowlands, Danielle Darrieux. A precocious and outspoken Iranian girl grows up during the Islamic Revolution.","Rated":"PG-13"}