{"imdbID":"tt0857191","Title":"The Visitor","Year":"2007","Director":"Tom McCarthy","Writer":"Tom McCarthy","Country":"USA","Language":"English, French, Arabic, Romanian","Gross":"$9,422,422 (USA) (3 October 2008)","Production_Co":"Groundswell Productions, Next Wednesday Productions, Participant Media ","Runtime":"104 min","Cast":"Richard Jenkins, Haaz Sleiman, Danai Gurira, Hiam Abbass, Marian Seldes, Maggie Moore, Michael Cumpsty, Bill McHenry, Richard Kind, Tzahi Moskovitz, Amir Arison, Neal Lerner, Ramon Fernandez, Frank Pando, Waleed Zuaiter","Plot":"A college professor travels to New York City to attend a conference and finds a young couple living in his apartment. In Connecticut, lonely widowed Professor Walter Vale has a boring life. He teaches only one class at the local college and is trying to learn how to play the piano, despite not having the necessary musical talent. Walter is assigned to attend a conference about Global Policy and Development at New York University, where he is to give a lecture about a paper on which he is co-author. When he arrives at his apartment in New York, he finds Tarek Khalil, a Syrian musician, and Zainab, a Senegalese street vendor, living there. He sympathizes with the situation of the illegal immigrants and invites the couple to stay with him. Tarek invites him to go to his gig at Jules Live Jazz. Walter is fascinated with his African drum and Tarek offers to teach Walter to play the drum. However, after an incident in the subway, Tarek is arrested by the police and sent to a detention center for illegal immigrants. Walter has just hired a lawyer to defend Tarek when, out of the blue, Tarek's mother Mouna ... Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Drama","Keywords":"apartment, immigrant, professor, illegal immigrant, subway","imdbRating":"7.7","imdbVotes":"36,669","Awards":"Nominated for 1 Oscar. Another 18 wins & 33 nominations.","Metascore":"79","Released":"23 May 2008 (USA) ","Location":"East Village Wines, East Village, Manhattan, New York City, New York, USA ","Actors":"Richard Jenkins, Haaz Sleiman, Danai Gurira ","Running_time":"PT104M / 1h 44min","Description":"Directed by Tom McCarthy.  With Richard Jenkins, Haaz Sleiman, Danai Gurira, Hiam Abbass. A college professor travels to New York City to attend a conference and finds a young couple living in his apartment.","Rated":"PG-13"}