{"imdbID":"tt0810819","Title":"The Danish Girl","Year":"2015","Director":"Tom Hooper","Country":"UK, USA, Belgium, Denmark, Germany","Language":"English, French, German","Budget":"$25,000,000 (estimated)","Gross":"$11,074,001 (USA) (4 March 2016)","Production_Co":"Working Title Films, Artémis Productions, Kvinde Films ","Runtime":"119 min","Cast":"Alicia Vikander, Eddie Redmayne, Tusse Silberg, Adrian Schiller, Amber Heard, Emerald Fennell, Henry Pettigrew, Claus Bue, Peter Krag, Angela Curran, Pixie, Richard Dixon, Ben Whishaw, Pip Torrens, Paul Bigley","Plot":"A fictitious love story loosely inspired by the lives of Danish artists Lili Elbe and Gerda Wegener. Lili and Gerda's marriage and work evolve as they navigate Lili's groundbreaking journey as a transgender pioneer. Copenhagen, 1926. Danish artist, Gerda Wegener, painted her own husband, Einar Wegener (Eddie Redmayne), as a lady in her painting. When the painting gained popularity, Einar started to change his appearance into a female appearance and named himself Lili Elbe. With his feminism passion and Gerda's support, Einar - or Elbe - attempted one of the first male-to-female sex reassignment surgery, a decision that turned into a massive change for their marriage, that Gerda realized her own husband is no longer a man or the person she married before. A childhood friend of Einar, art-dealer Hans Axgil (Matthias Schoenaerts), shows up and starts a complex love triangle with the couple. Written by Gusde","Genre":"Biography, Drama, Romance","Keywords":"painting, transgender, gender identity, lgbtq, love","imdbRating":"7.0","imdbVotes":"55,893","Awards":"Won 1 Oscar. Another 25 wins & 67 nominations.","Metascore":"66","Released":"22 January 2016 (USA) ","Location":"Copenhagen, Denmark ","Actors":"Eddie Redmayne, Alicia Vikander, Amber Heard ","Writer":"David Ebershoff (novel), Lucinda Coxon (screenplay)","Running_time":"PT119M / 1h 59min","Description":"Directed by Tom Hooper.  With Eddie Redmayne, Alicia Vikander, Amber Heard, Ben Whishaw. A fictitious love story loosely inspired by the lives of Danish artists Lili Elbe and Gerda Wegener. Lili and Gerda's marriage and work evolve as they navigate Lili's groundbreaking journey as a transgender pioneer.","Rated":"R"}