{"imdbID":"tt0876563","Title":"Ponyo","Year":"2008","Director":"Hayao Miyazaki","Writer":"Hayao Miyazaki","Taglines":"Welcome To A World Where Anything Is Possible.","Certificate":"G | See all certifications »","Country":"Japan","Language":"Japanese","Also_Known_As":"Ponyo ","Budget":"JPY 3,400,000,000 (estimated)","Opening_Weekend":"$3,585,852 (USA) (14 August 2009)","Gross":"$15,081,783 (USA) (30 October 2009)","Production_Co":"Studio Ghibli, Nippon Television Network (NTV), Dentsu ","Runtime":"101 min","Sound_Mix":"Dolby Digital EX (as Dolby Digital Surround EX)| DTS-ES (6.1 channels)| Dolby Digital (English-language version)","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Hayao Miyazaki stated at the 2009 San Diego Comic Con that he was inspired to create the film after watching Disney's animated adaptation The Little Mermaid (1989). See more »","Cast":"Tomoko Yamaguchi, Kazushige Nagashima, Yûki Amami, Jôji Tokoro, Yuria Nara, Hiroki Doi, Rumi Hiiragi, Akiko Yano, Kazuko Yoshiyuki, Tomoko Naraoka, Shin'ichi Hatori, Tokie Hidari, Eimi Hiraoka, Nozomi Ôhashi, Akihiko Ishizumi","Plot":"An adventure about a five-year-old boy and his relationship with Ponyo, a goldfish princess who longs to become a human after falling in love with him. The son of a sailor, 5-year old Sosuke lives a quiet life on an oceanside cliff with his mother Lisa. One fateful day, he finds a beautiful goldfish trapped in a bottle on the beach and upon rescuing her, names her Ponyo. But she is no ordinary goldfish. The daughter of a masterful wizard and a sea goddess, Ponyo uses her father's magic to transform herself into a young girl and quickly falls in love with Sosuke, but the use of such powerful sorcery causes a dangerous imbalance in the world. As the moon steadily draws nearer to the earth and Ponyo's father sends the ocean's mighty waves to find his daughter, the two children embark on an adventure of a lifetime to save the world and fulfill Ponyo's dreams of becoming human. Written by The Massie Twins","Genre":"Animation, Family, Fantasy","Keywords":"sea goddess, magical realism, children adventure, tsunami, small town","imdbRating":"7.7","imdbVotes":"82,059","Awards":"11 wins & 15 nominations.","Metascore":"86","Released":"14 August 2009 (USA) ","Actors":"Cate Blanchett, Matt Damon, Liam Neeson ","Running_time":"PT101M / 1h 41min","Description":"Directed by Hayao Miyazaki.  With Cate Blanchett, Matt Damon, Liam Neeson, Tomoko Yamaguchi. An adventure about a five-year-old boy and his relationship with Ponyo, a goldfish princess who longs to become a human after falling in love with him.","Rated":"G"}