{"imdbID":"tt0870111","Title":"Frost/Nixon","Year":"2008","Director":"Ron Howard","Country":"USA, UK, France","Language":"English","Budget":"$35,000,000 (estimated)","Gross":"$18,593,156 (USA) (20 March 2009)","Production_Co":"Universal Pictures, Imagine Entertainment, Working Title Films ","Runtime":"122 min","Cast":"Frank Langella, Michael Sheen, Sam Rockwell, Kevin Bacon, Matthew Macfadyen, Oliver Platt, Rebecca Hall, Toby Jones, Andy Milder, Kate Jennings Grant, Gabriel Jarret, Jim Meskimen, Patty McCormack, Geoffrey Blake, Clint Howard","Plot":"A dramatic retelling of the post-Watergate television interviews between British talk-show host David Frost and former president Richard Nixon. Writer Peter Morgan's legendary battle between Richard Nixon, the disgraced president with a legacy to save, and David Frost, a jet-setting television personality with a name to make, in the story of the historic encounter that changed both their lives. For three years after being forced from office, Nixon remained silent. But in summer 1977, the steely, cunning former commander-in-chief agreed to sit for one all-inclusive interview to confront the questions of his time in office and the Watergate scandal that ended his presidency. Nixon surprised everyone in selecting Frost as his televised confessor, intending to easily outfox the breezy British showman and secure a place in the hearts and minds of Americans (as well as a $600,000 fee). Likewise, Frost's team harbored doubts about their boss' ability to hold his own. But as cameras rolled, a charged battle of wits resulted. Written by alfiehitchie","Genre":"Drama, History","Keywords":"interview, watergate, president, resignation, scandal","imdbRating":"7.7","imdbVotes":"87,221","Awards":"Nominated for 5 Oscars. Another 20 wins & 68 nominations.","Metascore":"80","Released":"23 January 2009 (USA) ","Location":"Palos Verdes Estates, California, USA ","Actors":"Frank Langella, Michael Sheen, Kevin Bacon ","Writer":"Peter Morgan (screenplay), Peter Morgan (play)","Running_time":"PT122M / 2h 2min","Description":"Directed by Ron Howard.  With Frank Langella, Michael Sheen, Kevin Bacon, Sam Rockwell. A dramatic retelling of the post-Watergate television interviews between British talk-show host David Frost and former president Richard Nixon.","Rated":"R"}