{"imdbID":"tt0842926","Title":"The Kids Are All Right","Year":"2010","Director":"Lisa Cholodenko","Country":"USA","Language":"English","Budget":"$3,500,000 (estimated)","Gross":"£1,485,900 (UK) (19 November 2010)","Production_Co":"Focus Features, Gilbert Films, Saint Aire Production ","Runtime":"106 min","Cast":"Julianne Moore, Annette Bening, Mark Ruffalo, Mia Wasikowska, Josh Hutcherson, Yaya DaCosta, Kunal Sharma, Eddie Hassell, Zosia Mamet, Joaquín Garrido, Rebecca Lawrence Levy, Lisa Eisner, Eric Eisner, Sasha Spielberg, James MacDonald","Plot":"Two children conceived by artificial insemination bring their biological father into their non-traditional family life. Nic and Jules are in a long term, committed, loving but by no means perfect same-sex relationship. Nic, a physician, needs to wield what she believes is control, whereas Jules, under that control, is less self-assured. During their relationship, Jules has floundered in her \"nine to five\" life, sometimes trying to start a business - always unsuccessfully - or being the stay-at-home mom. She is currently trying to start a landscape design business. They have two teen-aged children, Joni (conceived by Nic) and Laser (by Jules). Although not exact replicas, each offspring does more closely resemble his/her biological mother in temperament. Joni and Laser are also half-siblings, having the same unknown sperm donor father. Shortly after Joni's eighteenth birthday and shortly before she plans to leave the house and head off to college, Laser, only fifteen and underage to do so, pleads with her to try and contact their sperm donor father. Somewhat reluctantly, she does. He is late ... Written by Huggo","Genre":"Comedy, Drama","Keywords":"sperm, sperm donor, college, biological father, motorcycle","imdbRating":"7.1","imdbVotes":"108,373","Awards":"Nominated for 4 Oscars. Another 28 wins & 112 nominations.","Metascore":"86","Released":"30 July 2010 (USA) ","Location":"Los Angeles, California, USA ","Actors":"Annette Bening, Julianne Moore, Mark Ruffalo ","Writer":"Lisa Cholodenko, Stuart Blumberg","Running_time":"PT106M / 1h 46min","Description":"Directed by Lisa Cholodenko.  With Annette Bening, Julianne Moore, Mark Ruffalo, Mia Wasikowska. Two children conceived by artificial insemination bring their biological father into their non-traditional family life.","Rated":"R"}