{"imdbID":"tt0813547","Title":"The Counterfeiters","Year":"2007","Director":"Stefan Ruzowitzky","Taglines":"A genius con artist put to work by the Nazis. A survivor's tale you've never seen before. ","Country":"Austria, Germany","Language":"German, Russian, English, Hebrew","Also_Known_As":"The Counterfeiters ","Budget":"€4,200,000 (estimated)","Opening_Weekend":"$87,514 (USA) (22 February 2008)","Gross":"$5,484,715 (USA) (22 August 2008)","Production_Co":"Magnolia Filmproduktion, Beta Cinema, Filmförderung Hamburg ","Runtime":"98 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"First Austrian film to win an Academy Award in the Best Foreign Language Film Category. See more »","Goofs":"Only prisoners admitted to the Auschwitz concentration camp complex had tattoos placed on their left forearms, but this story doesn't take place there and no other camps employed tattooing. Increasingly, movies, paintings, and other media have used the tattooed arm as a \"symbol\" of the camps or even the Holocaust itself - despite the historical error. There were two series: A ( up until 20,000 - July 30, 1944), and the B series - starting shortly thereafter. Those selected for the gas chambers after arriving were not included. These numbers were meant to be used as an identification marker at the time of death of the prisoner. See more »","Cast":"Karl Markovics, August Diehl, Devid Striesow, Martin Brambach, August Zirner, Veit Stübner, Sebastian Urzendowsky, Andreas Schmidt, Tilo Prückner, Lenn Kudrjawizki, Marian Kalus, Norman Stoffregen, Bernd Raucamp, Gode Benedix, Oliver Kanter","Plot":"The story of the Operation Bernhard, the largest counterfeiting operation in history, carried out by Germany during WWII. The Counterfeiters is the true story of the largest counterfeiting operation in history, set up by the Nazis in 1936. Salomon \"Sally\" Sorowitsch is the king of counterfeiters. He lives a mischievous life of cards, booze, and women in Berlin during the Nazi-era. Suddenly his luck runs dry when arrested by Superintendent Friedrich Herzog. Immediately thrown into the Mauthausen concentration camp, Salomon exhibits exceptional skills there and is soon transferred to the upgraded camp of Sachsenhausen. Upon his arrival, he once again comes face to face with Herzog, who is there on a secret mission. Hand-picked for his unique skill, Salomon and a group of professionals are forced to produce fake foreign currency under the program Operation Bernhard. The team, which also includes detainee Adolf Burger, is given luxury barracks for their assistance. But while Salomon attempts to weaken the economy of Germany's allied opponents, Adolf refuses to use his skills for Nazi profit and would like to... Written by Sony Pictures Classics","Genre":"Crime, Drama, War","Keywords":"male full frontal nudity, male pubic hair, pubic hair, inmate, nudity","imdbRating":"7.6","imdbVotes":"35,903","Awards":"Won 1 Oscar. Another 6 wins & 10 nominations.","Metascore":"78","Released":"18 April 2008 (USA) ","Location":"Nice, Alpes-Maritimes, France ","Actors":"Karl Markovics, August Diehl, Devid Striesow ","Writer":"Adolf Burger (book), Stefan Ruzowitzky (screenplay)","Running_time":"PT98M / 1h 38min","Description":"Directed by Stefan Ruzowitzky.  With Karl Markovics, August Diehl, Devid Striesow, Martin Brambach. The story of the Operation Bernhard, the largest counterfeiting operation in history, carried out by Germany during WWII.","Rated":"R"}