{"imdbID":"tt0816442","Title":"The Book Thief","Year":"2013","Director":"Brian Percival","Taglines":"This is the tale of the Book Thief, as narrated by death. And when Death tells a story, you really have to listen. It's just a small story really, about, amongst other things: a girl+an accordionist+some fanatical Germans+a Jewish fist fighter+and quite a lot of thievery. ","Country":"USA, Germany","Language":"English, German","Also_Known_As":"Ladrona de libros ","Opening_Weekend":"$105,005 (USA) (8 November 2013)","Gross":"$21,483,154 (USA) (4 April 2014)","Production_Co":"Fox 2000 Pictures, Sunswept Entertainment, TSG Entertainment ","Runtime":"131 min","Sound_Mix":"Dolby Digital | SDDS | Datasat","Color":"Color | Black and White","Aspect_Ratio":"2.35 : 1","Trivia":"Konrad Duden wrote the Duden Dictionary and Thesaurus. See more »","Goofs":"During the September 1939 scene, a boy on a bicycle holds a newspaper and excitedly exclaims Hitler has declared war. This is factually incorrect. England and France both officially declared war on Germany on 3 September 1939. Germany did not declare war on either nations. Hitler was hoping both England and France would come to the negotiating table as they had done previously over Czechoslovakia (The 1938 Munich Agreement). This led to a period known as 'The Phoney War' when both side did little after the fall of Poland. See more »","Cast":"Roger Allam, Sophie Nélisse, Heike Makatsch, Julian Lehmann, Gotthard Lange, Rainer Reiners, Kirsten Block, Geoffrey Rush, Emily Watson, Nico Liersch, Ludger Bökelmann, Paul Schaefer, Nozomi Linus Kaisar, Oliver Stokowski, Robert Beyer","Plot":"While subjected to the horrors of World War II Germany, young Liesel finds solace by stealing books and sharing them with others. In the basement of her home, a Jewish refugee is being protected by her adoptive parents. In 1938, the young girl Liesel Meminger is traveling by train with her mother and her younger brother when he dies. Her mother buries the boy in a cemetery by the tracks and Liesel picks up a book, \"The Gravediggers Handbook\", which was left on the grave of her brother and brings it with her. Liesel is delivered to a foster family in a small town and later she learns that her mother left her because she is a communist. Her stepmother, Rosa Hubermann, is a rude but caring woman and her stepfather, Hans Hubermann, is a simple kind-hearted man. Liesel befriends her next door neighbor, the boy Rudy Steiner, and they go together to the school. When Hans discovers that Liesel cannot read, he teaches her using her book and Liesel becomes an obsessed reader. During a Nazi speech where the locals are forced to burn books in a bonfire, Liesel recovers one book for her and the Major's wife Ilsa Hermann witnesses her action. Meanwhile Hans hides the Jewish Max Vandenburg, who is the son of a ... Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Drama, War","Keywords":"book, basement, girl, library, track","imdbRating":"7.6","imdbVotes":"94,697","Awards":"Nominated for 1 Oscar. Another 6 wins & 14 nominations.","Metascore":"53","Released":"27 November 2013 (USA) ","Location":"Berlin, Germany ","Actors":"Sophie Nélisse, Geoffrey Rush, Emily Watson ","Writer":"Markus Zusak (based on the novel by), Michael Petroni (screenplay)","Running_time":"PT131M / 2h 11min","Description":"Directed by Brian Percival.  With Sophie Nélisse, Geoffrey Rush, Emily Watson, Ben Schnetzer. While subjected to the horrors of World War II Germany, young Liesel finds solace by stealing books and sharing them with others. In the basement of her home, a Jewish refugee is being protected by her adoptive parents.","Rated":"PG-13"}