{"imdbID":"tt0880502","Title":"The Edge of Heaven","Year":"2007","Director":"Fatih Akin","Writer":"Fatih Akin","Certificate":"Unrated | See all certifications »","Country":"Germany, Turkey, Italy","Language":"German, Turkish, English","Also_Known_As":"The Edge of Heaven ","Opening_Weekend":"$18,593 (USA) (23 May 2008)","Gross":"$741,283 (USA) (10 October 2008)","Production_Co":"Anka Film, BKM, Dorje Film ","Runtime":"122 min","Sound_Mix":"Dolby Digital EX","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The book Nejat gives to his father is a (at that point fictitious) Turkish translation of \"Die Tochter des Schmieds\" (The Blacksmith's Daughter) by Selim Özdogan. Selim Özdogan is a good friend of Fatih Akin. See more »","Goofs":"In the movie, police officials are shown in the Pasakapisi Prison. Indeed, in Turkey the prisons are guarded and controlled not by the police but by the \"prison guards\" and the gendarme. See more »","Crazy_Credits":"Before the credits start to roll, there's a dedication to producer and actor Andreas Thiel, who died in Istanbul shortly before filming was finished. See more »","Cast":"Baki Davrak, Gürsoy Gemec, Cengiz Daner, Tuncel Kurtiz, Nursel Köse, Nurgül Yesilçay, Idil Üner, Erkan Can, Turgay Tanülkü, Elcim Eroglu, Nurten Güner, Asuman Altinay, Gökhan Kirac, Nejat Isler, Lars Rudolph","Plot":"A Turkish man travels to Istanbul to find the daughter of his father's former girlfriend. Nejat seems disapproving about his widower father Ali's choice of prostitute Yeter for a live-in girlfriend. But he grows fond of her when he discovers she sends money home to Turkey for her daughter's university studies. Yeter's sudden death distances father and son. Nejat travels to Istanbul to search for Yeter's daughter Ayten. Political activist Ayten has fled the Turkish police and is already in Germany. She is befriended by a young woman, Lotte, who invites rebellious Ayten to stay in her home, a gesture not particularly pleasing to her conservative mother Susanne. When Ayten is arrested and her asylum plea is denied, she is deported and imprisoned in Turkey. Lotte travels to Turkey,where she gets caught up in the seemingly hopeless situation of freeing Ayten. Written by omayra73@yahoo.com","Genre":"Drama","Keywords":"tragic event, istanbul, prostitute, police, germany","imdbRating":"7.9","imdbVotes":"25,568","Awards":"32 wins & 14 nominations.","Metascore":"85","Released":"27 September 2007 (Germany) ","Location":"Bremen, Germany ","Actors":"Baki Davrak, Gürsoy Gemec, Cengiz Daner ","Running_time":"PT122M / 2h 2min","Description":"Directed by Fatih Akin.  With Baki Davrak, Gürsoy Gemec, Cengiz Daner, Tuncel Kurtiz. A Turkish man travels to Istanbul to find the daughter of his father's former girlfriend.","Rated":"UNRATED"}