{"imdbID":"tt0851578","Title":"Paprika","Year":"2006","Director":"Satoshi Kon","Taglines":"This is your brain on anime.","Country":"Japan","Language":"Japanese, English","Also_Known_As":"Paprika ","Opening_Weekend":"$45,429 (USA) (25 May 2007)","Gross":"$881,302 (USA) (19 October 2007)","Production_Co":"Madhouse, Sony Pictures Entertainment ","Runtime":"90 min","Sound_Mix":"SDDS | DTS | Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The tall and short bartenders in Paprika's website are voiced by director Satoshi Kon, and the original author of the Paprika novel, Yasutaka Tsutsui, respectively. See more »","Cast":"Megumi Hayashibara, Tôru Furuya, Kôichi Yamadera, Katsunosuke Hori, Tôru Emori, Akio Ôtsuka, Hideyuki Tanaka, Satomi Kôrogi, Daisuke Sakaguchi, Mitsuo Iwata, Rikako Aikawa, Shin'ichirô Ôta, Satoshi Kon, Yasutaka Tsutsui, Brian Beacock","Plot":"When a machine that allows therapists to enter their patients' dreams is stolen, all hell breaks loose. Only a young female therapist can stop it: Paprika. Three scientists at the Foundation for Psychiatric Research fail to secure a device they've invented, the D.C. Mini, which allows people to record and watch their dreams. A thief uses the device to enter people's minds, when awake, and distract them with their own dreams and those of others. Chaos ensues. The trio - Chiba, Tokita, and Shima - assisted by a police inspector and by a sprite named Paprika must try to identify the thief as they ward off the thief's attacks on their own psyches. Dreams, reality, and the movies merge, while characters question the limits of science and the wisdom of Big Brother. Written by <jhailey@hotmail.com>","Genre":"Animation, Adventure, Crime","Keywords":"butterfly collection, lucid dream, flashback, virtual reality, movie theatre","imdbRating":"7.7","imdbVotes":"41,685","Awards":"6 wins & 5 nominations.","Metascore":"81","Released":"22 June 2007 (USA) ","Actors":"Megumi Hayashibara, Tôru Emori, Katsunosuke Hori ","Writer":"Yasutaka Tsutsui (novel), Seishi Minakami (screenplay) | 1 more credit »","Running_time":"PT90M / 1h 30min","Description":"Directed by Satoshi Kon.  With Megumi Hayashibara, Tôru Emori, Katsunosuke Hori, Tôru Furuya. When a machine that allows therapists to enter their patients' dreams is stolen, all hell breaks loose. Only a young female therapist can stop it: Paprika.","Rated":"R"}