{"imdbID":"tt0878804","Title":"The Blind Side","Year":"2009","Director":"John Lee Hancock","Country":"USA","Language":"English","Budget":"$29,000,000 (estimated)","Gross":"$255,950,375 (USA) (14 May 2010)","Production_Co":"Alcon Entertainment, Left Tackle Pictures, Netter Productions ","Cast":"Sandra Bullock, Tim McGraw, Quinton Aaron, Jae Head, Lily Collins, Ray McKinnon, Kim Dickens, Adriane Lenox, Kathy Bates, Catherine Dyer, Andy Stahl, Tom Nowicki, Libby Whittemore, Brian Hollan, Melody Weintraub","Plot":"The story of Michael Oher, a homeless and traumatized boy who became an All American football player and first round NFL draft pick with the help of a caring woman and her family. Based on the true story of Leigh Anne and Sean Tuohy who take in a homeless teenage African-American, Michael \"Big Mike\" Oher. Michael has no idea who his father is and his mother is a drug addict. Michael has had little formal education and few skills to help him learn. Leigh Anne soon takes charge however, as is her nature, ensuring that the young man has every opportunity to succeed. When he expresses an interest in football, she goes all out to help him, including giving the coach a few ideas on how best to use Michael's skills. They not only provide him with a loving home, but hire a tutor to help him improve his grades to the point where he would qualify for an NCAA Division I athletic scholarship. Michael Oher was the first-round pick of the Baltimore Ravens in the 2009 NFL draft. Written by garykmcd","Genre":"Biography, Drama, Sport","Keywords":"american football, football star, high school football, based on true story, left tackle","imdbRating":"7.7","imdbVotes":"214,253","Awards":"Won 1 Oscar. Another 7 wins & 29 nominations.","Metascore":"53","Released":"20 November 2009 (USA) ","Location":"Agnes Scott College - 141 E. College Avenue, Decatur, Georgia, USA ","Actors":"Quinton Aaron, Sandra Bullock, Tim McGraw ","Writer":"John Lee Hancock, Michael Lewis (book)","Running_time":"PT129M / 2h 9min","Description":"Directed by John Lee Hancock.  With Quinton Aaron, Sandra Bullock, Tim McGraw, Jae Head. The story of Michael Oher, a homeless and traumatized boy who became an All American football player and first round NFL draft pick with the help of a caring woman and her family.","Rated":"PG-13"}