{"imdbID":"tt0848228","Title":"The Avengers","Year":"2012","Director":"Joss Whedon","Taglines":"Avengers Assemble!","Country":"USA","Language":"English, Russian","Also_Known_As":"Group Hug ","Budget":"$220,000,000 (estimated)","Opening_Weekend":"$207,438,708 (USA) (4 May 2012)","Gross":"$623,279,547 (USA) (28 September 2012)","Production_Co":"Marvel Studios, Paramount Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"143 min | 173 min (extended cut)","Sound_Mix":"Datasat | Dolby Digital | Dolby Surround 7.1","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Enver Gjokaj plays the young police officer Captain America gives orders to at the beginning of the battle of New York. He also plays Agent Sousa in Marvel's Agent Carter (2015). See more »","Goofs":"When one of the computer operators resumed playing Galaga, the sound effect used is for an enemy ship attempting to capture the player's ship. Instead, this sound effect was used for normal gameplay. See more »","Crazy_Credits":"The Marvel Studios and Paramount Pictures logos are seen within the Tesseract. See more »","Cast":"Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Tom Hiddleston, Clark Gregg, Cobie Smulders, Stellan Skarsgård, Samuel L. Jackson, Gwyneth Paltrow, Paul Bettany, Alexis Denisof, Tina Benko","Plot":"Earth's mightiest heroes must come together and learn to fight as a team if they are to stop the mischievous Loki and his alien army from enslaving humanity. Nick Fury is the director of S.H.I.E.L.D., an international peace-keeping agency. The agency is a who's who of Marvel Super Heroes, with Iron Man, The Incredible Hulk, Thor, Captain America, Hawkeye and Black Widow. When global security is threatened by Loki and his cohorts, Nick Fury and his team will need all their powers to save the world from disaster. Written by WellardRockard","Genre":"Action, Adventure, Sci-Fi","Keywords":"s.h.i.e.l.d., iron man, soldier, assassin, alien invasion","imdbRating":"8.1","imdbVotes":"942,625","Awards":"Nominated for 1 Oscar. Another 36 wins & 76 nominations.","Metascore":"69","Released":"4 May 2012 (USA) ","Location":"Pittsburgh, Pennsylvania, USA ","Actors":"Robert Downey Jr., Chris Evans, Scarlett Johansson ","Writer":"Joss Whedon (screenplay), Zak Penn (story) | 1 more credit »","Running_time":"PT143M / 2h 23min","Description":"Directed by Joss Whedon.  With Robert Downey Jr., Chris Evans, Scarlett Johansson, Jeremy Renner. Earth's mightiest heroes must come together and learn to fight as a team if they are to stop the mischievous Loki and his alien army from enslaving humanity.","Rated":"PG-13"}