{"imdbID":"tt0978762","Title":"Mary and Max","Year":"2009","Director":"Adam Elliot","Writer":"Adam Elliot","Taglines":"Sometimes perfect strangers make the best friends. ","Certificate":"Not Rated | See all certifications »","Country":"Australia","Language":"English, Yiddish","Also_Known_As":"Mary & Max ","Budget":"AUD 8,240,000 (estimated)","Production_Co":"Melodrama Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"92 min","Sound_Mix":"Dolby Digital","Color":"Color | Black and White","Aspect_Ratio":"1.85 : 1","Trivia":"The blind man walking down the New York street looks like Barry Humphries and is reminiscent of his character Bert Schnick from 'Shock Treatment' See more »","Goofs":"When Mary is imagining what life is like in America, she imagines a can of \"Yanky Cola\"; however, the can has a retained ring pull, which wasn't first used until 1977. See more »","Crazy_Credits":"Before the end credits the next quote appears: \"God gave us our relatives; thank God we can choose our friends\" by Ethel Watts Mumford. See more »","Cast":"Toni Collette, Philip Seymour Hoffman, Barry Humphries, Eric Bana, Bethany Whitmore, Renée Geyer, Ian 'Molly' Meldrum, Julie Forsyth, John Flaus, Christopher Massey, Shaun Patten, Carolyn Shakespeare-Allen, Leanne Smith","Plot":"A tale of friendship between two unlikely pen pals: Mary, a lonely, eight-year-old girl living in the suburbs of Melbourne, and Max, a forty-four-year old, severely obese man living in New York. In the mid-1970's, a homely, friendless Australian girl of 8 picks a name out of a Manhattan phone book and writes to him; she includes a chocolate bar. She's Mary Dinkle, the only child of an alcoholic mother and a distracted father. He's Max Horowitz, an overweight man with Asperger's, living alone in New York. He writes back, with chocolate. Thus begins a 20-year correspondence, interrupted by a stay in an asylum and a few misunderstandings. Mary falls in love with a neighbor, saves money to have a birthmark removed and deals with loss. Max has a friendship with a neighbor, tries to control his weight, and finally gets the dream job. Will the two ever meet face to face? Written by <jhailey@hotmail.com>","Genre":"Animation, Comedy, Drama","Keywords":"friendship, neighbor, chocolate, phone book, correspondence","imdbRating":"8.2","imdbVotes":"113,584","Awards":"4 wins & 7 nominations.","Metascore":"","Released":"9 April 2009 (Australia) ","Location":"Melbourne, Victoria, Australia","Actors":"Toni Collette, Philip Seymour Hoffman, Eric Bana ","Running_time":"PT92M / 1h 32min","Description":"Directed by Adam Elliot.  With Toni Collette, Philip Seymour Hoffman, Eric Bana, Barry Humphries. A tale of friendship between two unlikely pen pals: Mary, a lonely, eight-year-old girl living in the suburbs of Melbourne, and Max, a forty-four-year old, severely obese man living in New York.","Rated":"NOT RATED"}