{"imdbID":"tt0986233","Title":"Hunger","Year":"2008","Director":"Steve McQueen","Taglines":"An odyssey, in which the smallest gestures become epic and when the body is the last resource for protest. ","Certificate":"Not Rated | See all certifications »","Country":"UK, Ireland","Language":"English, Irish","Also_Known_As":"Fome ","Budget":"£1,500,000 (estimated)","Opening_Weekend":"£136,413 (UK) (31 October 2008)","Gross":"$154,084 (USA) (5 June 2009)","Production_Co":"Film4, Channel Four Film, Northern Ireland Screen ","Runtime":"96 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"First theatrical film directed by Steve McQueen. See more »","Goofs":"Raymond Lohan's Ford Granada is a Mk2 Facelift, which was released in winter 1981 and would've appeared on Irish roads in 1982. See more »","Cast":"Stuart Graham, Laine Megaw, Brian Milligan, Liam McMahon, Karen Hassan, Michael Fassbender, Frank McCusker, Lalor Roddy, Helen Madden, Des McAleer, Geoff Gatt, Rory Mullen, Ben Peel, Helena Bereen, Paddy Jenkins","Plot":"Irish republican Bobby Sands leads the inmates of a Northern Irish prison in a hunger strike. Hunger follows life in the Maze Prison, Northern Ireland with an interpretation of the highly emotive events surrounding the 1981 IRA Hunger Strike, led by Bobby Sands. With an epic eye for detail, the film provides a timely exploration of what happens when body and mind are pushed to the uttermost limit. Written by Icon","Genre":"Biography, Drama","Keywords":"prison, hunger strike, bobby sands, ireland, ira","imdbRating":"7.6","imdbVotes":"49,063","Awards":"45 wins & 31 nominations.","Metascore":"82","Released":"31 October 2008 (UK) ","Actors":"Stuart Graham, Laine Megaw, Brian Milligan ","Writer":"Enda Walsh, Steve McQueen","Running_time":"PT96M / 1h 36min","Description":"Directed by Steve McQueen.  With Stuart Graham, Laine Megaw, Brian Milligan, Liam McMahon. Irish republican Bobby Sands leads the inmates of a Northern Irish prison in a hunger strike.","Rated":"NOT RATED"}