{"imdbID":"tt0929632","Title":"Precious","Year":"2009","Director":"Lee Daniels","Country":"USA","Language":"English, Italian","Budget":"$10,000,000 (estimated)","Gross":"$47,536,959 (USA) (5 March 2010)","Production_Co":"Lionsgate, Lee Daniels Entertainment, Smokewood Entertainment Group ","Runtime":"110 min | 109 min","Cast":"Gabourey Sidibe, Mo'Nique, Paula Patton, Mariah Carey, Sherri Shepherd, Lenny Kravitz, Stephanie Andujar, Chyna Layne, Amina Robinson, Xosha Roquemore, Angelic Zambrana, Aunt Dot, Nealla Gordon, Grace Hightower, Barret Helms","Plot":"In New York City's Harlem circa 1987, an overweight, abused, illiterate teen who is pregnant with her second child is invited to enroll in an alternative school in hopes that her life can head in a new direction. It's Harlem 1987. Sixteen year old Claireece Jones - who goes by her middle name Precious - is an illiterate, overweight black girl. She is pregnant with her second child, both children fathered by her biological father, who has continually raped her since she was a child, but who she doesn't see otherwise. Her infant daughter, Mongo - such named since she has Down Syndrome - lives with Precious' grandmother. Precious lives with her mother Mary, who abuses Precious both physically and emotionally. Mary does nothing but smoke, watch television and collect welfare through fraud (as she doesn't ever look for a job) and believes that education does nothing for Precious, who she would rather also collect welfare if only to bring money into the household. To escape her life, Precious often daydreams of herself in glamorous situations. Because of her current pregnancy, Precious' principal transfers her into an alternative school. In dealing with the school's sympathetic teacher Miss Blu Rain... Written by Huggo","Genre":"Drama","Keywords":"lesbian couple, african american lesbian, lesbian, school, abuse","imdbRating":"7.4","imdbVotes":"84,178","Awards":"Won 2 Oscars. Another 111 wins & 92 nominations.","Metascore":"79","Released":"20 November 2009 (USA) ","Location":"New York City, New York, USA ","Actors":"Gabourey Sidibe, Mo'Nique, Paula Patton ","Writer":"Geoffrey Fletcher (screenplay), Sapphire (novel)","Running_time":"PT110M / 1h 50min","Description":"Directed by Lee Daniels.  With Gabourey Sidibe, Mo'Nique, Paula Patton, Mariah Carey. In New York City's Harlem circa 1987, an overweight, abused, illiterate teen who is pregnant with her second child is invited to enroll in an alternative school in hopes that her life can head in a new direction.","Rated":"R"}