{"imdbID":"tt0976051","Title":"The Reader","Year":"2008","Director":"Stephen Daldry","Country":"USA, Germany","Language":"English, German, Greek, Latin","Budget":"$32,000,000 (estimated)","Gross":"$34,180,954 (USA) (1 May 2009)","Production_Co":"Weinstein Company, The, Mirage Enterprises, Studio Babelsberg ","Runtime":"124 min","Cast":"Ralph Fiennes, Jeanette Hain, David Kross, Kate Winslet, Susanne Lothar, Alissa Wilms, Florian Bartholomäi, Friederike Becht, Matthias Habich, Frieder Venus, Marie-Anne Fliegel, Hendrik Arnst, Rainer Sellien, Torsten Michaelis, Moritz Grove","Plot":"Post-WWII Germany: Nearly a decade after his affair with an older woman came to a mysterious end, law student Michael Berg re-encounters his former lover as she defends herself in a war-crime trial. THE READER opens in post-war Germany when teenager Michael Berg becomes ill and is helped home by Hanna, a stranger twice his age. Michael recovers from scarlet fever and seeks out Hanna to thank her. The two are quickly drawn into a passionate but secretive affair. Michael discovers that Hanna loves being read to and their physical relationship deepens. Hanna is enthralled as Michael reads to her from \"The Odyssey,\" \"Huck Finn\" and \"The Lady with the Little Dog.\" Despite their intense bond, Hanna mysteriously disappears one day and Michael is left confused and heartbroken. Eight years later, while Michael is a law student observing the Nazi war crime trials, he is stunned to find Hanna back in his life - this time as a defendant in the courtroom. As Hanna's past is revealed, Michael uncovers a deep secret that will impact both of their lives. THE READER is a story about truth and reconciliation, about how one generation comes to terms with the crimes of another. Written by The Weinstein Company","Genre":"Drama, Romance","Keywords":"war crime, trial, love, nazi, reading","imdbRating":"7.6","imdbVotes":"184,914","Awards":"Won 1 Oscar. Another 24 wins & 45 nominations.","Metascore":"58","Released":"30 January 2009 (USA) ","Location":"Germany ","Actors":"Kate Winslet, Ralph Fiennes, Bruno Ganz ","Writer":"David Hare (screenplay), Bernhard Schlink (book)","Running_time":"PT124M / 2h 4min","Description":"Directed by Stephen Daldry.  With Kate Winslet, Ralph Fiennes, Bruno Ganz, Jeanette Hain. Post-WWII Germany: Nearly a decade after his affair with an older woman came to a mysterious end, law student Michael Berg re-encounters his former lover as she defends herself in a war-crime trial.","Rated":"R"}