{"imdbID":"tt0926084","Title":"Harry Potter and the Deathly Hallows: Part 1","Year":"2010","Director":"David Yates","Taglines":"The End Begins ","Country":"UK, USA","Language":"English","Also_Known_As":"The Deathly Hallows ","Budget":"£150,000,000 (estimated)","Opening_Weekend":"£18,319,721 (UK) (19 November 2010)","Gross":"$294,980,434 (USA) (1 April 2011)","Production_Co":"Warner Bros., Heyday Films ","Runtime":"146 min","Sound_Mix":"Dolby Digital | SDDS | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Features the first and only appearance of Mundungus Fletcher (Andy Linden in the film series. In the books, Fletcher has appeared in every installment since 'Harry Potter and the Order of the Phoenix', and he is briefly mentioned in 'Harry Potter and the Goblet of Fire', but he was always written out of the respective movie adaptations. See more »","Goofs":"When Harry is preparing to jump into the lake after the sword of Gryffindor, he submerges, wearing his glasses. They are present as he drowns. After returning to the surface, all is blurry and he is no longer wearing them. Harry picks them up off the ice, from a position nowhere near the hole he dove through. See more »","Crazy_Credits":"The end credits are in 3D gold text. When they conclude, the Deathly Hallows symbol appears, first in extreme close-up with all three items rotating independently (like the one Mr. Lovegood wears around his neck), then shrinks down with the title appearing centered across it. Next, the line fades out followed by the circle and, as the triangle fades out, the Elder Wand appears in its place. See more »","Cast":"Bill Nighy, Emma Watson, Richard Griffiths, Harry Melling, Daniel Radcliffe, Julie Walters, Bonnie Wright, Rupert Grint, Ian Kelly, Michelle Fairley, Fiona Shaw, Alan Rickman, Carolyn Pickles, Ralph Fiennes, Helena Bonham Carter","Plot":"As Harry races against time and evil to destroy the Horcruxes, he uncovers the existence of three most powerful objects in the wizarding world: the Deathly Hallows. Voldemort's power is growing stronger. He now has control over the Ministry of Magic and Hogwarts. Harry, Ron, and Hermione decide to finish Dumbledore's work and find the rest of the Horcruxes to defeat the Dark Lord. But little hope remains for the Trio, and the rest of the Wizarding World, so everything they do must go as planned. Written by Chris Green","Genre":"Adventure, Family, Fantasy","Keywords":"power, race against time, magic, school of magic, seventh part","imdbRating":"7.7","imdbVotes":"314,775","Awards":"Nominated for 2 Oscars. Another 13 wins & 50 nominations.","Metascore":"65","Released":"19 November 2010 (USA) ","Location":"Wales, UK ","Actors":"Daniel Radcliffe, Emma Watson, Rupert Grint ","Writer":"Steve Kloves (screenplay), J.K. Rowling (novel)","Running_time":"PT146M / 2h 26min","Description":"Directed by David Yates.  With Daniel Radcliffe, Emma Watson, Rupert Grint, Bill Nighy. As Harry races against time and evil to destroy the Horcruxes, he uncovers the existence of three most powerful objects in the wizarding world: the Deathly Hallows.","Rated":"PG-13"}