{"imdbID":"tt0986264","Title":"Like Stars on Earth","Year":"2007","Taglines":"Every Child is Special","Country":"India","Language":"Hindi, English","Also_Known_As":"Like Stars on Earth ","Opening_Weekend":"£66,204 (UK) (21 December 2007)","Gross":"$1,204,660 (USA) (18 January 2008)","Production_Co":"Aamir Khan Productions, PVR Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"165 min","Sound_Mix":"DTS | Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"India's official submission to the Foreign-Language Film category of the 2009 Academy Awards. See more »","Goofs":"During the song \"Jame Raho,\" which portrays the busy and mechanical life of the family, Maya is shown ironing a striped short for Nandkishore. Next cut, he is shown actually wearing a plain shirt instead of the just hurriedly ironed shirt. See more »","Cast":"Darsheel Safary, Aamir Khan, Tanay Chheda, Sachet Engineer, Tisca Chopra, Vipin Sharma, Lalitha Lajmi, Girija Oak, Ravi Khanvilkar, Pratima Kulkarni, Meghna Malik, Sonali Sachdev, Sanjay Dadich, Raaj Gopal Iyer, Bugs Bhargava","Plot":"An eight-year-old boy is thought to be lazy and a trouble-maker, until the new art teacher has the patience and compassion to discover the real problem behind his struggles in school. Ishaan Awasthi is an eight-year-old whose world is filled with wonders that no one else seems to appreciate; colours, fish, dogs and kites are just not important in the world of adults, who are much more interested in things like homework, marks and neatness. And Ishaan just cannot seem to get anything right in class. When he gets into far more trouble than his parents can handle, he is packed off to a boarding school to 'be disciplined'. Things are no different at his new school, and Ishaan has to contend with the added trauma of separation from his family. One day a new art teacher bursts onto the scene, Ram Shankar Nikumbh, who infects the students with joy and optimism. He breaks all the rules of 'how things are done' by asking them to think, dream and imagine, and all the children respond with enthusiasm, all except Ishaan. Nikumbh soon realizes that Ishaan is very unhappy, and he sets out to discover why. With time, patience and care, he ultimately helps Ishaan find himself. Written by Anonymous","Genre":"Drama, Family, Music","Keywords":"school, teacher, boarding school, joy, child","imdbRating":"8.5","imdbVotes":"81,161","Awards":"13 wins & 15 nominations.","Metascore":"","Released":"21 December 2007 (India) ","Location":"Panchgani, Maharashtra, India","Actors":"Darsheel Safary, Aamir Khan, Tanay Chheda ","Director":"Aamir Khan, Amole Gupte (uncredited)","Writer":"Amole Gupte (dialogue & screenplay), Amole Gupte (story)","Running_time":"PT165M / 2h 45min","Description":"Directed by Aamir Khan, Amole Gupte.  With Darsheel Safary, Aamir Khan, Tanay Chheda, Sachet Engineer. An eight-year-old boy is thought to be lazy and a trouble-maker, until the new art teacher has the patience and compassion to discover the real problem behind his struggles in school.","Rated":"PG"}