{"imdbID":"tt0935075","Title":"Rabbit Hole","Year":"2010","Director":"John Cameron Mitchell","Country":"USA","Language":"English","Budget":"$5,000,000 (estimated)","Gross":"$2,221,809 (USA) (1 April 2011)","Production_Co":"Olympus Pictures, Blossom Films, OddLot Entertainment ","Runtime":"91 min","Cast":"Nicole Kidman, Aaron Eckhart, Dianne Wiest, Miles Teller, Tammy Blanchard, Sandra Oh, Giancarlo Esposito, Jon Tenney, Stephen Mailer, Mike Doyle, Roberta Wallach, Patricia Kalember, Ali Marsh, Yetta Gottesman, Colin Mitchell","Plot":"Life for a happy couple is turned upside down after their young son dies in an accident. Becca and Howie Corbett are a happily married couple whose perfect world is forever changed when their young son, Danny, is killed by a car. Becca, an executive-turned-stay-at-home mother, tries to redefine her existence in a surreal landscape of well-meaning family and friends. Painful, poignant, and often funny, Becca's experiences lead her to find solace in a mysterious relationship with a troubled young comic-book artist, Jason - the teenage driver of the car that killed Danny. Becca's fixation with Jason pulls her away from memories of Danny, while Howie immerses himself in the past, seeking refuge in outsiders who offer him something Becca is unable to give. The Corbetts, both adrift, make surprising and dangerous choices as they choose a path that will determine their fate. Written by Anonymous","Genre":"Drama","Keywords":"car, comic book artist, comic book, memory, iphone","imdbRating":"7.0","imdbVotes":"39,859","Awards":"Nominated for 1 Oscar. Another 6 wins & 39 nominations.","Metascore":"76","Released":"28 January 2011 (USA) ","Location":"College Point, Queens, New York City, New York, USA ","Actors":"Nicole Kidman, Aaron Eckhart, Dianne Wiest ","Writer":"David Lindsay-Abaire (screenplay), David Lindsay-Abaire (based on his play: \"Rabbit Hole\")","Running_time":"PT91M / 1h 31min","Description":"Directed by John Cameron Mitchell.  With Nicole Kidman, Aaron Eckhart, Dianne Wiest, Miles Teller. Life for a happy couple is turned upside down after their young son dies in an accident.","Rated":"PG-13"}