{"imdbID":"tt0970179","Title":"Hugo","Year":"2011","Director":"Martin Scorsese","Country":"USA","Language":"English","Budget":"$170,000,000 (estimated)","Gross":"$73,820,094 (USA) (6 April 2012)","Production_Co":"Paramount Pictures, GK Films, Infinitum Nihil ","Runtime":"126 min","Cast":"Ben Kingsley, Sacha Baron Cohen, Asa Butterfield, Chloë Grace Moretz, Ray Winstone, Emily Mortimer, Christopher Lee, Helen McCrory, Michael Stuhlbarg, Frances de la Tour, Richard Griffiths, Jude Law, Kevin Eldon, Gulliver McGrath, Shaun Aylward","Plot":"Set in 1930s Paris, an orphan who lives in the walls of a train station is wrapped up in a mystery involving his late father and an automaton. Hugo is an orphan boy living in the walls of a train station in 1930s Paris. He learned to fix clocks and other gadgets from his father and uncle which he puts to use keeping the train station clocks running. The only thing that he has left that connects him to his dead father is an automaton (mechanical man) that doesn't work without a special key. Hugo needs to find the key to unlock the secret he believes it contains. On his adventures, he meets George Melies, a shopkeeper, who works in the train station, and his adventure-seeking god-daughter. Hugo finds that they have a surprising connection to his father and the automaton, and he discovers it unlocks some memories the old man has buried inside regarding his past. Written by napierslogs","Genre":"Adventure, Drama, Family","Keywords":"automaton, steampunk, railway station, mechanical, train","imdbRating":"7.6","imdbVotes":"238,633","Awards":"Won 5 Oscars. Another 52 wins & 163 nominations.","Metascore":"83","Released":"23 November 2011 (USA) ","Location":"Théâtre de l'Athénée, Paris, France ","Actors":"Asa Butterfield, Chloë Grace Moretz, Christopher Lee ","Writer":"John Logan (screenplay), Brian Selznick (book)","Running_time":"PT126M / 2h 6min","Description":"Directed by Martin Scorsese.  With Asa Butterfield, Chloë Grace Moretz, Christopher Lee, Ben Kingsley. Set in 1930s Paris, an orphan who lives in the walls of a train station is wrapped up in a mystery involving his late father and an automaton.","Rated":"PG"}