{"imdbID":"tt0914798","Title":"The Boy in the Striped Pajamas","Year":"2008","Director":"Mark Herman","Taglines":"A timeless story of innocence lost and humanity found. ","Country":"UK, USA","Language":"English","Also_Known_As":"The Boy in the Striped Pajamas ","Budget":"$12,500,000 (estimated)","Opening_Weekend":"£513,653 (UK) (12 September 2008)","Gross":"$9,030,581 (USA) (16 January 2009)","Production_Co":"Miramax, BBC Films, Heyday Films ","Runtime":"94 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The story is in some parts the story of Rudolph Höss, two times commander in Auschwitz. The name \"Ralf\" is a play with names. His wife did not want him \"in bed\" after realizing what they where doing in the camp (whereupon he was unfaithful with the maid). The house in which the film is made, looks remarkably like their house close to Auschwitz. The children became aware of the camp. His rank (Lieutenant Colonel ) is same as Höss had at the time. In real life, however, Höss had four children and of course what happened in the movie did not happen to the Höss family. See more »","Goofs":"Gretel who gets brainwashed to supporting the third Reich throws away her dolls to act more 'mature' but if you look carefully when she gets a present from Elsa a doll is seen near her bedside. See more »","Crazy_Credits":"Quotation displayed before the opening titles: \"Childhood is measured out by sounds and smells and sights, before the dark hour of reason grows - John Betjeman\" See more »","Cast":"Asa Butterfield, Zac Mattoon O'Brien, Domonkos Németh, Henry Kingsmill, Vera Farmiga, Cara Horgan, Zsuzsa Holl, Amber Beattie, László Áron, David Thewlis, Richard Johnson, Sheila Hancock, Charlie Baker, Iván Verebély, Béla Fesztbaum","Plot":"Set during World War II, a story seen through the innocent eyes of Bruno, the eight-year-old son of the commandant at a concentration camp, whose forbidden friendship with a Jewish boy on the other side of the camp fence has startling and unexpected consequences. Young Bruno lives a wealthy lifestyle in prewar Germany along with his mother, elder sister, and SS Commandant father. The family relocates to the countryside where his father is assigned to take command a prison camp. A few days later, Bruno befriends another youth, strangely dressed in striped pajamas, named Shmuel who lives behind an electrified fence. Bruno will soon find out that he is not permitted to befriend his new friend as he is a Jew, and that the neighboring yard is actually a prison camp for Jews awaiting extermination. Written by rAjOo (gunwanti@hotmail.com)","Genre":"Drama, War","Keywords":"jew, boy, nazis, poison gas, fence","imdbRating":"7.8","imdbVotes":"125,879","Awards":"7 wins & 7 nominations.","Metascore":"55","Released":"26 November 2008 (USA) ","Location":"Hungary ","Actors":"Asa Butterfield, David Thewlis, Rupert Friend ","Writer":"John Boyne (novel), Mark Herman (screenplay)","Running_time":"PT94M / 1h 34min","Description":"Directed by Mark Herman.  With Asa Butterfield, David Thewlis, Rupert Friend, Zac Mattoon O'Brien. Set during World War II, a story seen through the innocent eyes of Bruno, the eight-year-old son of the commandant at a concentration camp, whose forbidden friendship with a Jewish boy on the other side of the camp fence has startling and unexpected consequences.","Rated":"PG-13"}