{"imdbID":"tt0947798","Title":"Black Swan","Year":"2010","Director":"Darren Aronofsky","Country":"USA","Language":"English, French, Italian","Also_Known_As":"El cisne negro ","Budget":"$13,000,000 (estimated)","Opening_Weekend":"$1,443,809 (USA) (3 December 2010)","Gross":"$106,952,327 (USA) (29 April 2011)","Production_Co":"Fox Searchlight Pictures, Cross Creek Pictures, Protozoa Pictures ","":"Show detailed company contact information on IMDbPro »","Runtime":"108 min","Sound_Mix":"Dolby Digital | DTS | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Darren Aronofsky had originally hoped for a budget of about $28-30 million. The budget eventually raised for the film was about $13 million. See more »","Goofs":"When Nina returns home after being assigned a role, she stands at her front door to go in. She is wearing her white scarf around her neck. She then puts her key in the lock and other hand on the door knob as she walks through the door to the other side, her hands are still on the door but her scarf is now over her arm. See more »","Cast":"Natalie Portman, Mila Kunis, Vincent Cassel, Barbara Hershey, Winona Ryder, Benjamin Millepied, Ksenia Solo, Kristina Anapau, Janet Montgomery, Sebastian Stan, Toby Hemingway, Sergio Torrado, Mark Margolis, Tina Sloan, Abraham Aronofsky","Plot":"A committed dancer wins the lead role in a production of Tchaikovsky's \"Swan Lake\" only to find herself struggling to maintain her sanity. Nina (Portman) is a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her obsessive former ballerina mother Erica (Hershey) who exerts a suffocating control over her. When artistic director Thomas Leroy (Cassel) decides to replace prima ballerina Beth MacIntyre (Ryder) for the opening production of their new season, Swan Lake, Nina is his first choice. But Nina has competition: a new dancer, Lily (Kunis), who impresses Leroy as well. Swan Lake requires a dancer who can play both the White Swan with innocence and grace, and the Black Swan, who represents guile and sensuality. Nina fits the White Swan role perfectly but Lily is the personification of the Black Swan. As the two young dancers expand their rivalry into a twisted friendship, Nina begins to get more in touch with her dark side - a recklessness that threatens to destroy her. Written by Fox Searchlight Pictures","Genre":"Drama, Thriller","Keywords":"ballerina, ballet, madness, female protagonist, lesbian kiss","imdbRating":"8.0","imdbVotes":"534,784","Awards":"Won 1 Oscar. Another 87 wins & 233 nominations.","Metascore":"79","Released":"17 December 2010 (USA) ","Location":"Bowling Green, Lower Manhattan, Manhattan, New York City, New York, USA ","Actors":"Natalie Portman, Mila Kunis, Vincent Cassel ","Writer":"Mark Heyman (screenplay), Andres Heinz (screenplay) (as Andrés Heinz) | 2 more credits »","Running_time":"PT108M / 1h 48min","Description":"Directed by Darren Aronofsky.  With Natalie Portman, Mila Kunis, Vincent Cassel, Winona Ryder. A committed dancer wins the lead role in a production of Tchaikovsky's \"Swan Lake\" only to find herself struggling to maintain her sanity.","Rated":"R"}