{"imdbID":"tt0978759","Title":"Frozen River","Year":"2008","Director":"Courtney Hunt","Writer":"Courtney Hunt","Country":"USA","Language":"English, French, Chinese, Urdu","Budget":"$1,000,000 (estimated)","Gross":"$2,508,841 (USA) (13 March 2009)","Production_Co":"Cohen Media Group, Harwood Hunt Productions, Off Hollywood Pictures ","Runtime":"97 min","Cast":"Melissa Leo, Misty Upham, Charlie McDermott, Michael O'Keefe, Mark Boone Junior, James Reilly, Jay Klaitz, John Canoe, Dylan Carusona, Michael Skye, Gargi Shinde, Rajesh Bose, Azin Jahanbakhsh, Jack Phillips, James Phillips","Plot":"Takes place in the days before Christmas near a little-known border crossing on the Mohawk reservation between New York State and Quebec. Here, the lure of fast money from smuggling ... See full summary » Takes place in the days before Christmas near a little-known border crossing on the Mohawk reservation between New York State and Quebec. Here, the lure of fast money from smuggling presents a daily challenge to single moms who would otherwise be earning minimum wage. Two women - one white, one Mohawk, both single mothers faced with desperate circumstances - are drawn into the world of border smuggling across the frozen water of the St. Lawrence River. Ray and Lila - and a New York State Trooper as opponent in an evolving cat-and-mouse game. Written by anonymous","Genre":"Crime, Drama","Keywords":"mohawk, money, river, new york, border","imdbRating":"7.2","imdbVotes":"21,434","Awards":"Nominated for 2 Oscars. Another 32 wins & 36 nominations.","Metascore":"82","Released":"5 September 2008 (USA) ","Location":"New York, USA ","Actors":"Melissa Leo, Misty Upham, Charlie McDermott ","Running_time":"PT97M / 1h 37min","Description":"Directed by Courtney Hunt.  With Melissa Leo, Misty Upham, Charlie McDermott, Michael O'Keefe. Takes place in the days before Christmas near a little-known border crossing on the Mohawk reservation between New York State and Quebec. Here, the lure of fast money from smuggling presents a daily challenge to single moms who would otherwise be earning minimum wage. Two women - one white, one Mohawk, both single mothers faced with desperate circumstances - are drawn into the world of border ...","Rated":"R"}