{"imdbID":"tt0918927","Title":"Doubt","Year":"2008","Director":"John Patrick Shanley","Taglines":"There is no evidence. There are no witnesses. But for one, there is no doubt.","Country":"USA","Language":"English","Also_Known_As":"La duda ","Budget":"$20,000,000 (estimated)","Opening_Weekend":"$507,226 (USA) (12 December 2008)","Gross":"$33,422,556 (USA) (3 April 2009)","Production_Co":"Goodspeed Productions, Scott Rudin Productions ","Runtime":"104 min","Sound_Mix":"SDDS | Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Tom Hanks, John Cusack and David Hyde Pierce were considered to play Father Flynn. See more »","Goofs":"In the movie, the street signs have black letters on a white background, without cross-streets. In 1964, NYC street signs had white letters on blue enamel backgrounds, with the cross-streets printed in smaller letters above. See more »","Cast":"Meryl Streep, Philip Seymour Hoffman, Amy Adams, Viola Davis, Alice Drummond, Audrie Neenan, Susan Blommaert, Carrie Preston, John Costelloe, Lloyd Clay Brown, Joseph Foster, Mike Roukis, Haklar Dezso, Frank Shanley, Robert Ridgell","Plot":"A Catholic school principal questions a priest's ambiguous relationship with a troubled young student. It's 1964, St. Nicholas in the Bronx. A charismatic priest, Father Flynn, is trying to upend the school's strict customs, which have long been fiercely guarded by Sister Aloysius Beauvier, the iron-gloved Principal who believes in the power of fear-based discipline. The winds of political change are sweeping through the community, and indeed, the school has just accepted its first black student, Donald Miller. But when Sister James, a hopeful innocent, shares with Sister Aloysius her guilt-inducing suspicion that Father Flynn is paying too much personal attention to Donald, Sister Aloysius sets off on a personal crusade to unearth the truth and to expunge Flynn from the school. Now, without a shard of proof besides her moral certainty, Sister Aloysius locks into a battle of wills with Father Flynn which threatens to tear apart the community with irrevocable consequences. Written by Miramax Films","Genre":"Drama, Mystery","Keywords":"school, priest, student, nun, boy","imdbRating":"7.5","imdbVotes":"97,208","Awards":"Nominated for 5 Oscars. Another 27 wins & 80 nominations.","Metascore":"68","Released":"25 December 2008 (USA) ","Location":"Beach and Mansion Streets, Bronx, New York City, New York, USA ","Actors":"Meryl Streep, Philip Seymour Hoffman, Amy Adams ","Writer":"John Patrick Shanley (screenplay), John Patrick Shanley (play)","Running_time":"PT104M / 1h 44min","Description":"Directed by John Patrick Shanley.  With Meryl Streep, Philip Seymour Hoffman, Amy Adams, Viola Davis. A Catholic school principal questions a priest's ambiguous relationship with a troubled young student.","Rated":"PG-13"}