{"imdbID":"tt1032846","Title":"4 Months, 3 Weeks and 2 Days","Year":"2007","Director":"Cristian Mungiu","Taglines":"How far would you go for a friend?","Certificate":"Not Rated | See all certifications »","Country":"Romania, Belgium","Language":"Romanian","Also_Known_As":"4 Months, 3 Weeks and 2 Days ","Budget":"€590,000 (estimated)","Opening_Weekend":"$51,712 (USA) (25 January 2008)","Gross":"$1,185,783 (USA) (2 May 2008)","Production_Co":"Mobra Films, Centrul National al Cinematografiei (CNC), Mindshare Media ","Runtime":"113 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Originally envisioned as part of a satirical omnibus film about urban legends in communist Romania. In 2009 writer and director Cristian Mungiu finally created Tales from the Golden Age (2009) (\"Tales from the Golden Age\") together with directors Hanno Höfer, Constantin Popescu, Ioana Uricaru and Razvan Marculescu. See more »","Goofs":"The trams in the movie came into service in late 90's. Trams in the late 1980s had half-sliding doors, and central command. See more »","Cast":"Anamaria Marinca, Laura Vasiliu, Vlad Ivanov, Alexandru Potocean, Luminita Gheorghiu, Adi Carauleanu, Liliana Mocanu, Tania Popa, Teodor Corban, Cerasela Iosifescu, Doru Ana, Eugenia Bosânceanu, Ion Sapdaru, Cristina Burbuz, Marioara Sterian","Plot":"A woman assists her friend in arranging an illegal abortion in 1980s Romania. Romania, 1987, the brutal Ceausescu communist regime is in place; birth control is illegal and abortion is a crime punishable by death. Gabita (Laura Vasliu) is almost five months into an unwanted pregnancy and in meek desperation turns to her friend and roommate, Otilia (Anamaria Marinca) for help in organizing an illegal termination. Unfortunate circumstances force the two women to use a male abortionist, Bebe (Vlad Ivanor), who, in addition to an absurd amount of money, also demands sex with both women as payment. The bleakness of the storyline expresses a dark socio-political critique in the twilight years of a repressive dictatorship. Written by kwedgwood@hotmail.com","Genre":"Drama","Keywords":"friend, romania, abortion, birth control, unwanted pregnancy","imdbRating":"7.9","imdbVotes":"43,793","Awards":"Nominated for 1 Golden Globe. Another 37 wins & 54 nominations.","Metascore":"97","Released":"14 September 2007 (Romania) ","Location":"Romania ","Actors":"Anamaria Marinca, Vlad Ivanov, Laura Vasiliu ","Writer":"Cristian Mungiu, Razvan Radulescu (script consultant)","Running_time":"PT113M / 1h 53min","Description":"Directed by Cristian Mungiu.  With Anamaria Marinca, Vlad Ivanov, Laura Vasiliu, Alexandru Potocean. A woman assists her friend in arranging an illegal abortion in 1980s Romania.","Rated":"NOT RATED"}