{"imdbID":"tt1069238","Title":"Departures","Year":"2008","Director":"Yôjirô Takita","Writer":"Kundô Koyama (screenplay)","Taglines":"The gift of last memories","Country":"Japan","Language":"Japanese","Also_Known_As":"Departures ","Opening_Weekend":"$74,945 (USA) (29 May 2009)","Gross":"$1,542,503 (USA) (11 June 2010)","Production_Co":"Amuse Soft Entertainment, Asahi Shimbun, Dentsu ","Runtime":"130 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Yôjirô Takita attended funeral ceremonies to understand the feelings of bereaved families, while Tsutomu Yamazaki never participated in the encoffinment training. See more »","Cast":"Masahiro Motoki, Tsutomu Yamazaki, Ryôko Hirosue, Kazuko Yoshiyuki, Kimiko Yo, Takashi Sasano, Tetta Sugimoto, Tôru Minegishi, Tatsuo Yamada, Yukari Tachibana, Tarô Ishida, Sanae Miyata, Ryôsuke Ôtani, Mitsuyo Hoshino, Tatsuhito Okuda","Plot":"A newly unemployed cellist takes a job preparing the dead for funerals. Daigo Kobayashi is a devoted cellist in an orchestra that has just been dissolved and now finds himself without a job. Daigo decides to move back to his old hometown with his wife to look for work and start over. He answers a classified ad entitled \"Departures\" thinking it is an advertisement for a travel agency only to discover that the job is actually for a \"Nokanshi\" or \"encoffineer,\" a funeral professional who prepares deceased bodies for burial and entry into the next life. While his wife and others despise the job, Daigo takes a certain pride in his work and begins to perfect the art of \"Nokanshi,\" acting as a gentle gatekeeper between life and death, between the departed and the family of the departed. The film follows his profound and sometimes comical journey with death as he uncovers the wonder, joy and meaning of life and living. Written by Regent Releasing","Genre":"Drama, Music","Keywords":"cellist, orchestra, funeral, death, ritual","imdbRating":"8.1","imdbVotes":"37,594","Awards":"Won 1 Oscar. Another 33 wins & 7 nominations.","Metascore":"68","Released":"19 June 2009 (USA) ","Location":"Sakata, Yamagata, Japan","Actors":"Masahiro Motoki, Ryôko Hirosue, Tsutomu Yamazaki ","Running_time":"PT130M / 2h 10min","Description":"Directed by Yôjirô Takita.  With Masahiro Motoki, Ryôko Hirosue, Tsutomu Yamazaki, Kazuko Yoshiyuki. A newly unemployed cellist takes a job preparing the dead for funerals.","Rated":"PG-13"}