{"imdbID":"tt1074638","Title":"Skyfall","Year":"2012","Director":"Sam Mendes","Country":"UK, USA","Language":"English","Also_Known_As":"007: Operación Skyfall ","Budget":"$200,000,000 (estimated)","Opening_Weekend":"$88,364,714 (USA) (9 November 2012)","Gross":"$304,360,277 (USA) (8 March 2013)","Production_Co":"Eon Productions, B23 ","Runtime":"143 min","Sound_Mix":"Dolby Digital | Datasat | SDDS | Sonics-DDP","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"It has been claimed that the film has used Great Britain and specifically London for filming locations more than any other Bond film in the franchise's history. Several different locations in the city of London were used as interiors and exteriors for the film, some of which would not normally be accessible for filming. London locations included Vauxhall Bridge; Millbank; The Old Vic Tunnels; an underground car park on Great Suffolk Street; Trinity Square; the entrance to Broadgate Tower; The Virgin Active Pool in Canary Wharf; Cadogan Square, The National Portrait Gallery; Parliament Square; Tower Hill; the building roof of the Department for Energy & Climate Change (DECC); the Smithfield Meat Market; St Bartholomew's Hospital; Charing Cross Underground Station; Greenwich's Old Royal Naval College; Southwark; Whitehall; and London's landmark Trafalgar Square. See more »","Goofs":"When the explosion that takes down the Merlin helicopter occurs the camera cuts briefly to inside the cockpit. No1 and No2 engine condition switches are set to ground idle. No3 engine is set to off. The rotor brake is in the \"on\" position. An aircraft in this configuration would not even have rotors turning, let alone fly around.All three engines should be in \"flight\" condition with the rotor brake \"off\". See more »","Crazy_Credits":"The opening credits feature Bond periodically shooting at targets, Shanghai dragons, Silva's skull logo, and the Skyfall mansion from which Bond's eyes stare out. At the end of the credits, the sky is seen falling upon the mansion. See more »","Cast":"Daniel Craig, Judi Dench, Javier Bardem, Ralph Fiennes, Naomie Harris, Bérénice Marlohe, Albert Finney, Ben Whishaw, Rory Kinnear, Ola Rapace, Helen McCrory, Nicholas Woodeson, Bill Buckhurst, Elize du Toit, Ian Bonar","Plot":"Bond's loyalty to M is tested when her past comes back to haunt her. Whilst MI6 comes under attack, 007 must track down and destroy the threat, no matter how personal the cost. When Bond's latest assignment goes gravely wrong and agents around the world are exposed, MI6 is attacked forcing M to relocate the agency. These events cause her authority and position to be challenged by Gareth Mallory (Ralph Fiennes), the new Chairman of the Intelligence and Security Committee. With MI6 now compromised from both inside and out, M is left with one ally she can trust: Bond. 007 takes to the shadows - aided only by field agent, Eve (Naomie Harris) - following a trail to the mysterious Silva (Javier Bardem), whose lethal and hidden motives have yet to reveal themselves. Written by JoaoBond","Genre":"Action, Adventure, Thriller","Keywords":"terrorist cell, intelligence agency, computer cracker, childhood home, computer hacker","imdbRating":"7.8","imdbVotes":"504,858","Awards":"Won 2 Oscars. Another 63 wins & 113 nominations.","Metascore":"81","Released":"9 November 2012 (USA) ","Location":"London, England, UK ","Actors":"Daniel Craig, Javier Bardem, Naomie Harris ","Writer":"Neal Purvis, Robert Wade | 1 more credit »","Running_time":"PT143M / 2h 23min","Description":"Directed by Sam Mendes.  With Daniel Craig, Javier Bardem, Naomie Harris, Judi Dench. Bond's loyalty to M is tested when her past comes back to haunt her. Whilst MI6 comes under attack, 007 must track down and destroy the threat, no matter how personal the cost.","Rated":"PG-13"}