{"imdbID":"tt1019452","Title":"A Serious Man","Year":"2009","Country":"USA, UK, France","Language":"English, Yiddish, Hebrew","Budget":"$7,000,000 (estimated)","Gross":"$9,190,525 (USA) (1 January 2010)","Production_Co":"Focus Features, StudioCanal, Relativity Media ","Runtime":"106 min","Cast":"Michael Stuhlbarg, Richard Kind, Fred Melamed, Sari Lennick, Aaron Wolff, Jessica McManus, Peter Breitmayer, Brent Braunschweig, David Kang, Benjamin Portnoe, Jack Swiler, Andrew S. Lentz, Jon Kaminski Jr., Ari Hoptman, Alan Mandell","Plot":"Larry Gopnik, a Midwestern physics teacher, watches his life unravel over multiple sudden incidents. Though seeking meaning and answers amidst his turmoils, he seems to keep sinking. Bloomington, Minnesota, 1967: Jewish physics lecturer Larry Gopnik is a serious and a very put-upon man. His daughter is stealing from him to save up for a nose job, his pot-head son, who gets stoned at his own bar-mitzvah, only wants him round to fix the TV aerial and his useless brother Arthur is an unwelcome house guest. But both Arthur and Larry get turfed out into a motel when Larry's wife Judy, who wants a divorce, moves her lover, Sy, into the house and even after Sy's death in a car crash they are still there. With lawyers' bills mounting for his divorce, Arthur's criminal court appearances and a land feud with a neighbour Larry is tempted to take the bribe offered by a student to give him an illegal exam pass mark. And the rabbis he visits for advice only dole out platitudes. Still God moves in mysterious - and not always pleasant - ways, as Larry and his family will find out. Written by don @ minifie-1","Genre":"Comedy, Drama","Keywords":"jewish, nose job, rabbi, bar mitzvah, marital breakup","imdbRating":"7.0","imdbVotes":"98,772","Awards":"Nominated for 2 Oscars. Another 17 wins & 67 nominations.","Metascore":"79","Released":"6 November 2009 (USA) ","Location":"Uptown Vision Clinic, Minneapolis, Minnesota, USA ","Actors":"Michael Stuhlbarg, Richard Kind, Sari Lennick ","Director":"Ethan Coen, Joel Coen","Writer":"Joel Coen, Ethan Coen","Running_time":"PT106M / 1h 46min","Description":"Directed by Ethan Coen, Joel Coen.  With Michael Stuhlbarg, Richard Kind, Sari Lennick, Fred Melamed. Larry Gopnik, a Midwestern physics teacher, watches his life unravel over multiple sudden incidents. Though seeking meaning and answers amidst his turmoils, he seems to keep sinking.","Rated":"R"}