{"imdbID":"tt1057500","Title":"Invictus","Year":"2009","Director":"Clint Eastwood","Country":"USA","Language":"English, Afrikaans, Maori, Zulu, Xhosa, Southern Sotho","Budget":"$60,000,000 (estimated)","Gross":"$37,479,778 (USA) (19 March 2010)","Production_Co":"Warner Bros., Spyglass Entertainment, Revelations Entertainment ","Runtime":"134 min","Cast":"Morgan Freeman, Matt Damon, Tony Kgoroge, Patrick Mofokeng, Matt Stern, Julian Lewis Jones, Adjoa Andoh, Marguerite Wheatley, Leleti Khumalo, Patrick Lyster, Penny Downie, Sibongile Nojila, Bonnie Henna, Shakes Myeko, Louis Minnaar","Plot":"Nelson Mandela, in his first term as the South African President, initiates a unique venture to unite the apartheid-torn land: enlist the national rugby team on a mission to win the 1995 Rugby World Cup. The film tells the inspiring true story of how Nelson Mandela joined forces with the captain of South Africa's rugby team to help unite their country. Newly elected President Mandela knows his nation remains racially and economically divided in the wake of apartheid. Believing he can bring his people together through the universal language of sport, Mandela rallies South Africa's rugby team as they make their historic run to the 1995 Rugby World Cup Championship match. Written by alfiehitchie","Genre":"Biography, Drama, History","Keywords":"president, rugby, nelson mandela, apartheid, nation","imdbRating":"7.4","imdbVotes":"120,576","Awards":"Nominated for 2 Oscars. Another 9 wins & 31 nominations.","Metascore":"74","Released":"11 December 2009 (USA) ","Location":"South Africa ","Actors":"Morgan Freeman, Matt Damon, Tony Kgoroge ","Writer":"Anthony Peckham (screenplay), John Carlin (book)","Running_time":"PT134M / 2h 14min","Description":"Directed by Clint Eastwood.  With Morgan Freeman, Matt Damon, Tony Kgoroge, Patrick Mofokeng. Nelson Mandela, in his first term as the South African President, initiates a unique venture to unite the apartheid-torn land: enlist the national rugby team on a mission to win the 1995 Rugby World Cup.","Rated":"PG-13"}