{"imdbID":"tt1049413","Title":"Up","Year":"2009","Taglines":"Fly Up to Venezuela","Country":"USA","Language":"English","Also_Known_As":"Up - Una aventura de altura ","Budget":"$175,000,000 (estimated)","Opening_Weekend":"$68,108,790 (USA) (29 May 2009)","Gross":"£34,284,193 (UK) (18 December 2009)","Production_Co":"Walt Disney Pictures, Pixar Animation Studios ","":"Show detailed company contact information on IMDbPro »","Runtime":"96 min","Sound_Mix":"SDDS | Dolby Digital EX | DTS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"When Russell goes to rescue Kevin, he catches up with the airship, the Spirit of Adventure. The shot of Russell - from the inside cabin, is of some of the dogs playing cards (using Milk Bones as their chips), is a nod to the iconic, (in)famous tacky painting; Dogs Playing Poker. See more »","Goofs":"Soon after the house is first launched and has clipped two TV aerials, an external shot of the house roof shows the weather vane rotating so the arrow is pointing south. This indicates the wind is blowing from south to north, and could not possibly take the house to South America. See more »","Crazy_Credits":"The closing credits are presented as text typed in a scrapbook, with photographs and mementos taped onto the pages. See more »","Cast":"Edward Asner, Christopher Plummer, Jordan Nagai, Bob Peterson, Delroy Lindo, Jerome Ranft, John Ratzenberger, David Kaye, Elie Docter, Jeremy Leary, Mickie McGowan, Danny Mann, Donald Fullilove, Jess Harnell, Josh Cooley","Plot":"Seventy-eight year old Carl Fredricksen travels to Paradise Falls in his home equipped with balloons, inadvertently taking a young stowaway. A young Carl Fredrickson meets a young adventure-spirited girl named Ellie. They both dream of going to a lost land in South America. 70 years later, Ellie has died. Carl remembers the promise he made to her. Then, when he inadvertently hits a construction worker, he is forced to go to a retirement home. But before they can take him, he and his house fly away. However, he has a stowaway aboard: an 8-year-old boy named Russell, who's trying to get an Assisting the Elderly badge. Together, they embark on an adventure, where they encounter talking dogs, an evil villain and a rare bird named Kevin. Written by Garfield2710","Genre":"Animation, Adventure, Comedy","Keywords":"house, promise, retirement, south america, boy","imdbRating":"8.3","imdbVotes":"630,736","Awards":"Won 2 Oscars. Another 70 wins & 70 nominations.","Metascore":"88","Released":"29 May 2009 (USA) ","Location":"Pixar Animation Studios - 1200 Park Avenue, Emeryville, California, USA ","Actors":"Edward Asner, Jordan Nagai, John Ratzenberger ","Director":"Pete Docter, Bob Peterson","Writer":"Pete Docter (story), Bob Peterson (story) | 3 more credits »","Running_time":"PT96M / 1h 36min","Description":"Directed by Pete Docter, Bob Peterson.  With Edward Asner, Jordan Nagai, John Ratzenberger, Christopher Plummer. Seventy-eight year old Carl Fredricksen travels to Paradise Falls in his home equipped with balloons, inadvertently taking a young stowaway.","Rated":"PG"}