{"imdbID":"tt1045658","Title":"Silver Linings Playbook","Year":"2012","Director":"David O. Russell","Country":"USA","Language":"English","Budget":"$21,000,000 (estimated)","Gross":"$132,088,910 (USA) (31 May 2013)","Production_Co":"Weinstein Company, The ","Runtime":"122 min","Cast":"Bradley Cooper, Jennifer Lawrence, Robert De Niro, Jacki Weaver, Chris Tucker, Anupam Kher, John Ortiz, Shea Whigham, Julia Stiles, Paul Herman, Dash Mihok, Matthew Russell, Cheryl Williams, Patrick McDade, Brea Bee","Plot":"After a stint in a mental institution, former teacher Pat Solitano moves back in with his parents and tries to reconcile with his ex-wife. Things get more challenging when Pat meets Tiffany, a mysterious girl with problems of her own. Against medical advice and without the knowledge of her husband Pat Solatano Sr., caring Dolores Solatano discharges her adult son, Pat Solatano Jr., from a Maryland mental health institution after his minimum eight month court ordered stint. The condition of the release includes Pat Jr. moving back in with his parents in their Philadelphia home. Although Pat Jr.'s institutionalization was due to him beating up the lover of his wife Nikki, he was diagnosed with bipolar disorder. Nikki has since left him and has received a restraining order against him. Although he is on medication (which he doesn't take because of the way it makes him feel) and has mandatory therapy sessions, Pat Jr. feels like he can manage on the outside solely by healthy living and looking for the \"silver linings\" in his life. His goals are to get his old job back as a substitute teacher, but more importantly reunite with Nikki. He finds there are certain instances where he doesn't cope well, however no less so ... Written by Huggo","Genre":"Comedy, Drama, Romance","Keywords":"bipolar disorder, unhappy marriage, adulterous wife, voyeur, obsessive compulsive personality disorder","imdbRating":"7.8","imdbVotes":"516,114","Awards":"Won 1 Oscar. Another 86 wins & 141 nominations.","Metascore":"81","Released":"25 December 2012 (USA) ","Location":"Upper Darby, Pennsylvania, USA ","Actors":"Bradley Cooper, Jennifer Lawrence, Robert De Niro ","Writer":"David O. Russell (screenplay), Matthew Quick (novel)","Running_time":"PT122M / 2h 2min","Description":"Directed by David O. Russell.  With Bradley Cooper, Jennifer Lawrence, Robert De Niro, Jacki Weaver. After a stint in a mental institution, former teacher Pat Solitano moves back in with his parents and tries to reconcile with his ex-wife. Things get more challenging when Pat meets Tiffany, a mysterious girl with problems of her own.","Rated":"R"}