{"imdbID":"tt1084950","Title":"Rachel Getting Married","Year":"2008","Director":"Jonathan Demme","Writer":"Jenny Lumet","Country":"USA","Language":"English","Gross":"$12,796,277 (USA) (17 April 2009)","Production_Co":"Armian Pictures, Clinica Estetico, Marc Platt Productions ","Runtime":"113 min","Cast":"Sebastian Stan, Roslyn Ruff, Anne Hathaway, Bill Irwin, Anna Deavere Smith, Annaleigh Ashford, Zafer Tawil, Beau Sia, Innbo Shim, Eliza Simpson, Olive, Rosemarie DeWitt, Anisa George, Tamyra Gray, Victoria Haynes","Plot":"A young woman who has been in and out of rehab for the past 10 years returns home for the weekend for her sister's wedding. Kym Buchman has been in drug rehab for nine months, during which time she has been clean. She is released temporarily from the facility to attend her sister Rachel Buchman's wedding. During her release, Kym is staying at the family home, where the wedding is taking place. As such, it is like Grand Central Station for the duration of Kym's stay, which may not be the most conducive situation for her in constantly being exposed to the watching eyes of those who know and don't yet know her, but know of her situation. The reunion with her family members starts off well enough, but issues around Kym's release from rehab quickly surface. Kym and Rachel's father, Paul Buchman, wants to make sure that Kym is all right at all times, which to Kym feels instead like he doesn't trust her. Rachel slowly begins to resent Kym's situation taking over what is supposed to be the happiest day of her life, some of which is directed by Kym, some of which isn't. One person present but largely not included ... Written by Huggo","Genre":"Drama, Romance","Keywords":"wedding, friend, tears, maid of honor, 12 step program","imdbRating":"6.7","imdbVotes":"40,573","Awards":"Nominated for 1 Oscar. Another 31 wins & 56 nominations.","Metascore":"82","Released":"7 November 2008 (USA) ","Location":"Fairfield, Connecticut, USA ","Actors":"Anne Hathaway, Rosemarie DeWitt, Debra Winger ","Running_time":"PT113M / 1h 53min","Description":"Directed by Jonathan Demme.  With Anne Hathaway, Rosemarie DeWitt, Debra Winger, Sebastian Stan. A young woman who has been in and out of rehab for the past 10 years returns home for the weekend for her sister's wedding.","Rated":"R"}