{"imdbID":"tt1028532","Title":"Hachi: A Dog's Tale","Year":"2009","Director":"Lasse Hallström","Taglines":"A true story of faith, devotion and undying love.","Certificate":"G | See all certifications »","Country":"USA, UK","Language":"English, Japanese","Also_Known_As":"Hachi: A Dog's Tale ","Budget":"$16,000,000 (estimated)","Opening_Weekend":"£442,753 (UK) (12 March 2010)","Gross":"£1,048,876 (UK) (26 March 2010)","Production_Co":"Stage 6 Films, Inferno Distribution, Hachiko ","Runtime":"93 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The baseball game that Parker watches with Hachi is Game 6 of the 1996 World Series, which the New York Yankees beat the Atlanta Braves 3-2 to win their 22nd World Series championship. See more »","Goofs":"The puppy has obviously grown several weeks between its departure from a monastery in Japan and being found at a train station presumably less than a day after. See more »","Cast":"Richard Gere, Joan Allen, Cary-Hiroyuki Tagawa, Sarah Roemer, Jason Alexander, Erick Avari, Davenia McFadden, Robbie Sublett, Kevin DeCoste, Rob Degnan, Tora Hallström, Donna Sorbello, Frank S. Aronson, Troy Doherty, Ian Sherman","Plot":"A drama based on the true story of a college professor's bond with the abandoned dog he takes into his home. In Bedridge, Professor Parker Wilson finds an abandoned dog at the train station and takes it home with the intention of returning the animal to its owner. He finds that the dog is an Akita and names it Hachiko. However, nobody claims the dog so his family decides to keep Hachi. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Drama, Family","Keywords":"dog, loyalty, japanese, waiting, human animal relationship","imdbRating":"8.2","imdbVotes":"144,334","Awards":"","Metascore":"","Released":"12 March 2010 (UK) ","Location":"Bristol, Rhode Island, USA ","Actors":"Richard Gere, Joan Allen, Cary-Hiroyuki Tagawa ","Writer":"Stephen P. Lindsey (screenplay), Kaneto Shindô (motion picture \"Hachiko monogatari\")","Running_time":"PT93M / 1h 33min","Description":"Directed by Lasse Hallström.  With Richard Gere, Joan Allen, Cary-Hiroyuki Tagawa, Sarah Roemer. A drama based on the true story of a college professor's bond with the abandoned dog he takes into his home.","Rated":"G"}