{"imdbID":"tt1013753","Title":"Milk","Year":"2008","Director":"Gus Van Sant","Writer":"Dustin Lance Black","Country":"USA","Language":"English","Budget":"$20,000,000 (estimated)","Gross":"$31,838,002 (USA) (10 April 2009)","Production_Co":"Focus Features, Axon Films, Groundswell Productions ","Runtime":"128 min","Cast":"Sean Penn, Emile Hirsch, Josh Brolin, Diego Luna, James Franco, Alison Pill, Victor Garber, Denis O'Hare, Joseph Cross, Stephen Spinella, Lucas Grabeel, Brandon Boyce, Howard Rosenman, Kelvin Yu, Jeff Koons","Plot":"The story of Harvey Milk, and his struggles as an American gay activist who fought for gay rights and became California's first openly gay elected official. Using flashbacks from a statement recorded late in life and archival footage for atmosphere, this film traces Harvey Milk's career from his 40th birthday to his death. He leaves the closet and New York, opens a camera shop that becomes the salon for San Francisco's growing gay community, and organizes gays' purchasing power to build political alliances. He runs for office with lover Scott Smith as his campaign manager. Victory finally comes on the same day Dan White wins in the city's conservative district. The rest of the film sketches Milk's relationship with White and the 1978 fight against a statewide initiative to bar gays and their supporters from public school jobs. Written by <jhailey@hotmail.com>","Genre":"Biography, Drama, History","Keywords":"gay rights, gay activist, gay pickup, discrimination, gay love","imdbRating":"7.6","imdbVotes":"133,255","Awards":"Won 2 Oscars. Another 54 wins & 125 nominations.","Metascore":"84","Released":"30 January 2009 (USA) ","Location":"San Francisco Fire Station 43, 720 Moscow Street, San Francisco, California, USA ","Actors":"Sean Penn, Josh Brolin, Emile Hirsch ","Running_time":"PT128M / 2h 8min","Description":"Directed by Gus Van Sant.  With Sean Penn, Josh Brolin, Emile Hirsch, Diego Luna. The story of Harvey Milk, and his struggles as an American gay activist who fought for gay rights and became California's first openly gay elected official.","Rated":"R"}