{"imdbID":"tt1136608","Title":"District 9","Year":"2009","Director":"Neill Blomkamp","Taglines":"They came here 28 years ago. Coexistence has never been easy. Why won't we let them leave? ","Country":"USA, New Zealand, Canada, South Africa","Language":"English, Nyanja, Afrikaans, Zulu, Xhosa, Southern Sotho","Also_Known_As":"Sector 9 ","Budget":"$30,000,000 (estimated)","Opening_Weekend":"$37,354,308 (USA) (14 August 2009)","Gross":"$115,646,235 (USA) (30 October 2009)","Production_Co":"TriStar Pictures, Block / Hanson, WingNut Films ","":"Show detailed company contact information on IMDbPro »","Runtime":"112 min","Sound_Mix":"DTS | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Several Afrikaans curse words can be heard throughout the film, including 'doos' or 'poes' (both of which are slang terms for a vagina), fok/fokken (which means \"f**k/f**king\"), and 'bliksem' which has a variation of meanings. 'Bliksem' means 'to hit' or just 'hit', as in \"ek sal jou bliksem\" means \" I will hit you. It can also be used as a derogatory term when referring to a person or as a derogatory adjective when used to describe a person or object. \"Daai bliksemse prawn\" would roughly translate to \"That damn prawn\" Also at some point, a sniper says \"Kom na pappa toe\", which translates to \"Come to daddy\". See more »","Goofs":"After Wikus is ejected from the badly damaged mecha suit, he lands on a flat dirt area with litter all around him and starts to crawl slowly. When the camera comes back to him, he's crawling through dried up brush and there is a fire near him. When the screen reads \"74 hours after exposure,\" he is again crawling on a dirt path with no vegetation or fire around him. See more »","Crazy_Credits":"The end credits are back to front, with the actors names on the left and character names on the right. As opposed to most films where its the other way round. See more »","Cast":"Sharlto Copley, Jason Cope, Nathalie Boltt, Sylvaine Strike, Elizabeth Mkandawie, John Sumner, William Allen Young, Greg Melvill-Smith, Nick Blake, Morena Busa Sesatsa, Themba Nkosi, Mzwandile Nqoba, Barry Strydom, Jed Brophy, Louis Minnaar","Plot":"An extraterrestrial race forced to live in slum-like conditions on Earth suddenly finds a kindred spirit in a government agent who is exposed to their biotechnology. In 1982, a massive star ship bearing a bedraggled alien population, nicknamed \"The Prawns,\" appeared over Johannesburg, South Africa. Twenty-eight years later, the initial welcome by the human population has faded. The refugee camp where the aliens were located has deteriorated into a militarized ghetto called District 9, where they are confined and exploited in squalor. In 2010, the munitions corporation, Multi-National United, is contracted to forcibly evict the population with operative Wikus van der Merwe in charge. In this operation, Wikus is exposed to a strange alien chemical and must rely on the help of his only two new 'Prawn' friends. Written by Kenneth Chisholm (kchishol@rogers.com)","Genre":"Action, Sci-Fi","Keywords":"alien, prawn, ghetto, refugee, refugee camp","imdbRating":"8.0","imdbVotes":"517,290","Awards":"Nominated for 4 Oscars. Another 23 wins & 99 nominations.","Metascore":"81","Released":"14 August 2009 (USA) ","Location":"South Africa ","Actors":"Sharlto Copley, David James, Jason Cope ","Writer":"Neill Blomkamp, Terri Tatchell","Running_time":"PT112M / 1h 52min","Description":"Directed by Neill Blomkamp.  With Sharlto Copley, David James, Jason Cope, Nathalie Boltt. An extraterrestrial race forced to live in slum-like conditions on Earth suddenly finds a kindred spirit in a government agent who is exposed to their biotechnology.","Rated":"R"}