{"imdbID":"tt1130884","Title":"Shutter Island","Year":"2010","Director":"Martin Scorsese","Taglines":"Someone is missing.","Country":"USA","Language":"English, German","Also_Known_As":"Ashecliffe ","Budget":"$80,000,000 (estimated)","Opening_Weekend":"$41,062,440 (USA) (19 February 2010)","Gross":"$127,968,405 (USA) (4 June 2010)","Production_Co":"Paramount Pictures, Phoenix Pictures, Sikelia Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"138 min","Sound_Mix":"SDDS | Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Filmed in four months during 2008. See more »","Goofs":"Throughout the movie and in Teddy's dreams the phrase \"Why you all wet, Baby\" is used. However, in the final flashback by the lake Andrew uses the phrase \"Baby, why you all wet\". See more »","Cast":"Leonardo DiCaprio, Mark Ruffalo, Ben Kingsley, Max von Sydow, Michelle Williams, Emily Mortimer, Patricia Clarkson, Jackie Earle Haley, Ted Levine, John Carroll Lynch, Elias Koteas, Robin Bartlett, Christopher Denham, Nellie Sciutto, Joseph Sikora","Plot":"A U.S Marshal investigates the disappearance of a murderess who escaped from a hospital for the criminally insane. It's 1954, and up-and-coming U.S. marshal Teddy Daniels is assigned to investigate the disappearance of a patient from Boston's Shutter Island Ashecliffe Hospital. He's been pushing for an assignment on the island for personal reasons, but before long he wonders whether he hasn't been brought there as part of a twisted plot by hospital doctors whose radical treatments range from unethical to illegal to downright sinister. Teddy's shrewd investigating skills soon provide a promising lead, but the hospital refuses him access to records he suspects would break the case wide open. As a hurricane cuts off communication with the mainland, more dangerous criminals \"escape\" in the confusion, and the puzzling, improbable clues multiply, Teddy begins to doubt everything - his memory, his partner, even his own sanity. Written by alfiehitchie","Genre":"Mystery, Thriller","Keywords":"surprise ending, self delusion, year 1954, plot twist, female psychopath","imdbRating":"8.1","imdbVotes":"747,078","Awards":"7 wins & 55 nominations.","Metascore":"63","Released":"19 February 2010 (USA) ","Location":"433 So Spring st Los Angeles, California, USA ","Actors":"Leonardo DiCaprio, Emily Mortimer, Mark Ruffalo ","Writer":"Laeta Kalogridis (screenplay), Dennis Lehane (novel)","Running_time":"PT138M / 2h 18min","Description":"Directed by Martin Scorsese.  With Leonardo DiCaprio, Emily Mortimer, Mark Ruffalo, Ben Kingsley. A U.S Marshal investigates the disappearance of a murderess who escaped from a hospital for the criminally insane.","Rated":"R"}