{"imdbID":"tt1120985","Title":"Blue Valentine","Year":"2010","Director":"Derek Cianfrance","Country":"USA","Language":"English","Budget":"$3,500,000 (estimated)","Gross":"$9,701,559 (USA) (15 April 2011)","Production_Co":"Incentive Filmed Entertainment, Silverwood Films, Hunting Lane Films ","Runtime":"112 min","Cast":"Ryan Gosling, Michelle Williams, Faith Wladyka, John Doman, Mike Vogel, Marshall Johnson, Jen Jones, Maryann Plunkett, James Benatti, Barbara Troy, Carey Westbrook, Ben Shenkman, Eileen Rosen, Enid Graham, Ashley Gurnari","Plot":"The relationship of a contemporary married couple, charting their evolution over a span of years by cross-cutting between time periods. Dean Pereira and Cindy Heller Pereira are a young, working class married couple - Dean currently working as a painter, and Cindy working as a nurse in a medical clinic - with a young daughter named Frankie. Despite their relatively tender ages, they are both ravaged by the life they've eked out together and by the experiences they've had leading into their marriage. Dean, a high school drop out, comes from a broken home, where he never really had a mother figure. He never saw himself getting married or having a family despite falling in love at first sight with Cindy. He doesn't have any professional ambition beyond his current work - which he enjoys since he feels he can knock off a beer at 8 o'clock in the morning without it affecting his work - although Cindy believes he has so much more potential in life. Cindy also comes from a dysfunctional family, with her own mother and father not setting an example of a harmonious married or family life. One of her previous serious ... Written by Huggo","Genre":"Drama, Romance","Keywords":"dysfunctional family, falling in love, unhappily married woman, female in shower, dog hit by a car","imdbRating":"7.4","imdbVotes":"136,863","Awards":"Nominated for 1 Oscar. Another 7 wins & 50 nominations.","Metascore":"81","Released":"28 January 2011 (USA) ","Location":"New York City, New York, USA ","Actors":"Ryan Gosling, Michelle Williams, John Doman ","Writer":"Derek Cianfrance, Joey Curtis | 1 more credit »","Running_time":"PT112M / 1h 52min","Description":"Directed by Derek Cianfrance.  With Ryan Gosling, Michelle Williams, John Doman, Faith Wladyka. The relationship of a contemporary married couple, charting their evolution over a span of years by cross-cutting between time periods.","Rated":"R"}