{"imdbID":"tt1119646","Title":"The Hangover","Year":"2009","Director":"Todd Phillips","Taglines":"Where's Doug? ","Country":"USA, Germany","Language":"English","Also_Known_As":"¿Qué pasó ayer? ","Budget":"$35,000,000 (estimated)","Opening_Weekend":"$44,979,319 (USA) (5 June 2009)","Gross":"$277,313,371 (USA) (11 December 2009)","Production_Co":"Warner Bros., Legendary Pictures, Green Hat Films ","Runtime":"100 min | 108 min (unrated)","Sound_Mix":"SDDS | Dolby Digital | DTS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"An actual taser was originally going to be used in the taser scene, but lawyers from Warner Bros. demanded that the crew use a prop. See more »","Goofs":"After the scene where doctor tells them about the \"Best Little Chapel\", they are shown pulling up to the chapel in the patrol vehicle. When the step out of the car, Alan is able to get out of the backseat because patrol vehicles have child safety locks like many cars. A flip of a switch on each door allows them to be operable from the inside. See more »","Crazy_Credits":"Collage of photos telling the story of what happened that night. See more »","Cast":"Bradley Cooper, Ed Helms, Zach Galifianakis, Justin Bartha, Heather Graham, Sasha Barrese, Jeffrey Tambor, Ken Jeong, Rachael Harris, Mike Tyson, Mike Epps, Jernard Burks, Rob Riggle, Cleo King, Bryan Callen","Plot":"Three buddies wake up from a bachelor party in Las Vegas, with no memory of the previous night and the bachelor missing. They make their way around the city in order to find their friend before his wedding. Angelenos Doug Billings and Tracy Garner are about to get married. Two days before the wedding, the four men in the wedding party - Doug, Doug's two best buddies Phil Wenneck and Stu Price, and Tracy's brother Alan Garner - hop into Tracy's father's beloved Mercedes convertible for a 24-hour stag party to Las Vegas. Phil, a married high school teacher, has the same maturity level as his students when he's with his pals. Stu, a dentist, is worried about everything, especially what his controlling girlfriend Melissa thinks. Because she disapproves of traditional male bonding rituals, Stu has to lie to her about the stag, he telling her that they are going on a wine tasting tour in the Napa Valley. Regardless, he intends on eventually marrying her, against the advice and wishes of his friends. And Alan seems to be unaware of what are considered the social graces of the western world. The morning after their arrival in Las Vegas, they awaken in their hotel suite each with the worst ... Written by Huggo","Genre":"Comedy","Keywords":"hangover, morning after, hedonism, drunkenness, female nudity","imdbRating":"7.8","imdbVotes":"566,722","Awards":"Won 1 Golden Globe. Another 10 wins & 26 nominations.","Metascore":"73","Released":"5 June 2009 (USA) ","Location":"Jean, Nevada, USA ","Actors":"Zach Galifianakis, Bradley Cooper, Justin Bartha ","Writer":"Jon Lucas, Scott Moore","Running_time":"PT100M / 1h 40min","Description":"Directed by Todd Phillips.  With Zach Galifianakis, Bradley Cooper, Justin Bartha, Ed Helms. Three buddies wake up from a bachelor party in Las Vegas, with no memory of the previous night and the bachelor missing. They make their way around the city in order to find their friend before his wedding.","Rated":"R"}