{"imdbID":"tt1185616","Title":"Waltz with Bashir","Year":"2008","Director":"Ari Folman","Writer":"Ari Folman","Taglines":"We may forget the past, but the past won't forget us. [Theatrical trailer.]","Country":"Israel, France, Germany, USA, Finland, Switzerland, Belgium, Australia","Language":"Hebrew, Arabic, German, English","Also_Known_As":"Waltz with Bashir ","Budget":"$1,500,000 (estimated)","Opening_Weekend":"£113,087 (UK) (21 November 2008)","Gross":"$2,283,276 (USA) (8 May 2009)","Production_Co":"Bridgit Folman Film Gang, Les Films d'Ici, Razor Film Produktion GmbH ","Runtime":"90 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Artist David Polonsky is right handed, but did most of the illustration for this film with his left hand, as he felt that his original drawing were 'too pretty.' See more »","Goofs":"The narrator refers to the transport helicopter as a \"Hercules helicopter\", which is a confusion of the C-130 Hercules cargo plane with the CH-53 Stallion helicopter, the latter being the true transportation device. See more »","Cast":"Ari Folman, Ori Sivan, Ronny Dayag, Shmuel Frenkel, Zahava Solomon, Ron Ben-Yishai, Dror Harazi, Mickey Leon, Yehezkel Lazarov","Plot":"An Israeli film director interviews fellow veterans of the 1982 invasion of Lebanon to reconstruct his own memories of his term of service in that conflict. One night at a bar, an old friend tells director Ari about a recurring nightmare in which he is chased by 26 vicious dogs. Every night, the same number of beasts. The two men conclude that there's a connection to their Israeli Army mission in the first Lebanon War of the early eighties. Ari is surprised that he can't remember a thing anymore about that period of his life. Intrigued by this riddle, he decides to meet and interview old friends and comrades around the world. He needs to discover the truth about that time and about himself. As Ari delves deeper and deeper into the mystery, his memory begins to creep up in surreal images. Written by intlpress@aol.com","Genre":"Animation, Biography, Drama","Keywords":"interview, lebanon, dog, bar, nightmare","imdbRating":"8.0","imdbVotes":"44,833","Awards":"Nominated for 1 Oscar. Another 42 wins & 54 nominations.","Metascore":"91","Released":"12 June 2008 (Israel) ","Actors":"Ari Folman, Ron Ben-Yishai, Ronny Dayag ","Running_time":"PT90M / 1h 30min","Description":"Directed by Ari Folman.  With Ari Folman, Ron Ben-Yishai, Ronny Dayag, Ori Sivan. An Israeli film director interviews fellow veterans of the 1982 invasion of Lebanon to reconstruct his own memories of his term of service in that conflict.","Rated":"R"}