{"imdbID":"tt1189073","Title":"The Skin I Live In","Year":"2011","Director":"Pedro Almodóvar","Country":"Spain","Language":"Spanish","Also_Known_As":"Koža u kojoj živim ","Budget":"$13,000,000 (estimated)","Opening_Weekend":"$223,119 (USA) (14 October 2011)","Gross":"$3,185,193 (USA) (23 March 2012)","Production_Co":"Blue Haze Entertainment, Canal+ España, El Deseo ","Runtime":"120 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The film was the first collaboration in 21 years between Almodóvar and Banderas since Tie Me Up! Tie Me Down! (1990). See more »","Goofs":"When Vera comes to the clothes shop in a taxi, the taxi is very clearly a Ford C-Max. However, in the next shot, when the reflection of the car is visible in the window pane as it drives away, it's a Volkswagen Jetta. See more »","Cast":"Antonio Banderas, Elena Anaya, Marisa Paredes, Jan Cornet, Roberto Álamo, Eduard Fernández, José Luis Gómez, Blanca Suárez, Susi Sánchez, Bárbara Lennie, Fernando Cayo, Chema Ruiz, Buika, Ana Mena, Teresa Manresa","Plot":"A brilliant plastic surgeon, haunted by past tragedies, creates a type of synthetic skin that withstands any kind of damage. His guinea pig: a mysterious and volatile woman who holds the key to his obsession. In honor of his late wife who died in a flaming car accident, scientist, Dr. Robert Ledgard, is trying to synthesize the perfect skin which can withstand burns, cuts or any other kind of damage. As he gets closer to perfecting this skin on his flawless patient, the scientific community starts growing skeptical and his past is revealed that shows how his patient is closely linked to tragic events he would like to forget. Written by napierslogs","Genre":"Thriller","Keywords":"transgender, suicide, lesbian, rape, skin","imdbRating":"7.6","imdbVotes":"97,994","Awards":"Nominated for 1 Golden Globe. Another 24 wins & 63 nominations.","Metascore":"70","Released":"2 September 2011 (Spain) ","Location":"A Estrada, Pontevedra, Galicia, Spain ","Actors":"Antonio Banderas, Elena Anaya, Jan Cornet ","Writer":"Agustín Almodóvar (collaboration), Pedro Almodóvar | 1 more credit »","Running_time":"PT120M / 2h","Description":"Directed by Pedro Almodóvar.  With Antonio Banderas, Elena Anaya, Jan Cornet, Marisa Paredes. A brilliant plastic surgeon, haunted by past tragedies, creates a type of synthetic skin that withstands any kind of damage. His guinea pig: a mysterious and volatile woman who holds the key to his obsession.","Rated":"R"}