{"imdbID":"tt1149362","Title":"The White Ribbon","Year":"2009","Director":"Michael Haneke","Country":"Germany, Austria, France, Italy","Language":"German, Italian, Polish","Also_Known_As":"The White Ribbon ","Budget":"€12,000,000 (estimated)","Opening_Weekend":"£72,226 (UK) (13 November 2009)","Gross":"$2,222,647 (USA) (28 May 2010)","Production_Co":"X-Filme Creative Pool, Wega Film, Les Films du Losange ","Runtime":"144 min","Sound_Mix":"DTS | Dolby Digital","Color":"Black and White","Aspect_Ratio":"1.85 : 1","Trivia":"Film debut of Christian Friedel. See more »","Crazy_Credits":"The opening and closing credits are shown in complete silence. There is no music or other sounds during both entire credit sequences. See more »","Cast":"Christian Friedel, Ernst Jacobi, Leonie Benesch, Ulrich Tukur, Ursina Lardi, Fion Mutert, Michael Kranz, Burghart Klaußner, Steffi Kühnert, Maria-Victoria Dragus, Leonard Proxauf, Levin Henning, Johanna Busse, Thibault Sérié, Josef Bierbichler","Plot":"Strange events happen in a small village in the north of Germany during the years before World War I, which seem to be ritual punishment. Who is responsible? From July, 1913 to the outbreak of World War I, a series of incidents take place in a German village. A horse trips on a wire and throws the rider; a woman falls to her death through rotted planks; the local baron's son is hung upside down in a mill; parents slap and bully their children; a man is cruel to his long-suffering lover; another sexually abuses his daughter. People disappear. A callow teacher, who courts a nanny in the baron's household, narrates the story and tries to investigate the connections among these accidents and crimes. What is foreshadowed? Are the children holy innocents? God may be in His heaven, but all is not right with the world; the center cannot hold. Written by <jhailey@hotmail.com>","Genre":"Drama, Mystery","Keywords":"children, small village, mysterious event, doctor, pastor","imdbRating":"7.8","imdbVotes":"51,457","Awards":"Nominated for 2 Oscars. Another 55 wins & 34 nominations.","Metascore":"82","Released":"5 March 2010 (USA) ","Location":"Evangelical Church, Netzow, Plattenburg, Brandenburg, Germany ","Actors":"Christian Friedel, Ernst Jacobi, Leonie Benesch ","Writer":"Michael Haneke, Michael Haneke (story)","Running_time":"PT144M / 2h 24min","Description":"Directed by Michael Haneke.  With Christian Friedel, Ernst Jacobi, Leonie Benesch, Ulrich Tukur. Strange events happen in a small village in the north of Germany during the years before World War I, which seem to be ritual punishment. Who is responsible?","Rated":"R"}