{"imdbID":"tt1182345","Title":"Moon","Year":"2009","Director":"Duncan Jones","Taglines":"250,000 miles from home, the hardest thing to face...is yourself ","Country":"UK","Language":"English, Spanish","Also_Known_As":"Kuu ","Budget":"$5,000,000 (estimated)","Opening_Weekend":"$136,046 (USA) (12 June 2009)","Gross":"$5,009,677 (USA) (13 November 2009)","Production_Co":"Liberty Films UK, Xingu Films, Limelight Fund ","Runtime":"97 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Appeared on Entertainment Weekly's list of The 50 Best Movies You've Never Seen in the Jul 16, 2012 issue. See more »","Goofs":"When GERTY tells Sam he can't go outside, and at the first Eliza transmission, the computer monitor reads \"sattelite link lost\" (with \"satellite\" misspelled). See more »","Crazy_Credits":"At the very end of the credits, the film copyright is credited to Lunar Industries Inc. Lunar Industries Inc. just happens to be the corporation featured in the film. See more »","Cast":"Sam Rockwell, Kevin Spacey, Dominique McElligott, Rosie Shaw, Adrienne Shaw, Kaya Scodelario, Benedict Wong, Matt Berry, Malcolm Stewart, Robin Chalk","Plot":"Astronaut Sam Bell has a quintessentially personal encounter toward the end of his three-year stint on the Moon, where he, working alongside his computer, GERTY, sends back to Earth parcels of a resource that has helped diminish our planet's power problems. Sam Bell has a three year contract to work for Lunar Industries. For the contract's entire duration, he is the sole employee based at their lunar station. His primary job responsibility is to harvest and periodically rocket back to Earth supplies of helium-3, the current clean and abundant fuel used on Earth. There is no direct communication link available between the lunar station and Earth, so his only direct real-time interaction is with GERTY, the intelligent computer whose function is to attend to his day to day needs. With such little human contact and all of it indirect, he feels that three years is far too long to be so isolated; he knows he is beginning to hallucinate as the end of his three years approaches. All he wants is to return to Earth to be with his wife Tess and their infant daughter Eve, who was born just prior to his leaving for this job. With two weeks to go, he gets into an accident at one of the mechanical harvesters and is rendered unconscious. Injured, he ... Written by Huggo","Genre":"Drama, Sci-Fi","Keywords":"moon, solitude, earth, contract, computer","imdbRating":"8.0","imdbVotes":"250,297","Awards":"Won 1 BAFTA Film Award. Another 24 wins & 30 nominations.","Metascore":"67","Released":"10 July 2009 (USA) ","Location":"Los Angeles, California, USA ","Actors":"Sam Rockwell, Kevin Spacey, Dominique McElligott ","Writer":"Duncan Jones (story), Nathan Parker","Running_time":"PT97M / 1h 37min","Description":"Directed by Duncan Jones.  With Sam Rockwell, Kevin Spacey, Dominique McElligott, Rosie Shaw. Astronaut Sam Bell has a quintessentially personal encounter toward the end of his three-year stint on the Moon, where he, working alongside his computer, GERTY, sends back to Earth parcels of a resource that has helped diminish our planet's power problems.","Rated":"R"}