{"imdbID":"tt1100089","Title":"Foxcatcher","Year":"2014","Director":"Bennett Miller","Country":"USA","Language":"English, French","Budget":"$24,000,000 (estimated)","Gross":"$12,096,300 (USA) (6 March 2015)","Production_Co":"Annapurna Pictures, Likely Story, Media Rights Capital ","Runtime":"134 min","Cast":"Steve Carell, Channing Tatum, Mark Ruffalo, Sienna Miller, Vanessa Redgrave, Anthony Michael Hall, Guy Boyd, Brett Rice, Jackson Frazer, Samara Lee, Francis J. Murphy III, Jane Mowder, David 'Doc' Bennett, Lee Perkins, Robert Haramia","Plot":"Mark and Dave Schultz, U.S. Olympic Wrestling champions, join Team Foxcatcher led by multimillionaire John E. du Pont as they train for the 1988 games in Seoul - but John's emotional self-destruction threatens to consume them all. Based on true events, Foxcatcher tells the dark and fascinating story of the unlikely and ultimately tragic relationship between an eccentric multi-millionaire and two champion wrestlers. When Olympic Gold Medal winning wrestler Mark Schultz (Channing Tatum) is invited by wealthy heir John du Pont (Steve Carell) to move on to the du Pont estate and help form a team to train for the 1988 Seoul Olympics at his new state-of-the-art training facility, Schultz jumps at the opportunity, hoping to focus on his training and finally step out of the poverty striken situation Olympic caliber athletes like he and his revered brother, Dave (Mark Ruffalo). Driven by hidden needs, du Pont sees backing Schultz's bid for Gold and the chance to \"coach\" a world-class wrestling team as an opportunity to gain the elusive respect of his peers and, more importantly, his disapproving mother (Vanessa Redgrave). Trapped in du Pont's majestic but suffocating world, Mark comes to see his benefactor as an ... Written by Sony Pictures Classics","Genre":"Biography, Drama, Sport","Keywords":"domination, olympics, training, brother, wrestler","imdbRating":"7.0","imdbVotes":"100,702","Awards":"Nominated for 5 Oscars. Another 11 wins & 71 nominations.","Metascore":"81","Released":"16 January 2015 (USA) ","Location":"Sewickley Heights, Pennsylvania, USA ","Actors":"Steve Carell, Channing Tatum, Mark Ruffalo ","Writer":"E. Max Frye, Dan Futterman","Running_time":"PT134M / 2h 14min","Description":"Directed by Bennett Miller.  With Steve Carell, Channing Tatum, Mark Ruffalo, Vanessa Redgrave. Mark and Dave Schultz, U.S. Olympic Wrestling champions, join Team Foxcatcher led by multimillionaire John E. du Pont as they train for the 1988 games in Seoul - but John's emotional self-destruction threatens to consume them all.","Rated":"R"}