{"imdbID":"tt1187043","Title":"3 Idiots","Year":"2009","Director":"Rajkumar Hirani","Country":"India","Language":"Hindi, English","Also_Known_As":"Three Idiots ","Budget":"INR 550,000,000 (estimated)","Opening_Weekend":"£437,554 (UK) (25 December 2009)","Gross":"$6,523,137 (USA) (19 February 2010)","Production_Co":"Vinod Chopra Productions ","":"Show detailed company contact information on IMDbPro »","Runtime":"170 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Every time Rancho has an eccentric idea ,a high pitched sound can be heard in the background. See more »","Goofs":"As we all know that Rancho (Aamir Khan) was pass out from Mechanical Engineering branch from ICE. How real Ranchhoddas (Javed Jaffery) can get the tenders of Highway Bridge, which lies into Civil Engineering branch. See more »","Cast":"Aamir Khan, Madhavan, Sharman Joshi, Kareena Kapoor, Boman Irani, Omi Vaidya, Mona Singh, Javed Jaffrey, Parikshat Sahni, Olivier Lafont, Rahul Kumar, Amardeep Jha, Farida Dadi, Mukund Bhatt, Chaitali Bose","Plot":"Two friends are searching for their long lost companion. They revisit their college days and recall the memories of their friend who inspired them to think differently, even as the rest of the world called them \"idiots\". Farhan Qureshi and Raju Rastogi want to re-unite with their fellow collegian, Rancho, after faking a stroke aboard an Air India plane, and excusing himself from his wife - trouser less - respectively. Enroute, they encounter another student, Chatur Ramalingam, now a successful businessman, who reminds them of a bet they had undertaken 10 years ago. The trio, while recollecting hilarious antics, including their run-ins with the Dean of Delhi's Imperial College of Engineering, Viru Sahastrabudhe, race to locate Rancho, at his last known address - little knowing the secret that was kept from them all this time. Written by rAjOo (gunwanti@hotmail.com)","Genre":"Comedy, Drama","Keywords":"against the system, digit in title, suicide, suicide attempt, friend","imdbRating":"8.4","imdbVotes":"193,535","Awards":"25 wins & 13 nominations.","Metascore":"67","Released":"25 December 2009 (India) ","Location":"Bangalore, Karnataka, India ","Actors":"Aamir Khan, Madhavan, Mona Singh ","Writer":"Rajkumar Hirani, Abhijat Joshi | 1 more credit »","Running_time":"PT170M / 2h 50min","Description":"Directed by Rajkumar Hirani.  With Aamir Khan, Madhavan, Mona Singh, Sharman Joshi. Two friends are searching for their long lost companion. They revisit their college days and recall the memories of their friend who inspired them to think differently, even as the rest of the world called them \"idiots\".","Rated":"PG-13"}