{"imdbID":"tt1132620","Title":"The Girl with the Dragon Tattoo","Year":"2009","Director":"Niels Arden Oplev","Country":"Sweden, Denmark, Germany, Norway","Language":"Swedish, English","Also_Known_As":"The Girl with the Dragon Tattoo ","Budget":"$13,000,000 (estimated)","Opening_Weekend":"£378,434 (UK) (12 March 2010)","Gross":"$10,095,170 (USA) (18 February 2011)","Production_Co":"Yellow Bird, ZDF Enterprises, Sveriges Television (SVT) ","Runtime":"152 min | 180 min (extended) | 186 min (Extended Version) (Part 1 & 2)","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The motorcycle used by Lisbeth is a Husaberg, which is a Swedish brand. See more »","Goofs":"In the still photos from the movies, Lisbeth Salander's camera is shown to be a Canon EOS series. In the movie, the download software on her PowerBook reveals it as a Nikon. See more »","Cast":"Michael Nyqvist, Noomi Rapace, Lena Endre, Sven-Bertil Taube, Peter Haber, Peter Andersson, Marika Lagercrantz, Ingvar Hirdwall, Björn Granath, Ewa Fröling, Michalis Koutsogiannakis, Annika Hallin, Sofia Ledarp, Tomas Köhler, David Dencik","Plot":"A journalist is aided in his search for a woman who has been missing -- or dead -- for forty years by a young female hacker. Forty years ago, Harriet Vanger disappeared from a family gathering on the island owned and inhabited by the powerful Vanger clan. Her body was never found, yet her uncle suspects murder and that the killer is a member of his own tightly knit but dysfunctional family. He employs disgraced financial journalist Mikael Blomkvist and the tattooed, ruthless computer hacker Lisbeth Salander to investigate. When the pair link Harriet's disappearance to a number of grotesque murders from almost forty years ago, they begin to unravel a dark and appalling family history; but, the Vangers are a secretive clan, and Blomkvist and Salander are about to find out just how far they are prepared to go to protect themselves. Written by Music Box Films","Genre":"Crime, Drama, Mystery","Keywords":"strong female lead, journalist, island, hacker, suspect","imdbRating":"7.8","imdbVotes":"170,816","Awards":"Won 2 BAFTA Film Awards. Another 17 wins & 34 nominations.","Metascore":"76","Released":"30 April 2010 (USA) ","Location":"Tabernas, Almería, Andalucía, Spain ","Actors":"Michael Nyqvist, Noomi Rapace, Ewa Fröling ","Writer":"Nikolaj Arcel (screenplay), Rasmus Heisterberg (screenplay) | 1 more credit »","Running_time":"PT152M / 2h 32min","Description":"Directed by Niels Arden Oplev.  With Michael Nyqvist, Noomi Rapace, Ewa Fröling, Lena Endre. A journalist is aided in his search for a woman who has been missing -- or dead -- for forty years by a young female hacker.","Rated":"R"}