{"imdbID":"tt1170358","Title":"The Hobbit: The Desolation of Smaug","Year":"2013","Director":"Peter Jackson","Taglines":"Beyond darkness... beyond desolation... lies the greatest danger of all.","Country":"USA, New Zealand","Language":"English","Also_Known_As":"The Hobbit Part 2 ","Budget":"$225,000,000 (estimated)","Opening_Weekend":"$73,645,197 (USA) (13 December 2013)","Gross":"$258,355,354 (USA) (11 April 2014)","Production_Co":"Metro-Goldwyn-Mayer (MGM), New Line Cinema, WingNut Films ","Runtime":"161 min | 186 min (Extended Edition)","Sound_Mix":"Dolby Atmos | Datasat | Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"In a midnight screening in São Paulo, Brazil, one of the cinema's speakers broke after Smaug's first roar. See more »","Goofs":"Just after Thorin rides down the river of gold on a wheelbarrow, Bilbo is forced to leap off of the falling bridge knocked over by Smaug. Upon hitting the ground, he rolls and Sting at his side can clearly be seen to bend almost at right angles, indicating a rubber stunt sword. See more »","Cast":"Ian McKellen, Martin Freeman, Richard Armitage, Ken Stott, Graham McTavish, William Kircher, James Nesbitt, Stephen Hunter, Dean O'Gorman, Aidan Turner, John Callen, Peter Hambleton, Jed Brophy, Mark Hadlow, Adam Brown","Plot":"The dwarves, along with Bilbo Baggins and Gandalf the Grey, continue their quest to reclaim Erebor, their homeland, from Smaug. Bilbo Baggins is in possession of a mysterious and magical ring. After successfully crossing over (and under) the Misty Mountains, Thorin and Company must seek aid from a powerful stranger before taking on the dangers of Mirkwood Forest--without their Wizard. If they reach the human settlement of Lake-town it will be time for the hobbit Bilbo Baggins to fulfill his contract with the dwarves. The party must complete the journey to Lonely Mountain and burglar Baggins must seek out the Secret Door that will give them access to the hoard of the dragon Smaug. And, where has Gandalf got off to? And what is his secret business to the south? Written by Otaku-sempai","Genre":"Adventure, Fantasy","Keywords":"dwarf, sword and sorcery, elf, mountain, lake town","imdbRating":"7.9","imdbVotes":"463,915","Awards":"Nominated for 3 Oscars. Another 14 wins & 78 nominations.","Metascore":"66","Released":"13 December 2013 (USA) ","Location":"Stone Street Studios, Stone Street, Miramar, Wellington, New Zealand ","Actors":"Ian McKellen, Martin Freeman, Richard Armitage ","Writer":"Fran Walsh (screenplay), Philippa Boyens (screenplay) | 3 more credits »","Running_time":"PT161M / 2h 41min","Description":"Directed by Peter Jackson.  With Ian McKellen, Martin Freeman, Richard Armitage, Ken Stott. The dwarves, along with Bilbo Baggins and Gandalf the Grey, continue their quest to reclaim Erebor, their homeland, from Smaug. Bilbo Baggins is in possession of a mysterious and magical ring.","Rated":"PG-13"}