{"imdbID":"tt1255953","Title":"Incendies","Year":"2010","Director":"Denis Villeneuve","Taglines":"The search began at the opening of their mother's will.","Country":"Canada, France","Language":"French, Arabic, English","Also_Known_As":"Incendies ","Budget":"$6,800,000 (estimated)","Opening_Weekend":"$50,679 (USA) (22 April 2011)","Gross":"$6,857,096 (USA) (23 September 2011)","Production_Co":"micro_scope, TS Productions, Phi Group ","":"Show detailed company contact information on IMDbPro »","Runtime":"139 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"This film won the Best Feature Film awarded by the jury at the 2011 Adelaide Film Festival. Director Denis Villeneuve responded by saying that \"As a poetic sign of gratitude to [the] Adelaide Film Festival, I'll give the name of 'Adelaide' to one of my main characters in my next film. So thank you one thousand times to [the] Adelaide Film Festival!\" See more »","Goofs":"Scenes set in Lebanon give away their real location by the cars with Jordanian number plates. See more »","Crazy_Credits":"'Mr. Leonard Cohen I need your help, please call me.\" - Denis Villeneuve See more »","Cast":"Mustafa Kamel, Hussein Sami, Rémy Girard, Mélissa Désormeaux-Poulin, Maxim Gaudette, Dominique Briand, Lubna Azabal, Frédéric Paquet, Hamed Najem, Ahmad Massad, Bader Alami, Majida Hussein, Asriah Nijres, John Dunn-Hill, Nadia Essadiqi","Plot":"Twins journey to the Middle East to discover their family history, and fulfill their mother's last wishes. A mother's last wishes send twins Jeanne and Simon on a journey to the Middle East in search of their tangled roots. Adapted from Wajdi Mouawad's acclaimed play, Incendies tells the powerful and moving tale of two young adults' voyage to the core of deep-rooted hatred, never-ending wars and enduring love. Written by Mylène Chollet","Genre":"Drama, Mystery, War","Keywords":"twin brother and sister, mother son relationship, brother sister relationship, family relationships, middle east","imdbRating":"8.2","imdbVotes":"75,239","Awards":"Nominated for 1 Oscar. Another 39 wins & 14 nominations.","Metascore":"82","Released":"12 January 2011 (France) ","Location":"175 Boulevard Deguire, Montréal, Québec, Canada ","Actors":"Lubna Azabal, Mélissa Désormeaux-Poulin, Maxim Gaudette ","Writer":"Denis Villeneuve (scenario), Wajdi Mouawad (play) | 2 more credits »","Running_time":"PT139M / 2h 19min","Description":"Directed by Denis Villeneuve.  With Lubna Azabal, Mélissa Désormeaux-Poulin, Maxim Gaudette, Mustafa Kamel. Twins journey to the Middle East to discover their family history, and fulfill their mother's last wishes.","Rated":"R"}