{"imdbID":"tt1276104","Title":"Looper","Year":"2012","Director":"Rian Johnson","Writer":"Rian Johnson","Taglines":"Face your future. Fight your past. ","Country":"USA, China","Language":"English, French","Also_Known_As":"Looper: Asesinos del futuro ","Budget":"$30,000,000 (estimated)","Opening_Weekend":"$20,801,552 (USA) (28 September 2012)","Gross":"$66,468,315 (USA) (28 December 2012)","Production_Co":"Endgame Entertainment, DMG Entertainment, DMG Entertainment ","Runtime":"119 min","Sound_Mix":"Dolby Digital | Datasat | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Joseph Gordon-Levitt had prosthetics to make him look more like Bruce Willis in order to play his younger self. He also watched a lot of Bruce Willis films in preparation for the role so that he could impersonate some of his mannerisms. See more »","Goofs":"When Joe and Cid are having a conversation looking out of the hatch at the end of the tunnel from the house, the branch holding up the hatch changes position from shot to shot. It is rotated about 90 degrees between the positions and the position changes four or five times during the conversation. See more »","Cast":"Joseph Gordon-Levitt, Bruce Willis, Emily Blunt, Paul Dano, Noah Segan, Piper Perabo, Jeff Daniels, Pierce Gagnon, Qing Xu, Tracie Thoms, Frank Brennan, Garret Dillahunt, Nick Gomez, Marcus Hester, Jon Eyez","Plot":"In 2074, when the mob wants to get rid of someone, the target is sent into the past, where a hired gun awaits - someone like Joe - who one day learns the mob wants to 'close the loop' by sending back Joe's future self for assassination. In the year 2044, a man working for a group of killers called \"Loopers\" (they work for the mob and kill people who are sent blindfolded back in time from the year 2074 by their bosses) recognizes a victim as himself. He hesitates resulting in the escape of his older self. Written by malachmcfreak","Genre":"Action, Crime, Drama","Keywords":"future, time loop, chase, time travel, surprise ending","imdbRating":"7.4","imdbVotes":"415,316","Awards":"15 wins & 42 nominations.","Metascore":"84","Released":"28 September 2012 (USA) ","Location":"Thibodaux, Louisiana, USA ","Actors":"Joseph Gordon-Levitt, Bruce Willis, Emily Blunt ","Running_time":"PT119M / 1h 59min","Description":"Directed by Rian Johnson.  With Joseph Gordon-Levitt, Bruce Willis, Emily Blunt, Paul Dano. In 2074, when the mob wants to get rid of someone, the target is sent into the past, where a hired gun awaits - someone like Joe - who one day learns the mob wants to 'close the loop' by sending back Joe's future self for assassination.","Rated":"R"}