{"imdbID":"tt1220719","Title":"Ip Man","Year":"2008","Director":"Wilson Yip","Taglines":"Mentor of iconic legend Bruce Lee ","Country":"Hong Kong, China","Language":"Cantonese, Mandarin, Japanese","Also_Known_As":"Ip Man ","Budget":"$11,715,578 (estimated)","Production_Co":"Beijing ShengShi HuaRei Film Investment & Management Co., China Film Co-Production Corporation, Mandarin Films Distribution ","":"Show detailed company contact information on IMDbPro »","Runtime":"106 min","Sound_Mix":"DTS | Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Principal photography for Ip Man began in March 2008 and ended in August; filming took place in Shanghai, which was used to architecturally recreate Foshan. During filming, conflicts arose between the producers of Ip Man and filmmaker Kar-Wai Wong over the film's working title. Wong, who had been developing his own Ip Man biopic, clashed with the producers after learning that their film would be titled Grandmaster Ip Man, which was too similar to the title of the other film. The producers of Ip Man agreed to change the film title, despite Wong's film being in development hell. Kar-wai's film, titled The Grandmaster (2013), was released on 10 January 2013. See more »","Goofs":"In the bedroom, when Yip Man is reading, there is a modern lamp made of matte metal. See more »","Cast":"Donnie Yen, Simon Yam, Ka Tung Lam, Siu-Wong Fan, Lynn Hung, Hiroyuki Ikeuchi, Tenma Shibuya, Xing Yu, Zhi-Hui Chen, You-Nam Wong, Rong-Jun Cai, Li Chak, Siu-Kwan Chan, Calvin Ka-Sing Cheng, Shi De-Qiang","Plot":"A semi-biographical account of Yip Man, the successful martial arts master who taught the Chinese martial art of Wing Chun to the world. In 1935 in Foshan, south China, there are martial arts schools on every street corner. Ip Man is the undisputed martial arts champion, yet he has not devoted himself to teaching. Despite this, it seems that all the kung fu masters of the city are eager to fight him to improve their reputation. Written by Riccardo Amadori","Genre":"Action, Biography, Drama","Keywords":"hand to hand combat, martial arts, master, wing chun, fight","imdbRating":"8.1","imdbVotes":"156,669","Awards":"12 wins & 15 nominations.","Metascore":"59","Released":"12 December 2008 (China) ","Actors":"Donnie Yen, Simon Yam, Siu-Wong Fan ","Writer":"Edmond Wong (screenplay), Tai-Li Chan","Running_time":"PT106M / 1h 46min","Description":"Directed by Wilson Yip.  With Donnie Yen, Simon Yam, Siu-Wong Fan, Ka Tung Lam. A semi-biographical account of Yip Man, the successful martial arts master who taught the Chinese martial art of Wing Chun to the world.","Rated":"R"}