{"imdbID":"tt1201607","Title":"Harry Potter and the Deathly Hallows: Part 2","Year":"2011","Director":"David Yates","Taglines":"The Last Enemy Is Death ","Country":"USA, UK","Language":"English","Also_Known_As":"Harry Potter and the Deathly Hallows: Part 2 3D ","Budget":"$125,000,000 (estimated)","Opening_Weekend":"$169,189,427 (USA) (15 July 2011)","Gross":"$380,955,619 (USA) (11 November 2011)","Production_Co":"Warner Bros., Heyday Films, Moving Picture Company (MPC) ","":"Show detailed company contact information on IMDbPro »","Runtime":"130 min","Sound_Mix":"Dolby Digital | DTS | Dolby (Dolby Surround 7.1)| SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Despite appearing only once in the film as Albus Dumbledore, Michael Gambon was one of the top billed cast of the film. See more »","Goofs":"In the flashback to when Snape and Lily were kids, Lily is shown with brown eyes. This is incorrect because everybody describes Lily to have the same color eyes as Harry in the movie which is blue. See more »","Crazy_Credits":"The only credits at the beginning of the movie are the Warner Brothers logo and the title \"Harry Potter and the Deathly Hallows Part 2.\" See more »","Cast":"Ralph Fiennes, Michael Gambon, Alan Rickman, Daniel Radcliffe, Rupert Grint, Emma Watson, Evanna Lynch, Domhnall Gleeson, Clémence Poésy, Warwick Davis, John Hurt, Helena Bonham Carter, Graham Duff, Anthony Allgood, Rusty Goffe","Plot":"Harry, Ron and Hermione search for Voldemort's remaining Horcruxes in their effort to destroy the Dark Lord as the final battle rages on at Hogwarts. Harry, Ron, and Hermione continue their quest of finding and destroying the Dark Lord's three remaining Horcruxes, the magical items responsible for his immortality. But as the mystical Deathly Hallows are uncovered, and Voldemort finds out about their mission, the biggest battle begins and life as they know it will never be the same again. Written by Jordan","Genre":"Adventure, Drama, Fantasy","Keywords":"battle, final battle, immortality, eighth part, pretending to be dead","imdbRating":"8.1","imdbVotes":"516,546","Awards":"Nominated for 3 Oscars. Another 44 wins & 82 nominations.","Metascore":"87","Released":"15 July 2011 (USA) ","Location":"England, UK ","Actors":"Daniel Radcliffe, Emma Watson, Rupert Grint ","Writer":"Steve Kloves (screenplay), J.K. Rowling (novel)","Running_time":"PT130M / 2h 10min","Description":"Directed by David Yates.  With Daniel Radcliffe, Emma Watson, Rupert Grint, Michael Gambon. Harry, Ron and Hermione search for Voldemort's remaining Horcruxes in their effort to destroy the Dark Lord as the final battle rages on at Hogwarts.","Rated":"PG-13"}