{"imdbID":"tt1226774","Title":"In the Loop","Year":"2009","Director":"Armando Iannucci","Taglines":"Things Are About To Spin Out Of Control ","Certificate":"Not Rated | See all certifications »","Country":"UK","Language":"English","Also_Known_As":"In the loop ","Budget":"£612,650 (estimated)","Opening_Weekend":"£468,954 (UK) (17 April 2009)","Gross":"$2,384,044 (USA) (16 October 2009)","Production_Co":"BBC Films, UK Film Council, Aramid Entertainment Fund ","Runtime":"106 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The shooting script after thirty days of filming was 237 pages long. The first cut of the film was 4.5 hours long. The final edit took four months to complete. See more »","Goofs":"Simon and Toby land in DC at what seems to be the afternoon (it is still full daylight, there are no long shadows and they proceed to the hotel and discuss what they'll do that evening). They phone Judy in London to arrange transport for them. She is woken by the call in what she says is the middle of the night. But DC is only 5 hours behind London, so it should be no later than mid-evening there. See more »","Crazy_Credits":"The film's final credits roll over a long shot of the main office. At the very end, Malcolm Tucker comes out, looks at the TV and asks, \"Who let this woman out with her fucking hair like this?! On national television?! Looks like she stuck her finger in a fucking electrical socket...\" before walking away. See more »","Cast":"Peter Capaldi, Harry Hadden-Paton, Samantha Harrington, Gina McKee, Tom Hollander, Olivia Poulet, Chris Addison, James Smith, Zach Woods, Mimi Kennedy, Anna Chlumsky, Enzo Cilenti, Lucinda Raikes, James Doherty, David Rasche","Plot":"A political satire about a group of skeptical American and British operatives attempting to prevent a war between two countries. The US President and UK Prime Minister fancy a war. But not everyone agrees that war is a good thing. The US General Miller doesn't think so and neither does the British Secretary of State for International Development, Simon Foster. But, after Simon accidentally backs military action on TV, he suddenly has a lot of friends in Washington, DC. If Simon can get in with the right DC people, if his entourage of one can sleep with the right intern, and if they can both stop the Prime Minister's chief spin-doctor Malcolm Tucker rigging the vote at the UN, they can halt the war. If they don't... well, they can always sack their Director of Communications Judy, who they never liked anyway and who's back home dealing with voters with blocked drains and a man who's angry about a collapsing wall. Written by Loop Film Productions Ltd/AT","Genre":"Comedy","Keywords":"politics, vote, washington d.c., wall, middle east","imdbRating":"7.5","imdbVotes":"43,003","Awards":"Nominated for 1 Oscar. Another 15 wins & 37 nominations.","Metascore":"83","Released":"4 September 2009 (USA) ","Location":"Inglis Barracks, Mill Hill, London, England, UK ","Actors":"Tom Hollander, Peter Capaldi, James Gandolfini ","Writer":"Jesse Armstrong (screenplay), Simon Blackwell (screenplay) | 3 more credits »","Running_time":"PT106M / 1h 46min","Description":"Directed by Armando Iannucci.  With Tom Hollander, Peter Capaldi, James Gandolfini, Harry Hadden-Paton. A political satire about a group of skeptical American and British operatives attempting to prevent a war between two countries.","Rated":"NOT RATED"}