{"imdbID":"tt1285016","Title":"The Social Network","Year":"2010","Director":"David Fincher","Country":"USA","Language":"English, French","Budget":"$40,000,000 (estimated)","Gross":"$96,917,897 (USA) (25 February 2011)","Production_Co":"Columbia Pictures, Relativity Media, Scott Rudin Productions ","Runtime":"120 min","Cast":"Jesse Eisenberg, Rooney Mara, Bryan Barter, Dustin Fitzsimons, Joseph Mazzello, Patrick Mapel, Andrew Garfield, Toby Meuli, Alecia Svensen, Jami Owen, James Dastoli, Robert Dastoli, Scotty Crowe, Jayk Gallagher, Marcella Lentz-Pope","Plot":"Harvard student Mark Zuckerberg creates the social networking site that would become known as Facebook, but is later sued by two brothers who claimed he stole their idea, and the co-founder who was later squeezed out of the business. On a fall night in 2003, Harvard undergrad and computer programming genius Mark Zuckerberg sits down at his computer and heatedly begins working on a new idea. In a fury of blogging and programming, what begins in his dorm room soon becomes a global social network and a revolution in communication. A mere six years and 500 million friends later, Mark Zuckerberg is the youngest billionaire in history... but for this entrepreneur, success leads to both personal and legal complications. Written by Columbia Pictures","Genre":"Biography, Drama","Keywords":"facebook, competitiveness, creator, intellectual property, entrepreneur","imdbRating":"7.7","imdbVotes":"461,609","Awards":"Won 3 Oscars. Another 157 wins & 157 nominations.","Metascore":"95","Released":"1 October 2010 (USA) ","Location":"Andover, Massachusetts, USA ","Actors":"Jesse Eisenberg, Andrew Garfield, Justin Timberlake ","Writer":"Aaron Sorkin (screenplay), Ben Mezrich (book)","Running_time":"PT120M / 2h","Description":"Directed by David Fincher.  With Jesse Eisenberg, Andrew Garfield, Justin Timberlake, Rooney Mara. Harvard student Mark Zuckerberg creates the social networking site that would become known as Facebook, but is later sued by two brothers who claimed he stole their idea, and the co-founder who was later squeezed out of the business.","Rated":"PG-13"}