{"imdbID":"tt1291584","Title":"Warrior","Year":"2011","Director":"Gavin O'Connor","Taglines":"Fight for Country ","Country":"USA","Language":"English, Spanish","Also_Known_As":"La última pelea ","Budget":"$25,000,000 (estimated)","Opening_Weekend":"$5,242,107 (USA) (9 September 2011)","Gross":"$13,651,662 (USA) (28 October 2011)","Production_Co":"Lionsgate, Mimran Schur Pictures, Solaris ","":"Show detailed company contact information on IMDbPro »","Runtime":"140 min","Sound_Mix":"Dolby Digital | Datasat | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Brendan Conlon may be loosely based on the life of real-life UFC fighter Rich \"Ace\" Franklin. Like the character, Franklin was also a high school teacher who took part in cage-fights to make extra money. See more »","Goofs":"North Hills Senior High School, where Brendan taught physics, and the Twin Highway Drive-in theater, where his students watched the final two fights, take place in Philadelphia but are actually located in Pittsburgh, where most of the rest of the movie is set. See more »","Cast":"Joel Edgerton, Tom Hardy, Nick Nolte, Jennifer Morrison, Frank Grillo, Kevin Dunn, Maximiliano Hernández, Bryan Callen, Sam Sheridan, Fernando Chien, Jake McLaughlin, Vanessa Martinez, Denzel Whitaker, Carlos Miranda, Manuel Espinosa","Plot":"The youngest son of an alcoholic former boxer returns home, where he's trained by his father for competition in a mixed martial arts tournament - a path that puts the fighter on a collision course with his estranged, older brother. Two brothers face the fight of a lifetime - and the wreckage of their broken family - within the brutal, high-stakes world of Mixed Martial Arts (MMA) fighting in Lionsgate's action/drama, WARRIOR. A former Marine, haunted by a tragic past, Tommy Riordan returns to his hometown of Pittsburgh and enlists his father, a recovered alcoholic and his former coach, to train him for an MMA tournament awarding the biggest purse in the history of the sport. As Tommy blazes a violent path towards the title prize, his brother, Brendan, a former MMA fighter unable to make ends meet as a public school teacher, returns to the amateur ring to provide for his family. Even though years have passed, recriminations and past betrayals keep Brendan bitterly estranged from both Tommy and his father. But when Brendan's unlikely rise as an underdog sets him on a collision course with Tommy, the two brothers must finally confront the forces that tore them apart, all the while waging the most intense, ... Written by MConnell","Genre":"Drama, Sport","Keywords":"tournament, mixed martial arts, alcoholic, return home, underdog","imdbRating":"8.2","imdbVotes":"318,505","Awards":"Nominated for 1 Oscar. Another 6 wins & 19 nominations.","Metascore":"71","Released":"9 September 2011 (USA) ","Location":"Santa Clarita, California, USA ","Actors":"Tom Hardy, Nick Nolte, Joel Edgerton ","Writer":"Gavin O'Connor (screenplay), Anthony Tambakis (screenplay) | 3 more credits »","Running_time":"PT140M / 2h 20min","Description":"Directed by Gavin O'Connor.  With Tom Hardy, Nick Nolte, Joel Edgerton, Jennifer Morrison. The youngest son of an alcoholic former boxer returns home, where he's trained by his father for competition in a mixed martial arts tournament - a path that puts the fighter on a collision course with his estranged, older brother.","Rated":"PG-13"}