{"imdbID":"tt1242460","Title":"We Need to Talk About Kevin","Year":"2011","Director":"Lynne Ramsay","Country":"UK, USA","Language":"English","Also_Known_As":"Tenemos que hablar de Kevin ","Budget":"$7,000,000 (estimated)","Opening_Weekend":"$24,587 (USA) (9 December 2011)","Gross":"$1,738,692 (USA) (18 May 2012)","Production_Co":"BBC Films, UK Film Council, Footprint Investment Fund ","Runtime":"112 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The colours on the target for the bow and arrow are in every scene. (Red, blue, yellow and white) See more »","Goofs":"The poster that appears in the Agency of travel behind Eva is of Buñol, the city where the war of tomatoes in the beginning of the movie takes place. The name is misspelled as \"Bunôl\" See more »","Crazy_Credits":"There are no opening credits. See more »","Cast":"Tilda Swinton, John C. Reilly, Ezra Miller, Jasper Newell, Rock Duer, Ashley Gerasimovich, Siobhan Fallon Hogan, Alex Manette, Kenneth Franklin, Leslie Lyles, Paul Diomede, Michael Campbell, J. Mallory McCree, Mark Elliot Wilson, James Chen","Plot":"Kevin's mother struggles to love her strange child, despite the increasingly vicious things he says and does as he grows up. But Kevin is just getting started, and his final act will be beyond anything anyone imagined. Eva Khatchadourian is trying to piece together her life following the \"incident\". Once a successful travel writer, she is forced to take whatever job comes her way, which of late is as a clerk in a travel agency. She lives a solitary life as people who know about her situation openly shun her, even to the point of violent actions toward her. She, in turn, fosters that solitary life because of the incident, the aftermath of which has turned her into a meek and scared woman. That incident involved her son Kevin Khatchadourian, who is now approaching his eighteenth birthday. Eva and Kevin have always had a troubled relationship, even when he was an infant. Whatever troubles he saw, Franklin, Eva's complacent husband, just attributed it to Kevin being a typical boy. The incident may be seen by both Kevin and Eva as his ultimate act in defiance against his mother. Written by Huggo","Genre":"Drama, Thriller","Keywords":"defiance, psychopath, mental illness, toilet training, archery","imdbRating":"7.5","imdbVotes":"90,960","Awards":"Nominated for 1 Golden Globe. Another 26 wins & 62 nominations.","Metascore":"68","Released":"21 October 2011 (UK) ","Location":"Buñol, Valencia, Comunidad Valenciana, Spain ","Actors":"Tilda Swinton, John C. Reilly, Ezra Miller ","Writer":"Lynne Ramsay (screenplay), Rory Stewart Kinnear (screenplay) | 1 more credit »","Running_time":"PT112M / 1h 52min","Description":"Directed by Lynne Ramsay.  With Tilda Swinton, John C. Reilly, Ezra Miller, Jasper Newell. Kevin's mother struggles to love her strange child, despite the increasingly vicious things he says and does as he grows up. But Kevin is just getting started, and his final act will be beyond anything anyone imagined.","Rated":"R"}