{"imdbID":"tt1365050","Title":"Beasts of No Nation","Year":"2015","Director":"Cary Joji Fukunaga","Taglines":"Child. Captive. Killer.","Certificate":"Not Rated | See all certifications »","Country":"USA","Language":"English","Also_Known_As":"Безрiднi звiрi ","Budget":"$6,000,000 (estimated)","Opening_Weekend":"$51,003 (USA) (16 October 2015)","Gross":"$83,861 (USA) (23 October 2015)","Production_Co":"Princess Grace Foundation, The, Red Crown Productions, Participant Media ","Runtime":"137 min","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Fukunaga colored the film personally, basing the look largely off of 1970s photo-chemical stock film stock. See more »","Goofs":"When Agu is first captured by the NDF and made to carry a crate of ammunition, it is a crate of 5.56x45mm rounds (according to the markings on the crate). Curiously, neither side in the civil war uses weapons that chamber this round; the NDF forces all carry Kalashnikov variants chambered in 7.62x39mm while the NRC soldiers favor HK G3 variants chambered in 7.62x51mm. See more »","Cast":"Abraham Attah, Emmanuel Affadzi, Ricky Adelayitor, Andrew Adote, Vera Nyarkoah Antwi, Ama K. Abebrese, Kobina Amissah-Sam, Francis Weddey, Fred Nii Amugi, John Arthur, Grace Nortey, Emmary Brown, Nataliah Andoh, Matthew Mpoke Bigg, Nana Mensah","Plot":"A drama based on the experiences of Agu, a child soldier fighting in the civil war of an unnamed African country. Follows the journey of a young boy, Agu, who is forced to join a group of soldiers in a fictional West African country. While Agu fears his commander and many of the men around him, his fledgling childhood has been brutally shattered by the war raging through his country, and he is at first torn between conflicting revulsion and fascination Depicts the mechanics of war and does not shy away from explicit, visceral detail, and paints a complex, difficult picture of Agu as a child soldier. Written by Bennie Carden","Genre":"Drama, War","Keywords":"male frontal nudity, child soldier, civil war, boy, guerrilla warfare","imdbRating":"7.8","imdbVotes":"34,725","Awards":"Nominated for 1 Golden Globe. Another 24 wins & 46 nominations.","Metascore":"79","Released":"16 October 2015 (USA) ","Location":"Ghana","Actors":"Abraham Attah, Emmanuel Affadzi, Ricky Adelayitor ","Writer":"Cary Joji Fukunaga (screenplay), Uzodinma Iweala (based on the novel by)","Running_time":"PT137M / 2h 17min","Description":"Directed by Cary Joji Fukunaga.  With Abraham Attah, Emmanuel Affadzi, Ricky Adelayitor, Andrew Adote. A drama based on the experiences of Agu, a child soldier fighting in the civil war of an unnamed African country.","Rated":"NOT RATED"}