{"imdbID":"tt1345836","Title":"The Dark Knight Rises","Year":"2012","Director":"Christopher Nolan","Taglines":"Rise ","Certificate":"U/A | See all certifications »","Country":"USA, UK","Language":"English","Also_Known_As":"Batman: El caballero de la noche asciende ","Budget":"$250,000,000 (estimated)","Opening_Weekend":"$160,887,295 (USA) (20 July 2012)","Gross":"$448,130,642 (USA) (7 December 2012)","Production_Co":"Warner Bros., Legendary Pictures, DC Entertainment ","":"Show detailed company contact information on IMDbPro »","Runtime":"164 min","Sound_Mix":"SDDS | Datasat | Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"During the motorcycle chase scene, Bane is wearing a red helmet with black visor as well as a brown motorcycle jacket. This is the original costume Jason Todd took under his Red Hood persona, which is itself a callback to The Joker's original criminal identity. See more »","Goofs":"In the football stadium when Bane grabs the microphone off the Official, it is the back judge who would not have a microphone - only the head referee would have a microphone. Further, it's not a regular microphone, it's a headset used for communications between coaches, and between the booth official(s) and field officials. Those systems aren't connected to the PA system, though it can be done if a need comes up. Obviously Bane wasn't coordinating with the PA control booth, he just picks up the headset and talks in to the mic part as if it were hooked in already. See more »","Crazy_Credits":"The title does not appear onscreen until after the last scene and before the end credits. See more »","Cast":"Christian Bale, Gary Oldman, Tom Hardy, Joseph Gordon-Levitt, Anne Hathaway, Marion Cotillard, Morgan Freeman, Michael Caine, Matthew Modine, Alon Aboutboul, Ben Mendelsohn, Burn Gorman, Daniel Sunjata, Aidan Gillen, Sam Kennard","Plot":"Eight years after the Joker's reign of anarchy, the Dark Knight, with the help of the enigmatic Selina, is forced from his imposed exile to save Gotham City, now on the edge of total annihilation, from the brutal guerrilla terrorist Bane. Despite his tarnished reputation after the events of The Dark Knight, in which he took the rap for Dent's crimes, Batman feels compelled to intervene to assist the city and its police force which is struggling to cope with Bane's plans to destroy the city. Written by WellardRockard","Genre":"Action, Thriller","Keywords":"police officer, lawlessness, terrorist plot, imprisonment, thug","imdbRating":"8.5","imdbVotes":"1,088,813","Awards":"Nominated for 1 BAFTA Film Award. Another 44 wins & 99 nominations.","Metascore":"78","Released":"20 July 2012 (India) ","Location":"Downtown, Los Angeles, California, USA ","Actors":"Christian Bale, Tom Hardy, Anne Hathaway ","Writer":"Jonathan Nolan (screenplay), Christopher Nolan (screenplay) | 3 more credits »","Running_time":"PT164M / 2h 44min","Description":"Directed by Christopher Nolan.  With Christian Bale, Tom Hardy, Anne Hathaway, Gary Oldman. Eight years after the Joker's reign of anarchy, the Dark Knight, with the help of the enigmatic Selina, is forced from his imposed exile to save Gotham City, now on the edge of total annihilation, from the brutal guerrilla terrorist Bane.","Rated":"U/A"}