{"imdbID":"tt1375666","Title":"Inception","Year":"2010","Director":"Christopher Nolan","Writer":"Christopher Nolan","Taglines":"Your mind is the scene of the crime ","Certificate":"UA | See all certifications »","Country":"USA, UK","Language":"English, Japanese, French","Also_Known_As":"Chakravuyh ","Budget":"$160,000,000 (estimated)","Opening_Weekend":"£5,912,814 (UK) (16 July 2010)","Gross":"$292,568,851 (USA) (31 December 2010)","Production_Co":"Warner Bros., Legendary Pictures, Syncopy ","":"Show detailed company contact information on IMDbPro »","Runtime":"148 min","Sound_Mix":"Dolby Digital | DTS | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Sir Michael Caine acts in six of Christopher Nolan movies. The music of each Christopher Nolan movie he acts in is composed by Hans Zimmer, except The Prestige (2006), which had music by David Julyan. See more »","Goofs":"When Arthur arrives in the hotel to get Cobb for their ride on the roof, it is dark outside. When they are out on the roof, it is around noon. See more »","Crazy_Credits":"The movie title never appears in the beginning of the movie, but appears three times during the end credits. Once at the beginning, again after the main actors and developers, and once more at the very end. See more »","Cast":"Leonardo DiCaprio, Joseph Gordon-Levitt, Ellen Page, Tom Hardy, Ken Watanabe, Dileep Rao, Cillian Murphy, Tom Berenger, Marion Cotillard, Pete Postlethwaite, Michael Caine, Lukas Haas, Tai-Li Lee, Claire Geare, Magnus Nolan","Plot":"A thief, who steals corporate secrets through use of dream-sharing technology, is given the inverse task of planting an idea into the mind of a CEO. Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state, when the mind is at its most vulnerable. Cobb's rare ability has made him a coveted player in this treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved. Now Cobb is being offered a chance at redemption. One last job could give him his life back but only if he can accomplish the impossible - inception. Instead of the perfect heist, Cobb and his team of specialists have to pull off the reverse: their task is not to steal an idea but to plant one. If they succeed, it could be the perfect crime. But no amount of careful planning or expertise can prepare the team for the dangerous enemy that seems to predict their every move. An enemy that only Cobb could have seen coming. Written by Warner Bros. Pictures","Genre":"Action, Mystery, Sci-Fi","Keywords":"dream, subconscious, thief, ambiguous ending, corporate espionage","imdbRating":"8.8","imdbVotes":"1,401,769","Awards":"Won 4 Oscars. Another 139 wins & 192 nominations.","Metascore":"74","Released":"16 July 2010 (India) ","Location":"Bedfordshire, England, UK ","Actors":"Leonardo DiCaprio, Joseph Gordon-Levitt, Ellen Page ","Running_time":"PT148M / 2h 28min","Description":"Directed by Christopher Nolan.  With Leonardo DiCaprio, Joseph Gordon-Levitt, Ellen Page, Ken Watanabe. A thief, who steals corporate secrets through use of dream-sharing technology, is given the inverse task of planting an idea into the mind of a CEO.","Rated":"UA"}