{"imdbID":"tt1371111","Title":"Cloud Atlas","Year":"2012","Taglines":"Everything Is Connected","Country":"Germany, USA, Hong Kong, Singapore","Language":"English, Spanish","Also_Known_As":"Cloud Atlas ","Budget":"$102,000,000 (estimated)","Opening_Weekend":"$9,612,247 (USA) (26 October 2012)","Gross":"$27,098,580 (USA) (18 January 2013)","Production_Co":"Cloud Atlas Productions, X-Filme Creative Pool, Anarchos Pictures ","Runtime":"172 min","Sound_Mix":"Dolby Digital | Datasat | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Luisa Rey's parents Lester and Judith Rey appear to be a tip of the hat to sci-fi publishing greats Lester del Rey and Judy-Lynn del Rey. See more »","Goofs":"When the young teenage customer at Papa Song's squirts the white mayonnaise-looking condiment all over Yoona-939's back, he shoots it all up over her right shoulder, but when Yoona-939 turns around to punch him, all of the condiment is concentrated on the center of her back, it's no longer on her shoulder. See more »","Crazy_Credits":"When a montage is shown of all the characters the actors are playing, the font of the names changes with each time period. See more »","Cast":"Tom Hanks, Halle Berry, Jim Broadbent, Hugo Weaving, Jim Sturgess, Doona Bae, Ben Whishaw, Keith David, James D'Arcy, Xun Zhou, David Gyasi, Susan Sarandon, Hugh Grant, Robert Fyfe, Martin Wuttke","Plot":"An exploration of how the actions of individual lives impact one another in the past, present and future, as one soul is shaped from a killer into a hero, and an act of kindness ripples across centuries to inspire a revolution. Everything is connected: an 1849 diary of an ocean voyage across the Pacific; letters from a composer to his lover; a thriller about a conspiracy at a nuclear power plant; a farce about a publisher in a nursing home; a rebellious clone in futuristic Korea; and the tale of a tribe living in post-apocalyptic Seoul, far in the future. Written by Anonymous","Genre":"Drama, Sci-Fi","Keywords":"nonlinear timeline, future, letter, composer, nursing home","imdbRating":"7.5","imdbVotes":"277,113","Awards":"Nominated for 1 Golden Globe. Another 16 wins & 69 nominations.","Metascore":"55","Released":"26 October 2012 (USA) ","Location":"Port de Sóller, Mallorca, Balearic Islands, Spain ","Actors":"Tom Hanks, Halle Berry, Hugh Grant ","Director":"Tom Tykwer, Lana Wachowski | 1 more credit »","Writer":"David Mitchell (novel), Lana Wachowski (written for the screen by) | 2 more credits »","Running_time":"PT172M / 2h 52min","Description":"Directed by Tom Tykwer, Lana Wachowski, Lilly Wachowski.  With Tom Hanks, Halle Berry, Hugh Grant, Hugo Weaving. An exploration of how the actions of individual lives impact one another in the past, present and future, as one soul is shaped from a killer into a hero, and an act of kindness ripples across centuries to inspire a revolution.","Rated":"R"}