{"imdbID":"tt1315981","Title":"A Single Man","Year":"2009","Director":"Tom Ford","Country":"USA","Language":"English, Spanish","Budget":"$7,000,000 (estimated)","Gross":"$9,166,863 (USA) (16 April 2010)","Production_Co":"Fade to Black Productions, Depth of Field, Artina Films ","Runtime":"99 min","Cast":"Colin Firth, Julianne Moore, Nicholas Hoult, Matthew Goode, Jon Kortajarena, Paulette Lamori, Ryan Simpkins, Ginnifer Goodwin, Teddy Sears, Paul Butler, Aaron Sanders, Aline Weber, Keri Lynn Pratt, Jenna Gavigan, Alicia Carr","Plot":"An English professor, one year after the sudden death of his boyfriend, is unable to cope with his typical days in 1960s Los Angeles. It's November 30, 1962. Native Brit George Falconer, an English professor at a Los Angeles area college, is finding it difficult to cope with life. Jim, his personal partner of sixteen years, died in a car accident eight months earlier when he was visiting with family. Jim's family were not going to tell George of the death or accident, let alone allow him to attend the funeral. This day, George has decided to get his affairs in order before he will commit suicide that evening. As he routinely and fastidiously prepares for the suicide and post suicide, George reminisces about his life with Jim. But George spends this day with various people, who see a man sadder than usual and who affect his own thoughts about what he is going to do. Those people include Carlos, a Spanish immigrant/aspiring actor/gigolo recently arrived in Los Angeles; Charley, his best friend who he knew from England, she who is a drama queen of a woman who romantically desires her best friend despite his sexual ... Written by Huggo","Genre":"Drama","Keywords":"practicing a suicide, gay character, suicide contemplation, car accident, male full back nudity","imdbRating":"7.6","imdbVotes":"80,917","Awards":"Nominated for 1 Oscar. Another 33 wins & 50 nominations.","Metascore":"77","Released":"5 February 2010 (USA) ","Location":"300 W Green St, Pasadena, California, USA ","Actors":"Colin Firth, Julianne Moore, Matthew Goode ","Writer":"Christopher Isherwood (novel), Tom Ford (written for the screen by) | 1 more credit »","Running_time":"PT99M / 1h 39min","Description":"Directed by Tom Ford.  With Colin Firth, Julianne Moore, Matthew Goode, Nicholas Hoult. An English professor, one year after the sudden death of his boyfriend, is unable to cope with his typical days in 1960s Los Angeles.","Rated":"R"}