{"imdbID":"tt1318514","Title":"Rise of the Planet of the Apes","Year":"2011","Director":"Rupert Wyatt","Taglines":"Evolution Becomes Revolution","Country":"USA","Language":"English, Sign Languages","Also_Known_As":"Caesar ","Budget":"$93,000,000 (estimated)","Opening_Weekend":"$54,806,191 (USA) (5 August 2011)","Gross":"$176,740,650 (USA) (16 December 2011)","Production_Co":"Twentieth Century Fox Film Corporation, Dune Entertainment, Chernin Entertainment ","Runtime":"105 min","Sound_Mix":"SDDS | Datasat | Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"In one scene under the vault, Caesar is taking the pose of The Thinker, by French sculptor Auguste Rodin. See more »","Goofs":"Buck's nostrils are rounded yet a gorilla's nostrils are covered by a small amount of skin folded along the area. See more »","Crazy_Credits":"The end credits appear over a map, showing the virus spreading around the world. See more »","Cast":"Andy Serkis, Karin Konoval, Terry Notary, Richard Ridings, Christopher Gordon, Devyn Dalton, Jay Caputo, James Franco, Freida Pinto, John Lithgow, Brian Cox, Tom Felton, David Oyelowo, Tyler Labine, Jamie Harris","Plot":"A substance, designed to help the brain repair itself, gives rise to a super-intelligent chimp who leads an ape uprising. At the story's heart is Caesar (Andy Serkis), a chimpanzee who gains human-like intelligence and emotions from an experimental drug. Raised like a child by the drug's creator, Will Rodman (James Franco) and a primatologist Caroline Aranha (Freida Pinto), Caesar ultimately finds himself taken from the humans he loves and imprisoned in an ape sanctuary in San Bruno. Seeking justice for his fellow inmates, Caesar gives the fellow apes the same drug that he inherited. He then assembles a simian army and escapes the sanctuary - putting man and ape on a collision course that could change the planet forever. Written by emauger1","Genre":"Action, Drama, Sci-Fi","Keywords":"ape, alzheimer's disease, chimpanzee, when animals attack, fire","imdbRating":"7.6","imdbVotes":"391,789","Awards":"Nominated for 1 Oscar. Another 19 wins & 41 nominations.","Metascore":"68","Released":"5 August 2011 (USA) ","Location":"Wellington, New Zealand ","Actors":"James Franco, Andy Serkis, Freida Pinto ","Writer":"Rick Jaffa, Amanda Silver | 1 more credit »","Running_time":"PT105M / 1h 45min","Description":"Directed by Rupert Wyatt.  With James Franco, Andy Serkis, Freida Pinto, Karin Konoval. A substance, designed to help the brain repair itself, gives rise to a super-intelligent chimp who leads an ape uprising.","Rated":"PG-13"}