{"imdbID":"tt1322269","Title":"August: Osage County","Year":"2013","Director":"John Wells","Country":"USA","Language":"English","Budget":"$25,000,000 (estimated)","Gross":"$37,738,400 (USA) (2 May 2014)","Production_Co":"Weinstein Company, The, Jean Doumanian Productions, Smokehouse Pictures ","Runtime":"121 min","Cast":"Meryl Streep, Julia Roberts, Chris Cooper, Ewan McGregor, Margo Martindale, Sam Shepard, Dermot Mulroney, Julianne Nicholson, Juliette Lewis, Abigail Breslin, Benedict Cumberbatch, Misty Upham, Will Coffey, Newell Alexander, Jerry Stahl","Plot":"A look at the lives of the strong-willed women of the Weston family, whose paths have diverged until a family crisis brings them back to the Oklahoma house they grew up in, and to the dysfunctional woman who raised them. Violet Weston (Meryl Streep) has cancer and a propensity for pills and alcohol. She's a difficult woman to deal with and her husband has finally had enough. Violet's family gathers including middle daughter Ivy, youngest daughter Karen (with her new fiancé), eldest daughter Barbara (with her separated husband and teenage daughter), and her sister Mattie Fae (with her husband and son in tow). A family tragedy causes tensions to run high and secrets to come out. The Weston women will be forced to examine themselves and their lives whether they want to or not. Welcome to Osage County, Oklahoma in the sweltering heat of August. Written by napierslogs","Genre":"Drama","Keywords":"pedophilia, incestuous relationship, based on play, oklahoma, secret","imdbRating":"7.3","imdbVotes":"65,159","Awards":"Nominated for 2 Oscars. Another 15 wins & 60 nominations.","Metascore":"58","Released":"10 January 2014 (USA) ","Location":"Oklahoma, USA ","Actors":"Meryl Streep, Dermot Mulroney, Julia Roberts ","Writer":"Tracy Letts (screenplay), Tracy Letts (play)","Running_time":"PT121M / 2h 1min","Description":"Directed by John Wells.  With Meryl Streep, Dermot Mulroney, Julia Roberts, Juliette Lewis. A look at the lives of the strong-willed women of the Weston family, whose paths have diverged until a family crisis brings them back to the Oklahoma house they grew up in, and to the dysfunctional woman who raised them.","Rated":"R"}