{"imdbID":"tt1305806","Title":"The Secret in Their Eyes","Year":"2009","Director":"Juan José Campanella","Country":"Argentina, Spain","Language":"Spanish","Also_Known_As":"The Secret in Their Eyes ","Budget":"$2,000,000 (estimated)","Opening_Weekend":"$167,866 (USA) (16 April 2010)","Gross":"$20,167,424 (USA) (8 January 2016)","Production_Co":"Tornasol Films, Haddock Films, 100 Bares ","":"Show detailed company contact information on IMDbPro »","Runtime":"129 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"This is the second movie directed by Juan José Campanella to receive an Oscar nomination. The first one was Son of the Bride (2001). See more »","Goofs":"The perimeter advertising of Tomas Duco stadium (where the match is being held) is not from the 1970s. All the perimeter advertisements shown behind the goal line are from 2008, the year when the movie was shot. See more »","Cast":"Soledad Villamil, Ricardo Darín, Carla Quevedo, Pablo Rago, Javier Godino, Bárbara Palladino, Rudy Romano, Alejandro Abelenda, Mario Alarcón, Guillermo Francella, Sebastián Blanco, Mariano Argento, José Luis Gioia, Juan José Ortíz, Kiko Cerone","Plot":"A retired legal counselor writes a novel hoping to find closure for one of his past unresolved homicide cases and for his unreciprocated love with his superior - both of which still haunt him decades later. In 1999, retired Argentinian federal justice agent Benjamín Espósito is writing a novel, using an old closed case as the source material. That case is the brutal rape and murder of Liliana Coloto. In addition to seeing the extreme grief of the victim's husband Ricardo Morales, Benjamín, his assistant Pablo Sandoval, and newly hired department chief Irene Menéndez-Hastings were personally affected by the case as Benjamín and Pablo tracked the killer, hence the reason why the unsatisfactory ending to the case has always bothered him. Despite the department already having two other suspects, Benjamín and Pablo ultimately were certain that a man named Isidoro Gómez is the real killer. Although he is aware that historical accuracy is not paramount for the novel, the process of revisiting the case is more an issue of closure for him. He tries to speak to the key players in the case, most specifically Irene, who still works in the justice department and who he has always been attracted to ... Written by Huggo","Genre":"Drama, Mystery, Thriller","Keywords":"justice, murder, investigation, suspect, tension","imdbRating":"8.2","imdbVotes":"124,340","Awards":"Won 1 Oscar. Another 51 wins & 39 nominations.","Metascore":"80","Released":"21 May 2010 (USA) ","Location":"Estación Retiro, Retiro, Buenos Aires, Federal District, Argentina ","Actors":"Ricardo Darín, Soledad Villamil, Pablo Rago ","Writer":"Eduardo Sacheri, Juan José Campanella | 1 more credit »","Running_time":"PT129M / 2h 9min","Description":"Directed by Juan José Campanella.  With Ricardo Darín, Soledad Villamil, Pablo Rago, Carla Quevedo. A retired legal counselor writes a novel hoping to find closure for one of his past unresolved homicide cases and for his unreciprocated love with his superior - both of which still haunt him decades later.","Rated":"R"}