{"imdbID":"tt1392190","Title":"Mad Max: Fury Road","Year":"2015","Director":"George Miller","Country":"Australia, USA","Language":"English, Russian","Budget":"$150,000,000 (estimated)","Gross":"$153,629,485 (USA) (18 September 2015)","Production_Co":"Warner Bros., Kennedy Miller Productions, Village Roadshow Pictures ","Runtime":"120 min","Cast":"Tom Hardy, Charlize Theron, Nicholas Hoult, Hugh Keays-Byrne, Josh Helman, Nathan Jones, Zoë Kravitz, Rosie Huntington-Whiteley, Riley Keough, Abbey Lee, Courtney Eaton, John Howard, Richard Carter, Iota, Angus Sampson","Plot":"A woman rebels against a tyrannical ruler in postapocalyptic Australia in search for her home-land with the help of a group of female prisoners, a psychotic worshipper, and a drifter named Max. An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and almost everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order. There's Max, a man of action and a man of few words, who seeks peace of mind following the loss of his wife and child in the aftermath of the chaos. And Furiosa, a woman of action and a woman who believes her path to survival may be achieved if she can make it across the desert back to her childhood homeland. Written by Production","Genre":"Action, Adventure, Sci-Fi","Keywords":"post apocalypse, australia, desert, escape, on the run","imdbRating":"8.1","imdbVotes":"481,708","Awards":"Won 6 Oscars. Another 176 wins & 178 nominations.","Metascore":"90","Released":"15 May 2015 (USA) ","Location":"Namib Desert, Namibia ","Actors":"Tom Hardy, Charlize Theron, Nicholas Hoult ","Writer":"George Miller, Brendan McCarthy | 1 more credit »","Running_time":"PT120M / 2h","Description":"Directed by George Miller.  With Tom Hardy, Charlize Theron, Nicholas Hoult, Zoë Kravitz. A woman rebels against a tyrannical ruler in postapocalyptic Australia in search for her home-land with the help of a group of female prisoners, a psychotic worshipper, and a drifter named Max.","Rated":"R"}