{"imdbID":"tt1454029","Title":"The Help","Year":"2011","Director":"Tate Taylor","Taglines":"Change begins with a whisper.","Country":"USA, India, United Arab Emirates","Language":"English","Also_Known_As":"Historias cruzadas ","Budget":"$25,000,000 (estimated)","Opening_Weekend":"$26,044,590 (USA) (12 August 2011)","Gross":"$169,705,587 (USA) (2 March 2012)","Production_Co":"DreamWorks SKG, Reliance Entertainment, Participant Media ","":"Show detailed company contact information on IMDbPro »","Sound_Mix":"Dolby Digital | SDDS | Datasat","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Hilly's house is actually a residential property and the featured cream couch was already part of it. See more »","Goofs":"When Yule Mae asks the Holbrooks for the advance in wages, Mr. Holbrook quickly excuses himself claiming he's late. As he bends down to give his wife a peck on the cheek, his tie is not clipped to his shirt. After the kiss, and a director's cut, it is properly fixed. See more »","Cast":"Emma Stone, Viola Davis, Bryce Dallas Howard, Octavia Spencer, Jessica Chastain, Ahna O'Reilly, Allison Janney, Anna Camp, Eleanor Henry, Emma Henry, Chris Lowell, Cicely Tyson, Mike Vogel, Sissy Spacek, Brian Kerwin","Plot":"An aspiring author during the civil rights movement of the 1960s decides to write a book detailing the African-American maids' point of view on the white families for which they work, and the hardships they go through on a daily basis. Set in Mississippi during the 1960s, Skeeter (Stone) is a southern society girl who returns from college determined to become a writer, but turns her friends' lives -- and a Mississippi town -- upside down when she decides to interview the black women who have spent their lives taking care of prominent southern families. Aibileen (Davis), Skeeter's best friend's housekeeper, is the first to open up -- to the dismay of her friends in the tight-knit black community. Despite Skeeter's life-long friendships hanging in the balance, she and Aibileen continue their collaboration and soon more women come forward to tell their stories -- and as it turns out, they have a lot to say. Along the way, unlikely friendships are forged and a new sisterhood emerges, but not before everyone in town has a thing or two to say themselves when they become unwittingly -- and unwillingly -- caught up in the changing times. Written by Walt Disney Pictures","Genre":"Drama","Keywords":"maid, jackson mississippi, black servant, chocolate pie, writing a novel","imdbRating":"8.1","imdbVotes":"306,356","Awards":"Won 1 Oscar. Another 79 wins & 108 nominations.","Metascore":"62","Released":"10 August 2011 (USA) ","Location":"Clarksdale, Mississippi, USA ","Actors":"Emma Stone, Viola Davis, Octavia Spencer ","Writer":"Tate Taylor (screenplay), Kathryn Stockett (novel)","Running_time":"PT146M / 2h 26min","Description":"Directed by Tate Taylor.  With Emma Stone, Viola Davis, Octavia Spencer, Bryce Dallas Howard. An aspiring author during the civil rights movement of the 1960s decides to write a book detailing the African-American maids' point of view on the white families for which they work, and the hardships they go through on a daily basis.","Rated":"PG-13"}