{"imdbID":"tt1457767","Title":"The Conjuring","Year":"2013","Director":"James Wan","Country":"USA","Language":"English, Latin","Also_Known_As":"The Warren Files ","Budget":"$20,000,000 (estimated)","Opening_Weekend":"$41,855,326 (USA) (19 July 2013)","Gross":"$137,387,272 (USA) (25 October 2013)","Production_Co":"New Line Cinema, Safran Company, The, Evergreen Media Group ","Runtime":"112 min","Sound_Mix":"Dolby Digital | Datasat | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"When the real life family that the film is based on, named the Perrons, visited the set locate in North Caroline, they felt a cool wind whip throughout the set. They also noticed that the intense, sudden draft did not move or shake any trees. See more »","Goofs":"When Judy Warren is being attacked by the witch in her bedroom, her locket necklace is hanging on her night table. After they get her out and run down the hall, it is around her neck. See more »","Crazy_Credits":"\"Some of the artwork seen in this movie is provided by Austrian artist Maria Loewenstein.\" See more »","Cast":"Vera Farmiga, Patrick Wilson, Lili Taylor, Ron Livingston, Shanley Caswell, Hayley McFarland, Joey King, Mackenzie Foy, Kyla Deaver, Shannon Kook, John Brotherton, Sterling Jerins, Marion Guyot, Morganna May, Amy Tipton","Plot":"Paranormal investigators Ed and Lorraine Warren work to help a family terrorized by a dark presence in their farmhouse. In 1971, Carolyn and Roger Perron move their family into a dilapidated Rhode Island farm house and soon strange things start happening around it with escalating nightmarish terror. In desperation, Carolyn contacts the noted paranormal investigators, Ed and Lorraine Warren, to examine the house. What the Warrens discover is a whole area steeped in a satanic haunting that is now targeting the Perron family wherever they go. To stop this evil, the Warrens will have to call upon all their skills and spiritual strength to defeat this spectral menace at its source that threatens to destroy everyone involved. Written by Kenneth Chisholm (kchishol@rogers.com)","Genre":"Horror","Keywords":"based on true story, paranormal investigator, farmhouse, rhode island, witch","imdbRating":"7.5","imdbVotes":"276,231","Awards":"14 wins & 21 nominations.","Metascore":"68","Released":"19 July 2013 (USA) ","Location":"Wilmington, North Carolina, USA ","Actors":"Patrick Wilson, Vera Farmiga, Ron Livingston ","Writer":"Chad Hayes, Carey Hayes (as Carey W. Hayes)","Running_time":"PT112M / 1h 52min","Description":"Directed by James Wan.  With Patrick Wilson, Vera Farmiga, Ron Livingston, Lili Taylor. Paranormal investigators Ed and Lorraine Warren work to help a family terrorized by a dark presence in their farmhouse.","Rated":"R"}