{"imdbID":"tt1535109","Title":"Captain Phillips","Year":"2013","Director":"Paul Greengrass","Country":"USA","Language":"English, Somali","Budget":"$55,000,000 (estimated)","Gross":"$107,100,855 (USA) (28 February 2014)","Production_Co":"Scott Rudin Productions, Michael De Luca Productions, Trigger Street Productions ","Runtime":"134 min","Cast":"Tom Hanks, Catherine Keener, Barkhad Abdi, Barkhad Abdirahman, Faysal Ahmed, Mahat M. Ali, Michael Chernus, David Warshofsky, Corey Johnson, Chris Mulkey, Yul Vazquez, Max Martini, Omar Berdouni, Mohamed Ali, Issak Farah Samatar","Plot":"The true story of Captain Richard Phillips and the 2009 hijacking by Somali pirates of the US-flagged MV Maersk Alabama, the first American cargo ship to be hijacked in two hundred years. Captain Phillips is a multi-layered examination of the 2009 hijacking of the U.S. container ship Maersk Alabama by a crew of Somali pirates. It is - through director Paul Greengrass's distinctive lens - simultaneously a pulse-pounding thriller, and a complex portrait of the myriad effects of globalization. The film focuses on the relationship between the Alabama's commanding officer, Captain Richard Phillips (two time Academy Award®-winner Tom Hanks), and the Somali pirate captain, Muse (Barkhad Abdi), who takes him hostage. Phillips and Muse are set on an unstoppable collision course when Muse and his crew target Phillips' unarmed ship; in the ensuing standoff, 145 miles off the Somali coast, both men will find themselves at the mercy of forces beyond their control. Written by Sony Pictures Entertainment","Genre":"Biography, Drama, Thriller","Keywords":"captain, pirate, somali, ship, hostage","imdbRating":"7.9","imdbVotes":"312,767","Awards":"Nominated for 6 Oscars. Another 16 wins & 132 nominations.","Metascore":"83","Released":"11 October 2013 (USA) ","Location":"Malta ","Actors":"Tom Hanks, Barkhad Abdi, Barkhad Abdirahman ","Writer":"Billy Ray (screenplay), Richard Phillips (based upon the book \"A Captain's Duty: Somali Pirates, Navy SEALS, and Dangerous Days at Sea\" by) | 1 more credit »","Running_time":"PT134M / 2h 14min","Description":"Directed by Paul Greengrass.  With Tom Hanks, Barkhad Abdi, Barkhad Abdirahman, Catherine Keener. The true story of Captain Richard Phillips and the 2009 hijacking by Somali pirates of the US-flagged MV Maersk Alabama, the first American cargo ship to be hijacked in two hundred years.","Rated":"PG-13"}