{"imdbID":"tt1542344","Title":"127 Hours","Year":"2010","Director":"Danny Boyle","Country":"USA, UK","Language":"English, Italian","Budget":"$18,000,000 (estimated)","Gross":"$18,329,466 (USA) (8 April 2011)","Production_Co":"Pathé, Everest Entertainment, Cloud Eight Films ","Runtime":"94 min","Cast":"James Franco, Kate Mara, Amber Tamblyn, Sean Bott, Koleman Stinger, Treat Williams, John Lawrence, Kate Burton, Bailee Michelle Johnson, Parker Hadley, Clémence Poésy, Fenton Quinn, Lizzy Caplan, Peter Joshua Hull, Pieter Jan Brugge","Plot":"An adventurous mountain climber becomes trapped under a boulder while canyoneering alone near Moab, Utah and resorts to desperate measures in order to survive. 127 Hours is the true story of mountain climber Aron Ralston's remarkable adventure to save himself after a fallen boulder crashes on his arm and traps him in an isolated canyon in Utah. Over the next five days Ralston examines his life and survives the elements to finally discover he has the courage and the wherewithal to extricate himself by any means necessary, scale a 65 foot wall and hike over eight miles before he can be rescued. Throughout his journey, Ralston recalls friends, lovers, family, and the two hikers he met before his accident. Will they be the last two people he ever had the chance to meet? Written by Fox Searchlight Pictures","Genre":"Adventure, Biography, Drama","Keywords":"alone, aron ralston, based on autobiography, survival, canyon","imdbRating":"7.6","imdbVotes":"270,246","Awards":"Nominated for 6 Oscars. Another 22 wins & 136 nominations.","Metascore":"82","Released":"28 January 2011 (USA) ","Location":"Moab, Utah, USA ","Actors":"James Franco, Amber Tamblyn, Kate Mara ","Writer":"Danny Boyle (screenplay), Simon Beaufoy (screenplay) | 1 more credit »","Running_time":"PT94M / 1h 34min","Description":"Directed by Danny Boyle.  With James Franco, Amber Tamblyn, Kate Mara, Sean Bott. An adventurous mountain climber becomes trapped under a boulder while canyoneering alone near Moab, Utah and resorts to desperate measures in order to survive.","Rated":"R"}