{"imdbID":"tt1504320","Title":"The King's Speech","Year":"2010","Director":"Tom Hooper","Writer":"David Seidler (screenplay)","Taglines":"Find Your Voice. ","Country":"UK, USA, Australia","Language":"English","Also_Known_As":"El discurso del rey ","Budget":"$15,000,000 (estimated)","Opening_Weekend":"$355,450 (USA) (26 November 2010)","Gross":"$138,795,342 (USA) (10 June 2011)","Production_Co":"See-Saw Films, Weinstein Company, The, UK Film Council ","":"Show detailed company contact information on IMDbPro »","Runtime":"118 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Timothy Spall also plays Winston Churchill at the opening of the 2012 London Olympics. See more »","Goofs":"In the movie, an air raid alarm occurs in London in September 1939. There was a false air raid alarm at 11:28 a.m. on September 3, 1939, the day war was declared on Germany. Genuine air raids occurred the next year. See more »","Crazy_Credits":"In the end credit roll, Philip Clements is listed twice as Assistant Sound Editor. See more »","Cast":"Colin Firth, Helena Bonham Carter, Derek Jacobi, Robert Portal, Richard Dixon, Paul Trussell, Adrian Scarborough, Andrew Havill, Charles Armstrong, Roger Hammond, Geoffrey Rush, Calum Gittins, Jennifer Ehle, Dominic Applewhite, Ben Wimsett","Plot":"The story of King George VI of the United Kingdom of Great Britain and Northern Ireland, his impromptu ascension to the throne and the speech therapist who helped the unsure monarch become worthy of it. Tells the story of the man who became King George VI, the father of Queen Elizabeth II. After his brother abdicates, George ('Bertie') reluctantly assumes the throne. Plagued by a dreaded stammer and considered unfit to be king, Bertie engages the help of an unorthodox speech therapist named Lionel Logue. Through a set of unexpected techniques, and as a result of an unlikely friendship, Bertie is able to find his voice and boldly lead the country through war. Written by Anonymous","Genre":"Biography, Drama, History","Keywords":"king, speech, king george vi, speech therapist, england","imdbRating":"8.0","imdbVotes":"481,653","Awards":"Won 4 Oscars. Another 98 wins & 183 nominations.","Metascore":"88","Released":"25 December 2010 (USA) ","Location":"Halton House, Halton, Wendover, Buckinghamshire, England, UK ","Actors":"Colin Firth, Geoffrey Rush, Helena Bonham Carter ","Running_time":"PT118M / 1h 58min","Description":"Directed by Tom Hooper.  With Colin Firth, Geoffrey Rush, Helena Bonham Carter, Derek Jacobi. The story of King George VI of the United Kingdom of Great Britain and Northern Ireland, his impromptu ascension to the throne and the speech therapist who helped the unsure monarch become worthy of it.","Rated":"R"}