{"imdbID":"tt1554091","Title":"A Better Life","Year":"2011","Director":"Chris Weitz","Country":"USA","Language":"English, Spanish","Budget":"$10,000,000 (estimated)","Gross":"$1,754,319 (USA) (26 August 2011)","Production_Co":"Summit Entertainment, Lime Orchard Productions, Witt/Thomas Productions ","Cast":"Demián Bichir, Eddie 'Piolin' Sotelo, Joaquín Cosio, José Julián, Nancy Lenehan, Gabriel Chavarria, Bobby Soto, Chelsea Rendon, Trampas Thompson, Tim Griffin, Valorie Hubbard, Dolores Heredia, Isabella Rae Thomas, Carlos Linares, Robert Peters","Plot":"A gardener in East L.A. struggles to keep his son away from gangs and immigration agents while trying to give his son the opportunities he never had. Carlos Galindo is a decent man, a Mexican single parent working as a gardener in California to raise Luis,his fourteen-year-old son,whom Carlos is frightened will drift into local gang culture. Carlos buys a truck for his work with money loaned by his sister but a shifty new employee steals it from him and,though Carlos and Luis track the thief down,he has sold the truck. Father and son bond as they reclaim the vehicle from the pound but Carlos attracts police attention,making his future in America uncertain when it is discovered that he is an illegal immigrant. Written by don @ minifie-1","Genre":"Drama","Keywords":"gang, truck, gardener, police, money","imdbRating":"7.2","imdbVotes":"12,934","Awards":"Nominated for 1 Oscar. Another 6 wins & 7 nominations.","Metascore":"64","Released":"28 July 2011 (Thailand) ","Location":"Wattles Mansion - 1824 N. Curson Avenue, Hollywood, Los Angeles, California, USA ","Actors":"Demián Bichir, José Julián, Eddie 'Piolin' Sotelo ","Writer":"Eric Eason (screenplay), Roger L. Simon (story)","Running_time":"PT98M / 1h 38min","Description":"Directed by Chris Weitz.  With Demián Bichir, José Julián, Eddie 'Piolin' Sotelo, Joaquín Cosio. A gardener in East L.A. struggles to keep his son away from gangs and immigration agents while trying to give his son the opportunities he never had.","Rated":"PG-13"}