{"imdbID":"tt1596363","Title":"The Big Short","Year":"2015","Director":"Adam McKay","Taglines":"This is a true story","Country":"USA","Language":"English","Also_Known_As":"The Big Short: Inside the Doomsday Machine ","Budget":"$28,000,000 (estimated)","Opening_Weekend":"$705,527 (USA) (11 December 2015)","Gross":"$69,815,957 (USA) (11 March 2016)","Production_Co":"Plan B Entertainment, Regency Enterprises ","Runtime":"130 min","Sound_Mix":"Dolby Digital | Datasat","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"After Burry sends his email to investors about his restriction of their funds the first person to respond has the last name \"Bates.\" See more »","Goofs":"While the guys are exploring one of the abandoned homes in Miami, a Ralphs Grocery Store circular is visible in the pile of junk mail. Ralphs are only found in Southern California. See more »","Cast":"Ryan Gosling, Rudy Eisenzopf, Casey Groves, Charlie Talbert, Harold Gervais, Maria Frangos, Christian Bale, Hunter Burke, Bernard Hocke, Shauna Rappold, Brandon Stacy, Aiden Flowers, Peter Epstein, Anthony Marble, Silas Cooper","Plot":"Four denizens in the world of high-finance predict the credit and housing bubble collapse of the mid-2000s, and decide to take on the big banks for their greed and lack of foresight. Three separate but parallel stories of the U.S mortgage housing crisis of 2005 are told. Michael Burry, an eccentric ex-physician turned one-eyed Scion Capital hedge fund manager, has traded traditional office attire for shorts, bare feet and a Supercuts haircut. He believes that the US housing market is built on a bubble that will burst within the next few years. Autonomy within the company allows Burry to do largely as he pleases, so Burry proceeds to bet against the housing market with the banks, who are more than happy to accept his proposal for something that has never happened in American history. The banks believe that Burry is a crackpot and therefore are confident in that they will win the deal. Jared Vennett with Deutschebank gets wind of what Burry is doing and, as an investor believes he too can cash in on Burry's beliefs. An errant telephone call to FrontPoint Partners gets this information into the hands of Mark Baum, an idealist who is fed up with the corruption in the ... Written by Huggo","Genre":"Biography, Comedy, Drama","Keywords":"bank, fraud, banking, finance, mortgage","imdbRating":"7.9","imdbVotes":"114,423","Awards":"Won 1 Oscar. Another 30 wins & 71 nominations.","Metascore":"81","Released":"23 December 2015 (USA) ","Location":"New Orleans, Louisiana, USA ","Actors":"Christian Bale, Steve Carell, Ryan Gosling ","Writer":"Charles Randolph (screenplay), Adam McKay (screenplay) | 1 more credit »","Running_time":"PT130M / 2h 10min","Description":"Directed by Adam McKay.  With Christian Bale, Steve Carell, Ryan Gosling, Brad Pitt. Four denizens in the world of high-finance predict the credit and housing bubble collapse of the mid-2000s, and decide to take on the big banks for their greed and lack of foresight.","Rated":"R"}