{"imdbID":"tt1631867","Title":"Edge of Tomorrow","Year":"2014","Director":"Doug Liman","Taglines":"Live, Die, Repeat","Country":"USA, Canada","Language":"English","Also_Known_As":"All You Need Is Kill ","Budget":"$178,000,000 (estimated)","Opening_Weekend":"$28,760,246 (USA) (6 June 2014)","Gross":"$100,189,501 (USA) (5 September 2014)","Production_Co":"Warner Bros., Village Roadshow Pictures, RatPac-Dune Entertainment ","Runtime":"113 min","Sound_Mix":"SDDS | Datasat | Dolby Digital | Dolby Atmos","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Rita, for her bravery, was nicknamed by the public \"The Angel of Verdun.\" In real life, Verdun was the site in France of the bloodiest battle of WWI in 1916. It lasted almost a year and an estimated one million men on both sides died, and Mons was the site in Belgium of a battle in 1914 and spawned tales of what many consider an otherworldly miracle. A 1914 newspaper short story about the battle, \"The Bowmen,\" written by horror-story specialist Arthur Machen, told the tale of how during the battle, soldiers on both sides saw \"supernatural\" medieval archers appearing in the sky and causing the enemy to retreat. Despite Machen's attempts to prevent it, his story, which was entirely fictional, quickly inspired a popular and strongly believed account of \"the Angels of Mons.\" The Battle of Verdun occurred two years later and there was no association with angelic apparitions, but Rita's nickname does seem to be inspired by the \"Angels of Mons\" story. See more »","Goofs":"On the map seen at the start of the movie, the capital of Hungary, Budapest is misplaced. See more »","Crazy_Credits":"There are no opening credits, the title doesn't appear until the closing credits. See more »","Cast":"Tom Cruise, Emily Blunt, Brendan Gleeson, Bill Paxton, Jonas Armstrong, Tony Way, Kick Gurry, Franz Drameh, Dragomir Mrsic, Charlotte Riley, Masayoshi Haneda, Terence Maynard, Noah Taylor, Lara Pulver, Madeleine Mantock","Plot":"A military officer is brought into an alien war against an extraterrestrial enemy who can reset the day and know the future. When this officer is enabled with the same power, he teams up with a Special Forces warrior to try and end the war. An alien race has hit the Earth in an unrelenting assault, unbeatable by any military unit in the world. Major William Cage (Cruise) is an officer who has never seen a day of combat when he is unceremoniously dropped into what amounts to a suicide mission. Killed within minutes, Cage now finds himself inexplicably thrown into a time loop-forcing him to live out the same brutal combat over and over, fighting and dying again...and again. But with each battle, Cage becomes able to engage the adversaries with increasing skill, alongside Special Forces warrior Rita Vrataski (Blunt). And, as Cage and Vrataski take the fight to the aliens, each repeated encounter gets them one step closer to defeating the enemy! Written by Warner Bros. Pictures","Genre":"Action, Adventure, Sci-Fi","Keywords":"time loop, alien, dying repeatedly, combat, battle","imdbRating":"7.9","imdbVotes":"407,799","Awards":"11 wins & 34 nominations.","Metascore":"71","Released":"6 June 2014 (USA) ","Location":"Leavesden Studios, Leavesden, Hertfordshire, England, UK ","Actors":"Tom Cruise, Emily Blunt, Bill Paxton ","Writer":"Christopher McQuarrie (screenplay), Jez Butterworth (screenplay) | 2 more credits »","Running_time":"PT113M / 1h 53min","Description":"Directed by Doug Liman.  With Tom Cruise, Emily Blunt, Bill Paxton, Brendan Gleeson. A military officer is brought into an alien war against an extraterrestrial enemy who can reset the day and know the future. When this officer is enabled with the same power, he teams up with a Special Forces warrior to try and end the war.","Rated":"PG-13"}