{"imdbID":"tt1605783","Title":"Midnight in Paris","Year":"2011","Director":"Woody Allen","Writer":"Woody Allen","Country":"Spain, USA, France","Language":"English, French, Spanish, German","Budget":"$17,000,000 (estimated)","Gross":"$56,816,662 (USA) (16 March 2012)","Production_Co":"Mediapro, Versátil Cinema, Gravier Productions ","Cast":"Owen Wilson, Rachel McAdams, Kurt Fuller, Mimi Kennedy, Michael Sheen, Nina Arianda, Carla Bruni, Maurice Sonnenberg, Thierry Hancisse, Guillaume Gouix, Audrey Fleurot, Marie-Sohna Conde, Yves Heck, Alison Pill, Tom Hiddleston","Plot":"While on a trip to Paris with his fiancée's family, a nostalgic screenwriter finds himself mysteriously going back to the 1920s every day at midnight. Gil and Inez travel to Paris as a tag-along vacation on her parents' business trip. Gil is a successful Hollywood writer but is struggling on his first novel. He falls in love with the city and thinks they should move there after they get married, but Inez does not share his romantic notions of the city or the idea that the 1920s was the golden age. When Inez goes off dancing with her friends, Gil takes a walk at midnight and discovers what could be the ultimate source of inspiration for writing. Gil's daily walks at midnight in Paris could take him closer to the heart of the city but further from the woman he's about to marry. Written by napierslogs","Genre":"Comedy, Fantasy, Romance","Keywords":"1920s, golden age, time travel romance, midnight, love","imdbRating":"7.7","imdbVotes":"291,111","Awards":"Won 1 Oscar. Another 19 wins & 90 nominations.","Metascore":"81","Released":"10 June 2011 (USA) ","Location":"Arc de Triomphe, Paris 8, Paris, France ","Actors":"Owen Wilson, Rachel McAdams, Kathy Bates ","Running_time":"PT94M / 1h 34min","Description":"Directed by Woody Allen.  With Owen Wilson, Rachel McAdams, Kathy Bates, Kurt Fuller. While on a trip to Paris with his fiancée's family, a nostalgic screenwriter finds himself mysteriously going back to the 1920s every day at midnight.","Rated":"PG-13"}