{"imdbID":"tt1663202","Title":"The Revenant","Year":"2015","Director":"Alejandro González Iñárritu (as Alejandro G. Iñárritu)","Country":"USA","Language":"English, Pawnee, French","Budget":"$135,000,000 (estimated)","Gross":"$179,143,137 (USA) (11 March 2016)","Production_Co":"Anonymous Content, Appian Way, CatchPlay ","Runtime":"156 min","Cast":"Leonardo DiCaprio, Tom Hardy, Domhnall Gleeson, Will Poulter, Forrest Goodluck, Paul Anderson, Kristoffer Joner, Joshua Burge, Duane Howard, Melaw Nakehk'o, Fabrice Adde, Arthur RedCloud, Christopher Rosamond, Robert Moloney, Lukas Haas","Plot":"A frontiersman on a fur trading expedition in the 1820s fights for survival after being mauled by a bear and left for dead by members of his own hunting team. While exploring the uncharted wilderness in 1823, legendary frontiersman Hugh Glass sustains injuries from a brutal bear attack. When his hunting team leaves him for dead, Glass must utilize his survival skills to find a way back home to his beloved family. Grief-stricken and fueled by vengeance, Glass treks through the wintry terrain to track down John Fitzgerald, the former confidant who betrayed and abandoned him. Written by Jwelch5742","Genre":"Adventure, Drama, Thriller","Keywords":"survival, revenge, bear attack, interracial romance, cauterizing a wound","imdbRating":"8.2","imdbVotes":"283,400","Awards":"Won 3 Oscars. Another 66 wins & 146 nominations.","Metascore":"76","Released":"8 January 2016 (USA) ","Location":"Calgary, Alberta, Canada ","Actors":"Leonardo DiCaprio, Tom Hardy, Will Poulter ","Writer":"Mark L. Smith (screenplay), Alejandro González Iñárritu (screenplay) (as Alejandro G. Iñárritu) | 1 more credit »","Running_time":"PT156M / 2h 36min","Description":"Directed by Alejandro González Iñárritu.  With Leonardo DiCaprio, Tom Hardy, Will Poulter, Domhnall Gleeson. A frontiersman on a fur trading expedition in the 1820s fights for survival after being mauled by a bear and left for dead by members of his own hunting team.","Rated":"R"}