{"imdbID":"tt1602098","Title":"Albert Nobbs","Year":"2011","Director":"Rodrigo García","Country":"UK, Ireland, France, USA","Language":"English","Budget":"$8,000,000 (estimated)","Gross":"$3,014,541 (USA) (11 May 2012)","Production_Co":"Mockingbird Pictures, Trillium Productions, Parallel Film Productions ","Runtime":"113 min","Cast":"Glenn Close, Antonia Campbell-Hughes, Mia Wasikowska, Pauline Collins, Maria Doyle Kennedy, Mark Williams, James Greene, Serena Brabazon, Michael McElhatton, Dolores Mullally, Bonnie McCormack, Phyllida Law, Brendan Gleeson, Kenneth Collard, Judy Donovan","Plot":"Albert Nobbs struggles to survive in late 19th century Ireland, where women aren't encouraged to be independent. Posing as a man, so she can work as a butler in Dublin's most posh hotel, Albert meets a handsome painter and looks to escape the lie she has been living. In 19th century Dublin, Albert Nobbs, an eccentric man in the latter part of middle age, works as a waiter in Morrison's Hotel run by the stingy and controlling Marge Baker. Albert is hard working and saves his money so that one day he will be able to eke out a better life for himself by owning his own business rather than work at the hotel. Beyond his work colleagues, he is all alone in the world. One day, a man named Hubert Page is hired by Mrs. Baker to paint one of the rooms in the hotel. She forces Hubert to share Albert's bed for the one night he is required to stay to complete the work, much to Albert's horror. Hubert discovers the reason Albert did not want to share a room with him. But rather than the issue being a problem, Hubert shows Albert that he can follow a slightly different life path than the one he envisioned for himself - one closer to the life that Hubert leads with his wife Cathleen - which includes getting married and having a wife to support him emotionally. ... Written by Huggo","Genre":"Drama","Keywords":"woman pretending to be a man, hotel, 19th century, painter, waiter","imdbRating":"6.6","imdbVotes":"19,121","Awards":"Nominated for 3 Oscars. Another 19 wins & 37 nominations.","Metascore":"57","Released":"22 February 2012 (France) ","Location":"Iveagh Gardens, Dublin, County Dublin, Ireland ","Actors":"Glenn Close, Mia Wasikowska, Aaron Taylor-Johnson ","Writer":"Gabriella Prekop (screenplay), John Banville (screenplay) | 3 more credits »","Running_time":"PT113M / 1h 53min","Description":"Directed by Rodrigo García.  With Glenn Close, Mia Wasikowska, Aaron Taylor-Johnson, Antonia Campbell-Hughes. Albert Nobbs struggles to survive in late 19th century Ireland, where women aren't encouraged to be independent. Posing as a man, so she can work as a butler in Dublin's most posh hotel, Albert meets a handsome painter and looks to escape the lie she has been living.","Rated":"R"}