{"imdbID":"tt1655420","Title":"My Week with Marilyn","Year":"2011","Director":"Simon Curtis","Country":"UK, USA","Language":"English, French","Budget":"£6,400,000 (estimated)","Gross":"$14,597,405 (USA) (30 March 2012)","Production_Co":"Weinstein Company, The, BBC Films, Lipsync Productions ","Runtime":"99 min","Cast":"Michelle Williams, Eddie Redmayne, Julia Ormond, Kenneth Branagh, Pip Torrens, Geraldine Somerville, Michael Kitchen, Miranda Raison, Karl Moffatt, Simon Russell Beale, Toby Jones, Robert Portal, Philip Jackson, Jim Carter, Victor McGuire","Plot":"Colin Clark, an employee of Sir Laurence Olivier's, documents the tense interaction between Olivier and Marilyn Monroe during the production of The Prince and the Showgirl (1957). Sir Laurence Olivier is making a movie in London. Young Colin Clark, an eager film student, wants to be involved and he navigates himself a job on the set. When film star Marilyn Monroe arrives for the start of shooting, all of London is excited to see the blonde bombshell, while Olivier is struggling to meet her many demands and acting ineptness, and Colin is intrigued by her. Colin's intrigue is met when Marilyn invites him into her inner world where she struggles with her fame, her beauty and her desire to be a great actress. Written by napierslogs","Genre":"Biography, Drama","Keywords":"actress, assistant director, movie star, blonde bombshell, wardrobe","imdbRating":"7.0","imdbVotes":"70,133","Awards":"Nominated for 2 Oscars. Another 19 wins & 59 nominations.","Metascore":"65","Released":"23 December 2011 (USA) ","Location":"Windsor Castle, Windsor, Berkshire, England, UK ","Actors":"Michelle Williams, Eddie Redmayne, Kenneth Branagh ","Writer":"Adrian Hodges (screenplay), Colin Clark (books)","Running_time":"PT99M / 1h 39min","Description":"Directed by Simon Curtis.  With Michelle Williams, Eddie Redmayne, Kenneth Branagh, Julia Ormond. Colin Clark, an employee of Sir Laurence Olivier's, documents the tense interaction between Olivier and Marilyn Monroe during the production of The Prince and the Showgirl (1957).","Rated":"R"}