{"imdbID":"tt1675434","Title":"The Intouchables","Year":"2011","Taglines":"One man brought a family together...and changed their lives forever. ","Certificate":"U/A | See all certifications »","Country":"France","Language":"French, English","Also_Known_As":"Amigos ","Budget":"€9,500,000 (estimated)","Opening_Weekend":"$103,507 (USA) (25 May 2012)","Gross":"$13,179,837 (USA) (11 January 2013)","Production_Co":"Quad Productions, Ten Films, Canal+ ","":"Show detailed company contact information on IMDbPro »","Runtime":"112 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The sports car Driss is driving for Philippe is a Maserati Quattroporte. See more »","Goofs":"When the police car first appears behind Driss, you can hear a short burst of the siren, which is clearly an American-inspired tone (also used in UK etc.) This is not possible, because the French police only use one very recognizable tone. When the pursuit begins, the police car has the recognizable and correct French siren tone. See more »","Crazy_Credits":"5% of the profits from the film will be donated to the Association Simon of Cyrene - 15 rue de Suffren - 75015 Paris whose purpose is to create shared living spaces for disabled adults and friends. See more »","Cast":"François Cluzet, Omar Sy, Anne Le Ny, Audrey Fleurot, Joséphine de Meaux, Clotilde Mollet, Alba Gaïa Kraghede Bellugi, Cyril Mendy, Salimata Kamate, Absa Diatou Toure, Grégoire Oestermann, Dominique Daguier, François Caron, Christian Ameri, Thomas Solivéres","Plot":"After he becomes a quadriplegic from a paragliding accident, an aristocrat hires a young man from the projects to be his caregiver. In Paris, the aristocratic and intellectual Philippe is a quadriplegic millionaire who is interviewing candidates for the position of his carer, with his red-haired secretary Magalie. Out of the blue, the rude African Driss cuts the line of candidates and brings a document from the Social Security and asks Phillipe to sign it to prove that he is seeking a job position so he can receive his unemployment benefit. Philippe challenges Driss, offering him a trial period of one month to gain experience helping him. Then Driss can decide whether he would like to stay with him or not. Driss accepts the challenge and moves to the mansion, changing the boring life of Phillipe and his employees. Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Biography, Comedy, Drama","Keywords":"paralysis, reference to earth wind and fire, reference to hector berlioz, class differences, friendship between men","imdbRating":"8.6","imdbVotes":"475,236","Awards":"Nominated for 1 Golden Globe. Another 32 wins & 38 nominations.","Metascore":"57","Released":"13 July 2012 (India) ","Location":"Paris, France ","Actors":"François Cluzet, Omar Sy, Anne Le Ny ","Director":"Olivier Nakache, Eric Toledano","Writer":"Olivier Nakache, Eric Toledano","Running_time":"PT112M / 1h 52min","Description":"Directed by Olivier Nakache, Eric Toledano.  With François Cluzet, Omar Sy, Anne Le Ny, Audrey Fleurot. After he becomes a quadriplegic from a paragliding accident, an aristocrat hires a young man from the projects to be his caregiver.","Rated":"U/A"}