{"imdbID":"tt1646971","Title":"How to Train Your Dragon 2","Year":"2014","Director":"Dean DeBlois","Country":"USA","Language":"English","Also_Known_As":"Cómo entrenar a tu dragón 2 ","Budget":"$145,000,000 (estimated)","Opening_Weekend":"$49,451,322 (USA) (13 June 2014)","Gross":"$176,997,107 (USA) (5 December 2014)","Production_Co":"DreamWorks Animation, Duncan Studio, Mad Hatter Entertainment ","Runtime":"102 min","Sound_Mix":"Auro 11.1 | Dolby Atmos | Datasat | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The music in the teaser trailer is \"Beyond the Clouds,\" written and conducted by Audiomachine. See more »","Goofs":"During the battle with the alpha, Hiccup takes a strip of cloth to cover Toothless' eyes. Just as he puts in on, there is no tear in the top left side, but a split second later, when the camera zooms in, a tear suddenly appears. See more »","Crazy_Credits":"Like the first film, they are no opening credits. The title of the film doesn't show up until the very beginning of the credits. See more »","Cast":"Jay Baruchel, Cate Blanchett, Gerard Butler, Craig Ferguson, America Ferrera, Jonah Hill, Christopher Mintz-Plasse, T.J. Miller, Kristen Wiig, Djimon Hounsou, Kit Harington, Kieron Elliott, Philip McGrade, Andrew Ableson, Gideon Emery","Plot":"When Hiccup and Toothless discover an ice cave that is home to hundreds of new wild dragons and the mysterious Dragon Rider, the two friends find themselves at the center of a battle to protect the peace. It's been five years since Hiccup and Toothless successfully united dragons and vikings on the island of Berk. While Astrid, Snotlout and the rest of the gang are challenging each other to dragon races (the island's new favorite contact sport), the now inseparable pair journey through the skies, charting unmapped territories and exploring new worlds. When one of their adventures leads to the discovery of a secret ice cave that is home to hundreds of new wild dragons and the mysterious Dragon Rider, the two friends find themselves at the center of a battle to protect the peace. Now, Hiccup and Toothless must unite to stand up for what they believe while recognizing that only together do they have the power to change the future of both men and dragons. Written by Twentieth Century Fox Film Corporation","Genre":"Animation, Action, Adventure","Keywords":"dragon, viking, husband wife relationship, mother son relationship, father son relationship","imdbRating":"7.9","imdbVotes":"209,798","Awards":"Nominated for 1 Oscar. Another 13 wins & 58 nominations.","Metascore":"76","Released":"13 June 2014 (USA) ","Actors":"Jay Baruchel, Cate Blanchett, Gerard Butler ","Writer":"Dean DeBlois, Cressida Cowell (\"How to Train Your Dragon\" book series)","Running_time":"PT102M / 1h 42min","Description":"Directed by Dean DeBlois.  With Jay Baruchel, Cate Blanchett, Gerard Butler, Craig Ferguson. When Hiccup and Toothless discover an ice cave that is home to hundreds of new wild dragons and the mysterious Dragon Rider, the two friends find themselves at the center of a battle to protect the peace.","Rated":"PG"}