{"imdbID":"tt1602620","Title":"Amour","Year":"2012","Director":"Michael Haneke","Writer":"Michael Haneke (screenplay)","Country":"France, Germany, Austria","Language":"French, English","Budget":"$8,900,000 (estimated)","Gross":"$225,377 (USA) (27 November 2015)","Production_Co":"Les Films du Losange, X-Filme Creative Pool, Wega Film ","Runtime":"127 min","Cast":"Jean-Louis Trintignant, Emmanuelle Riva, Isabelle Huppert, Alexandre Tharaud, William Shimell, Ramón Agirre, Rita Blanco, Carole Franck, Dinara Drukarova, Laurent Capelluto, Jean-Michel Monroc, Suzanne Schmidt, Damien Jouillerot, Walid Afkir","Plot":"Georges and Anne are an octogenarian couple. They are cultivated, retired music teachers. Their daughter, also a musician, lives in Britain with her family. One day, Anne has a stroke, and the couple's bond of love is severely tested. Georges and Anne are a couple of retired music teachers enjoying life in their eighties. However, Anne suddenly has a stroke at breakfast and their lives are never the same. That incident begins Anne's harrowingly steep physical and mental decline as Georges attempts to care for her at home as she wishes. Even as the fruits of their lives and career remain bright, the couple's hopes for some dignity prove a dispiriting struggle even as their daughter enters the conflict. In the end, George, with his love fighting against his own weariness and diminished future on top of Anne's, is driven to make some critical decisions for them both. Written by Kenneth Chisholm (kchishol@rogers.com)","Genre":"Drama, Romance","Keywords":"stroke, old couple, old love, daughter, music teacher","imdbRating":"7.9","imdbVotes":"68,135","Awards":"Won 1 Oscar. Another 76 wins & 99 nominations.","Metascore":"94","Released":"25 October 2013 (India) ","Location":"France ","Actors":"Jean-Louis Trintignant, Emmanuelle Riva, Isabelle Huppert ","Running_time":"PT127M / 2h 7min","Description":"Directed by Michael Haneke.  With Jean-Louis Trintignant, Emmanuelle Riva, Isabelle Huppert, Alexandre Tharaud. Georges and Anne are an octogenarian couple. They are cultivated, retired music teachers. Their daughter, also a musician, lives in Britain with her family. One day, Anne has a stroke, and the couple's bond of love is severely tested.","Rated":"PG-13"}