{"imdbID":"tt1655442","Title":"The Artist","Year":"2011","Director":"Michel Hazanavicius","Writer":"Michel Hazanavicius","Country":"France, USA, Belgium","Language":"English, French","Also_Known_As":"Beauty Spot ","Budget":"$15,000,000 (estimated)","Opening_Weekend":"$204,878 (USA) (18 November 2011)","Gross":"$44,667,095 (USA) (15 June 2012)","Production_Co":"Studio 37, La Petite Reine, La Classe Américaine ","":"Show detailed company contact information on IMDbPro »","Runtime":"100 min","Sound_Mix":"Dolby Digital | DTS | SDDS","Color":"Black and White","Aspect_Ratio":"1.33 : 1","Trivia":"George and Peppy briefly meet on a staircase with ornate wrought iron filigree. This staircase is in the central atrium of the Bradbury Building located at 304 South Broadway, Los Angeles, California. Dozens of movies, TV shows, and music videos have been filmed there. Most notably, the interior and exterior were featured prominently in Blade Runner (1982). See more »","Goofs":"When George sees the large marque for Peppy Miller's movie Beauty Spot, the beauty spot on her image is on the wrong side of her face. See more »","Crazy_Credits":"The opening credits are styled after the style of opening used in the 1920s and 1930s, complete with technical credits shown the way they would have been then. See more »","Cast":"Jean Dujardin, Bérénice Bejo, John Goodman, James Cromwell, Penelope Ann Miller, Missi Pyle, Beth Grant, Ed Lauter, Joel Murray, Bitsie Tulloch, Ken Davitian, Malcolm McDowell, Basil Hoffman, Bill Fagerbakke, Nina Siemaszko","Plot":"A silent movie star meets a young dancer, but the arrival of talking pictures sends their careers in opposite directions. Outside a movie premiere, enthusiastic fan Peppy Miller literally bumps into the swashbuckling hero of the silent film, George Valentin. The star reacts graciously and Peppy plants a kiss on his cheek as they are surrounded by photographers. The headlines demand: \"Who's That Girl?\" and Peppy is inspired to audition for a dancing bit-part at the studio. However as Peppy slowly rises through the industry, the introduction of talking-pictures turns Valentin's world upside-down. Written by L. Hamre","Genre":"Comedy, Drama, Romance","Keywords":"movie studio, 1920s, movie star, modern silent movie, jack russell terrier","imdbRating":"8.0","imdbVotes":"184,881","Awards":"Won 5 Oscars. Another 143 wins & 172 nominations.","Metascore":"89","Released":"20 January 2012 (USA) ","Location":"Fremont Mansion - 56 Fremont Place, Los Angeles, California, USA ","Actors":"Jean Dujardin, Bérénice Bejo, John Goodman ","Running_time":"PT100M / 1h 40min","Description":"Directed by Michel Hazanavicius.  With Jean Dujardin, Bérénice Bejo, John Goodman, James Cromwell. A silent movie star meets a young dancer, but the arrival of talking pictures sends their careers in opposite directions.","Rated":"PG-13"}