{"imdbID":"tt1659337","Title":"The Perks of Being a Wallflower","Year":"2012","Director":"Stephen Chbosky","Taglines":"We are infinite. ","Country":"USA","Language":"English","Also_Known_As":"Las ventajas de ser invisible ","Budget":"$13,000,000 (estimated)","Opening_Weekend":"$228,359 (USA) (21 September 2012)","Gross":"$17,738,570 (USA) (1 February 2013)","Production_Co":"Summit Entertainment, Mr. Mudd ","":"Show detailed company contact information on IMDbPro »","Runtime":"102 min","Sound_Mix":"Dolby Digital | Datasat","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Both Logan Lerman and Emma Watson have starred in a Chris Columbus film. Watson appeared in Harry Potter and the Sorcerer's Stone (2001) and Harry Potter and the Chamber of Secrets (2002) and Lerman appeared in Percy Jackson & the Olympians: The Lightning Thief (2010). See more »","Goofs":"Sam is regarded as a music fanatic, particularly in regards to artists belonging to the glam and new wave genres. Anyone with any significant exposure to this music would undoubtedly recognize a David Bowie song by his voice alone. It is not believable that it would have taken Sam more than a school year to identify the tunnel song as David Bowie's \"Heroes.\" See more »","Cast":"Logan Lerman, Dylan McDermott, Kate Walsh, Patrick de Ledebur, Johnny Simmons, Brian Balzerini, Tom Kruszewski, Nina Dobrev, Nicholas Braun, Julia Garner, Ezra Miller, Tom Savini, Emily Marie Callaway, Paul Rudd, Chelsea Zhang","Plot":"An introvert freshman is taken under the wings of two seniors who welcome him to the real world. Based on the novel written by Stephen Chbosky, this is about 15-year-old Charlie (Logan Lerman), an endearing and naive outsider, coping with first love (Emma Watson), the suicide of his best friend, and his own mental illness while struggling to find a group of people with whom he belongs. The introvert freshman is taken under the wings of two seniors, Sam and Patrick, who welcome him to the real world. Written by Anonymous","Genre":"Drama, Romance","Keywords":"mental illness, coming of age, high school, gay, first love","imdbRating":"8.0","imdbVotes":"335,667","Awards":"19 wins & 46 nominations.","Metascore":"67","Released":"12 October 2012 (USA) ","Location":"Fort Pitt Tunnel, Pittsburgh, Pennsylvania, USA ","Actors":"Logan Lerman, Emma Watson, Ezra Miller ","Writer":"Stephen Chbosky (screenplay), Stephen Chbosky (book)","Running_time":"PT102M / 1h 42min","Description":"Directed by Stephen Chbosky.  With Logan Lerman, Emma Watson, Ezra Miller, Paul Rudd. An introvert freshman is taken under the wings of two seniors who welcome him to the real world.","Rated":"PG-13"}