{"imdbID":"tt1798709","Title":"Her","Year":"2013","Director":"Spike Jonze","Writer":"Spike Jonze","Country":"USA","Language":"English","Budget":"$23,000,000 (estimated)","Gross":"$25,556,065 (USA) (11 April 2014)","Production_Co":"Annapurna Pictures ","Runtime":"126 min","Cast":"Joaquin Phoenix, Lynn Adrianna Freedman, Lisa Renee Pitts, Gabe Gomez, Chris Pratt, Artt Butler, May Lindstrom, Rooney Mara, Bill Hader, Kristen Wiig, Brian Johnson, Scarlett Johansson, Amy Adams, Matt Letscher, Spike Jonze","Plot":"A lonely writer develops an unlikely relationship with his newly purchased operating system that's designed to meet his every need. Theodore is a lonely man in the final stages of his divorce. When he's not working as a letter writer, his down time is spent playing video games and occasionally hanging out with friends. He decides to purchase the new OS1, which is advertised as the world's first artificially intelligent operating system, \"It's not just an operating system, it's a consciousness,\" the ad states. Theodore quickly finds himself drawn in with Samantha, the voice behind his OS1. As they start spending time together they grow closer and closer and eventually find themselves in love. Having fallen in love with his OS, Theodore finds himself dealing with feelings of both great joy and doubt. As an OS, Samantha has powerful intelligence that she uses to help Theodore in ways others hadn't, but how does she help him deal with his inner conflict of being in love with an OS? Written by Bob Philpot","Genre":"Drama, Romance, Sci-Fi","Keywords":"loneliness, future, female frontal nudity, divorce, artificial intelligence","imdbRating":"8.0","imdbVotes":"336,059","Awards":"Won 1 Oscar. Another 75 wins & 167 nominations.","Metascore":"90","Released":"10 January 2014 (USA) ","Location":"Los Angeles, California, USA ","Actors":"Joaquin Phoenix, Amy Adams, Scarlett Johansson ","Running_time":"PT126M / 2h 6min","Description":"Directed by Spike Jonze.  With Joaquin Phoenix, Amy Adams, Scarlett Johansson, Rooney Mara. A lonely writer develops an unlikely relationship with his newly purchased operating system that's designed to meet his every need.","Rated":"R"}