{"imdbID":"tt1772341","Title":"Wreck-It Ralph","Year":"2012","Director":"Rich Moore","Taglines":"This November, he's exploring new worlds, he's meeting new friends... he's got ONE chance to play the hero. ","Country":"USA","Language":"English","Also_Known_As":"Ralph, el demoledor ","Budget":"$165,000,000 (estimated)","Opening_Weekend":"$49,038,712 (USA) (2 November 2012)","Gross":"$189,412,677 (USA) (26 April 2013)","Production_Co":"Walt Disney Animation Studios ","Runtime":"101 min","Sound_Mix":"Datasat | Dolby Digital | SDDS","Color":"Color","Aspect_Ratio":"2.39:1","Trivia":"The sheriffs release \"devil dogs\"; this is a cream-filled devil's food cake from Drake's brand snacks. It is also a long time nickname of U.S. Marines supposedly given to them during WWI by the German Army. See more »","Goofs":"When King Candy visits Ralph to tell him to stop Vanellope from racing and gives him his Hero Medal, Ralph stuffs it in his overalls. The blue ribbon of the medal is not visible on a number of shots until Vanellope spots it and then the blue ribbon is visible. See more »","Crazy_Credits":"The Walt Disney Animation Studios logo is rendered in 8-bit video game format. See more »","Cast":"John C. Reilly, Sarah Silverman, Jack McBrayer, Jane Lynch, Alan Tudyk, Mindy Kaling, Joe Lo Truglio, Ed O'Neill, Dennis Haysbert, Edie McClurg, Raymond S. Persi, Jess Harnell, Rachael Harris, Skylar Astin, Adam Carolla","Plot":"A video game villain wants to be a hero and sets out to fulfill his dream, but his quest brings havoc to the whole arcade where he lives. Wreck-It Ralph longs to be as beloved as his game's perfect Good Guy, Fix-It Felix. Problem is, nobody loves a Bad Guy. But they do love heroes... so when a modern, first-person shooter game arrives featuring tough-as-nails Sergeant Calhoun, Ralph sees it as his ticket to heroism and happiness. He sneaks into the game with a simple plan -- win a medal -- but soon wrecks everything, and accidentally unleashes a deadly enemy that threatens every game in the arcade. Ralph's only hope? Vanellope von Schweetz, a young troublemaking \"glitch\" from a candy-coated cart racing game who might just be the one to teach Ralph what it means to be a Good Guy. But will he realize he is good enough to become a hero before it's \"Game Over\" for the entire arcade? Written by Walt Disney Studios Motion Pictures","Genre":"Animation, Adventure, Comedy","Keywords":"medal, glitch, arcade, candy, king","imdbRating":"7.8","imdbVotes":"257,723","Awards":"Nominated for 1 Oscar. Another 32 wins & 40 nominations.","Metascore":"72","Released":"2 November 2012 (USA) ","Actors":"John C. Reilly, Jack McBrayer, Jane Lynch ","Writer":"Rich Moore (story), Phil Johnston (story) | 4 more credits »","Running_time":"PT101M / 1h 41min","Description":"Directed by Rich Moore.  With John C. Reilly, Jack McBrayer, Jane Lynch, Sarah Silverman. A video game villain wants to be a hero and sets out to fulfill his dream, but his quest brings havoc to the whole arcade where he lives.","Rated":"PG"}