{"imdbID":"tt1827487","Title":"Once Upon a Time in Anatolia","Year":"2011","Director":"Nuri Bilge Ceylan","Certificate":"Not Rated | See all certifications »","Country":"Turkey, Bosnia and Herzegovina","Language":"Turkish","Also_Known_As":"Once Upon a Time in Anatolia ","Opening_Weekend":"$10,652 (USA) (6 January 2012)","Gross":"$138,730 (USA) (1 June 2012)","Production_Co":"Zeynofilm, Production 2006, 1000 Volt ","Runtime":"157 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The movie premiered at the 2011 Cannes Film Festival where it was a co-winner of the Grand Prix. See more »","Goofs":"Once the deceased body is discovered you can see the \"corpse's\" thumb briefly twitch. See more »","Cast":"Muhammet Uzuner, Yilmaz Erdogan, Taner Birsel, Ahmet Mümtaz Taylan, Firat Tanis, Ercan Kesal, Erol Erarslan, Ugur Aslanoglu, Murat Kiliç, Safak Karali, Emre Sen, Burhan Yildiz, Nihan Okutucu, Cansu Demirci, Kubilay Tunçer","Plot":"A group of men set out in search of a dead body in the Anatolian steppes. In the rural area around the Anatolian town of Keskin, the local prosecutor, police commissar, and doctor lead a search for a victim of a murder to whom a suspect named Kenan and his mentally challenged brother confessed. However, the search is proving more difficult than expected as Kenan is fuzzy as to the body's exact location. As the group continues looking, its members can't help but chat among themselves about both trivia and their deepest concerns in an investigation that is proving more trying than any of them expected. Written by Kenneth Chisholm (kchishol@rogers.com)","Genre":"Crime, Drama","Keywords":"police, dead body, steppe, doctor, murder","imdbRating":"7.8","imdbVotes":"25,561","Awards":"19 wins & 25 nominations.","Metascore":"82","Released":"23 September 2011 (Turkey) ","Location":"Turkey ","Actors":"Muhammet Uzuner, Yilmaz Erdogan, Taner Birsel ","Writer":"Ebru Ceylan, Nuri Bilge Ceylan | 1 more credit »","Running_time":"PT157M / 2h 37min","Description":"Directed by Nuri Bilge Ceylan.  With Muhammet Uzuner, Yilmaz Erdogan, Taner Birsel, Ahmet Mümtaz Taylan. A group of men set out in search of a dead body in the Anatolian steppes.","Rated":"NOT RATED"}