{"imdbID":"tt1853728","Title":"Django Unchained","Year":"2012","Director":"Quentin Tarantino","Writer":"Quentin Tarantino","Taglines":"This Christmas, Django is off the chain. ","Certificate":"A | See all certifications »","Country":"USA","Language":"English, German, French, Italian","Also_Known_As":"Django sin cadenas ","Budget":"$100,000,000 (estimated)","Opening_Weekend":"$30,122,888 (USA) (28 December 2012)","Gross":"$162,804,648 (USA) (10 May 2013)","Production_Co":"Columbia Pictures, Weinstein Company, The ","":"Show detailed company contact information on IMDbPro »","Runtime":"165 min","Sound_Mix":"SDDS | Datasat | Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Franco Nero: The lead actor from Django (1966), the movie which inspired this one, has a cameo as the owner of the slave that fights against a slave owned by the character played by DiCaprio (the screenplay gives his character the name Amerigo Vassepi). After being asked to spell his name, Django explains, \"The 'D' is silent\". Nero replies, \"I know\". See more »","Goofs":"The movie depicts the characters having and using guns that employ metal cartridges. Those would not be available in 1858, the standard round at the time being a paper cartridge containing powder and ball and a separate percussion cap. See more »","Crazy_Credits":"Normally, the logo for The Weinstein Company is silent. In this film, it is accompanied with the theme music for Miramax from the early 90s, in a nod to Tarantino's first 2 films. See more »","Cast":"Jamie Foxx, Christoph Waltz, Leonardo DiCaprio, Kerry Washington, Samuel L. Jackson, Walton Goggins, Dennis Christopher, James Remar, David Steen, Dana Gourrier, Nichole Galicia, Laura Cayouette, Ato Essandoh, Sammi Rotibi, Clay Donahue Fontenot","Plot":"With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner. Former dentist, Dr. King Schultz, buys the freedom of a slave, Django, and trains him with the intent to make him his deputy bounty hunter. Instead, he is led to the site of Django's wife who is under the hands of Calvin Candie, a ruthless plantation owner. Written by BenLobel","Genre":"Drama, Western","Keywords":"ku klux klan, n word, dynamite, slavery, riding bareback","imdbRating":"8.5","imdbVotes":"905,379","Awards":"Won 2 Oscars. Another 52 wins & 137 nominations.","Metascore":"81","Released":"22 March 2013 (India) ","Location":"Jackson Hole, Wyoming, USA ","Actors":"Jamie Foxx, Christoph Waltz, Leonardo DiCaprio ","Running_time":"PT165M / 2h 45min","Description":"Directed by Quentin Tarantino.  With Jamie Foxx, Christoph Waltz, Leonardo DiCaprio, Kerry Washington. With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.","Rated":"A"}