{"imdbID":"tt1832382","Title":"A Separation","Year":"2011","Director":"Asghar Farhadi","Writer":"Asghar Farhadi","Taglines":"Ugly truth, sweet lies ","Country":"Iran","Language":"Persian","Also_Known_As":"Nader and Simin, a Separation ","Budget":"$500,000 (estimated)","Opening_Weekend":"$59,481 (USA) (30 December 2011)","Gross":"$7,098,492 (USA) (15 June 2012)","Production_Co":"Asghar Farhadi ","":"Show detailed company contact information on IMDbPro »","Runtime":"123 min","Sound_Mix":"Dolby SR","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"The first Iranian film to receive a Golden Globe award. See more »","Goofs":"When Simin and Hojjat's sister are talking to Hojjat, the fan behind Hojjat is on at first, but off and facing a different angle in subsequent scenes. See more »","Cast":"Peyman Moaadi, Leila Hatami, Sareh Bayat, Shahab Hosseini, Sarina Farhadi, Merila Zare'i, Ali-Asghar Shahbazi, Babak Karimi, Kimia Hosseini, Shirin Yazdanbakhsh, Sahabanu Zolghadr, Mohammadhasan Asghari, Shirin Azimiyannezhad, Hamid Dadju, Mohammad Ebrahimian","Plot":"A married couple are faced with a difficult decision - to improve the life of their child by moving to another country or to stay in Iran and look after a deteriorating parent who has Alzheimer's disease. Nader (Peyman Moaadi) and Simin (Leila Hatami) argue about living abroad. Simin prefers to live abroad to provide better opportunities for their only daughter, Termeh. However, Nader refuses to go because he thinks he must stay in Iran and take care of his father (Ali-Asghar Shahbazi), who suffers from Alzheimers. However, Simin is determined to get a divorce and leave the country with her daughter. Written by Amin Davoodi","Genre":"Drama, Mystery","Keywords":"iran, divorce, iranian, alzheimer's disease, caregiver","imdbRating":"8.4","imdbVotes":"145,419","Awards":"Won 1 Oscar. Another 76 wins & 41 nominations.","Metascore":"95","Released":"29 October 2012 (India) ","Location":"Tehran, Iran","Actors":"Peyman Moaadi, Leila Hatami, Sareh Bayat ","Running_time":"PT123M / 2h 3min","Description":"Directed by Asghar Farhadi.  With Peyman Moaadi, Leila Hatami, Sareh Bayat, Shahab Hosseini. A married couple are faced with a difficult decision - to improve the life of their child by moving to another country or to stay in Iran and look after a deteriorating parent who has Alzheimer's disease.","Rated":"PG-13"}