{"imdbID":"tt1800241","Title":"American Hustle","Year":"2013","Director":"David O. Russell","Country":"USA","Language":"English, Arabic","Budget":"$40,000,000 (estimated)","Gross":"$150,117,807 (USA) (4 April 2014)","Production_Co":"Columbia Pictures, Annapurna Pictures, Atlas Entertainment ","Runtime":"138 min","Cast":"Christian Bale, Bradley Cooper, Amy Adams, Jeremy Renner, Jennifer Lawrence, Louis C.K., Jack Huston, Michael Peña, Shea Whigham, Alessandro Nivola, Elisabeth Röhm, Paul Herman, Saïd Taghmaoui, Matthew Russell, Thomas Matthews","Plot":"A con man, Irving Rosenfeld, along with his seductive partner Sydney Prosser, is forced to work for a wild FBI agent, Richie DiMaso, who pushes them into a world of Jersey powerbrokers and mafia. A fictional film set in the alluring world of one of the most stunning scandals to rock our nation, American Hustle tells the story of brilliant con man Irving Rosenfeld (Christian Bale), who along with his equally cunning and seductive British partner Sydney Prosser (Amy Adams) is forced to work for a wild FBI agent Richie DiMaso (Bradley Cooper). DiMaso pushes them into a world of Jersey powerbrokers and mafia that's as dangerous as it is enchanting. Jeremy Renner is Carmine Polito, the passionate, volatile, New Jersey political operator caught between the con-artists and Feds. Irving's unpredictable wife Rosalyn (Jennifer Lawrence) could be the one to pull the thread that brings the entire world crashing down. Written by Sony Pictures Entertainment","Genre":"Crime, Drama","Keywords":"scam, con artist, women wearing a one piece swimsuit, sexual attraction, drunk wife","imdbRating":"7.3","imdbVotes":"347,259","Awards":"Nominated for 10 Oscars. Another 64 wins & 196 nominations.","Metascore":"90","Released":"20 December 2013 (USA) ","Location":"Boston, Massachusetts, USA ","Actors":"Christian Bale, Amy Adams, Bradley Cooper ","Writer":"Eric Warren Singer, David O. Russell","Running_time":"PT138M / 2h 18min","Description":"Directed by David O. Russell.  With Christian Bale, Amy Adams, Bradley Cooper, Jennifer Lawrence. A con man, Irving Rosenfeld, along with his seductive partner Sydney Prosser, is forced to work for a wild FBI agent, Richie DiMaso, who pushes them into a world of Jersey powerbrokers and mafia.","Rated":"R"}