{"imdbID":"tt1935179","Title":"Mud","Year":"2012","Director":"Jeff Nichols","Writer":"Jeff Nichols","Country":"USA","Language":"English","Also_Known_As":"Amor Bandido ","Opening_Weekend":"$2,215,460 (USA) (26 April 2013)","Gross":"$21,589,307 (USA) (6 September 2013)","Production_Co":"Lionsgate, Everest Entertainment, Brace Cove Productions ","Runtime":"130 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Over 2000 boys auditioned for the role of Neckbone. See more »","Goofs":"Mud says that the same snake antivenom cannot be used twice on the same person. While it is true that repeated use of first-generation antivenoms can cause severe allergic reactions, modern antivenoms can be used repeatedly safely. See more »","Crazy_Credits":"Everest Entertainment donates a portion of its profits from each film to charity. By watching an Everest film you have made a difference. We thank you. See more »","Cast":"Matthew McConaughey, Reese Witherspoon, Tye Sheridan, Jacob Lofland, Sam Shepard, Ray McKinnon, Sarah Paulson, Michael Shannon, Joe Don Baker, Paul Sparks, Bonnie Sturdivant, Stuart Greer, John Ward Jr., Kristy Barrington, Johnny Cheek","Plot":"Two young boys encounter a fugitive and form a pact to help him evade the vigilantes that are on his trail and to reunite him with his true love. 14 year-old Ellis (Tye Sheridan) lives on a makeshift houseboat on the banks of a river in Arkansas with his parents, Mary Lee (Sarah Paulson) and Senior (Ray McKinnon). He sneaks out early one morning to meet his best friend, Neckbone (Jacob Lofland). Neckbone, also 14, lives with his uncle, Galen (Michael Shannon), who makes a hardscrabble living diving for oysters. The two boys set out to an island on the Mississippi River, where Neckbone has discovered an unusual sight-a boat, suspended high in the trees, a remnant of an extreme flood some time in the past. They climb the tree and into the boat only to find fresh bread and fresh footprints. Realizing that they are not the only ones who have discovered the treehouse boat, they decide to leave. When they reach the shore, they find the same footprint in their boat. And that's when they meet Mud (Matthew McConaughey). Mud is a gritty, superstitious character; his clothes are dirty, his tooth is cracked, and he needs help. He tells the... Written by Roadside Attractions","Genre":"Drama","Keywords":"boat, boy, river, 14 year old, bounty hunter","imdbRating":"7.4","imdbVotes":"129,810","Awards":"11 wins & 34 nominations.","Metascore":"76","Released":"10 May 2013 (USA) ","Location":"Crocketts Bluff, Arkansas, USA ","Actors":"Matthew McConaughey, Tye Sheridan, Jacob Lofland ","Running_time":"PT130M / 2h 10min","Description":"Directed by Jeff Nichols.  With Matthew McConaughey, Tye Sheridan, Jacob Lofland, Sam Shepard. Two young boys encounter a fugitive and form a pact to help him evade the vigilantes that are on his trail and to reunite him with his true love.","Rated":"PG-13"}