{"imdbID":"tt1907668","Title":"Flight","Year":"2012","Director":"Robert Zemeckis","Writer":"John Gatins","Country":"USA","Language":"English","Budget":"$31,000,000 (estimated)","Gross":"$93,749,203 (USA) (8 February 2013)","Production_Co":"Paramount Pictures, ImageMovers, Parkes+MacDonald Image Nation ","Runtime":"138 min","Cast":"Nadine Velazquez, Denzel Washington, Carter Cabassa, Adam C. Edwards, Tamara Tunie, Brian Geraghty, Kelly Reilly, Conor O'Neill, Charlie E. Schmidt, Will Sherrod, Boni Yanagisawa, Adam Tomei, Dane Davenport, John Crow, Bruce Greenwood","Plot":"An airline pilot saves almost all his passengers on his malfunctioning airliner which eventually crashed, but an investigation into the accident reveals something troubling. Whip Whitaker is a commuter airline pilot. While on a flight from Orlando to Atlanta something goes wrong and the plane starts to fly erratically. With little choice Whip crashes the plane and saves almost all on board. When he wakes up in the hospital, his friend from the airline union introduces him to a lawyer who tells him there's a chance he could face criminal charges because his blood test reveals that he was intoxicated with alcohol and cocaine. He denies being impaired, so while an investigation is underway, he is told to keep his act together. However, letting go of his addiction is not as easy as it seems... Written by Immanuel Ambhara","Genre":"Drama, Thriller","Keywords":"flight, airline, pilot, lawyer, flight attendant","imdbRating":"7.3","imdbVotes":"257,401","Awards":"Nominated for 2 Oscars. Another 13 wins & 41 nominations.","Metascore":"76","Released":"2 November 2012 (USA) ","Location":"Atlanta First United Methodist Church - 360 Peachtree Street NE, Atlanta, Georgia, USA ","Actors":"Denzel Washington, Nadine Velazquez, Don Cheadle ","Running_time":"PT138M / 2h 18min","Description":"Directed by Robert Zemeckis.  With Denzel Washington, Nadine Velazquez, Don Cheadle, John Goodman. An airline pilot saves almost all his passengers on his malfunctioning airliner which eventually crashed, but an investigation into the accident reveals something troubling.","Rated":"R"}