{"imdbID":"tt1954470","Title":"Gangs of Wasseypur","Year":"2012","Director":"Anurag Kashyap","Certificate":"A | See all certifications »","Country":"India","Language":"Hindi","Also_Known_As":"Bande Vasejpura ","Budget":"INR 184,000,000 (estimated)","Production_Co":"Jar Pictures, AKFPL, Bohra Bros Productions ","Runtime":"320 min (2 parts)","Sound_Mix":"Dolby Digital | Datasat","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Most of the slaughter house scenes were single shot takes. After every shot, the actor 'Vipin Sharma' (who acted in the role of Ehsaan Qureshi) would come aside and throw up. The AD 'Anubhuti Kashyap' (sister of director Anurag Kashyap) would hold back a crowd of almost 50 by standers, more than half of whom were actual butchers, during the shoot by holding her arms wide. A lot of these butchers actually had knives and choppers hidden in their clothes and would joke among themselves \"shall we plunge it stab it this way?\" which she could hear, and had to ignore since she had to concentrate in the shoot See more »","Goofs":"When Shamshad Alam chase Definite on the streets. One can easily see that the vehicles on the road are having number plates with Registration number of Uttar Pradesh-65 which is of Varanasi. Even the public transport vehicles were having the Registration number of Varanasi which is only possible if the location is in Varanasi but the location of the scene was portrayed to be in the state of Jharkhand. This is because that the scene was shot with the hidden cameras on an actual location on the streets of Varanasi. See more »","Crazy_Credits":"The opening credits are in black and white and distorted, to reflect the style of the times in which the opening is set. See more »","Cast":"Manoj Bajpayee, Richa Chadha, Nawazuddin Siddiqui, Tigmanshu Dhulia, Jameel Khan, Piyush Mishra, Jaideep Ahlawat, Huma Qureshi, Zeishan Quadri, Vipin Sharma, Satyakam Anand, Aditya Kumar, Rajkummar Rao, Vineet Kumar Singh, Sankalp Acharekar","Plot":"A clash between Sultan (a Qureishi dacoit chief) and Shahid Khan (a Pathan who impersonates him) leads to the expulsion of Khan from Wasseypur, and ignites a deadly blood feud spanning three generations. Shahid Khan is exiled after impersonating the legendary Sultana Daku in order to rob British trains. Now outcast, Shahid becomes a worker at Ramadhir Singh's colliery, only to spur a revenge battle that passes on to generations. At the turn of the decade, Shahid's son, the philandering Sardar Khan vows to get his father's honor back, becoming the most feared man of Wasseypur. Written by anonymous","Genre":"Action, Crime, Drama","Keywords":"revenge, blood, abuse, gun, cult film","imdbRating":"8.3","imdbVotes":"41,898","Awards":"10 wins & 32 nominations.","Metascore":"89","Released":"2 August 2012 (Singapore) ","Location":"Varanasi, Uttar Pradesh, India","Actors":"Manoj Bajpayee, Richa Chadha, Nawazuddin Siddiqui ","Writer":"Akhilesh Jaiswal, Anurag Kashyap | 2 more credits »","Running_time":"PT320M / 5h 20min","Description":"Directed by Anurag Kashyap.  With Manoj Bajpayee, Richa Chadha, Nawazuddin Siddiqui, Tigmanshu Dhulia. A clash between Sultan (a Qureishi dacoit chief) and Shahid Khan (a Pathan who impersonates him) leads to the expulsion of Khan from Wasseypur, and ignites a deadly blood feud spanning three generations.","Rated":"A"}