{"imdbID":"tt2096673","Title":"Inside Out","Year":"2015","Taglines":"Meet the little voices inside your head. ","Country":"USA","Language":"English","Also_Known_As":"The Untitled Pixar Movie That Takes You Inside the Mind ","Budget":"$175,000,000 (estimated)","Opening_Weekend":"$90,440,272 (USA) (19 June 2015)","Gross":"$356,454,367 (USA) (4 December 2015)","Production_Co":"Walt Disney Pictures, Pixar Animation Studios ","Runtime":"95 min","Sound_Mix":"Dolby Digital | Datasat | Dolby Atmos","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Originally Joy was to be able to enter the real world. See more »","Goofs":"Both parents has brown eyes. Riley have blue. See more »","Crazy_Credits":"Dedicated to our children. Don't grow up. Ever. See more »","Cast":"Amy Poehler, Phyllis Smith, Richard Kind, Bill Hader, Lewis Black, Mindy Kaling, Kaitlyn Dias, Diane Lane, Kyle MacLachlan, Paula Poundstone, Bobby Moynihan, Paula Pell, Dave Goelz, Frank Oz, Josh Cooley","Plot":"After young Riley is uprooted from her Midwest life and moved to San Francisco, her emotions - Joy, Fear, Anger, Disgust and Sadness - conflict on how best to navigate a new city, house, and school. Growing up can be a bumpy road, and it's no exception for Riley, who is uprooted from her Midwest life when her father starts a new job in San Francisco. Like all of us, Riley is guided by her emotions - Joy, Fear, Anger, Disgust and Sadness. The emotions live in Headquarters, the control center inside Riley's mind, where they help advise her through everyday life. As Riley and her emotions struggle to adjust to a new life in San Francisco, turmoil ensues in Headquarters. Although Joy, Riley's main and most important emotion, tries to keep things positive, the emotions conflict on how best to navigate a new city, house and school. Written by Pixar","Genre":"Animation, Adventure, Comedy","Keywords":"memory, emotion, sadness, bus, running away","imdbRating":"8.3","imdbVotes":"287,622","Awards":"Won 1 Oscar. Another 73 wins & 86 nominations.","Metascore":"94","Released":"19 June 2015 (USA) ","Location":"Pixar Animation Studios - 1200 Park Avenue, Emeryville, California, USA","Actors":"Amy Poehler, Bill Hader, Lewis Black ","Director":"Pete Docter, Ronnie Del Carmen","Writer":"Pete Docter (original story by), Ronnie Del Carmen (original story by) | 3 more credits »","Running_time":"PT95M / 1h 35min","Description":"Directed by Pete Docter, Ronnie Del Carmen.  With Amy Poehler, Bill Hader, Lewis Black, Mindy Kaling. After young Riley is uprooted from her Midwest life and moved to San Francisco, her emotions - Joy, Fear, Anger, Disgust and Sadness - conflict on how best to navigate a new city, house, and school.","Rated":"PG"}