{"imdbID":"tt2024544","Title":"12 Years a Slave","Year":"2013","Director":"Steve McQueen","Country":"USA, UK","Language":"English","Budget":"$20,000,000 (estimated)","Gross":"$56,667,870 (USA) (2 May 2014)","Production_Co":"Regency Enterprises, River Road Entertainment, Plan B Entertainment ","Runtime":"134 min","Cast":"Chiwetel Ejiofor, Dwight Henry, Dickie Gravois, Bryan Batt, Ashley Dyke, Kelsey Scott, Quvenzhané Wallis, Cameron Zeigler, Tony Bentley, Scoot McNairy, Taran Killam, Christopher Berry, Bill Camp, Mister Mackey Jr., Chris Chalk","Plot":"In the antebellum United States, Solomon Northup, a free black man from upstate New York, is abducted and sold into slavery. Based on an incredible true story of one man's fight for survival and freedom. In the pre-Civil War United States, Solomon Northup (Chiwetel Ejiofor), a free black man from upstate New York, is abducted and sold into slavery. Facing cruelty (personified by a malevolent slave owner, portrayed by Michael Fassbender), as well as unexpected kindnesses, Solomon struggles not only to stay alive, but to retain his dignity. In the twelfth year of his unforgettable odyssey, Solomon's chance meeting with a Canadian abolitionist (Brad Pitt) will forever alter his life. Written by Fox Searchlight","Genre":"Biography, Drama, History","Keywords":"whipping, separation from family, torture, social injustice, racism","imdbRating":"8.1","imdbVotes":"413,914","Awards":"Won 3 Oscars. Another 231 wins & 305 nominations.","Metascore":"97","Released":"8 November 2013 (USA) ","Location":"New Orleans, Louisiana, USA ","Actors":"Chiwetel Ejiofor, Michael Kenneth Williams, Michael Fassbender ","Writer":"John Ridley (screenplay), Solomon Northup (based on \"Twelve Years a Slave\" by)","Running_time":"PT134M / 2h 14min","Description":"Directed by Steve McQueen.  With Chiwetel Ejiofor, Michael Kenneth Williams, Michael Fassbender, Brad Pitt. In the antebellum United States, Solomon Northup, a free black man from upstate New York, is abducted and sold into slavery.","Rated":"R"}