{"imdbID":"tt2024519","Title":"The Broken Circle Breakdown","Year":"2012","Director":"Felix van Groeningen","Certificate":"Not Rated | See all certifications »","Country":"Belgium, Netherlands","Language":"Flemish, English, Dutch","Also_Known_As":"Krah razbijenog kruga ","Opening_Weekend":"$7,100 (USA) (1 November 2013)","Gross":"$30,700 (USA) (15 November 2013)","Production_Co":"Menuet Producties, Topkapi Films ","Runtime":"111 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Swiss censorship certificate # 1009.520. See more »","Cast":"Johan Heldenbergh, Veerle Baetens, Nell Cattrysse, Geert Van Rampelberg, Nils De Caster, Robbie Cleiren, Bert Huysentruyt, Jan Bijvoet, Sofie Sente, Ruth Beeckmans, Jan Hammenecker, Blanka Heirman, Kirsten Pieters, Yves Degryse, Dominique Van Malder","Plot":"Elise and Didier fall in love at first sight, in spite of their differences. He talks, she listens. He's a romantic atheist, she's a religious realist. When their daughter becomes seriously ill, their love is put on trial. Elise and Didier fall in love at first sight. She has her own tattoo shop and he plays the banjo in a bluegrass band. They bond over their shared enthusiasm for American music and culture, and dive headfirst into a sweeping romance that plays out on and off stage - but when an unexpected tragedy hits their new family, everything they know and love is tested. An intensely moving portrait of a relationship from beginning to end, propelled by a soundtrack of foot-stomping bluegrass, The Broken Circle Breakdown is a romantic melodrama of the highest order. Written by Tribeca Film","Genre":"Drama, Music, Romance","Keywords":"bluegrass, tattoo, suicide, george w. bush, loss of daughter","imdbRating":"7.8","imdbVotes":"28,054","Awards":"Nominated for 1 Oscar. Another 33 wins & 24 nominations.","Metascore":"71","Released":"10 October 2012 (Belgium) ","Location":"Ghent, East Flanders, Flanders, Belgium ","Actors":"Veerle Baetens, Johan Heldenbergh, Nell Cattrysse ","Writer":"Johan Heldenbergh (play), Mieke Dobbels (play) | 3 more credits »","Running_time":"PT111M / 1h 51min","Description":"Directed by Felix van Groeningen.  With Veerle Baetens, Johan Heldenbergh, Nell Cattrysse, Geert Van Rampelberg. Elise and Didier fall in love at first sight, in spite of their differences. He talks, she listens. He's a romantic atheist, she's a religious realist. When their daughter becomes seriously ill, their love is put on trial.","Rated":"NOT RATED"}