{"imdbID":"tt2140373","Title":"Saving Mr. Banks","Year":"2013","Director":"John Lee Hancock","Taglines":"To Walt Disney, \"Mary Poppins\" was more than a book. To her, it was more than a movie. ","Country":"UK, Australia, USA","Language":"English","Also_Known_As":"El sueño de Walt ","Budget":"$35,000,000 (estimated)","Opening_Weekend":"$413,373 (USA) (13 December 2013)","Gross":"$83,299,761 (USA) (11 April 2014)","Production_Co":"Walt Disney Pictures, Ruby Films, Essential Media & Entertainment ","Runtime":"125 min","Sound_Mix":"Datasat | Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Emma Thompson's first live action film project for Walt Disney Pictures, as opposed to Treasure Planet (2002) for Walt Disney Feature Animation (now Walt Disney Animation Studios) and Brave (2012) for Pixar Animation Studios. See more »","Goofs":"P.L. Travers never did warm up to the song \"Let's Go Fly a Kite\", as depicted in the film. According to Richard M. Sherman, it was \"Feed the Birds\" that actually won her over. See more »","Crazy_Credits":"There is a post credits dedication of the movie to Diane Marie Disney, Walt Disney's oldest daughter, who passed away in November, 2013. See more »","Cast":"Emma Thompson, Tom Hanks, Annie Rose Buckley, Colin Farrell, Ruth Wilson, Paul Giamatti, Bradley Whitford, B.J. Novak, Jason Schwartzman, Lily Bigham, Kathy Baker, Melanie Paxson, Andy McPhee, Rachel Griffiths, Ronan Vibert","Plot":"Author P.L. Travers reflects on her childhood after reluctantly meeting with Walt Disney, who seeks to adapt her Mary Poppins books for the big screen. When Walt Disney's daughters begged him to make a movie of their favorite book, P.L. Travers' Mary Poppins (1964), he made them a promise - one that he didn't realize would take 20 years to keep. In his quest to obtain the rights, Walt comes up against a curmudgeonly, uncompromising writer who has absolutely no intention of letting her beloved magical nanny get mauled by the Hollywood machine. But, as the books stop selling and money grows short, Travers reluctantly agrees to go to Los Angeles to hear Disney's plans for the adaptation. For those two short weeks in 1961, Walt Disney pulls out all the stops. Armed with imaginative storyboards and chirpy songs from the talented Sherman brothers, Walt launches an all-out onslaught on P.L. Travers, but the prickly author doesn't budge. He soon begins to watch helplessly as Travers becomes increasingly immovable and the rights begin to move further away from his grasp. It is only when he reaches into his own childhood that Walt discovers ... Written by Walt Disney Pictures","Genre":"Biography, Comedy, Drama","Keywords":"disney, author, loss of father, reference to walt disney, suppression of emotion","imdbRating":"7.5","imdbVotes":"113,543","Awards":"Nominated for 1 Oscar. Another 12 wins & 71 nominations.","Metascore":"65","Released":"20 December 2013 (USA) ","Location":"Disneyland Park, Disneyland Resort - 1600 S. Disneyland Drive, Anaheim, California, USA ","Actors":"Emma Thompson, Tom Hanks, Annie Rose Buckley ","Writer":"Kelly Marcel, Sue Smith","Running_time":"PT125M / 2h 5min","Description":"Directed by John Lee Hancock.  With Emma Thompson, Tom Hanks, Annie Rose Buckley, Colin Farrell. Author P.L. Travers reflects on her childhood after reluctantly meeting with Walt Disney, who seeks to adapt her Mary Poppins books for the big screen.","Rated":"PG-13"}