{"imdbID":"tt2194499","Title":"About Time","Year":"2013","Director":"Richard Curtis","Writer":"Richard Curtis","Taglines":"A new funny film about love. With a bit of time travel. ","Country":"UK","Language":"English","Also_Known_As":"Cuestión de tiempo ","Opening_Weekend":"$1,076,250 (USA) (1 November 2013)","Gross":"$15,294,553 (USA) (20 December 2013)","Production_Co":"Translux, Working Title Films ","Runtime":"123 min","Sound_Mix":"SDDS | Datasat | Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Shipped to theaters under the code name Cupboard. See more »","Goofs":"In the ending credits, the recording artist Cat Power is mistakenly credited as \"Cat Powers\". See more »","Cast":"Domhnall Gleeson, Rachel McAdams, Bill Nighy, Lydia Wilson, Lindsay Duncan, Richard Cordery, Joshua McGuire, Tom Hollander, Margot Robbie, Will Merrick, Vanessa Kirby, Tom Hughes, Clemmie Dugdale, Harry Hadden-Paton, Mitchell Mullen","Plot":"At the age of 21, Tim discovers he can travel in time and change what happens and has happened in his own life. His decision to make his world a better place by getting a girlfriend turns out not to be as easy as you might think. At the age of 21, Tim Lake (Domhnall Gleeson) discovers he can travel in time... The night after another unsatisfactory New Year party, Tim's father (Bill Nighy) tells his son that the men in his family have always had the ability to travel through time. Tim can't change history, but he can change what happens and has happened in his own life-so he decides to make his world a better place...by getting a girlfriend. Sadly, that turns out not to be as easy as you might think. Moving from the Cornwall coast to London to train as a lawyer, Tim finally meets the beautiful but insecure Mary (Rachel McAdams). They fall in love, then an unfortunate time-travel incident means he's never met her at all. So they meet for the first time again-and again-but finally, after a lot of cunning time-traveling, he wins her heart. Tim then uses his power to create the perfect romantic proposal, to save his wedding from the worst best-man speeches, to save his best friend from professional disaster and to ... Written by Universal Pictures","Genre":"Drama, Fantasy, Romance","Keywords":"lingerie slip, time travel romance, time travel, wedding, boyfriend girlfriend relationship","imdbRating":"7.8","imdbVotes":"190,840","Awards":"3 wins & 7 nominations.","Metascore":"55","Released":"8 November 2013 (USA) ","Location":"London, England, UK ","Actors":"Domhnall Gleeson, Rachel McAdams, Bill Nighy ","Running_time":"PT123M / 2h 3min","Description":"Directed by Richard Curtis.  With Domhnall Gleeson, Rachel McAdams, Bill Nighy, Lydia Wilson. At the age of 21, Tim discovers he can travel in time and change what happens and has happened in his own life. His decision to make his world a better place by getting a girlfriend turns out not to be as easy as you might think.","Rated":"R"}