{"imdbID":"tt2278388","Title":"The Grand Budapest Hotel","Year":"2014","Director":"Wes Anderson","Country":"USA, Germany, UK","Language":"English, French","Budget":"€23,000,000 (estimated)","Gross":"$59,073,773 (USA) (22 August 2014)","Production_Co":"Fox Searchlight Pictures, Indian Paintbrush, Studio Babelsberg ","Runtime":"99 min","Cast":"Ralph Fiennes, F. Murray Abraham, Mathieu Amalric, Adrien Brody, Willem Dafoe, Jeff Goldblum, Harvey Keitel, Jude Law, Bill Murray, Edward Norton, Saoirse Ronan, Jason Schwartzman, Léa Seydoux, Tilda Swinton, Tom Wilkinson","Plot":"The adventures of Gustave H, a legendary concierge at a famous hotel from the fictional Republic of Zubrowka between the first and second World Wars, and Zero Moustafa, the lobby boy who becomes his most trusted friend. GRAND BUDAPEST HOTEL recounts the adventures of Gustave H, a legendary concierge at a famous European hotel between the wars, and Zero Moustafa, the lobby boy who becomes his most trusted friend. The story involves the theft and recovery of a priceless Renaissance painting and the battle for an enormous family fortune -- all against the back-drop of a suddenly and dramatically changing Continent. Written by Fox Searchlight Pictures","Genre":"Adventure, Comedy, Drama","Keywords":"hotel, first person narration, painting, lobby boy, mentor protege relationship","imdbRating":"8.1","imdbVotes":"443,499","Awards":"Won 4 Oscars. Another 117 wins & 208 nominations.","Metascore":"88","Released":"28 March 2014 (USA) ","Location":"Görlitz, Saxony, Germany ","Actors":"Ralph Fiennes, F. Murray Abraham, Mathieu Amalric ","Writer":"Stefan Zweig (inspired by the writings of), Wes Anderson (screenplay) | 2 more credits »","Running_time":"PT99M / 1h 39min","Description":"Directed by Wes Anderson.  With Ralph Fiennes, F. Murray Abraham, Mathieu Amalric, Adrien Brody. The adventures of Gustave H, a legendary concierge at a famous hotel from the fictional Republic of Zubrowka between the first and second World Wars, and Zero Moustafa, the lobby boy who becomes his most trusted friend.","Rated":"R"}