{"imdbID":"tt2278871","Title":"Blue Is the Warmest Color","Year":"2013","Director":"Abdellatif Kechiche","Country":"France, Belgium, Spain","Language":"French, English","Also_Known_As":"Blue Is the Warmest Color ","Opening_Weekend":"$100,316 (USA) (25 October 2013)","Gross":"$2,199,675 (USA) (7 March 2014)","Production_Co":"Quat'sous Films, Wild Bunch, France 2 Cinéma ","Runtime":"180 min","Sound_Mix":"Stereo (5.1 surround)| Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The first film adaption of a graphic novel to win the Palm D'Or. See more »","Goofs":"When Adéle goes to Emma's art gallery opening, there's a dolly shot of her walking from left to right towards the entrance. There's a reflection of the top of the camera in one of the windows of the building. See more »","Crazy_Credits":"There are no opening credits. See more »","Cast":"Léa Seydoux, Adèle Exarchopoulos, Salim Kechiouche, Aurélien Recoing, Catherine Salée, Benjamin Siksou, Mona Walravens, Alma Jodorowsky, Jérémie Laheurte, Anne Loiret, Benoît Pilot, Sandor Funtek, Fanny Maurin, Maelys Cabezon, Samir Bella","Plot":"Adele's life is changed when she meets Emma, a young woman with blue hair, who will allow her to discover desire, to assert herself as a woman and as an adult. In front of others, Adele grows, seeks herself, loses herself and ultimately finds herself through love and loss. Adèle is a high school student who is beginning to explore herself as a woman. She dates men but finds no satisfaction with them sexually, and is rejected by a female friend who she does desire. She dreams of something more. She meets Emma who is a free spirited girl whom Adèle's friends reject due to her sexuality, and by association most begin to reject Adèle. Her relationship with Emma grows into more than just friends as she is the only person with whom she can express herself openly. Together, Adèle and Emma explore social acceptance, sexuality, and the emotional spectrum of their maturing relationship. Written by ~mEp (mep1)","Genre":"Drama, Romance","Keywords":"lesbian, cunnilingus, lesbian sex, male frontal nudity, blue hair","imdbRating":"7.8","imdbVotes":"86,342","Awards":"Nominated for 1 Golden Globe. Another 83 wins & 92 nominations.","Metascore":"88","Released":"9 October 2013 (France) ","Location":"Lille, Nord, France ","Actors":"Léa Seydoux, Adèle Exarchopoulos, Salim Kechiouche ","Writer":"Abdellatif Kechiche (scenario, adaptation and dialogue), Ghalia Lacroix (scenario, adaptation and dialogue) | 1 more credit »","Running_time":"PT180M / 3h","Description":"Directed by Abdellatif Kechiche.  With Léa Seydoux, Adèle Exarchopoulos, Salim Kechiouche, Aurélien Recoing. Adele's life is changed when she meets Emma, a young woman with blue hair, who will allow her to discover desire, to assert herself as a woman and as an adult. In front of others, Adele grows, seeks herself, loses herself and ultimately finds herself through love and loss.","Rated":"NC-17"}