{"imdbID":"tt2209418","Title":"Before Midnight","Year":"2013","Director":"Richard Linklater","Country":"USA, Greece","Language":"English, Greek, French","Also_Known_As":"Untitled Before Sunset Sequel ","Opening_Weekend":"$246,914 (USA) (24 May 2013)","Gross":"$8,114,507 (USA) (1 November 2013)","Production_Co":"Faliro House Productions, Venture Forth, Castle Rock Entertainment ","Runtime":"109 min","Sound_Mix":"Dolby Digital | Datasat | SDDS","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"Walter Lassally, who plays Patrick, the British writer, is a famous cinematographer, who despite having an Academy Award, this is his first time acting. See more »","Goofs":"Jesse doesn't calculate their ages correctly. During the walk to the hotel, they discuss that Jesse is now 41 years old. A few minutes later Celine calculates that they have to be together another 56 years to match Jesse's grandparents relationship, and Jesse states they will be 98 years old by then. 56 plus 41 is 97, not 98. See more »","Cast":"Ethan Hawke, Julie Delpy, Seamus Davey-Fitzpatrick, Jennifer Prior, Charlotte Prior, Xenia Kalogeropoulou, Walter Lassally, Ariane Labed, Yiannis Papadopoulos, Athina Rachel Tsangari, Panos Koronis, Enrico Focardi, Manolis Goussias, Anouk Servera, Yota Argyropoulou","Plot":"We meet Jesse and Celine nine years on in Greece. Almost two decades have passed since their first meeting on that train bound for Vienna. It has been nine years since we last met Jesse and Celine, the French-American couple who once met on a train in Vienna. They now live in Paris with twin daughters, but have spent a summer in Greece on the invitation of an author colleague of Jesse's. When the vacation is over and Jesse must send his teenage son off to the States, he begins to question his life decisions, and his relationship with Celine is at risk. Written by Peter Brandt Nielsen","Genre":"Drama, Romance","Keywords":"greece, twin, friend, hotel room, greek","imdbRating":"7.9","imdbVotes":"90,405","Awards":"Nominated for 1 Oscar. Another 19 wins & 55 nominations.","Metascore":"94","Released":"14 June 2013 (USA) ","Location":"Kardamyli, Messinia, Greece ","Actors":"Ethan Hawke, Julie Delpy, Seamus Davey-Fitzpatrick ","Writer":"Richard Linklater, Julie Delpy | 3 more credits »","Running_time":"PT109M / 1h 49min","Description":"Directed by Richard Linklater.  With Ethan Hawke, Julie Delpy, Seamus Davey-Fitzpatrick, Ariane Labed. We meet Jesse and Celine nine years on in Greece. Almost two decades have passed since their first meeting on that train bound for Vienna.","Rated":"R"}