{"imdbID":"tt2358891","Title":"The Great Beauty","Year":"2013","Director":"Paolo Sorrentino","Certificate":"Not Rated | See all certifications »","Country":"Italy, France","Language":"Italian, Japanese, Spanish, Chinese","Also_Known_As":"La gran belleza ","Budget":"€9,200,000 (estimated)","Opening_Weekend":"$23,442 (USA) (15 November 2013)","Gross":"$2,835,886 (USA) (11 April 2014)","Production_Co":"Indigo Film, Medusa Film, Babe Film ","Runtime":"141 min | 172 min (extended)","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Egidio (nightclub mgr.; Ramona's father): \"She can't be a stripper at 50.\" At time of production, she was closer to 50 than 42. See more »","Cast":"Toni Servillo, Carlo Verdone, Sabrina Ferilli, Carlo Buccirosso, Iaia Forte, Pamela Villoresi, Galatea Ranzi, Franco Graziosi, Giorgio Pasotti, Massimo Popolizio, Sonia Gessner, Anna Della Rosa, Luca Marinelli, Serena Grandi, Ivan Franek","Plot":"Jep Gambardella has seduced his way through the lavish nightlife of Rome for decades, but after his 65th birthday and a shock from the past, Jep looks past the nightclubs and parties to find a timeless landscape of absurd, exquisite beauty. Journalist Jep Gambardella has charmed and seduced his way through the lavish nightlife of Rome for decades. Since the legendary success of his one and only novel, he has been a permanent fixture in the city's literary and social circles, but when his sixty-fifth birthday coincides with a shock from the past, Jep finds himself unexpectedly taking stock of his life, turning his cutting wit on himself and his contemporaries, and looking past the extravagant nightclubs, parties, and cafés to find Rome in all its glory: a timeless landscape of absurd, exquisite beauty. Written by Jon Mulvaney","Genre":"Drama","Keywords":"party, male nudity, genitalia, old age, male frontal nudity","imdbRating":"7.7","imdbVotes":"52,462","Awards":"Won 1 Oscar. Another 52 wins & 72 nominations.","Metascore":"86","Released":"14 March 2014 (USA) ","Location":"Rome, Lazio, Italy ","Actors":"Toni Servillo, Carlo Verdone, Sabrina Ferilli ","Writer":"Paolo Sorrentino (story), Paolo Sorrentino (screenplay) | 1 more credit »","Running_time":"PT141M / 2h 21min","Description":"Directed by Paolo Sorrentino.  With Toni Servillo, Carlo Verdone, Sabrina Ferilli, Carlo Buccirosso. Jep Gambardella has seduced his way through the lavish nightlife of Rome for decades, but after his 65th birthday and a shock from the past, Jep looks past the nightclubs and parties to find a timeless landscape of absurd, exquisite beauty.","Rated":"NOT RATED"}