{"imdbID":"tt2488496","Title":"Star Wars: Episode VII - The Force Awakens","Year":"2015","Director":"J.J. Abrams","Taglines":"The force is calling to you. Just let it in. ","Country":"USA","Language":"English","Also_Known_As":"Star Wars: The Force Awakens ","Budget":"$200,000,000 (estimated)","Opening_Weekend":"$247,966,675 (USA) (18 December 2015)","Gross":"$930,757,012 (USA) (11 March 2016)","Production_Co":"Lucasfilm, Bad Robot, Truenorth Productions ","Runtime":"135 min","Sound_Mix":"12-Track Digital Sound (IMAX 12 track)| Dolby Atmos | Dolby Surround 7.1 | Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The film features both a James Bond and a Blofeld, \"Max Von Sydow\" (Blofeld in Never Say Never Again (1983)) and Daniel Craig (James Bond since 2006). See more »","Goofs":"When Kylo Ren meets up with Rey and Finn in the forest, how the did Ren get ahead of them and is waiting of them? Plus how did he know exactly where they were going to be? Rey and Finn originally had to climb to a higher level when they entered the base. So, they most likely had to climb back down giving Kylo enough time to get ahead of them. He could have also used the Force to predict where they would cross paths. See more »","Crazy_Credits":"The stars that form the backdrop for the end credits are exactly the same stars as in the beginning of the movie. See more »","Cast":"Harrison Ford, Mark Hamill, Carrie Fisher, Adam Driver, Daisy Ridley, John Boyega, Oscar Isaac, Lupita Nyong'o, Andy Serkis, Domhnall Gleeson, Anthony Daniels, Max von Sydow, Peter Mayhew, Gwendoline Christie, Joonas Suotamo","Plot":"Three decades after the defeat of the Galactic Empire, a new threat arises. The First Order attempts to rule the galaxy and only a ragtag group of heroes can stop them, along with the help of the Resistance. 30 years after the defeat of Darth Vader and the Empire, Rey, a scavenger from the planet Jakku, finds a BB-8 droid that knows the whereabouts of the long lost Luke Skywalker. Rey, as well as a rogue stormtrooper and two smugglers, are thrown into the middle of a battle between the Resistance and the daunting legions of the First Order. Written by Noah White","Genre":"Action, Adventure, Fantasy","Keywords":"female protagonist, outer space, father son relationship, patricide, droid","imdbRating":"8.4","imdbVotes":"455,844","Awards":"Nominated for 5 Oscars. Another 20 wins & 97 nominations.","Metascore":"81","Released":"18 December 2015 (USA) ","Location":"Pinewood Studios, Iver Heath, Buckinghamshire, England, UK ","Actors":"Daisy Ridley, John Boyega, Oscar Isaac ","Writer":"Lawrence Kasdan, J.J. Abrams | 2 more credits »","Running_time":"PT135M / 2h 15min","Description":"Directed by J.J. Abrams.  With Daisy Ridley, John Boyega, Oscar Isaac, Domhnall Gleeson. Three decades after the defeat of the Galactic Empire, a new threat arises. The First Order attempts to rule the galaxy and only a ragtag group of heroes can stop them, along with the help of the Resistance.","Rated":"PG-13"}