{"imdbID":"tt2446980","Title":"Joy","Year":"2015","Director":"David O. Russell","Country":"USA","Language":"English, Spanish, French","Budget":"$60,000,000 (estimated)","Gross":"$56,415,623 (USA) (4 March 2016)","Production_Co":"Fox 2000 Pictures, TSG Entertainment, Annapurna Pictures ","Runtime":"124 min","Cast":"Jennifer Lawrence, Edgar Ramirez, Robert De Niro, Dascha Polanco, Virginia Madsen, Isabella Rossellini, Bradley Cooper, Isabella Crovetti-Cramp, Elisabeth Röhm, Aundrea Gadsby, Gia Gadsby, Tomas Elizondo, Zeke Elizondo, Diane Ladd, Madison Wolfe","Plot":"Joy is the story of the title character, who rose to become founder and matriarch of a powerful family business dynasty. 1995. Joy has always been fascinated by creating things, this pursuit always supported emotionally by her maternal grandmother, Mimi. Joy feels that lack of practical support has led to others making fortunes on ideas she had come up with years ago but could not act upon manufacturing. Despite being broke, Joy is the person in her extended family to who everyone has always turned, in the process forgoing her own life, including not having attended college to help see her parents through their divorce. She works in an unsatisfying job as an Eastern Airlines ticket clerk, and lives with her mother Terry who spends all day in bed watching soap operas, her ex-husband Tony, a less than successful aspiring Latino Tom Jones wannabe, and their two children. Added to this mix is her father Rudy, the owner of a failing heavy-duty garage, which is managed by Joy's older half-sister Peggy, with who she has somewhat of a strained relationship, and for which Joy does the books. Sharon, Rudy's ... Written by Huggo","Genre":"Comedy, Drama","Keywords":"mop, based on real person, female inventor, sales pitch, business","imdbRating":"6.6","imdbVotes":"49,080","Awards":"Nominated for 1 Oscar. Another 2 wins & 16 nominations.","Metascore":"56","Released":"25 December 2015 (USA) ","Location":"Boston, Massachusetts, USA ","Actors":"Jennifer Lawrence, Robert De Niro, Bradley Cooper ","Writer":"David O. Russell (screenplay), Annie Mumolo (story) | 1 more credit »","Running_time":"PT124M / 2h 4min","Description":"Directed by David O. Russell.  With Jennifer Lawrence, Robert De Niro, Bradley Cooper, Edgar Ramirez. Joy is the story of the title character, who rose to become founder and matriarch of a powerful family business dynasty.","Rated":"PG-13"}