{"imdbID":"tt2431286","Title":"Philomena","Year":"2013","Director":"Stephen Frears","Country":"UK, USA, France","Language":"English","Budget":"$12,000,000 (estimated)","Gross":"$37,707,719 (USA) (16 May 2014)","Production_Co":"Weinstein Company, The, Yucaipa Films, Pathé ","Runtime":"98 min","Cast":"Judi Dench, Steve Coogan, Sophie Kennedy Clark, Mare Winningham, Barbara Jefford, Ruth McCabe, Peter Hermann, Sean Mahon, Anna Maxwell Martin, Michelle Fairley, Wunmi Mosaku, Amy McAllister, Charlie Murphy, Cathy Belton, Kate Fleetwood","Plot":"A world-weary political journalist picks up the story of a woman's search for her son, who was taken away from her decades ago after she became pregnant and was forced to live in a convent. When former journalist Martin Sixsmith is dismissed from the Labour Party in disgrace, he is at a loss as to what do. That changes when a young Irish woman approaches him about a story of her mother, Philomena, who had her son taken away when she was a teenage inmate of a Catholic convent. Martin arranges a magazine assignment about her search for him that eventually leads to America. Along the way, Martin and Philomena discover as much about each other as about her son's fate. Furthermore, both find their basic beliefs challenged. Written by Kenneth Chisholm (kchishol@rogers.com)","Genre":"Biography, Drama","Keywords":"convent, catholic, irish adoption board, catholic church, human interest story","imdbRating":"7.6","imdbVotes":"73,193","Awards":"Nominated for 4 Oscars. Another 31 wins & 71 nominations.","Metascore":"76","Released":"27 November 2013 (USA) ","Location":"London, England, UK ","Actors":"Judi Dench, Steve Coogan, Sophie Kennedy Clark ","Writer":"Steve Coogan (screenplay), Jeff Pope (screenplay) | 1 more credit »","Running_time":"PT98M / 1h 38min","Description":"Directed by Stephen Frears.  With Judi Dench, Steve Coogan, Sophie Kennedy Clark, Mare Winningham. A world-weary political journalist picks up the story of a woman's search for her son, who was taken away from her decades ago after she became pregnant and was forced to live in a convent.","Rated":"PG-13"}