{"imdbID":"tt2582846","Title":"The Fault in Our Stars","Year":"2014","Director":"Josh Boone","Taglines":"Based on the #1 bestseller ","Country":"USA","Language":"English","Also_Known_As":"TFiOS ","Budget":"$12,000,000 (estimated)","Opening_Weekend":"$48,002,523 (USA) (6 June 2014)","Gross":"$124,868,837 (USA) (3 October 2014)","Production_Co":"Fox 2000 Pictures, Temple Hill Entertainment, TSG Entertainment ","Runtime":"126 min | 133 min (Extended Edition)","Sound_Mix":"Dolby | Dolby Digital | SDDS | Datasat","Color":"Color","Aspect_Ratio":"1.85 : 1","Trivia":"(at around 1 min 36 sec) While Hazel and her mother are at the mall, on the table between them are two plastic giraffes humping. This may be an Easter egg for the nerdfighters, the name for vlogbrothers fans. The two giraffes refer to the fact that the vlogbrothers placed giraffe sex thumbnails on some of their videos even though they have nothing to do with the videos' content. See more »","Goofs":"When Hazel and Gus leave the hotel in Amsterdam to go to Van Houten's house, they take a streetcar to get there. However, in the email Hazel receives from Lidewij prior to the trip, it is stated that the hotel is only a street over from Van Houten's home. See more »","Crazy_Credits":"The 20th Century Fox opening is in dark and once it finishes its course, it heads to the sky of twinkling stars. See more »","Cast":"Shailene Woodley, Ansel Elgort, Nat Wolff, Laura Dern, Sam Trammell, Willem Dafoe, Lotte Verbeek, Ana Dela Cruz, Randy Kovitz, Toni Saladna, David Whalen, Milica Govich, Allegra Carpenter, Emily Peachey, Emily Bach","Plot":"Two teenage cancer patients begin a life-affirming journey to visit a reclusive author in Amsterdam. Hazel and Augustus are two teenagers who share an acerbic wit, a disdain for the conventional, and a love that sweeps them on a journey. Their relationship is all the more miraculous, given that Hazel's other constant companion is an oxygen tank, Gus jokes about his prosthetic leg, and they meet and fall in love at a cancer support group. Written by Anonymous","Genre":"Drama, Romance","Keywords":"cancer, teenager, falling in love, friendship, novel","imdbRating":"7.9","imdbVotes":"235,028","Awards":"19 wins & 11 nominations.","Metascore":"69","Released":"6 June 2014 (USA) ","Location":"Amsterdam, Noord-Holland, Netherlands ","Actors":"Shailene Woodley, Ansel Elgort, Nat Wolff ","Writer":"Scott Neustadter (screenplay), Michael H. Weber (screenplay) | 1 more credit »","Running_time":"PT126M / 2h 6min","Description":"Directed by Josh Boone.  With Shailene Woodley, Ansel Elgort, Nat Wolff, Laura Dern. Two teenage cancer patients begin a life-affirming journey to visit a reclusive author in Amsterdam.","Rated":"PG-13"}