{"imdbID":"tt2562232","Title":"Birdman or (The Unexpected Virtue of Ignorance)","Year":"2014","Director":"Alejandro González Iñárritu (as Alejandro G. Iñárritu)","Country":"USA","Language":"English","Budget":"$22,000,000 (estimated)","Gross":"$42,335,698 (USA) (10 April 2015)","Production_Co":"New Regency Pictures, M Prods, Grisbi Productions, Le ","Runtime":"119 min","Cast":"Michael Keaton, Emma Stone, Kenny Chin, Jamahl Garrison-Lowe, Zach Galifianakis, Naomi Watts, Jeremy Shamos, Andrea Riseborough, Katherine O'Sullivan, Damian Young, Keenan Shimizu, Akira Ito, Natalie Gold, Merritt Wever, Edward Norton","Plot":"Illustrated upon the progress of his latest Broadway play, a former popular actor's struggle to cope with his current life as a wasted actor is shown. Actor Riggan Thomson is most famous for his movie role from over twenty years ago of the comic book superhero Birdman in the blockbuster movie of the same name and its two equally popular sequels. His association with the role took over his life, where Birdman is more renowned than \"Riggan Thomson\" the actor. Now past middle age, Riggan is trying to establish himself as a true artist by writing, directing, starring in and co-producing with his best friend Jake what is his Broadway debut, an adaptation of Raymond Carver's story, What We Talk About When We Talk About Love. He is staking his name, what little artistic reputation that comes with that name and his life savings on the project, and as such will do anything needed to make the play a success. As he and Jake go through the process of the previews toward opening night, Riggan runs into several issues: needing to find a replacement for the integral supporting male role the night before the first preview; hiring the talented ... Written by Huggo","Genre":"Comedy, Drama","Keywords":"actor, broadway play, replacement, artist, stage","imdbRating":"7.8","imdbVotes":"368,564","Awards":"Won 4 Oscars. Another 175 wins & 253 nominations.","Metascore":"88","Released":"14 November 2014 (USA) ","Location":"New York City, New York, USA ","Actors":"Michael Keaton, Zach Galifianakis, Edward Norton ","Writer":"Alejandro González Iñárritu (as Alejandro G. Iñárritu), Nicolás Giacobone | 3 more credits »","Running_time":"PT119M / 1h 59min","Description":"Directed by Alejandro González Iñárritu.  With Michael Keaton, Zach Galifianakis, Edward Norton, Andrea Riseborough. Illustrated upon the progress of his latest Broadway play, a former popular actor's struggle to cope with his current life as a wasted actor is shown.","Rated":"R"}