{"imdbID":"tt2582496","Title":"Me and Earl and the Dying Girl","Year":"2015","Director":"Alfonso Gomez-Rejon","Taglines":"A little friendship never killed anyone. ","Country":"USA","Language":"English","Also_Known_As":"Yo, él y Raquel ","Budget":"$8,000,000 (estimated)","Opening_Weekend":"$364,039 (USA) (19 June 2015)","Gross":"$6,743,776 (USA) (28 August 2015)","Production_Co":"Indian Paintbrush ","Runtime":"105 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The shot in Rachel's bedroom where her and Greg discuss prom and her cancer lasts for 5 minutes and 5 seconds with only one camera movement in the last 2 seconds of the shot. See more »","Goofs":"Each scene where Rachel is informing her friends about her test are different, the first time she stands in front of her friend, and the second she is hugging her friend. See more »","Cast":"Thomas Mann, RJ Cyler, Olivia Cooke, Nick Offerman, Connie Britton, Molly Shannon, Jon Bernthal, Matt Bennett, Katherine Hughes, Masam Holden, Bobb'e J. Thompson, Gavin Dietz, Edward DeBruce III, Natalie Marchelletta, Chelsea Zhang","Plot":"High schooler Greg, who spends most of his time making parodies of classic movies with his co-worker Earl, finds his outlook forever altered after befriending a classmate who has just been diagnosed with cancer. Seventeen-year-old Greg has managed to become part of every social group at his Pittsburgh high school without having any friends, but his life changes when his mother forces him to befriend Rachel, a girl he once knew in Hebrew school who has leukemia. Written by Toby Padilla","Genre":"Comedy, Drama","Keywords":"high school, leukemia, teenage boy, aspiring filmmaker, amateur film","imdbRating":"7.8","imdbVotes":"62,987","Awards":"15 wins & 24 nominations.","Metascore":"74","Released":"1 July 2015 (USA) ","Location":"Lili Coffee Shop LLC & The Copacetic Comics Co - 3138 Dobson Street, Pittsburgh, USA ","Actors":"Thomas Mann, RJ Cyler, Olivia Cooke ","Writer":"Jesse Andrews (novel), Jesse Andrews (screenplay)","Running_time":"PT105M / 1h 45min","Description":"Directed by Alfonso Gomez-Rejon.  With Thomas Mann, RJ Cyler, Olivia Cooke, Nick Offerman. High schooler Greg, who spends most of his time making parodies of classic movies with his co-worker Earl, finds his outlook forever altered after befriending a classmate who has just been diagnosed with cancer.","Rated":"PG-13"}