{"imdbID":"tt2737050","Title":"Two Days, One Night","Year":"2014","Country":"Belgium, France, Italy","Language":"French, Arabic, English","Budget":"€7,000,000 (estimated)","Gross":"$1,333,900 (USA) (27 February 2015)","Production_Co":"Les Films du Fleuve, Archipel 35, BIM Distribuzione ","Runtime":"95 min","Cast":"Marion Cotillard, Fabrizio Rongione, Catherine Salée, Batiste Sornin, Pili Groyne, Simon Caudry, Lara Persain, Alain Eloy, Myriem Akeddiou, Fabienne Sciascia, Anette Niro, Rania Mellouli, Christelle Delbrouck, Timur Magomedgadzhiev, Hassaba Halibi","Plot":"Sandra, a young Belgian mother, discovers that her workmates have opted for a significant pay bonus, in exchange for her dismissal. She has only one weekend to convince her colleagues to give up their bonuses so that she can keep her job. Sandra Bya, married with two children, has been off work from her job at Solwal on medical leave for depression. During her absence from work, her boss, M. Dumont, on the suggestion of her immediate supervisor, the shop foreman Jean-Marc, figures that her section of the company can function with sixteen people working full time with a bit of overtime instead of seventeen with no overtime, that seventeenth person being Sandra. Because of the global competition the company faces, Dumont decides the company can only finance the annual bonuses for those sixteen employees, which are EUR1,000 per person, or Sandra's job, leaving the decision to those sixteen. On a Friday near the end of her medical leave, Sandra learns of this situation from her friend and co-worker Juliette after the \"show of hands\" vote is held, the result a 13-3 decision for the bonuses over Sandra's job. Because Juliette knows Jean-Marc, who is determined to get rid of Sandra, influenced the vote by scare mongering ... Written by Huggo","Genre":"Drama","Keywords":"injustice, xanax, bonus, depression, employer employee relationship","imdbRating":"7.4","imdbVotes":"29,855","Awards":"Nominated for 1 Oscar. Another 37 wins & 72 nominations.","Metascore":"89","Released":"21 May 2014 (Belgium) ","Location":"Seraing, Liège, Wallonia, Belgium ","Actors":"Marion Cotillard, Fabrizio Rongione, Catherine Salée ","Director":"Jean-Pierre Dardenne, Luc Dardenne","Writer":"Jean-Pierre Dardenne, Luc Dardenne","Running_time":"PT95M / 1h 35min","Description":"Directed by Jean-Pierre Dardenne, Luc Dardenne.  With Marion Cotillard, Fabrizio Rongione, Catherine Salée, Batiste Sornin. Sandra, a young Belgian mother, discovers that her workmates have opted for a significant pay bonus, in exchange for her dismissal. She has only one weekend to convince her colleagues to give up their bonuses so that she can keep her job.","Rated":"PG-13"}