{"imdbID":"tt2802154","Title":"Leviathan","Year":"2014","Director":"Andrey Zvyagintsev","Country":"Russia","Language":"Russian","Also_Known_As":"Leviathan ","Production_Co":"Non-Stop Productions ","Runtime":"140 min","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"When the scene where the mayor visits Nikolay's house and confronts Nikolay and Dmitry was being filmed, Aleksey Serebryakov, who played Nikolay, was so drunk that he became sick and had to leave the scene. Roman Madyanov, who played the drunken mayor, was actually the only one who was sober and he ended up doing much of the scene alone without anyone to act against. See more »","Cast":"Aleksey Serebryakov, Elena Lyadova, Vladimir Vdovichenkov, Roman Madyanov, Anna Ukolova, Aleksey Rozin, Sergey Pokhodaev, Platon Kamenev, Sergey Bachurskiy, Valeriy Grishko, Alla Emintseva, Margarita Shubina, Dmitriy Bykovskiy-Romashov, Sergey Borisov, Igor Savochkin","Plot":"In a Russian coastal town, Kolya is forced to fight the corrupt mayor when he is told that his house will be demolished. He recruits a lawyer friend to help, but the man's arrival brings further misfortune for Kolya and his family. On the outskirts of a small coastal town in the Barents Sea, where whales sometimes come to its bay, lives an ordinary family: Kolya (Aleksey Serebryakov), his wife Lilya (Elena Lyadova) and their teenage son Romka. The family is haunted by a local corrupted mayor (Roman Madyanov), who is trying to take away the land, a house and a small auto repair shop from Kolya. To save their homes Kolya calls his old Army friend in Moscow (Vladimir Vdovichenkov), who has now become an authoritative attorney. Together they decide to fight back and collect dirt on the mayor. Written by iggy","Genre":"Drama","Keywords":"mayor, sea, attorney, lawyer, corrupt politician","imdbRating":"7.7","imdbVotes":"28,855","Awards":"Nominated for 1 Oscar. Another 25 wins & 36 nominations.","Metascore":"92","Released":"5 February 2015 (Russia) ","Location":"Kirovsk, Murmansk Oblast, Russia ","Actors":"Aleksey Serebryakov, Elena Lyadova, Roman Madyanov ","Writer":"Oleg Negin, Andrey Zvyagintsev","Running_time":"PT140M / 2h 20min","Description":"Directed by Andrey Zvyagintsev.  With Aleksey Serebryakov, Elena Lyadova, Roman Madyanov, Vladimir Vdovichenkov. In a Russian coastal town, Kolya is forced to fight the corrupt mayor when he is told that his house will be demolished. He recruits a lawyer friend to help, but the man's arrival brings further misfortune for Kolya and his family.","Rated":"R"}