{"imdbID":"tt2872718","Title":"Nightcrawler","Year":"2014","Director":"Dan Gilroy","Writer":"Dan Gilroy","Taglines":"The closer you look the darker it gets. ","Country":"USA","Language":"English","Also_Known_As":"Primicia mortal ","Budget":"$8,500,000 (estimated)","Opening_Weekend":"$10,441,000 (USA) (31 October 2014)","Gross":"$32,279,955 (USA) (23 January 2015)","Production_Co":"Bold Films, Sierra / Affinity, Nightcrawler ","Runtime":"117 min","Sound_Mix":"Dolby Digital | Datasat","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"The music cues in the movie represent the music cues in Lou's head. See more »","Goofs":"The camera does a full view around the red car as Lou is chasing the police cars. The V8 exhaust engine sound is heard when the camera is at the front of the car and not the back. See more »","Crazy_Credits":"Though hardly perceivable, the moon continues to rise as credits roll. See more »","Cast":"Jake Gyllenhaal, Michael Papajohn, Marco Rodríguez, Bill Paxton, James Huang, Kent Shocknek, Pat Harvey, Sharon Tay, Rick Garcia, Leah Fredkin, Bill Seward, Rick Chambers, Holly Hannula, Jonny Coyne, Nick Chacon","Plot":"When Louis Bloom, a driven man desperate for work, muscles into the world of L.A. crime journalism, he blurs the line between observer and participant to become the star of his own story. Aiding him in his effort is Nina, a TV-news veteran. NIGHTCRAWLER is a thriller set in the nocturnal underbelly of contemporary Los Angeles. Jake Gyllenhaal stars as Lou Bloom, a driven young man desperate for work who discovers the high-speed world of L.A. crime journalism. Finding a group of freelance camera crews who film crashes, fires, murder and other mayhem, Lou muscles into the cut-throat, dangerous realm of nightcrawling - where each police siren wail equals a possible windfall and victims are converted into dollars and cents. Aided by Rene Russo as Nina, a veteran of the blood-sport that is local TV news, Lou blurs the line between observer and participant to become the star of his own story. Written by Open Road Films","Genre":"Crime, Thriller","Keywords":"sociopath, ethics, tv news, journalism, employer employee relationship","imdbRating":"7.9","imdbVotes":"273,093","Awards":"Nominated for 1 Oscar. Another 42 wins & 112 nominations.","Metascore":"76","Released":"31 October 2014 (USA) ","Location":"Los Angeles, California, USA ","Actors":"Jake Gyllenhaal, Rene Russo, Bill Paxton ","Running_time":"PT117M / 1h 57min","Description":"Directed by Dan Gilroy.  With Jake Gyllenhaal, Rene Russo, Bill Paxton, Riz Ahmed. When Louis Bloom, a driven man desperate for work, muscles into the world of L.A. crime journalism, he blurs the line between observer and participant to become the star of his own story. Aiding him in his effort is Nina, a TV-news veteran.","Rated":"R"}