{"imdbID":"tt2980516","Title":"The Theory of Everything","Year":"2014","Director":"James Marsh","Country":"UK","Language":"English, French, Latin, Italian","Budget":"$15,000,000 (estimated)","Gross":"$35,887,263 (USA) (10 April 2015)","Production_Co":"Working Title Films ","Runtime":"123 min","Cast":"Eddie Redmayne, Felicity Jones, Tom Prior, Sophie Perry, Finlay Wright-Stephens, Harry Lloyd, Alice Orr-Ewing, David Thewlis, Thomas Morrison, Michael Marcus, Gruffudd Glyn, Paul Longley, Emily Watson, Guy Oliver-Watts, Simon McBurney","Plot":"A look at the relationship between the famous physicist Stephen Hawking and his wife. The Theory of Everything is the story of the most brilliant and celebrated physicist of our time, Stephen Hawking, and Jane Wilde the arts student he fell in love with whilst studying at Cambridge in the 1960s. Little was expected from Stephen Hawking, a bright but shiftless student of cosmology, given just two years to live following the diagnosis of a fatal illness at 21 years of age. He became galvanized, however, by the love of fellow Cambridge student, Jane Wilde, and he went on to be called the successor to Einstein, as well as a husband and father to their three children. Over the course of their marriage as Stephen's body collapsed and his academic renown soared, fault lines were exposed that tested the lineaments of their relationship and dramatically altered the course of both of their lives. Written by Spencer Higham","Genre":"Biography, Drama, Romance","Keywords":"cambridge university, lou gehrig's disease, physicist, based on memoir, husband wife relationship","imdbRating":"7.7","imdbVotes":"245,360","Awards":"Won 1 Oscar. Another 24 wins & 114 nominations.","Metascore":"72","Released":"26 November 2014 (USA) ","Location":"Cambridge, Cambridgeshire, England, UK ","Actors":"Eddie Redmayne, Felicity Jones, Tom Prior ","Writer":"Anthony McCarten (screenplay), Jane Hawking (book)","Running_time":"PT123M / 2h 3min","Description":"Directed by James Marsh.  With Eddie Redmayne, Felicity Jones, Tom Prior, Sophie Perry. A look at the relationship between the famous physicist Stephen Hawking and his wife.","Rated":"PG-13"}