{"imdbID":"tt3011894","Title":"Wild Tales","Year":"2014","Director":"Damián Szifrón (as Damián Szifron)","Writer":"Damián Szifrón (as Damián Szifron)","Taglines":"We can all lose control","Country":"Argentina, Spain","Language":"Spanish","Also_Known_As":"Wild Tales ","Budget":"$3,300,000 (estimated)","Opening_Weekend":"$85,100 (USA) (20 February 2015)","Gross":"$3,079,012 (USA) (26 June 2015)","Production_Co":"Corner Producciones, El Deseo, Instituto Nacional de Cine y Artes Audiovisuales (INCAA) ","Runtime":"122 min","Sound_Mix":"Dolby Surround 7.1","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"During the credits at the beginning, each main actor of each tale is identified with a wild animal. In the director's case, it is a fox. Szifrón said that this was because his father had liked foxes a lot, and had used to watch lots of documentaries about them. He also felt identified with that picture, more specifically with the fox's gaze, as the job of a director is in the gaze. See more »","Goofs":"When the bride calls her husband's \"guitar teacher\", the screen is off even though the phone is in front of her and it's supposed to be in call mode. See more »","Crazy_Credits":"In the opening credits of the film, each actor is identified and accompanied by the image of a wild animal. In the case of the director (Szifrón), he chose a fox, the reason is not only because he is red haired: \"The fox was an animal that my dad really liked, he always saw foxes documentaries, I think that's why I chose it...\" See more »","Cast":"Darío Grandinetti, María Marull, Mónica Villa, Rita Cortese, Julieta Zylberberg, César Bordón, Leonardo Sbaraglia, Walter Donado, Ricardo Darín, Nancy Dupláa, Oscar Martínez, María Onetto, Osmar Núñez, Germán de Silva, Erica Rivas","Plot":"Six short stories that explore the extremities of human behavior involving people in distress. The film is divided into six segments. (1) \"Pasternak\": While being on a plane, a model and a music critic realise they have a common acquaintance called Pasternak. Soon they discover that every passenger and crew member on board know Pasternak. Is this coincidence? (2) \"The Rats\": A waitress recognizes her client - it's the loan shark who caused a tragedy in her family. The cook suggests mixing rat poison with his food, but the waitress refuses. The stubborn cook, however, decides to proceed with her plan. (3) \"The Strongest\": Two drivers on a lone highway have an argument with tragic consequences. (4) \"Little Bomb\": A demolition engineer has his car towed by a truck for parking in a wrong place and he has an argument with the employee of the towing company. This event destroys his private and professional life, and he plots revenge against the corrupt towing company and the city hall. (5) \"The Proposal\": A reckless son of a wealthy family has an overnight hit-and-run accident, in ... Written by Claudio Carvalho, Rio de Janeiro, Brazil","Genre":"Comedy, Drama, Thriller","Keywords":"suicide by airplane crash, revenge, music critic, road rage, anthology","imdbRating":"8.1","imdbVotes":"77,136","Awards":"Nominated for 1 Oscar. Another 43 wins & 52 nominations.","Metascore":"77","Released":"21 August 2014 (Argentina) ","Location":"Buenos Aires, Federal District, Argentina ","Actors":"Darío Grandinetti, María Marull, Mónica Villa ","Running_time":"PT122M / 2h 2min","Description":"Directed by Damián Szifrón.  With Darío Grandinetti, María Marull, Mónica Villa, Rita Cortese. Six short stories that explore the extremities of human behavior involving people in distress.","Rated":"R"}