{"imdbID":"tt3076658","Title":"Creed","Year":"2015","Director":"Ryan Coogler","Taglines":"Your legacy is more than a name","Country":"USA","Language":"English, Spanish","Also_Known_As":"Creed: Corazón de campeón ","Budget":"$35,000,000 (estimated)","Opening_Weekend":"$29,632,823 (USA) (27 November 2015)","Gross":"$109,712,885 (USA) (26 February 2016)","Production_Co":"Metro-Goldwyn-Mayer (MGM), Warner Bros., New Line Cinema ","Runtime":"133 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"Just as the film was entering pre-production, Sylvester Stallone's oldest son Sage Stallone died of a heart attack. Stallone has admitted that the loss almost sent him into a full breakdown, but Ryan Coogler was eventually able to convince him to use the film as a dedication to Sage, focusing specifically on the father-son relationships that appear in it. Although initially resistant, Stallone said at the Golden Globes that Creed helped him cope with Sage's death. See more »","Goofs":"At the end of the movie, Adonis and Rocky visit the Museum of Art. Adonis looks around as if he hasn't been there before, and says, \"This is it?\" However, Adonis was there when first came to Philadelphia, as he visited the Rocky statue which is located just off to the side of the famous steps. See more »","Cast":"Michael B. Jordan, Sylvester Stallone, Tessa Thompson, Phylicia Rashad, Andre Ward, Tony Bellew, Ritchie Coster, Jacob 'Stitch' Duran, Graham McTavish, Malik Bazille, Ricardo 'Padman' McGill, Gabe Rosado, Wood Harris, Buddy Osborn, Rupal Pujara","Plot":"The former World Heavyweight Champion Rocky Balboa serves as a trainer and mentor to Adonis Johnson, the son of his late friend and former rival Apollo Creed. Adonis Johnson is the son of the famous boxing champion Apollo Creed, who died in a boxing match in Rocky IV (1985). Adonis wasn't born until after his father's death and wants to follow his fathers footsteps in boxing. He seeks a mentor who is the former heavyweight boxing champion and former friend of Apollo Creed, the retired Rocky Balboa. Rocky eventually agrees to mentor Adonis. With Rocky's help they hope to get a title job to face even deadlier opponents than his father. But whether he is a true fighter remains to be seen.... Written by Blake ordonez","Genre":"Drama, Sport","Keywords":"boxing, fight, boxing match, philadelphia, montage","imdbRating":"7.8","imdbVotes":"109,223","Awards":"Nominated for 1 Oscar. Another 41 wins & 50 nominations.","Metascore":"82","Released":"25 November 2015 (USA) ","Location":"Philadelphia, Pennsylvania, USA ","Actors":"Michael B. Jordan, Sylvester Stallone, Tessa Thompson ","Writer":"Ryan Coogler (screenplay), Aaron Covington (screenplay) | 2 more credits »","Running_time":"PT133M / 2h 13min","Description":"Directed by Ryan Coogler.  With Michael B. Jordan, Sylvester Stallone, Tessa Thompson, Phylicia Rashad. The former World Heavyweight Champion Rocky Balboa serves as a trainer and mentor to Adonis Johnson, the son of his late friend and former rival Apollo Creed.","Rated":"PG-13"}