{"imdbID":"tt3169706","Title":"Pride","Year":"2014","Director":"Matthew Warchus","Writer":"Stephen Beresford (screenplay)","Taglines":"Based on the inspirational true story.","Country":"UK, France","Language":"English, Welsh","Also_Known_As":"Büszkeség és bányászélet ","Production_Co":"Pathé, BBC Films, Proud Films ","Runtime":"119 min","Sound_Mix":"Dolby Digital","Color":"Color","Aspect_Ratio":"2.35 : 1","Trivia":"There are cameo appearances of the real people some of the characters are based on in the Westminster Bridge scene. Reggie Blennerhassett and Ray Aller (played by Chris Overton and Joshua Hill), Gethin Roberts (played by Andrew Scott), Gethin's Mum (played by Olwen Medi), Mike Jackson (played by Joe Gilgun) and Ray Goodspeed (not directly portrayed in the movie but a leading light in LGSM) See more »","Goofs":"The microphones used on the various stages in the movie are connected with cables that use very modern connectors, these connectors have only been available since 2005. See more »","Cast":"Ben Schnetzer, Abram Rooney, Jim McManus, George MacKay, Monica Dolan, Matthew Flynn, Andrew Scott, Joseph Gilgun, Faye Marsay, Freddie Fox, Lucy Timmons, Jordan Metcalfe, Roger Morlidge, Dean Ashton, Chris Overton","Plot":"U.K. gay activists work to help miners during their lengthy strike of the National Union of Mineworkers in the summer of 1984. In 1984 20 year old closet gay Joe hesitantly arrives in London from Bromley for his first Gay Pride march and is taken under the collective wing of a group of gay men and Lesbian Steph, who meet at flamboyant Jonathan and his Welsh partner Gethin's Soho bookshop. Not only are gays being threatened by Thatcher but the miners are on strike in response to her pit closures and Northern Irish activist Mark Ashton believes gays and miners should show solidarity. Almost by accident a mini-bus full of gays find themselves in the Welsh village of Onllwyn in the Dulais valley and through their sincere fund raising and Jonathan's nifty disco moves persuade most of the community that they are on the same side. When a bigot tries to sabotage the partnership with a tabloid smear Mark turns it back on her with a hugely successful benefit concert to which most of the villagers, now thoroughly in tune with their gay friends, turn up. The miners are defeated and return to work but at the Pride march ... Written by don @ minifie-1","Genre":"Biography, Comedy, Drama","Keywords":"miner, national union of mineworkers, left wing politics, gay, gay activist","imdbRating":"7.8","imdbVotes":"32,549","Awards":"Nominated for 1 Golden Globe. Another 8 wins & 16 nominations.","Metascore":"79","Released":"12 September 2014 (UK) ","Location":"London, England, UK ","Actors":"Bill Nighy, Imelda Staunton, Dominic West ","Running_time":"PT119M / 1h 59min","Description":"Directed by Matthew Warchus.  With Bill Nighy, Imelda Staunton, Dominic West, Paddy Considine. U.K. gay activists work to help miners during their lengthy strike of the National Union of Mineworkers in the summer of 1984.","Rated":"R"}