{"imdbID":"tt3170832","Title":"Room","Year":"2015","Director":"Lenny Abrahamson","Country":"Ireland, Canada","Language":"English","Budget":"$6,000,000 (estimated)","Gross":"$14,161,502 (USA) (4 March 2016)","Production_Co":"A24, Element Pictures, No Trace Camping ","Runtime":"118 min","Cast":"Brie Larson, Jacob Tremblay, Sean Bridgers, Wendy Crewson, Sandy McMaster, Matt Gordon, Amanda Brugel, Joe Pingue, Joan Allen, Zarrin Darnell-Martin, Cas Anvar, William H. Macy, Jee-Yun Lee, Randal Edwards, Justin Mader","Plot":"A kidnapped mother and son make a daring escape, and experience a dramatic homecoming provoking a look into the power of imagination and the unstoppable force of a mother's love. ROOM tells the extraordinary story of Jack, a spirited 5-year-old who is looked after by his loving and devoted mother. Like any good mother, Ma dedicates herself to keeping Jack happy and safe, nurturing him with warmth and love and doing typical things like playing games and telling stories. Their life, however, is anything but typical--they are trapped--confined to a 10-by-10-foot space that Ma has euphemistically named Room. Ma has created a whole universe for Jack within Room, and she will stop at nothing to ensure that, even in this treacherous environment, Jack is able to live a complete and fulfilling life. But as Jack's curiosity about their situation grows, and Ma's resilience reaches its breaking point, they enact a risky plan to escape, ultimately bringing them face-to-face with what may turn out to be the scariest thing yet: the real world. Written by A24","Genre":"Drama","Keywords":"mother son relationship, escape, kidnapping, tooth, imprisonment","imdbRating":"8.3","imdbVotes":"95,929","Awards":"Won 1 Oscar. Another 79 wins & 123 nominations.","Metascore":"86","Released":"22 January 2016 (USA) ","Location":"Toronto, Ontario, Canada ","Actors":"Brie Larson, Jacob Tremblay, Sean Bridgers ","Writer":"Emma Donoghue (screenplay), Emma Donoghue (based on the novel by)","Running_time":"PT118M / 1h 58min","Description":"Directed by Lenny Abrahamson.  With Brie Larson, Jacob Tremblay, Sean Bridgers, Wendy Crewson. A kidnapped mother and son make a daring escape, and experience a dramatic homecoming provoking a look into the power of imagination and the unstoppable force of a mother's love.","Rated":"R"}