{"imdbID":"tt3397884","Title":"Sicario","Year":"2015","Director":"Denis Villeneuve","Writer":"Taylor Sheridan","Taglines":"The border is just another line to cross.","Country":"USA","Language":"English, Spanish","Also_Known_As":"Borderline ","Budget":"$30,000,000 (estimated)","Opening_Weekend":"$401,288 (USA) (18 September 2015)","Gross":"$46,875,468 (USA) (8 January 2016)","Production_Co":"Black Label Media, Lionsgate, Thunder Road Pictures ","Runtime":"121 min","Sound_Mix":"Dolby Digital | Dolby Atmos | Auro 11.1","Color":"Color | Black and White (surveillance footage)","Aspect_Ratio":"2.39 : 1","Trivia":"The word \"Sicario\" means \"Hitman\" or \"Gunman\" in Spanish. See more »","Goofs":"During the drone footage, the longitude data displayed is 111 degrees, 97 minutes, 15.69 seconds. Minutes in longitude rolls over to another degree at 60 minutes, so this longitudinal position does not exist. See more »","Cast":"Emily Blunt, Benicio Del Toro, Josh Brolin, Victor Garber, Jon Bernthal, Daniel Kaluuya, Jeffrey Donovan, Raoul Max Trujillo, Julio Cedillo, Hank Rogerson, Bernardo P. Saracino, Maximiliano Hernández, Kevin Wiggins, Edgar Arreola, Kim Larrichio","Plot":"An idealistic FBI agent is enlisted by a government task force to aid in the escalating war against drugs at the border area between the U.S. and Mexico. When drug violence worsens on the USA Mexico border, the FBI sends an idealistic agent, Kate Macer (Emily Blunt) on a mission to eradicate a drug cartel responsible for a bomb that had killed members of her team. Written by Gusde","Genre":"Action, Crime, Drama","Keywords":"war on drugs, u.s. mexico border, drug cartel, critically acclaimed, juarez mexico","imdbRating":"7.7","imdbVotes":"159,764","Awards":"Nominated for 3 Oscars. Another 10 wins & 121 nominations.","Metascore":"81","Released":"2 October 2015 (USA) ","Location":"Albuquerque, New Mexico, USA ","Actors":"Emily Blunt, Josh Brolin, Benicio Del Toro ","Running_time":"PT121M / 2h 1min","Description":"Directed by Denis Villeneuve.  With Emily Blunt, Josh Brolin, Benicio Del Toro, Jon Bernthal. An idealistic FBI agent is enlisted by a government task force to aid in the escalating war against drugs at the border area between the U.S. and Mexico.","Rated":"R"}