{"imdbID":"tt3316960","Title":"Still Alice","Year":"2014","Country":"USA, France","Language":"English","Budget":"$4,100,000 (estimated)","Gross":"$18,656,400 (USA) (24 April 2015)","Production_Co":"Lutzus-Brown, Killer Films, BSM Studio ","Runtime":"101 min","Cast":"Julianne Moore, Kate Bosworth, Shane McRae, Hunter Parrish, Alec Baldwin, Seth Gilliam, Kristen Stewart, Stephen Kunken, Erin Darke, Daniel Gerroll, Quincy Tyler Bernstine, Maxine Prescott, Orlagh Cassidy, Rosa Arredondo, Zillah Glory","Plot":"A linguistics professor and her family find their bonds tested when she is diagnosed with Alzheimer's Disease. Alice Howland is a renowned linguistics professor happily married with three grown children. All that begins to change when she strangely starts to forget words and then more. When her doctor diagnoses her with Early-onset Alzheimer's Disease, Alice and her family's lives face a harrowing challenge as this terminal degenerative neurological ailment slowly progresses to an inevitable conclusion they all dread. Along the way, Alice struggles to not only to fight the inner decay, but to make the most of her remaining time to find the love and peace to make simply living worthwhile. Written by Kenneth Chisholm (kchishol@rogers.com)","Genre":"Drama","Keywords":"linguistics professor, alzheimer's disease, bechdel test passed, reference to angels in america the play, new york city","imdbRating":"7.5","imdbVotes":"78,186","Awards":"Won 1 Oscar. Another 26 wins & 31 nominations.","Metascore":"72","Released":"20 February 2015 (USA) ","Location":"New York City, New York, USA ","Actors":"Julianne Moore, Alec Baldwin, Kristen Stewart ","Director":"Richard Glatzer, Wash Westmoreland","Writer":"Richard Glatzer (screenplay), Wash Westmoreland (screenplay) | 1 more credit »","Running_time":"PT101M / 1h 41min","Description":"Directed by Richard Glatzer, Wash Westmoreland.  With Julianne Moore, Alec Baldwin, Kristen Stewart, Kate Bosworth. A linguistics professor and her family find their bonds tested when she is diagnosed with Alzheimer's Disease.","Rated":"PG-13"}