{"imdbID":"tt3659388","Title":"The Martian","Year":"2015","Director":"Ridley Scott","Country":"USA, UK","Language":"English, Mandarin","Budget":"$108,000,000 (estimated)","Gross":"$228,416,202 (USA) (4 March 2016)","Production_Co":"Twentieth Century Fox Film Corporation, TSG Entertainment, Scott Free Productions ","Runtime":"144 min","Cast":"Matt Damon, Jessica Chastain, Kristen Wiig, Jeff Daniels, Michael Peña, Sean Bean, Kate Mara, Sebastian Stan, Aksel Hennie, Chiwetel Ejiofor, Benedict Wong, Mackenzie Davis, Donald Glover, Nick Mohammed, Shu Chen","Plot":"During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive. During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive. Millions of miles away, NASA and a team of international scientists work tirelessly to bring \"the Martian\" home, while his crewmates concurrently plot a daring, if not impossible, rescue mission. As these stories of incredible bravery unfold, the world comes together to root for Watney's safe return. Written by 20th Century Fox","Genre":"Adventure, Drama, Sci-Fi","Keywords":"space habitat, left for dead, nasa, astronaut, international cooperation","imdbRating":"8.1","imdbVotes":"381,530","Awards":"Nominated for 7 Oscars. Another 31 wins & 160 nominations.","Metascore":"80","Released":"2 October 2015 (USA) ","Location":"Hungary ","Actors":"Matt Damon, Jessica Chastain, Kristen Wiig ","Writer":"Drew Goddard (screenplay), Andy Weir (book)","Running_time":"PT144M / 2h 24min","Description":"Directed by Ridley Scott.  With Matt Damon, Jessica Chastain, Kristen Wiig, Kate Mara. During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive.","Rated":"PG-13"}